[{"summer": "True", "name": "Introduction to Managerial Accounting", "spring": "True", "number": "200", "fall": "True", "units": " 3", "description": "Analysis of  accounting data that are useful in managerial decision making and in the control and evaluation of the decisions made within business organizations. An introduction to basic models, financial statement analysis, cost behavior analysis and cost control procedures."}, {"summer": "True", "name": "Concepts of Financial Reporting", "spring": "True", "number": "210", "fall": "True", "units": " 3", "description": "Financial reporting concepts, the accounting information generating process, reporting practices, financial statement preparation, and the interpretation and analysis of financial statements.  Basic accounting principles and concepts, the accounting cycle, income measurement, and internal controls."}, {"summer": "True", "name": "Intermediate Financial Accounting I", "prerequisites": "Prerequisite: ACC 210 with a C+ or better", "spring": "True", "number": "310", "fall": "True", "units": " 3", "description": "Conceptual framework of financial accounting and process of development of professional standards. Foundations of accounting and reporting systems. Measurement and reporting issues for cash, receivables, inventories, and non-current assets."}, {"summer": "True", "name": "Intermediate Financial Accounting II", "prerequisites": "Prerequisite: ACC 310 with grade of C- or better", "spring": "True", "number": "311", "fall": "True", "units": " 3", "description": "A continuation of topics introduced in Intermediate Financial Accounting I (ACC 310). Topics include accounting for investments in equity and debt securities, measurement and recognition of current and non-current liabilities, accounting for operating and capital leases, accounting for pension and post-retirement benefit plans, determination and classification issues related to deferred income taxes, and accounting for various forms of stock-based compensation plans."}, {"summer": "True", "name": "An Introduction To Income Taxation", "prerequisites": "Prerequisite: ACC 210 with a grade of C- or better", "spring": "True", "number": "330", "fall": "True", "units": " 3", "description": "Basic income tax principles and procedures (including research and planning) with an emphasis on all types of entities and business transactions.  Exposure to a range of tax concepts within the framework of financial reporting."}, {"summer": "True", "name": "Accounting Information Systems", "prerequisites": "Prerequisite: ACC 200 and ACC 210 with a grade of C- or better and successful completion of the software skills test.", "spring": "True", "number": "340", "fall": "True", "units": " 3", "description": "Introduction to the importance of accounting and computer-based controls in an organization's enterprise systems. Focus on business processes, entity-wide information systems controls and security, database modeling and design focused on accounting,and contemporary issues involved in providing assurance services for systems reliability."}, {"summer": "True", "name": "Governmental and Nonprofit Accounting", "prerequisites": "Prerequisite: ACC 210 and Successful completion of the Software Skills Test", "spring": "True", "number": "410", "fall": "True", "units": " 3", "description": "Accounting for state and local governments, including budgeting, audit issues, and financial analysis.  Accounting for nonprofit organizations, including colleges and universities and healthcare organizations."}, {"summer": "True", "name": "Business Valuation", "prerequisites": "Prerequisite: ACC 210, BUS 320, successful completion of Software Skills Test, and (BUS/ST 350 or ST 302 or ST 361 or ST 370 or ST 372)", "spring": "True", "number": "411", "fall": "True", "units": " 3", "description": "Conceptual framework of how businesses work, value generation and reporting.  Interpretation of financial statements and their use in valuation of the firm."}, {"summer": "True", "name": "Strategic Management Accounting", "prerequisites": "Prerequisite: ACC 200 with C- or better and (BUS/ST 350, or ST 302 or ST 361 or ST 370 or ST 372) and successful completion of the Software Skills Test.", "spring": "True", "number": "420", "fall": "True", "units": " 3", "description": "Strategic management accounting focuses on the development and use of managerial accounting information in planning, control, and decision making activities and in designing and implementing business strategies.  Integration of performance measurement and cost control with corporate strategy."}, {"summer": "True", "name": "Enterprise Resource Planning Systems", "prerequisites": "Prerequisite: ACC 340 with grade of C- or better and successful completion of the Software Skills Test.", "spring": "True", "number": "440", "fall": "True", "units": " 3", "description": "An Enterprise Resource Planning (ERP) system is business software that is cross-functional, process-centered and uses a relational database. As NCSU is a member of the SAP University Alliance, you will obtain hands-on training with SAP, the ERP market leader. This knowledge will give business and IT students a competitive and advantage in the workplace. This course covers the managerial, accounting, and technical issues of ERP systems. Course content includes evolution of ERP systems, reengineering, process mapping, the ERP life cycle, functionality, bolt-ons, and auditing ERP systems. Credit will not be allowed for both ACC 440 and MBA 515."}, {"summer": "True", "name": "Auditing and Assurance Services", "prerequisites": "Prerequisite: ACC 311 with a C- or better and ACC 340 and (BUS/ST 350, or ST 302, or ST 361, or ST 370, or ST 372), and successful completion of the Software Skills Test.", "spring": "True", "number": "450", "fall": "True", "units": " 3", "description": "Introduction to auditing practice and theory. Focuses on developing skills for interpreting business strategies and identifying related business risks that may impact the risk of material misstatement in financial statements, describing internal control solutions to those risks, identifying evidential sources, and designing strategies to provide assurance about the financial statements, internal control over financial reporting, and other business information."}, {"summer": "True", "name": "Internal Auditing", "prerequisites": "Prerequisite: ACC 210 with grade of C- or better and successful completion of the Software Skills Test.", "spring": "True", "number": "451", "fall": "True", "units": " 3", "description": "The theory, practice and design of internal audit activities.  Examination of industry standards as a guide to the internal audit field.  Evaluation of internal controls, information technology and fraud risks and controls, audit evidence and assurance, communicating audit results and consulting engagements.  Emphasis on the professional practice of the discipline of internal auditing."}, {"summer": "True", "name": "Special Topics in Accounting", "prerequisites": "Prerequisite: Successful completion of the Software Skills Test", "spring": "True", "number": "495", "fall": "True", "units": " 1-6", "description": "Presentation of  material not normally available in regular course offerings, or offering of new courses on a trial basis."}, {"summer": "True", "name": "Independent Study in Accounting", "prerequisites": "Prerequisite: Successful completion of the Software Skills Test", "spring": "True", "number": "498", "fall": "True", "units": " 1-6", "description": "Detailed investigation of topics of particular interest to advanced undergraduates under faculty direction on a tutorial basis. Credits and content determined by faculty member in consultation with the associate department head."}, {"summer": "True", "name": "Internship in ACC", "prerequisites": "Prerequisite: Senior standing, GPA greater than or equal to 3.25, and successful completion of the Software Skills Test.", "spring": "True", "number": "499", "fall": "True", "units": " 1-6", "description": " ACM majors."}, {"summer": "True", "name": "Advanced Commercial Law", "prerequisites": "Prerequisite: MAC Program", "spring": "True", "number": "508", "fall": "True", "units": " 3", "description": "A study of law and regulation as a structure in which to develop business goals and strategies.  Students will examine those elements of law and regulation that are a context for ethical business behavior.  Students will also study the provisions oflaw and regulation including case-law that must be followed as a part of the strategic planning process and in the process of implementing business methods and procedures."}, {"summer": "True", "name": "Advanced Financial Accounting", "prerequisites": "Prerequisite: MAC Program", "spring": "True", "number": "510", "fall": "True", "units": " 3", "description": "Study of complex financial reporting topics affecting U.S. corporations.  Focus on the underlying business rationales associated with transactions/events triggering the complex financial reporting issue.  Topics will include international accounting, consolidations, mergers and acquisitions, derivatives, SEC reporting, and other emerging issues."}, {"summer": "True", "name": "Applied Financial Management", "prerequisites": "Prerequisite: MAC Program", "spring": "True", "number": "519", "fall": "True", "units": " 3", "description": "A study of key business decision made and tools used by CFOs in their executive management roles.  Students will focus on managerial analysis tools (e.g., business plans; budgeting) and finance issues (e.g., funding alternatives, treasury, and cash management).  The course will include management skills related to the CFO, such as negotiations, leadership, delegation, interactions with boards, etc."}, {"summer": "True", "name": "Advanced Management Accounting", "prerequisites": "Prerequisite: MAC Program", "spring": "True", "number": "520", "fall": "True", "units": " 3", "description": "A study of how accounting and operating information is used in management planning and decision making.  Students will apply advanced costing models and design and evaluate management decision making information systems.  Topics will include issues that are appropriate for consideration by executive management and the board of directors."}, {"summer": "True", "name": "Advanced Income Tax", "prerequisites": "Prerequisite: MAC Program", "spring": "True", "number": "530", "fall": "True", "units": " 3", "description": "A study of the tax consequences of business, financial, and personal wealth-planning transactions.  Students will examine the economic or legal context of transactions along with the non-tax motives of the transacting parties.  The course will consider the efficiency of tax strategies in terms of their impact on net cash flows and other financial reporting effects."}, {"summer": "True", "name": "Accounting and Tax Research", "prerequisites": "Prerequisite: MAC Program", "spring": "True", "number": "533", "fall": "True", "units": " 3", "description": "A study of research methods, procedures and tools used to develop solutions to technical and policy-oriented business problems.  Students will consult various competent authorities on taxation, accounting, auditing, and general business in the development of business problem solving techniques."}, {"summer": "True", "name": "IT Risks and Controls", "prerequisites": "Prerequisite: MAC Program", "spring": "True", "number": "540", "fall": "True", "units": " 3", "description": "A study of how business strategies use information technology (IT) as an efficient enabler of redesigned core business processes. Students will focus on how the use of IT affects risk management by eliminating certain risks and introducing others. Students will examine IT control solutions used to address IT risks and will address issues affecting assurance engagements related to IT systems."}, {"summer": "True", "name": "Advanced Auditing", "prerequisites": "Prerequisite: MAC Program", "spring": "True", "number": "550", "fall": "True", "units": " 3", "description": "A study of the impact of business risks on the design and performance of audit procedures to detect material misstatements in financial statements.  Students will be exposed, through a case-based approach, to significant business issues related to audit planning, risk assessment and auditor response, corporate governance, reporting, and other significant business issues affecting audit professionals in their first years of employment."}, {"summer": "True", "name": "Special Topics in Accounting", "spring": "True", "number": "588", "fall": "True", "units": " 1-6", "description": "Course objectives dependent upon unique circumstances motivating offering of course. Timely curriculum innovation the primary motivation. Departmental consent required."}, {"summer": "True", "name": "Managerial and Career Effectiveness", "prerequisites": "Prerequisite: MAC Program", "spring": "True", "number": "600", "fall": "True", "units": " 1", "description": "Knowledge and skills needed to advance professional accounting career. Strategic communication of self and ideas in professional and classroom settings. Diagnosis of organizational culture. Impression management and appropriate business behavior. Leadership of individuals, group dynamics, and team building."}, {"summer": "True", "name": "Independent Study", "spring": "True", "number": "630", "fall": "True", "units": " 1-6", "description": "Advanced topics not otherwise included in curriculum by advanced graduate students on a tutorial basis.  Determination of credits and content by participating faculty in consultation with Director of Graduate Programs.  Departmental consent required"}, {"summer": "True", "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "688", "fall": "True", "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": "True", "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "689", "fall": "True", "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}]