[{"summer": "True", "name": "Two Dimensional Design", "spring": "True", "number": "111", "fall": "True", "units": " Performing Arts", "description": "An introduction to the fundamentals of design studies through two dimensional problems. The basic elements and concepts of design explored as abstract and applied problems through design issues. Provides non-design students an introduction to design principles and a language of  design."}, {"summer": "True", "name": "Three Dimensional Design", "spring": "True", "number": "112", "fall": "True", "units": " Performing Arts", "description": "An introduction to the fundamentals of design studies through three-dimensional problems. The basic elements and concepts of design explored as abstract and applied problems through the design issue. Provides non-design students a working knowledge of design principles and a language of design."}, {"summer": "True", "name": " Design in Context", "prerequisites": "Prerequisite: D 104, D 105, or two studios", "spring": "True", "number": "202", "fall": "True", "units": " 6", "description": "Investigative problem solving in visual communication in the human environment.  Emphasis on visual language applied to specific contexts."}, {"summer": "True", "name": "Basic Photography", "spring": "True", "number": "212", "fall": "True", "units": " 3", "description": "Introduction to the processes and visual skills necessary for the beginning photographer. Darkroom experimentation, pinhole camera, basic rudiments of camera use, film development and printing. Exploration of issues related to the quality of visual communication."}, {"summer": "True", "name": "Digital Imaging", "prerequisites": "Prerequisite: D104 or ADN 111", "spring": "True", "number": "219", "fall": "True", "units": " 3", "description": "Introduction to exploring, creating, and modifying images through the use of computers.  Emphasis is on creativity, experimentation, and intuitive image-making using various computer techniques."}, {"summer": "True", "name": "Digital Illustration", "spring": "True", "number": "220", "fall": "True", "units": " 3", "description": "Hands-on exploration of digital drawing, painting, and image editing techniques with the use of pressure sensitive digital drawing tablets and image editing software; Development of ability to design and communicate convincing 3-dimensional forms and environments using 2D digital techniques with an emphasis on gesture, shape, volume, intuitive perspective, color, and light; Application of design process and research to generate images for visual concept development; Examination of relationships between historic and contemporary conventions for traditional and digital image-making."}, {"summer": "True", "name": "Digital Illustration II", "prerequisites": "Prerequisite: ADN 220", "spring": "True", "number": "221", "fall": "True", "units": " 3", "description": "Hands-on exploration of digital drawings, painting, and image editing techniques with the use of pressure sensitive digital drawing tablets and image editing software; Development of ability to integrate multiple visual elements to illustrate narratives and create illusionistic environments.  Emphasis shot design, linear perspective, light, color, texture, and atmosphere; Application of design process and research to generate images for visual concept development and mood; Examination of relationship between historic and contemporary illustration, compositing, and matte painting techniques."}, {"summer": "True", "name": "Digital Motion", "spring": "True", "number": "224", "fall": "True", "units": " 3", "description": "Hands-on exploration of motion, animation principles, and keyframing strategies; Development of animated experiments and sequences that focus on convincing and exaggerated movement, physics, and acting; Introduction to range of key animation software and techniques. Restricted to Art and Design Majors Only"}, {"summer": "True", "name": "Sequential Imaging", "spring": "True", "number": "226", "fall": "True", "units": " 3", "description": "Hands-on development of story-boards, story-reels, and animatics to plan and examine visual sequences; Development of freehand sketching techniques; Exploration of drawing and image-making as a tool for visual and conceptual development; Examination of traditional and contemporary visual storytelling techniques and conventions; Exploration of common strategies for developing narrative structure. Restricted to Art and Design Majors Only."}, {"summer": "True", "name": "Introduction to Printing and Surface Design", "prerequisites": "Prerequisite: C- or better in D104, ADN 111, or ADN 112", "spring": "True", "number": "272", "fall": "True", "units": " Performing Arts", "description": "Design and production of screen printed, painted and pattern-dyed fabrics. Development of design abilities (color use, pattern generation) and technical skills (screen printing, painting, use of fabric dyes).  Production of fabric samples, studies, yardage, and/or end products.  Awareness of industrial processes."}, {"summer": "True", "name": "Fibers Materials and Processes", "prerequisites": "Prerequisite: ADN 111 or ADN 112", "spring": "True", "number": "273", "fall": "True", "units": " 3", "description": "Introduction to historical and contemporary hand processes used by the textile designer. Students will learn a variety of textile techniques utilizing traditional and experimental methods. Emphasis will be on technical exploration and  development."}, {"summer": "True", "name": "Basic Woven and Constructed Textiles", "spring": "True", "number": "274", "fall": "True", "units": " 3", "description": "Hands-on introduction to structures and techniques of hand weaving and related off-loom textile structures. Focus on basic hand weaving structures, including plain weave, twills and satins, acquired through threading the loom and weaving with a variety of materials. Off-loom techniques explore a variety of structures made with simple hand tools. Projects focus on materials choice; color experimentation and control; pattern manipulations; scale and balance; and the design process as applied to hand constructed textile artifacts."}, {"summer": "True", "name": "Color, Pattern, and Cloth", "spring": "True", "number": "275", "fall": "True", "units": " 3", "description": "Introduction to the essential elements and skills of cloth design including repeat systems; pattern figure/ground relationships; color mixing; color relationships; applied color; color and pattern relationships; fabric analysis and re-design; yarn windings and color bleeding; cloth structures and their functions. Hands-on work with simple cloth structures such as plaiting, tapestry, bead weaving, pattern repeats, and fiber characteristics."}, {"summer": "True", "name": "Basic Drawing", "prerequisites": "Prerequisite: Design Majors and Design Minors", "spring": "True", "number": "281", "fall": "True", "units": " 3", "description": "A beginning descriptive drawing experience which teaches students to see, analyze, and transcribe observed subject matters. The transcription incorporates formal drawing issues (line, form, texture) with traditional and contemporary material space exploration."}, {"summer": "True", "name": "Special Topics in Design", "spring": "True", "number": "292", "fall": "True", "units": " 1-3", "description": "Topics of current interest in the School of Design.  Used to develop new courses."}, {"summer": "True", "name": "Basic Visual Laboratories", "prerequisites": "Prerequisite: Non-Design Majors must have completed  ADN 111and ADN 112", "spring": "True", "number": "311", "fall": "True", "units": " Performing Arts", "description": "Basic activities that relate to the major design areas in the School of Design. Study of visual communication skills in areas of illustration, printmaking, and life drawing. The student elects instructor and area(s) of activity. May be taken for a maximum of 12 credit hours by School of Design students."}, {"summer": "True", "name": "Intermediate Photography", "prerequisites": "Prerequisite: ADN 212", "spring": "True", "number": "312", "fall": "True", "units": " 3", "description": "Continuation of an advanced level of the skills and techniques developed in Basic Photography. Purpose is to develop use of camera as a perceptual tool to increase awareness and sensitivity of visual  imagery."}, {"summer": "True", "name": "Introduction to Animation", "prerequisites": "Prerequisite: ADN 219", "spring": "True", "number": "319", "fall": "True", "units": " 3", "description": "An intensive introduction to animation which integrates traditional hand generated animation, digital techniques and technology.  Students will explore animation's fundamental principles of linear formats, sequenced movement and time-based imaging."}, {"summer": "True", "name": "Surface Embellishment", "spring": "True", "number": "372", "fall": "True", "units": " 3", "description": "Hands-on experimentation with classic hand, machine, and digital stitching techniques on fabric; personal exploration of non-traditional materials and applications at different scales; and examination of historic and contemporary stitching through visits to the Gregg Museum and directed library and internet research."}, {"summer": "True", "name": "Basic Painting", "prerequisites": "Prerequisite: D 104 or both ADN 111 and ADN 112.", "spring": "True", "number": "384", "fall": "True", "units": " 3", "description": "Introduction to the principles of painting through class projects that expose students to different painting materials and techniques. Students learn to build a stretcher, size and prime a canvas as well as other rigid painting surfaces. Acrylic and oil paint used; projects assigned and open themes."}, {"summer": "True", "name": "Basic Sculpture", "prerequisites": "Prerequisite: D 104, ADN 112.", "spring": "True", "number": "386", "fall": "True", "units": " 3", "description": "Studio course introducing basic concepts, materials, and processes of sculpture. Instruction incorporates both traditional and contemporary form generation with emphasis on developing formal perception and projection."}, {"summer": "True", "name": "Design Studio", "prerequisites": "Prerequisite: D 104, D 105", "spring": "True", "number": "400", "fall": "True", "units": " 6", "description": "Studio offering upper-level undergraduates the opportunity to intensively study general design issues (form, color, structure, proportions, scale, etc.). Course may be used to partially satisfy studio requirement in all undergraduate degree  programs in the School of Design.\t"}, {"summer": "True", "name": "Senior Studio", "prerequisites": "Prerequisite: Seven studios and ADN 219", "spring": "True", "number": "402", "fall": "True", "units": " 6", "description": "Advanced Design studio emphasizing the exploration of past, current and potential future technologies within Design Department content areas (e.g., painting, sculpture, fibers, jewelry, color and light, etc.).  Students are expected to work independently, develop their own problem statements."}, {"summer": "True", "name": "Visual Laboratory II", "prerequisites": "Prerequisite: D 104 or both ADN 111 and ADN 112.", "spring": "True", "number": "411", "fall": "True", "units": " 3", "description": "Visual communication skills in the areas of life drawing, illustration, painting, print making and sculpture. May be taken for a maximum of 12 credit hours by School of Design students."}, {"summer": "True", "name": "Color and Light", "spring": "True", "number": "414", "fall": "True", "units": " 3", "description": "Physical and perceptual nature of color, color awareness, sensitivity and skills in visual communication with color as a designer's tool.\t"}, {"summer": "True", "name": "Contemporary Issues in Art and Design", "prerequisites": "Prerequisite: Junior standing in ADN, which equals 5 studios, or ADN 111 and ADN 112", "spring": "True", "number": "418", "fall": "True", "units": " 3", "description": "Explore a range of issues about contemporary art and design ideologies.  Concentration on selected readings which provide a platform for discussion of various ideas, approaches, perspectives and practices in the contemporary fields of art and design."}, {"summer": "True", "name": "Multimedia and Digital Imaging", "prerequisites": "Prerequisite: D 105, ADN 219", "spring": "True", "number": "419", "fall": "True", "units": " 3", "description": "Intensive hands-on investigation of the tools, techniques, and processes for the development of interactive multi-media projects.  Media teams will emphasize shaping an idea into a well thought-out design that works as an interactive experience."}, {"summer": "True", "name": "Digital Modeling", "spring": "True", "number": "423", "fall": "True", "units": " 3", "description": "Hands on introduction to 3D digital modeling tools and techniques for artists and designers who want to expand their skill sets to include 3D practices.  The course has applications in several disciplines including; animation, illustration, surface design, and concept development.  Explores the use of surface textures, lighting, and compositing.  Examines strategies for using 3D tools to create prototypes for physical objects, integrate 3D elements into 2D images, and create models for animation.  Restricted to Art and Design Majors Only."}, {"summer": "True", "name": "Art and Design: Theory and Practice", "prerequisites": "Prerequisite: Senior Level (6 studios), Art and Design Major", "spring": "True", "number": "428", "fall": "True", "units": " 3", "description": "Conceptual basis for developing a personal philosophy regarding the practice of art and design.  Theory based history of diverse cultures and forces of change: political, economic, religious, social, intellectual and philosophical as they affect the fields of art and design."}, {"summer": "True", "name": "Multimedia and Advanced Digital Imaging Studio", "prerequisites": "Prerequisite: ADN 219", "spring": "True", "number": "460", "fall": "True", "units": " 6", "description": "An intensive study of advanced image-making processes, software, and various computer platforms used in the creation of multimedia.  In a studio mode, students will place emphasis on creating interactive programs and finally transfer images to CD Rom and video with audio and special effects."}, {"summer": "True", "name": "Fibers and Surface Design Studio", "prerequisites": "Prerequisite: A grade of C- or better in DF 101 or ADN 111 and ADN 112;  Design Majors or Design Minors", "spring": "True", "number": "470", "fall": "True", "units": " 6", "description": "Practice of widely varying textile techniques with the solving of practical and conceptual design problems.  Textile end products are designed and produced at full scale in appropriate materials.  Focus includes weaving, knitting, printing and dyeing of fabrics, and a wide variety of fabric construction and embellishment processes.  Textile history is an ongoing part of the study.  Emphasis on synthesis of techniques and ideas."}, {"summer": "True", "name": "Advanced Surface Design", "prerequisites": "Prerequisite: D 104, ADN 272", "spring": "True", "number": "472", "fall": "True", "units": " 3", "description": "Advanced problems in the design and production of hand-printed and pattern-dyed fabrics. Experimentation with advanced color application techniques. Exploration of pattern and image production on fabric and development of design abilities in textilemedia.  Specific focus changes each semester."}, {"summer": "True", "name": "Advanced Three-Dimensional Fibers Forms and Structures", "prerequisites": "Prerequisite: ADN 273 or equivalent", "spring": "True", "number": "473", "fall": "True", "units": " 3", "description": "Advanced explorations of three-dimensional textiles forms and structures including works small and large scale installations and sculptures, planar structures in space, and textiles that interact with interior or exterior architecture, the body, or public or site-specific spaces. Technical focus on construction, joining mixed materials, armatures, integration of found materials, and both traditional and experimental structures and applications. Use of hand and power tools."}, {"summer": "True", "name": "Advanced Digital Hand Weaving", "spring": "True", "number": "474", "fall": "True", "units": " 3", "description": "Introduction to use of the computer as a tool for designing, drafting, and hand weaving, using simple software packages. Hand weaving on 24-harness computer assisted looms, 8 harness hand looms, and TC-1 digital hand jacquard loom. 4 to 24 harness woven structures including twill, satin, shadow weave, double weave, woven shibori, dyed warps, and other weave structures. Focus on designing, technical skills, and solving technical problems."}, {"summer": "True", "name": "Pre-Industrial World Textiles", "prerequisites": "Prerequisite: Sophomore standing", "spring": "True", "number": "475", "fall": "True", "units": " 3", "description": "Research on and discussion of hand-made textiles of the world, introducing major textile traditions from Africa, Asia, Europe, North and South America. Focus on geographic and cultural contexts, developments in making, and design characteristics, including impact of 20th century fiber art movements. Seminar format."}, {"summer": "True", "name": "Intermediate Studio", "prerequisites": "Prerequisite: D 104, D 105 or ADN 111, ADN 112, and ADN 311", "spring": "True", "number": "480", "fall": "True", "units": " 6", "description": "Studio format offering upper level undergraduates the opportunity to intensively study general design issues (form, color, structure, proportions, scale, etc.) through individual study in drawing, painting, sculpture, photography, or printmaking."}, {"summer": "True", "name": "Intermediate Drawing", "prerequisites": "Prerequisite: ADN 281", "spring": "True", "number": "481", "fall": "True", "units": " 3", "description": "An intermediate-level drawing course that further develops the designer's graphic, analytic, observational, and conceptual skills."}, {"summer": "True", "name": "Intermediate Painting", "prerequisites": "Prerequisite: D 105 or both ADN 111 and ADN 112.", "spring": "True", "number": "484", "fall": "True", "units": " 3", "description": "An intermediate-level painting course that through slide lectures, class projects, and assigned readings exposes students to contemporary painting art movements. Special emphasis given to the formal and interpretative analysis of a painting. Acrylic and oil paint are used; Projects have assigned and open themes."}, {"summer": "True", "name": "Intermediate Sculpture", "prerequisites": "Prerequisite: ADN 386", "spring": "True", "number": "486", "fall": "True", "units": " 3", "description": "An intermediate-level sculpture course that further develops the designer's analytic, observational, and conceptual skills."}, {"summer": "True", "name": "Art and Design International Studio", "prerequisites": "Prerequisite: Junior standing, Design Majors,  Approval Study Abroad Office", "spring": "True", "number": "490", "fall": "True", "units": " 6", "description": "Define Art and Design problems and develop design solutions in an international setting.  Studio projects related to design, culture, and traditional and contemporary art forms.  Focus on artifact making through direct studies.  Taught off campus."}, {"summer": "True", "name": "Special Seminar in Design", "spring": "True", "number": "491", "fall": "True", "units": " 1-3", "description": "Seminars on subjects of current interest in design."}, {"summer": "True", "name": "Special Topics in Design", "spring": "True", "number": "492", "fall": "True", "units": " 1-3", "description": " Technology.  Used to develop new courses."}, {"summer": "True", "name": "Art and Design Senior Lecture", "prerequisites": "Prerequisite: ADN 219, ADN 281, ADN 418, completion of a 400 level studio; Corequisite: ADN 400, ADN 460, ADN 470, or ADN 480", "spring": "True", "number": "493", "fall": "True", "units": " 3", "description": "ADN 493 is a capstone course for seniors in Art and Design.  The course prepares and equips students with the necessary tools and communication skills to present themselves professionally as competent practitioners.  Students are required to integrate their work from previous Art and Design courses into a comprehensive portfolio and personal website.  Students are required to participate in the Art and Design Senior Exhibition and provide their own transportation to the exhibition."}, {"summer": "True", "name": "Internship in Design", "prerequisites": "Prerequisite: Junior standing; 3.0 GPA or better", "spring": "True", "number": "494", "fall": "True", "units": " 1-6", "description": "Supervised field experience in design offices, galleries, museums and other organizations. Maximum of 6 credit hours."}, {"summer": "True", "name": "Independent Study in Design", "prerequisites": "Prerequisite: Junior standing in Design with 3.0 in Design or better", "spring": "True", "number": "495", "fall": "True", "units": " 1-6", "description": "Special projects in art and design developed under the direction of a faculty member on a tutorial basis. Maximum 6 credit hours."}, {"summer": "True", "name": "Advanced Visual Laboratory", "spring": "True", "number": "502", "fall": "True", "units": " 3", "description": "ADN 502 is a general title of Advanced Visual Laboratories under the supervision of an Art and Design faculty member to provide intensive experimental work in various phenomena and disciplines related to design."}, {"summer": "True", "name": " Design", "spring": "True", "number": "503", "fall": "True", "units": " 3", "description": "Seminar introduction to research in art and design, addressing theoretical, historical, and methodological contexts for individual exploration.  Reading, discussion, and presentations will emphasize current work and concept development in all art media.  Methods of examining idea sources, process, documentation, critiquing, speaking, and writing about visual concepts."}, {"summer": "True", "name": "Advanced Animation Studio", "prerequisites": "Prerequisite: ADN 460, ADN 419;  College of Design Graduate Student", "spring": "True", "number": "560", "fall": "True", "units": " 6", "description": "The studio serves as an intensive investigation of the tools, techniques, and processes for experimental multimedia animation. The studio will address the entire creative animation process, from initial storyboard concept to final production. The studio will serve as an advanced study of animation and imaging by investigating multimedia animation from numerous perspectives, including filmmaking, cognitive psychology, the fine arts and interaction design. Creativity in concept and execution (thecreative process) will be a major focus of the studio experience."}, {"summer": "True", "name": "Digital Animation and Imaging Seminar", "prerequisites": "Prerequisite: ADN 460, ADN 419;  College of Design Graduate Student", "spring": "True", "number": "561", "fall": "True", "units": " 3", "description": "Intensive research, presentation, and discussion of animation. Addressing historical animation issues related to media, culture and technology. Advanced study of animation and imaging through study of the history of multimedia animation from numerous perspectives, including filmmaking, painting and drawing, theater and animation history."}, {"summer": "True", "name": "Advanced Fibers and Surface Design Studio", "spring": "True", "number": "570", "fall": "True", "units": " 6", "description": " Design.  Creation of fibers and surface design products, with special emphasis given to design process; creative problem-solving, exploration, and innovation; and application of advanced art and design techniques and methodsto hands-on making of textile objects.  All projects will be individually conceived and executed."}, {"summer": "True", "name": "Fibers and Surface Design Seminar", "prerequisites": "Prerequisite: ADN 503", "spring": "True", "number": "571", "fall": "True", "units": " 3", "description": "Seminar on current professional issues in fibers and surface design, focusing on theory, history, critical analysis, and philosophy.  Reading, discussion, presentations, research, and writing about contemporary and historical thought in the field."}, {"summer": "True", "name": "Pre-Industrial World Textiles", "spring": "True", "number": "575", "fall": "True", "units": " 3", "description": "Research on and discussion of hand-made textiles of the world, introducing major textile traditions from Africa, Asia, Europe, North and South America. Focus on geographic and cultural contexts, development of production, and design characteristics,including 20th-century fiber art movements. Seminar format."}, {"summer": "True", "name": "Final Project Research", "spring": "True", "number": "581", "fall": "True", "units": " 3", "description": "Directed research to prepare background documentation for the final project, including historical and contemporary context, formation of project parameters, statement of goals, and documentation/project outline."}, {"summer": "True", "name": "Final Project Studio", "prerequisites": "Prerequisite: ADN 570(18cr) and ADN 581. Student in last semester of graduate enrollment", "spring": "True", "number": "588", "fall": "True", "units": " 6", "description": " Design, under the supervision of graduate advisory committee members."}, {"summer": "True", "name": "Special Topics in Art and Design", "spring": "True", "number": "592", "fall": "True", "units": " 1-6", "description": "Topics of current interest to the program or concentration offered by faculty in the department of Art and Design.  Subjects offered under this number are normally used to test and develop new courses."}, {"summer": "True", "name": " Design", "prerequisites": "Prerequisite: ADN 503; and ADN 570", "spring": "True", "number": "630", "fall": "True", "units": " 1-3", "description": " Design with consent of the supervising faculty.  May not be taken in the first semester of graduate study"}, {"summer": "True", "name": "Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "685", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "688", "fall": "True", "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": "True", "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "689", "fall": "True", "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}]