[{"summer": "True", "name": "Introduction to Career and Technical Education", "spring": "True", "number": "101", "fall": "True", "units": " 1", "description": "Overview of career and technical education programs, objectives, and outcomes in secondary schools.  Philosophy of career and technical education and how career and technical education programs fit into the overall mission of secondary education.  Mission of agricultural education, major program objectives, and introduction to the curricula taught within the state.  Roles and responsibilities of CTE teachers with specific emphasis on agricultural education teachers' roles and responsibilities.Historical context of agricultural education and other career and technical education programs, including major legislation affecting development of career and technical education."}, {"summer": "True", "name": "Fundamentals of Agricultural and Extension Education", "spring": "True", "number": "103", "fall": "True", "units": " 1", "description": "Introduction to the scope, purpose, and objectives of university education with an emphasis on agricultural education, extension education, and agricultural communications.  Students will explore College and departmental resources, academic policiesand procedures, the agricultural industry, career opportunities, and current trends and issues in agriculture.  Cannot receive credit for both AEE 103 and ALS 103"}, {"summer": "True", "name": "Introduction to Teaching Agriculture", "spring": "True", "number": "206", "fall": "True", "units": " 3", "description": "Introduction to teaching agricultural education in middle and secondary schools and collaborative efforts for teaching agricultural education to adults as rural community situations dictate.  Field experiences include three hours per week of structured observations of classroom teachers, teacher assistant activities, and reflections of the experience."}, {"summer": "True", "name": "Agricultural Biotechnology: Issues and Implications", "prerequisites": "Prerequisite: (BIO 105 or BIO 115 or BIO 181 or BIO 183)", "spring": "True", "number": "208", "fall": "True", "units": " 3", "description": "Trends and issues of agricultural biotechnology in today's society are addressed while covering the basic biological science behind the technology. Applications of and policy issues associated with plant, animal, and environmental biotechnology used in the agricultural industry are examined from an interdisciplinary approach."}, {"summer": "True", "name": " Extension Ed", "spring": "True", "number": "226", "fall": "True", "units": " 3", "description": "Use of computers and commercially produced agricultural software; the computer as a management tool; agricultural occupational applications of the computer; a multimedia instructional tool in agricultural classrooms and training situations; use of technology for processing information and imaging; network access; and electronic communications."}, {"summer": "True", "name": "Introduction to Cooperative Extension", "spring": "True", "number": "230", "fall": "True", "units": " 3", "description": "This course is designed for all students who are interested pursuing a career with the cooperative extension service. An introduction to the cooperative extension mission, philosophy, history, organization,structure, administration, program areas, extension program development, extension teaching and delivery methods, and the involvement and use of volunteers. Students are expected to provide their own transportation for outside of class activities and assignments."}, {"summer": "True", "name": "Service Learning Program Leader Development I", "spring": "True", "number": "291", "fall": "True", "units": " 1", "description": "The purpose of the course is to prepare students for their role as Alternative Service Break Team Leaders. The course will incorporate the larger issues of citizenship, social justice, and positive change and will include the logistics, risk-management, and leadership skills needed when leading a service trip. This course will require students to think critically about their role as a leader. Students will participate in a weekend overnight retreat. Transportation for the retreat will be provided by University Van rental. Expenses for the weekend retreat are covered in the ASB administrative charge paid by participants."}, {"summer": "True", "name": "Service Learning Program Leader Development II", "prerequisites": "Prerequisite: AEE 291", "spring": "True", "number": "292", "fall": "True", "units": " 2", "description": "The purpose of the course is to prepare students for their role as Alternative Service Break Team Leaders.  Part II of the Service Learning Program Leader Development will build upon what students learned in Part I and they will be able to put into practice what has been learned with their own teams.  Students will travel with their respective teams during spring break to complete the week long service-learning project.  Students will be responsible for fundraising for approximately half the cost of their trip.  Trip costs vary and depends on location selected."}, {"summer": "True", "name": "Administration and Supervision of Student Organizations", "prerequisites": "Prerequisite: AEE 206", "spring": "True", "number": "303", "fall": "True", "units": " 3", "description": "Principles and techniques for organizing, administering and supervising student organization activities."}, {"summer": "True", "name": "Communication Methods and Media", "prerequisites": "Prerequisite: ENG 101", "spring": "True", "number": "311", "fall": "True", "units": " 3", "description": "Foundations of agricultural communications.  Technologies of agricultural communication and the systematic approach to the development of agricultural communication materials.  Development of applied skills in design, production, evaluation, and dissemination of information unique to agricultural sciences and media."}, {"summer": "True", "name": "Experiential Learning in Agriculture", "prerequisites": "Prerequisite: AEE 206", "spring": "True", "number": "322", "fall": "True", "units": " 3", "description": "Planning, organizing, implementing, supervising and evaluating Supervised Agricultural Experience (SAE) programs in agriculture."}, {"summer": "True", "name": "Leadership Development in Agriculture and Life Sciences", "spring": "True", "number": "323", "fall": "True", "units": " 3", "description": "Leadership development in agricultural and related settings; foundations of leadership theory and practice; techniques for developing leadership skills; development of understanding of group interactions and group leader roles, technical communication skills, interpersonal influence, commitment, and goals achievement strategies necessary for effective leaders."}, {"summer": "True", "name": "Planning and Delivering Non-Formal Education", "spring": "True", "number": "325", "fall": "True", "units": " 3", "description": "Adult learning theory and practice, including planning non-formal educational programs for adults, methods of instructional delivery, effective use of instructional technology, marketing educational programs, and evaluation of educational outcomes.Microteaching (practice teaching presentations) and group presentations required as part of laboratory assignments."}, {"summer": "True", "name": "Teaching Diverse Learners in AED", "prerequisites": "Prerequisite: AEE 206; Junior standing; and AED Majors only", "spring": "True", "number": "326", "fall": "True", "units": " 3", "description": "Legislation and issues regarding diverse learners in middle and high school agricultural education are examined.  Discussion and practice in planning and facilitating teaching strategies to help those with special needs in an agricultural setting are emphasized.  Techniques to integrate reading and writing into the curriculum are identified and practiced.  Field trips are required."}, {"summer": "True", "name": "Conducting Summer Programs in Agricultural Education", "prerequisites": "Prerequisite: AEE 206, AEE 303, AEE 322, and Corequisite of AEE 426", "spring": "True", "number": "327", "fall": "True", "units": " 1", "description": "Field experience emphasizing summer agricultural education programs.  Individualized instruction for students during supervised agricultural experience visits and youth organization activities.  Professional development and program improvement activities."}, {"summer": "True", "name": "Youth Leadership Dev", "prerequisites": "Prerequisite: AEE 323-Leadership Development in Agriculture", "spring": "True", "number": "332", "fall": "True", "units": " 3", "description": "This course is intended to prepare students to be effective facilitators of youth leadership development programs. Theory will be emphasized in the course because it is essential to be grounded in theory in order to apply it.  Major course topics include but are not limited to: understanding the unique leadership development needs of young people, learning how to develop programs that meet those needs,  and the evaluation of youth leadership programs. Students will be required to be active in and outside of class sessions.  In this course you will learn by doing! Students must provide their own transportation for field trips and outside of class activities."}, {"summer": "True", "name": "Youth Program Development and Management", "spring": "True", "number": "333", "fall": "True", "units": " 3", "description": "Students are encouraged to have successfully completed AEE 323 prior to enrolling in this course."}, {"summer": "True", "name": "Personal Leadership Development in Agriculture and Life Sciences", "spring": "True", "number": "350", "fall": "True", "units": " 3", "description": "This course focuses on the impact of personal leadership on agricultural organizations and society.  The best leaders are those who have internalized personal leadership concepts and apply them to the practical situations in their environment.  This course teaches individuals to achieve optimal results by changing their fundamental approach to work, relationships, and problem solving, using time-honored principles in time management, leadership, and effectiveness.  Restricted to CALS students."}, {"summer": "True", "name": "Developing Team Leadership in Agriculture and Life Sciences", "prerequisites": "Prerequisite: AEE 323-Leadership Development in Agriculture", "spring": "True", "number": "360", "fall": "True", "units": " 3", "description": "Students in this course will study the impact of organized teams and team leaders on the development of agricultural organizations.  Principles and techniques involved in creating, organizing and directing teams will be explored.  Students will develop skills in team decision-making and communication.  Topics of discussion will include: components of a group and team, relationships of group and team members, effectiveness of groups and teams, and communication within groups and teams.  This course is designed for students who are interested in positions of leadership and who want to learn more about making the groups and teams they work with more effective.  Restricted to CALS students."}, {"summer": "True", "name": "Practicum in Agricultural Extension/Industry", "prerequisites": "Prerequisite: AEE 230, AEE 325, and Corequisite of AEE 490", "spring": "True", "number": "423", "fall": "True", "units": " 8", "description": "Participation in professional work experiences in preparation for effective leadership positions in the Cooperative Extension Service or the agribusiness industry."}, {"summer": "True", "name": "Planning Agricultural Educational Programs", "prerequisites": "Prerequisite: AEE(ED) 426, Corequisite: AEE(ED) 427", "spring": "True", "number": "424", "fall": "True", "units": " 3", "description": "Principles of program planning applied to educational programs in agriculture; includes theory and field experiences in planning, organizing, and evaluating high school and adult education programs."}, {"summer": "True", "name": "Methods of Teaching Agriculture", "prerequisites": "Prerequisite: Junior standing.", "spring": "True", "number": "426", "fall": "True", "units": " 3", "description": "Discussion and practice in planning and presenting instruction in agriculture in formal and informal settings.  Principles and application of approaches to teaching and organizing instruction, motivating students, developing instructional objectives, selecting and using teaching techniques, evaluating instruction, and managing classroom and laboratory instruction."}, {"summer": "True", "name": "Student Teaching in Agriculture", "prerequisites": "Prerequisite: AEE (ED) 426;  Admission to Professional Semester, Corequisite: AEE (ED) 490, AEE (ED) 424;", "spring": "True", "number": "427", "fall": "True", "units": " 8", "description": "Skills and techniques involved in teaching vocational agriculture through practice in a public school setting with concurrent on-campus seminars."}, {"summer": "True", "name": "Leadership and Management of Volunteers in Agricultural and Extension Education", "prerequisites": "Prerequisite: Junior standing", "spring": "True", "number": "433", "fall": "True", "units": " 3", "description": "This course is intended to prepare students to be effective managers of volunteer programs. Theory will be emphasized in the course because it is essential to be grounded in theory in order to apply it. Major topics of the course will include, but are not limited to: volunteer recruitment, training, evaluation and reward. Students will be required to be active in and outside of class sessions, including a 20-hour field experience. Students must provide their own transportation for field trips and outside of class activities. Cannot receive credit for both AEE 433 and 533."}, {"summer": "True", "name": "Collaborative Leadership: Building Partnerships Across Community Programs", "spring": "True", "number": "434", "fall": "True", "units": " 3", "description": "AEE 323 encouraged but not required."}, {"summer": "True", "name": "Professional Presentations in Agricultural Organizations", "spring": "True", "number": "435", "fall": "True", "units": " 3", "description": "This course teaches effective listening strategies, communication strategies, interpersonal skills and presentation strategies essential for use in today's workplace.  AEE 435 includes strategies and techniques for effective presentations in the food, agricultural, natural resources, as well as other professions, with emphasis on oral and visual presentation techniques.  Presentation skills and strategies for formal and informal situations including conferences, poster presentations along with leadership, conflict resolution, interviewing, negotiation, and group communication theory and strategies will be discussed.  Restricted to CALS students; Jr or Sr level status required."}, {"summer": "True", "name": "Organizational Leadership Development in Agriculture and Life Sciences", "prerequisites": "Prerequisite: AEE 323-Leadership Development in Agriculture", "spring": "True", "number": "460", "fall": "True", "units": " 3", "description": "This course focuses on the impact of effective leadership in organizations in both theory and practice.  Students will examine the major theories and studies that are most relevant and informative with the regard to leadership in organizations.  Students will develop skills in decision-making, management of organizations, and ethical leadership related to agricultural organizations.  Restricted to CALS students."}, {"summer": "True", "name": "Agricultural Communications", "prerequisites": "Prerequisite: AEE 311,  Senior standing", "spring": "True", "number": "470", "fall": "True", "units": " 3", "description": " and color photography to problems of communication and the development of visual presentation materials for instruction and training."}, {"summer": "True", "name": "Advanced Issues in Extension Education", "prerequisites": "Prerequisite: AEE 230", "spring": "True", "number": "478", "fall": "True", "units": " 3", "description": "Advanced issues and trends contributing to the administration, organization, and structure of extension education in a changing world. Senior standing required."}, {"summer": "True", "name": "Seminar in Agricultural and Extension Education", "prerequisites": "Prerequisite: Admission to Professional Semester", "spring": "True", "number": "490", "fall": "True", "units": " 1", "description": "Analysis of opportunities and challenges facing educational leaders in agriculture."}, {"summer": "True", "name": "External Learning Experience in Agricultural and Extension Education", "prerequisites": "Prerequisite: Sophomore standing", "spring": "True", "number": "492", "fall": "True", "units": " 1-6", "description": "Learning experience within an academic framework that utilizes facilities and resources external to the campus. Contact and arrangements with prospective employers initiated by the student and approved by the faculty adviser, prospective employer, and the departmental teaching coordinator prior to the experience.  Not intended for teaching licensure for students in AEE"}, {"summer": "True", "name": "Special Problems in Agriculture and Extension Education", "prerequisites": "Prerequisite: Sophomore standing", "spring": "True", "number": "493", "fall": "True", "units": " 1-6", "description": "A learning experience in agriculture and extension education within an academic framework that utilizes departmental campus facilities and resources.  Arrangements must be initiated by the student and approved by a faculty adviser and the departmental teaching coordinator.  Not intended for teacher licensure for students in AEE."}, {"summer": "True", "name": "Special Topics in Agricultural and Extension Education", "spring": "True", "number": "495", "fall": "True", "units": " 1-3", "description": "Offered as needed to present material not normally available in regular course offerings or  for offerings of new courses on a trial basis.  Not intended for teacher licensure for students in AEE."}, {"summer": "True", "name": "Agricultural Education, Schools and Society", "spring": "True", "number": "500", "fall": "True", "units": " 3", "description": "Role and structure of modern agricultural education within the overall educational system; school organization and governance, curriculum, teacher roles and responsibilities, educational philosophy and history, multiculturalism special need students, impact of technology, professionalism, and current educational trends and issues.  Web-based course."}, {"summer": "True", "name": "Foundations Of Agricultural and Extension Education", "spring": "True", "number": "501", "fall": "True", "units": " 3", "description": "Development and organization of agricultural and extension education in America from colonial times to the present. Emphasis on role of societal and scientific changes, the federal government and philosophy on evolution of agricultural and extensioneducation."}, {"summer": "True", "name": "Youth Program Management", "spring": "True", "number": "503", "fall": "True", "units": " 3", "description": "Research, theory and principles of youth organization management.  Analysis of youth development models and application of leadership theory in a youth organization.  Using evaluation models to assess the effectiveness of major youth organization.  Web-based course."}, {"summer": "True", "name": "Trends and Issues in Agricultural and Extension Education", "spring": "True", "number": "505", "fall": "True", "units": " 3", "description": "Scientific, political, demographic, social, educational, technological, and environmental trends and issues that will contribute to the future structure and operation of agricultural and extension education in the United States."}, {"summer": "True", "name": "Comparative Agricultural and Extension Education", "spring": "True", "number": "507", "fall": "True", "units": " 3", "description": "Organization and operation of formal and nonformal agricultural education and extension systems in the United States and in other countries.  Field trip required - cost approx. $175.00."}, {"summer": "True", "name": "Program Planning in Agricultural and Extension Education", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": "True", "number": "521", "fall": "True", "units": " 3", "description": "Consideration of the need for planning programs in education; objectives and evaluation of community programs; use of advisory group; organization and use of facilities."}, {"summer": "True", "name": "Occupational Experience in Agriculture", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": "True", "number": "522", "fall": "True", "units": " 3", "description": "A major and critical element in all programs of vocational education is provision for appropriate student learning experiences in a real and simulated employment environment. Due to recent developments in education and agriculture, new and expanded concepts of occupational experience devised. Current research substantiates need and desire of teachers of agriculture for assistance in implementing new concepts. Also designed to develop depth of understanding of theoretical foundations underlying new developments in occupational experiences to stimulate individual growth and creativity in implementing further developments."}, {"summer": "True", "name": "Adult Education in Agriculture", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": "True", "number": "523", "fall": "True", "units": " 3", "description": "Designed to meet needs of leaders in adult education. Opportunity to study some of basic problems and values in working with adult groups. Attention given to problem of fitting educational program for adults into public school program and other educational programs as well as to methods of teaching adults."}, {"summer": "True", "name": "Coordinating the High School Agricultural Education Program", "spring": "True", "number": "524", "fall": "True", "units": " 3", "description": "Principles of program planning applied to educational programs about agriculture; theory and field experiences in planning, organizing, and evaluating secondary agricultural education programs; development of plans for conducting all aspects of the complete agricultural education programs."}, {"summer": "True", "name": "Information Technologies in Agricultural and Extension Education", "spring": "True", "number": "526", "fall": "True", "units": " 3", "description": "Principles, theory and techniques of using information technologies to provide instruction to learners, both in person and at a distance, in formal and non formal educational settings."}, {"summer": "True", "name": "Instructional Design in Agricultural and Extension Education", "spring": "True", "number": "528", "fall": "True", "units": " 3", "description": "Planning, developing, implementing, evaluating and managing the instructional process; theories, models, development and research in instructional design' conducting tasks analysis and needs assessments; distance learning considerations.  Web-based course."}, {"summer": "True", "name": "Curriculum Development in Agricultural and Extension Education", "spring": "True", "number": "529", "fall": "True", "units": " 3", "description": "Design and development of data based curriculum and curriculum evaluation procedures in agricultural and extension education.  Critique of curriculum development models, contemporary trends and issues, curriculum resources and accountability tools.Analysis of the use of national and state standards as well as local community needs in curriculum development."}, {"summer": "True", "name": "Priority Management in Agricultural and Extension Education", "spring": "True", "number": "530", "fall": "True", "units": " 3", "description": "Examination of theoretical, psychological and empirical bases for strategies and techniques contributing to enhancement of managerial and personal effectiveness of agricultural educators and individuals in related agricultural organizations."}, {"summer": "True", "name": "Leadership and Management of Volunteers in Agricultural and Extension Education", "prerequisites": "Graduate and Post-baccalaureate Studies students only (GR, PBS)", "spring": "True", "number": "533", "fall": "True", "units": " 3", "description": "This course is intended to prepare students to be effective managers of volunteer programs. Theory will be emphasized in the course because it is essential to be grounded in theory in order to apply it. Major topics of the course will include, but are not limited to: volunteer recruitment, training, evaluation and reward. Students will be required to be active in and outside of class sessions, including a 20-hour field experience. Students must provide their own transportation for field trips and outside of class activities. Cannot receive credit for both AEE 433 and 533."}, {"summer": "True", "name": "Teaching Agriculture in Secondary Schools", "spring": "True", "number": "535", "fall": "True", "units": " 3", "description": "Application of theoretical models and research on effective teaching in secondary agricultural education programs.  teaching strategies, planning required, and instructional management for students with varying backgrounds. Evaluation of student learning and teacher evaluation of instruction."}, {"summer": "True", "name": "Organizational and Administrative Leadership in Agricultural and Extension Educa", "prerequisites": "Prerequisite: Master student or PBS status", "spring": "True", "number": "560", "fall": "True", "units": " 3", "description": "Organizational and administrative leadership concepts, skills and values in relation to agencies, organizations and institutions engaged in the administration of agricultural and extension education programs."}, {"summer": "True", "name": "Evaluation in Agricultural and Extension Education", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "577", "fall": "True", "units": " 3", "description": "Evaluation principles, models, and procedures used in developing and analyzing, agricultural, vocational, technical, and extension education programs; role of comprehensive evaluation in needs assessments, program planning, program implementation, and the marketing of outcomes to major stake-holders; designs for evaluating agricultural and extension programs.  Evaluation logic model is presented to identify and describe program inputs, activities, outputs, and outcomes."}, {"summer": "True", "name": "Scientific Inquiry in Agricultural and Extension Education", "spring": "True", "number": "578", "fall": "True", "units": " 3", "description": "Philosophy, design, interpretation and practice of scientific research in agricultural and extension education, with a particular focus on the skills necessary to be an effective and critical \"consumer\" of research that is practiced within the field.  Web based course."}, {"summer": "True", "name": "Research Design in Agricultural and Extension Education", "spring": "True", "number": "579", "fall": "True", "units": " 3", "description": "Design of Research in Agricultural and Extension education.  Development of proposals for thesis research or competitive grants.  Critical analyses of research in the field and proposed research."}, {"summer": "True", "name": "Special Topics in Agricultural and Extension Education", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": "True", "number": "595", "fall": "True", "units": " 1-4", "description": "Presentation of material not normally available in regular graduate course offerings or for offerings of new 500 level courses on a trial basis."}, {"summer": "True", "name": "Seminar", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": "True", "number": "601", "fall": "True", "units": " 1", "description": "Current topics and issues in agricultural and extension education. Selection and research of topics, presentation of seminars, and leading group discussions."}, {"summer": "True", "name": "Special Topics", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": "True", "number": "610", "fall": "True", "units": " 1-3", "description": "Presentation of material not normally available in regular graduate course offerings or for offerings of new 500 level courses on a trial basis."}, {"summer": "True", "name": "Special Problems in Agricultural and Extension Education", "spring": "True", "number": "620", "fall": "True", "units": " 1-6", "description": "Exploration of topics of special interest not covered by existing courses by individual students under faculty member's directions.  Readings and independent study, problems or research not related to a thesis."}, {"summer": "True", "name": "Practicum In Agricultural and Extension Education", "spring": "True", "number": "641", "fall": "True", "units": " 1-6", "description": "Faculty-supervised practicum in an educational, extension or agricultural industry setting."}, {"summer": "True", "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "685", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "688", "fall": "True", "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": "True", "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "689", "fall": "True", "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": "True", "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "690", "fall": "True", "units": " 1-3", "description": "For students in non-thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam."}, {"summer": "True", "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "693", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "695", "fall": "True", "units": " 1-9", "description": "Thesis research"}, {"summer": "True", "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "696", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "699", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis."}, {"summer": "True", "name": "International Agricultural Development", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "705", "fall": "True", "units": " 3", "description": "This course provides an opportunity to learn about global agricultural and extension education issues, challenges and opportunities relating to agricultural development. The course emphasis is on building necessary knowledge and skills for analyzing global agricultural and extension education issues and formulating alternatives for agricultural development. This course has been designed to help graduate students understand agriculture and extension education with a global perspective."}, {"summer": "True", "name": "Effective Teaching in Agriculture and Life Sciences", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "735", "fall": "True", "units": " 3", "description": "Theory and practice of effective teaching in agricultural and life sciences.  Emphasis on course planning, teaching and learning styles, instructional techniques, laboratory instruction, text construction, student evaluation, instructional technology, and faculty roles and responsibilities."}, {"summer": "True", "name": "Extension In Developing Countries", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": "True", "number": "740", "fall": "True", "units": " 3", "description": "Rural extension (agriculture, forestry, development, etc.). Strategies for enablement of farm/rural people to better usage of science, technology and other types of knowledge in fulfilling their own aspirations within their cultural context. Examination of practice of rural extension/development in many parts of the world and basic conceptual ideas and processes."}, {"summer": "True", "name": "Special Problems in Agricultural and Extension Education", "spring": "True", "number": "820", "fall": "True", "units": " 1-6", "description": "Exploration of topics of special interest not covered by existing courses by individual students under faculty member's directions. Readings and independent study, problems or research not related to a thesis."}, {"summer": "True", "name": "Practicum in Agricultural and Extension Education", "spring": "True", "number": "841", "fall": "True", "units": " 1-6", "description": "Faculty-supervised practicum in an educational, extension or agricultural industry setting."}, {"summer": "True", "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "885", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "893", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate faculty."}, {"summer": "True", "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "895", "fall": "True", "units": " 1-9", "description": "Dissertation research."}, {"summer": "True", "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "896", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "899", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hours, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations."}]