[{"summer": false, "name": " Resource Economics", "spring": true, "number": "201", "fall": true, "units": " 3", "description": "Introduction to economic principles of marginal benefits and costs with application to consumer and producer decisions. Functions of market exchange systems in determining prices and quantities and creation of wealth. Property rights and opportunities for exchange. Role of government in dealing with agricultural and resource problems. Macroeconomic analysis including inflation, unemployment, money and banking system.  Credit will not be given for both ARE 201 and either EC 201 or EC 205."}, {"summer": "True", "name": "SOC  203A", "spring": "True", "number": "3", "fall": "True", "units": "Current Social Problems", "description": "Examination of social problems linked to structures of economic, political, gender and racial inequality; including poverty, disease, racism, sexism, unemployment, psychological distress, educational failure, environmental destruction and violence. Possible solutions viewed from a variety of perspectives.   Includes core sociological concepts, methods and theories."}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": "114", "description": "Applications of mathematical principles to solve problems encountered in Agricultural Institute courses.  Percentages, ratios, proportions, averages, exponents, basic algebra, graphs, basic geometry and basic trigonometry with applications."}, {"summer": false, "name": "Community Leadership and Development", "spring": true, "number": "151", "fall": true, "units": " 3", "description": "Concentration upon preparation of students for leadership in their communities. Attention to leadership styles, social and personal factors contributing to an individual's rise to a leadership position, changing structures within communities, and social issues facing community leaders. Focus upon both urban and rural communities with primary emphasis on rural settings. DUBOSE-BLUM"}, {"summer": false, "name": "AGI External Learning Experience", "spring": true, "number": "192", "fall": true, "units": " 1-6", "description": "Learning experience in one of the eight majors in the Agricultural Institute that utilizes facilities and resources external to the campus. (Contact with professionals in the area of student's major must be initiated by student and approved by a faculty adviser and the Director of the Agricultural Institute prior to the experience)."}, {"summer": false, "name": "AGI Special Problems and On-campus Learning", "spring": true, "number": "193", "fall": true, "units": " 1-6", "description": "Learning experience in one of the eight majors in the Agricultural Institute that utilizes facilities and resources on the campus. (Contact with the project supervisor must be initiated by student and approved by the faculty adviser and the Director of the Agricultural Institute prior to the experience)."}, {"summer": false, "name": "International Learning Experience in AGI", "spring": true, "number": "194", "fall": true, "units": " 1-6", "description": "Course offered as needed for international learning experiences in the Agricultural Institute involving international travel and immersion in an international culture.  A written report is required and student must identify a faculty member to work with them.  Travel expenses may be incurred by the student. Departmental approval required."}, {"summer": false, "name": "Special Topics in the Agricultural Institute", "spring": true, "number": "195", "fall": true, "units": " 1-4", "description": "Offered as needed to present material not normally available in regular departmental course offerings or for offering of new courses on a trial basis."}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"prerequisites": " 3", "number": "", "description": "Principles of operation and maintenance of powered turf, garden, and landscape equipment. Small engines, power transmission systems, equipment maintenance, and operator safety."}, {"summer": false, "name": "Agricultural Tractors and Machinery", "spring": false, "number": "133", "fall": true, "units": " 4", "description": "Principles of tractor engines, power trains, and hydraulics. Tractor operation, service and testing. Machinery management involving tractor and implement selection based on power and field requirements and on economics of ownership and operation. Implements for crop production to include tillage, planting, chemicals and harvesting. Set-up, operation and maintenance of implements. Calibration of planting and chemical equipment. Tractor and machinery safety. VEAL"}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"number": ""}, {"prerequisites": " 1 - Offered in Fall Only", "number": "", "description": "Introduction to the collegiate experience, academic skills of successful students, and scope, purpose, and objectives of the Agricultural Institute with an emphasis on areas related to the ornamental and landscape plants industry. Students will explore college and departmental resources, academic policies and procedure, the green industry, career opportunities, and current trends and issues in horticulture."}, {"summer": false, "name": "Plant ID", "spring": false, "number": "111", "fall": true, "units": " 3", "description": "Identification, adaptation, culture, and use of ornamental trees, shrubs, vines, ground covers and herbaceous plants.  FAIR"}, {"summer": false, "name": "Plant Growth and Development", "spring": false, "number": "115", "fall": true, "units": " 3", "description": "Examination of how plants grow and respond to environmental and cultural stimuli. Topics include: cell growth; flower, fruit, seed, shoot, and root development and functions; anatomy of stems, roots and leaves; hormonal regulation of growth; adaptations for survival; plant responses to temperature, light and gravity; photosynthesis, transpiration, and absorption of water and nutrients. FONTENO"}, {"summer": false, "name": "Plant Propagation", "spring": true, "number": "121", "fall": false, "units": " 3", "description": "Principles and practices involved in sexual (seed) and asexual (vegetative) propagation of a variety of plants. Methods of asexual propagation include cuttings, layering, budding and grafting, division, separation, and micropropagation (tissue culture). Emphasis on factors affecting the regeneration of species by particular techniques. BLAZICH"}, {"summer": false, "name": "Greenhouse Crop Production", "spring": true, "number": "141", "fall": false, "units": " 4", "description": "Production of greenhouse crops. Emphasis on greenhouse construction and environmental manipulation of crop growth. Site selection, construction materials, greenhouse design. Specific flowering crops as models to demonstrate potted flowering plant, cut flower, and bedding plant production systems. Hands-on crop production experience plus trips to commercial floriculture production and marketing facilities."}, {"summer": false, "name": "Nursery Production", "spring": true, "number": "151", "fall": false, "units": " 3", "description": "Total aspects of field and container nursery stock production including site selection and development, propagation, growing procedures, harvesting, marketing, shipping and labor management practices. KRAUS"}, {"summer": false, "name": "Landscape Maintenance", "spring": false, "number": "162", "fall": true, "units": " 3", "description": "A study of the maintenance of landscaped areas including plant material selection, installation, pruning, fertilization, and pest control of trees, shrubs, lawns, flower beds, and interior plants. WARREN"}, {"number": ""}, {"number": "0102"}, {"number": ""}, {"number": ""}, {"number": ""}, {"prerequisites": " 3 - Offered in Fall Only", "number": "", "description": "General principles in turfgrass weed and disease development and management programs.  Different weeds, their life cycles, management techniques, and factors affecting herbicide application performance will be covered.  Students will learn the causes, development, identification and management of turfgrass diseases.  Laboratory includes weed identification and herbicide application methods.  Certain laboratory exercises will require personal transportation to Lake Wheeler Road Turf Field Lab unless otherwise specified by the lab instructors.  The course is restricted to AGI students only."}, {"summer": false, "name": "Diseases of Ornamentals and Turfgrasses", "spring": false, "number": "155", "fall": true, "units": " 3", "description": "Causes, development, identification and management of diseases of greenhouses and landscape ornamentals and turfgrasses. WARFIELD"}, {"number": ""}, {"prerequisites": " 3", "number": "", "description": "Basic principles of disease and disease management in livestock and poultry. Disease prevention through sanitation and vaccination. Diseases of horses, pigs, ruminants, poultry, and disease prevention programs for each species"}, {"number": ""}, {"summer": "True", "name": ")  172", "spring": "True", "number": "3", "fall": "True", "units": "Vertebrate Pest Management", "description": "Principles and practices of vertebrate pest damage control. Emphasis on integrated pest management as applied to damage caused by native wildlife and commensal rodents. WALDVOGEL"}]