[{"summer": "True", "name": "Introductory Topics in Agriculture and Life Sciences", "prerequisites": "Prerequisite: Freshman standing or Sophomore standing", "spring": "True", "number": "103", "fall": "True", "units": " 1", "description": "Introduction to scope and objectives of university education. Emphasis on  sciences, particularly as related to agriculture and life sciences. Departmental  programs, computers, career opportunities and more."}, {"summer": "True", "name": "Career Exploration Seminar", "prerequisites": "Prerequisite: Ag and Life Science Majors", "spring": "True", "number": "110", "fall": "True", "units": " 1", "description": "Students learn about the career decision-making process through integration of self-knowledge and research in the world of work.  Emphasis is placed on Agriculture and Life Sciences careers.  Course is targeted towards undeclared majors, or those who desire experiences in career exploration and planning.  Students assess interests, values, skills and personal strengths while learning about a variety of occupational resources.  Effective career management and job seeking skills emphasized.  Career mentors are utilized for each student."}, {"summer": "True", "name": "Special Topics in Agriculture and Life Sciences", "spring": "True", "number": "295", "fall": "True", "units": " 1-3", "description": "Offered as needed to present material not normally available in regular departmental course offerings; or for offerings of new courses on a trial basis."}, {"summer": "True", "name": "Professional Development and Career Opportunities in Agriculture and Life Scienc", "prerequisites": "Prerequisite: External transfers or NCSU students with 45 hours or more.  CALS Majors.", "spring": "True", "number": "303", "fall": "True", "units": " 1", "description": "Students will not receive credit for USC 301, ALS 103 and ALS 303."}, {"summer": "True", "name": "Agriculture and Life Sciences Honors Seminar", "prerequisites": "Prerequisite: Enrollment by invitation for sophomores or juniors in CALS with GPA 3.35 or higher.", "spring": "True", "number": "398", "fall": "True", "units": " 2", "description": "A seminar/discussion  honors course with emphasis on a team approach to scientific research into topics that link science with issues in society; exposure to leadership skills and bioethics; requirement of detailed written or oral reports; career development in the agricultural and life sciences; required participation in on- and off-campus scholarly retreats."}, {"summer": "True", "name": "International Learning Experience in Agriculture and Life Sciences", "spring": "True", "number": "494", "fall": "True", "units": " 1-6", "description": "Course offered as needed for international learning experiences in agriculture and life sciences involving international travel and immersion in an international culture.  A written report is required and student must identify a faculty member to work with them.  Travel expenses may be incurred by the student.  Departmental Approval Required."}, {"summer": "True", "name": "Special Topics in Agriculture and Life Sciences", "spring": "True", "number": "495", "fall": "True", "units": " 1-3", "description": "Offered as needed to present material not normally available in regular departmental course offerings or for offering of new courses on a trial basis."}, {"summer": "True", "name": "Honors Research or Teaching I", "prerequisites": "Prerequisite: ALS 398, GPA 3.25 or higher", "spring": "True", "number": "498", "fall": "True", "units": " 1-3", "description": " ALS 499 combined."}, {"summer": "True", "name": "Honors Research or Teaching II", "prerequisites": "Prerequisite: ALS 498, GPA 3.25 or higher", "spring": "True", "number": "499", "fall": "True", "units": " 1-4", "description": "Honors research or teaching for students in Agriculture and Life Sciences. Completion of work initiated in ALS 498. Analysis of results. Preparation and presentation of written and oral reports.  A maximum of 6 credits for ALS 498 and ALS 499 combined."}]