[{"summer": false, "name": "Introduction to Companion Animals", "prerequisites": "Prerequisite: Freshman standing or Sophomore standing", "spring": true, "number": "105", "fall": true, "units": " 3", "description": "Introduction to animals that people keep as companions.  Variation, behavior, anatomy, physiology, disease, and training of animals as diverse as fish, snakes, mice, rats, birds, cats, and dogs.  Special relationships between humans and companion animals in a societal context."}, {"summer": false, "name": "Introduction to Equine Science", "prerequisites": "Prerequisite: Freshman standing or Sophomore standing", "spring": false, "number": "110", "fall": true, "units": " 3", "description": "History, management, and use of horses and their profound impact on society.  Selection, care, and enjoyment of horses with emphasis on genetics, nutrition, reproduction, behavior, and health."}, {"summer": false, "name": "Introduction to Animal Science", "spring": true, "number": "150", "fall": true, "units": " 3", "description": "Fundamental principles of animal management; contributions of animals and animal products to humanity; application of science to animal production; issues regarding animal production."}, {"summer": false, "name": "Introduction to Animal Science Lab", "prerequisites": "Corequisite: ANS 150", "spring": true, "number": "151", "fall": true, "units": " 1", "description": "Hands-on experience and demonstrations with livestock and horses; identification of common management equipment and knowledge of proper use; animal tracts, organs, skulls, feeds, breeds, and other animal-related items or topics.  The lecture (ANS 150) must be taken concurrently or have been passed previously with a C-minus or higher.  This lab course is restricted to the following majors: SAS, IAS, AEX, AGS, and AED.  Transportation is provided to the off-campus labs, and students will be returned to campus prior to the end of the scheduled lab period."}, {"summer": false, "name": "Techniques of Animal Care", "prerequisites": "Prerequisite: ANS 150 or ANS 230, IAS Majors or SAS Majors", "spring": true, "number": "201", "fall": false, "units": " 2", "description": "A laboratory course in  the applied management of beef cattle, dairy cattle, swine and small ruminants with participatory assignments of common techniques utilized in livestock production."}, {"summer": false, "name": "Physiology of Domestic Animals", "prerequisites": "Prerequisite: (BIO 181 or BIO 183) and Sophomore standing", "spring": true, "number": "205", "fall": true, "units": " 3", "description": "This course is designed to introduce students to mammalian physiology (structure and function) with emphasis on livestock species. Students will gain a basic understanding of body systems including circulatory, muscular, skeletal, digestive, and reproductive systems and functions of those systems with relevance to the whole animal and maintenance of homeostasis."}, {"summer": "True", "name": "Anatomy of Domestic Animals Lab", "prerequisites": "Corequisite: ANS 205", "spring": "True", "number": "206", "fall": "True", "units": " 1", "description": "This lab course is designed for Animal Science majors to take with the ANS 205 lectures (Physiology of Domestic Animals).  Students will learn to identify major anatomical and cellular structures from domestic animal (livestock) specimens through examination of gross and microscopic anatomy.  SAS and IAS majors only."}, {"summer": true, "name": "Agricultural Biotechnology: Issues and Implications", "spring": true, "number": "208", "fall": false, "units": " 3", "description": "Trends and issues of agricultural biotechnology in today's society are addressed while covering the basic biological science behind the technology. Applications of and policy issues associated with plant, animal, and environmental biotechnology used in the agricultural industry are examined from an interdisciplinary approach."}, {"summer": false, "name": "Basic Agricultural Genetics", "prerequisites": "Prerequisite: ZO 160 or BIO 183", "spring": false, "number": "215", "fall": true, "units": " 3", "description": "Basic principles of inheritance in plants and animals of agricultural significance. Transmission genetics and its effects on the usefulness of plants and animals. Basic principles of plant and animal improvement."}, {"summer": false, "name": "Reproduction and Lactation in Domestic Animals", "prerequisites": "Prerequisite: ANS 205 or BIO 250", "spring": true, "number": "220", "fall": true, "units": " 3", "description": "Biological processes in reproduction and lactation with emphasis on domestic mammals such as cattle, sheep, goats, horses, swine, dogs, cand cats.  Environmental and genetic factors that affect these processes.  Identification, evaluation and solutions of problems in these physiological areas."}, {"summer": false, "name": "Reproduction and Lactation in Domestic Animals Lab", "prerequisites": "Corequisite of ANS 220", "spring": true, "number": "221", "fall": true, "units": " 1", "description": "ANS 221 is a laboratory course that introduces students to the application of principles of reproduction and lactation in domestic mammals. Students must have either completed or concurrently be enrolled in ANS 220. This course is restricted to Animal Science majors (SAS, IAS)."}, {"summer": true, "name": "Principles of Animal Nutrition", "spring": false, "number": "225", "fall": false, "units": " 3", "description": "This online Principles of Animal Nutrition course is designed for non-Animal Science majors and off-campus students. It includes: feed classification, gastrointestinal tract anatomy of domestic mammals, nutrients and their functions, digestion and metabolism, feed regulations, and feeding/nutrition of cattle, small ruminants, horses, swine, poultry, dogs, cats, and rabbits. For on-campus students, ANS 225 counts toward the Animal Science minor but only counts as a Free Elective for Animal Science majors."}, {"summer": false, "name": "Nutrition of Domestic Animals", "prerequisites": "Prerequisite: ANS 150 or BIO 183; ANS 205 is also recommended.", "spring": true, "number": "230", "fall": true, "units": " 3", "description": "Introduction to nutrition, digestion, and absorption in domestic mammals.  Major nutrient classes and their functions in the body, feed classification and chemical analysis, feed processing, and nutrient requirements."}, {"summer": false, "name": "Nutrition of Domestic Animals Lab", "prerequisites": "Corequisite: ANS 230", "spring": true, "number": "231", "fall": true, "units": " 1", "description": "ANS 231 is a laboratory course that introduces students to the application of principles of nutrition and applied feeding of domestic mammals.  Students must have either completed or concurrently be enrolled in ANS 230.  This course is restricted to Animal Science Majors (SAS, IAS)."}, {"summer": false, "name": "Swine Breeding and Gestation Management", "prerequisites": "Prerequisite: ANS 150 or equivalent", "spring": true, "number": "262", "fall": false, "units": " 1", "description": "Management principles associated with breeding and gestation in swine.  Emphasis on reproductive anatomy and physiology of boars and sows, development of replacement animals, semen production and evaluation, artificial insemination, and use of reproductive records.  Extensive use of reproductive case studies."}, {"summer": false, "name": "Professional Development of PreVeterinary Track Students", "prerequisites": "Prerequisite: BIO 183 and Sophomore Standing", "spring": true, "number": "281", "fall": false, "units": " 1", "description": "This course introduces PreVeterinary track students to the scope of the veterinary profession and to current issues affecting veterinary professionals. The course will help students gain an understanding of the professional requirement of the veterinary school applications. Students will be expected to discuss current animal and public health issues as well as areas of national shortage in the veterinary profession. One Saturday at the NCSU vet school Open House is required (first Saturday in April). Sophomore standing is required."}, {"summer": true, "name": "Animal Science Study Abroad", "spring": false, "number": "291", "fall": false, "units": " 1-6", "description": "Course sections offered as needed for international learning experiences in Animal Science involving international travel and N.C. State University Faculty-supervised learning in the non-U.S. location. A maximum of one credit hour per week of supervised study will be assigned, and the faculty member will provide students with a syllabus outlining the requirements for successful completion (grade of \"S\"). This course counts as a free elective. All expenses including travel, are the responsibility of the student. The student is also responsible for obtaining a valid passport."}, {"summer": true, "name": "Australian Animal Agriculture", "prerequisites": "Prerequisite: Cumulative GPA greater than 2.0.", "spring": false, "number": "292", "fall": false, "units": " 3", "description": "This course involves travel to Australia through N.C. State University's Study Abroad Program.  Participants will have the opportunity to increase their knowledge and understanding in the principle areas of animal and veterinary sciences and Australian studies.  Species studied include cattle (beef and dairy), sheep, goats, pigs, native Australian animals, and non-native feral animals (such as rabbits).  All expenses, including the Study Abroad fee and airline travel, are the responsibility of the student.  The student is also responsible for obtaining a valid passport."}, {"summer": true, "name": "Introduction to Human Nutrition", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "301", "fall": true, "units": " 3", "description": "Functions, dietary sources and deficiencies of essential nutrients in humans; a balanced diet; role of nutrients in heart disease, cancer, hypertension, osteoporosis; weight control and eating disorders; vegetarianism; food safety; dietary supplements; government regulation of food supply; food quackery. Food science majors may use as a free elective only"}, {"summer": false, "name": "Principles of Equine Evaluation", "prerequisites": "Prerequisite: ANS 110", "spring": true, "number": "303", "fall": false, "units": " 2", "description": "Conformation and function, performance, and soundness of the horse.  Breed standards, rules, and regulations for evaluation, selection, and performance.  Field trips."}, {"summer": false, "name": "Dairy Cattle Evaluation", "prerequisites": "Prerequisite: ANS 150", "spring": true, "number": "304", "fall": false, "units": " 2", "description": "The first half of this course covers basic aspects of dairy cattle breeds, dairy character, form and function including type traits and linear scoring of dairy cattle, interpreting and using judging scorecards, comparing/evaluating dairy cattle, andplacing animals in a class. The second half of the course develops the student's ability to correctly evaluate dairy cattle classes, but more importantly to support their opinions through oral communication."}, {"summer": false, "name": "Livestock Evaluation", "prerequisites": "Prerequisite: ANS 150", "spring": true, "number": "309", "fall": false, "units": " 3", "description": "Students will be exposed to basic concepts associated with growth, development and value determination of livestock.  Familiarization with official USDA grading standards for cattle, sheep, swine and goats is emphasized.  Introduction to judging terminology, placing classes of livestock and justification through oral reasons."}, {"summer": false, "name": "Muscle Foods and Eggs", "prerequisites": "Prerequisite: ZO 160, BIO 181 or BIO 183", "spring": false, "number": "322", "fall": true, "units": " 3", "description": "Processing and preserving fresh poultry, red meats, seafood, and eggs.  Ante- and post-mortem events as they affect quality, yield, and compositional characteristics of muscle foods.  Principles and procedures involved in the production of processedmeat items."}, {"summer": false, "name": "Milk and Dairy Products", "prerequisites": "Prerequisite: BIO 181 or 183, CH 101", "spring": true, "number": "324", "fall": true, "units": " 3", "description": "Introduction to the manufacture of dairy products.  Dairy processing procedures from the farm, through the dairy plant, and to the consumer are studied.  The course consists of 15 learning modules, three exams, and a project."}, {"summer": false, "name": "Laboratory Animal Science", "spring": true, "number": "330", "fall": false, "units": " 3", "description": "A sophomore to senior level course designed to cover the basics of laboratory animal science, a specialty dealing with the use of vertebrate animal species in intensive research.  Some topics to be covered are: husbandry, facility management, animalhealth and welfare, diagnostics, surgical area management, research methods and administrative duties.  Students will use the material for studying for the certification as a Laboratory Animal Technician via the American Association For Laboratory Animal Science (AALAS).  A separate fee is required for certification; this fee is not covered by tuition for ANS 330.  Must hold sophomore standing or higher."}, {"summer": false, "name": "Introduction to HACCP", "spring": true, "number": "350", "fall": true, "units": " 3", "description": "Introductory course on the Hazard Analysis and Critical Control Points System (HACCP) which is designed to decrease hazards in foods.  An International HACCP Alliance approved curriculum which covers prerequisite programs.  A step by step approach for developing and implementing a HACCP plan for USDA regulated food processing plants. Offered only as a world wide web course through the Office of Instructional Telecommunications."}, {"summer": false, "name": "Companion Animal Management", "prerequisites": "Prerequisite: ANS 105 and Junior standing", "spring": true, "number": "400", "fall": false, "units": " 3", "description": "Anatomy, physiology, nutrition, genetics, and health of companion animals including cats, dogs, rabbits, rats, mice, reptiles, amphibians, and fish.  Problem solving and enterprise management skills in laboratories."}, {"summer": false, "name": "Beef Cattle Management Lecture", "prerequisites": "Prerequisite: ANS 150 and Junior standing", "spring": true, "number": "402", "fall": false, "units": " 2", "description": "ANS 402 integrates technical information in animal nutrition, breeding, genetics, and reproductive physiology and incorporates this into information on management skills, business practices, and decision-making processes. This integration requires competency in oral and written communication skills; therefore, a major strategy is to practice and improve students' communication skills during the semester."}, {"summer": false, "name": "Swine Management", "prerequisites": "Prerequisite: ANS 150 and Junior standing", "spring": false, "number": "403", "fall": true, "units": " 3", "description": "Management principles associated with swine production.  Emphasis on interactions of health, equipment, nutrition, reproduction and genetics during nursery, finishing, farrowing and breeding phases of production. Waste management practices and alternatives, development of marketing strategies and economic evaluation of management practices."}, {"summer": false, "name": "Dairy Cattle Management Lecture", "prerequisites": "Prerequisite: (ANS 225 or ANS 230) and Junior standing", "spring": false, "number": "404", "fall": true, "units": " 2", "description": "ANS 404 covers nutritional requirements of the dairy cow, digestive physiology, practical applications of balancing rations, feeding systems, and management tools for effective feeding strategies. Students will also receive information on labor managemnt and efficient record keeping tools."}, {"summer": false, "name": "Small Ruminant Management", "prerequisites": "Prerequisite: ANS 150, Junior standing", "spring": false, "number": "408", "fall": true, "units": " 3", "description": "Principles and practices of production, management, and marketing of sheep and goats.  Role of genetics, nutrition, reproduction and animal health.  Hands-on experience and field trips during labs."}, {"summer": false, "name": "Equine Management", "prerequisites": "Prerequisite: ANS 110 and Junior standing", "spring": true, "number": "410", "fall": false, "units": " 3", "description": "Equine anatomy, physiology, nutrition, genetics and health. Laboratory emphasis on reproductive management, breeding, problem solving, and management skills. Field trips required."}, {"summer": false, "name": "Management of Growing and Performance Horses", "prerequisites": "Prerequisite: ANS 110", "spring": false, "number": "411", "fall": true, "units": " 3", "description": "This course is an overview of scientific applications used in management of growing and performance horses.  Topics include: nutrition and feeding, disease prevention, exercise conditioning, and methods of evaluation and selection.  Students required to provide their own transportation to labs.  Must hold junior or senior standing."}, {"summer": false, "name": "Comparative Nutrition", "prerequisites": "Prerequisite: ANS 225 or ANS 230 or CH 220 or CH 223", "spring": false, "number": "415", "fall": true, "units": " 3", "description": "Principles of nutrition, including the classification of nutrients and the nutrient requirements of and metabolism by different species for health, growth, maintenance and productive functions."}, {"summer": false, "name": "Human Nutrition and Chronic Disease", "prerequisites": "Prerequisite: Junior standing.  ANS 230, or ANS/FS/NTR 301 or FS/NTR 400 or ANS/NTR/PO 415", "spring": true, "number": "419", "fall": false, "units": " 3", "description": "Current concepts regarding, and physiological bases of the roles of nutrition in the prevention and treatment of acute and chronic disease states in humans with emphasis on the process of scientific discovery, reading of original research and transformation of research findings to public policy."}, {"summer": false, "name": "Feed Manufacturing Technology", "prerequisites": "Prerequisite: ANS(NTR,PO) 415 or ANS 230 or ANS 225", "spring": true, "number": "425", "fall": false, "units": " 3", "description": "Feed mill management, feed ingredient purchasing, inventory, storage, and quality evaluation, computerized feed formulation, feeding programs for poultry and swine, feed mill design, equipment, maintenance, operation, safety, state and federal regulations pertaining to feed manufacture."}, {"summer": true, "name": "Selection of Domestic Animals", "prerequisites": "Prerequisite: (ANS/HS 215 or GN 311) and (ST 311 or ST/BUS 350) and Junior standing", "spring": false, "number": "440", "fall": true, "units": " 3", "description": "Modern evaluation and selection procedures for domestic animals; selection goals, estimation of breeding values and performance testing; their impact on genetic changes."}, {"summer": false, "name": "Advanced Reproductive Physiology and Biotechnology", "prerequisites": "Prerequisite: ANS 220", "spring": false, "number": "452", "fall": true, "units": " 3", "description": "Comparative approach to examining aspects of reproductive physiology in selected vertebrate species.  Detailed examination of current reproductive biotechnologies and ethical issues associated with the application of reproductive biotechnologies. Credit will not be given for both ANS 452 and ANS (PHY) 552."}, {"summer": false, "name": "Growth and Development of Domestic Animals", "prerequisites": "Prerequisite: ANS 230, Junior standing", "spring": false, "number": "453", "fall": true, "units": " 3", "description": "Introduction to the basic concepts of growth with emphasis on domestic mammals.  Growth of the major classes of animal tissues and regulation by endogenous and exogenous factors.  Relationship to efficiency of animal production.  Credit will not be given for both ANS 453 and 553."}, {"summer": false, "name": "Lactation, Milk and Nutrition", "prerequisites": "Prerequisite: ANS 230 or FS/NTR 400; BCH 451 or ZO 421", "spring": true, "number": "454", "fall": false, "units": " 3", "description": "Nutritional properties of milk as a high-quality food with nutritional diversity.  Principles of physiology, biochemistry and cell biology in the mammary gland.  Procedures of milk production and milk collection for milk quality and nutrition.  Human lactation vs. that of domestic animals.  Impacts of biotechnology and food safety on dairy production. Credit will not be given for both ANS 454 and 554."}, {"summer": false, "name": "Beef Cattle Management Lab", "prerequisites": "Corequisite: ANS 402", "spring": true, "number": "462", "fall": false, "units": " 1", "description": "ANS 462 is a hands-on lab held at the Beef Educational Unit of N.C. State University. This lab is required for Animal Science majors who have taken or are taking ANS 402, Beef Cattle Management Lecture. AND 462 is restricted to Animal Science majors and minors. In ANS 462, students learn proper cattle handling techniques and management practices that are important for beef cattle management."}, {"summer": false, "name": "Dairy Cattle Management Lab", "prerequisites": "Corequisite: ANS 404", "spring": false, "number": "464", "fall": true, "units": " 1", "description": "ANS 464 lab is hands-on guide to principles of modern dairy cattle management. It will provide students an overview of a complete dairy enterprise. All students will receive instruction on the nutritional requirements of the dairy cow, digestive physiology and practical applications to balancing rations, feeding systems and management tools for effective feeding strategies, records keeping and role of diary record management system, post harvest technology including milk supply, milk processing and marketing and milk products. Restricted to Animal Science majors and minors."}, {"summer": false, "name": "Judging Team", "prerequisites": "Prerequisite: ANS 303 or ANS 304 or ANS 309", "spring": false, "number": "480", "fall": true, "units": " 1", "description": "Students practice judging techniques for livestock, horses, or dairy animals, including ranking animals and providing oral reasons to defend the rankings. Students meet weekly with a coach to practice locally and will also travel to compete in one or two regional or national competitions. Each team (livestock, horse, dairy) is expected to raise funds to finance the trips. Students earn 1 credit for being on a team, and can earn up to 3 credits of Free Elective for ANS 480 by serving on the judging team for different species. Field trips that last several days are required.  Departmental Approval Required.  Course may be taken up to 3 times (once per species)."}, {"summer": false, "name": "External Learning Experience", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "492", "fall": true, "units": " 1-6", "description": "A learning experience in agriculture and life sciences within an academic framework that utilizes  facilities and resources which are external to the campus. Contact and arrangements with prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, and the departmental teaching coordinator prior to the experience."}, {"summer": false, "name": "Special Problems in Animal Science", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "493", "fall": true, "units": " 1-6", "description": "A learning experience in agriculture and life sciences within an academic framework that utilizes departmental campus facilities and resources (Arrangements must be initiated by student and approved by a faculty adviser and the departmental teachingcoordinator)."}, {"summer": true, "name": "Special Topics in Animal Science", "spring": true, "number": "495", "fall": true, "units": " 1-3", "description": "Offered as needed to present material not normally available in regular course offerings or for offering of new courses on a trial basis."}, {"summer": false, "name": "Advanced Applied Animal Reproduction", "prerequisites": "Prerequisite: ANS 220", "spring": false, "number": "530", "fall": true, "units": " 3", "description": "Current reproductive management techniques for each of the major mammalian livestock species.  Enable students to develop reproductive decision making skills.  Must hold graduate status."}, {"summer": false, "name": "Advanced Applied Animal Reproduction Lab", "prerequisites": "Prerequisite: ANS 220, Corequisite: ANS 530", "spring": false, "number": "531", "fall": true, "units": " 1", "description": "Practical experience in routine reproductive management techniques discussed in ANS 530.  Must hold graduate status."}, {"summer": true, "name": "Selection of Domestic Animals", "prerequisites": "Prerequisite: (ANS 215 or GN 411) and (ST 311 or ST/BUS 350), or permission of instructor", "spring": false, "number": "540", "fall": true, "units": " 3", "description": "Modern evaluation and selection procedures for domestic animals; selection goals, estimation of breeding values and performance testing related to their impact on genetic changes.  Multiple species including horses, dogs, cats, beef cattle, dairy cattle, pigs, sheep, and poultry will be discussed.  Students cannot get credit for both ANS 440 and ANS 540."}, {"summer": false, "name": "Applied Ruminant Nutrition", "prerequisites": "Prerequisite: ANS 230 or ANS(NTR,PO) 415.  Permission given to undergraduates", "spring": false, "number": "550", "fall": true, "units": " 3", "description": "Applied concepts in ruminant nutrition for the practicing agricultural professional.  Protein, energy, vitamin and mineral nutrition in relation to the nutritional needs and practical feeding of beef cattle, dairy cattle, sheep, and goats.  New developments in feeding systems, feed additives and the prevention and treatment of metabolic disorders.  Emphasis on solving problems in case studies. Permission given to undergraduates"}, {"summer": false, "name": "Advanced Reproductive Physiology and Biotechnology", "prerequisites": "Prerequisite: ANS 220", "spring": false, "number": "552", "fall": true, "units": " 3", "description": "Comparative approach to examining aspects of reproductive physiology in selected vertebrate species.  Detailed examination of current reproductive biotechnologies and ethical issues associated with the application of reproductive biotechnologies.  Credit will not be given for both ANS 452 and ANS(PHY) 552."}, {"summer": false, "name": "Growth and Development of Domestic Animals", "spring": false, "number": "553", "fall": true, "units": " 3", "description": "Introduction to the basic concepts of growth with emphasis on domestic mammals.  Growth of the major classes of animal tissues and regulation by endogenous and exogenous factors.  Relationship to efficiency of animal production.  Credit will not be given for both ANS 453 and 553."}, {"summer": false, "name": "Lactation, Milk, and Nutrition", "prerequisites": "Prerequisite: ANS 230 or FS/NTR 400; BCH 451 or ZO 421", "spring": true, "number": "554", "fall": false, "units": " 3", "description": "Nutritional properties of milk as a high-quality food with nutritional diversity.  Principles of physiology, biochemistry and cell biology in the mammary gland.  Procedures of milk production and milk collection for milk quality and nutrition.  Human lactation vs. that of domestic animals.  Impacts of biotechnology and food safety on dairy production.  Credit will not be given for both ANS 454 and 554."}, {"summer": false, "name": "Equine Nutrition", "prerequisites": "Prerequisite:ANS 230 or ANS 225 or ANS (NTR,PO) 415 or PO/NTR 515", "spring": true, "number": "561", "fall": false, "units": " 3", "description": "This course explores concepts in equine nutrition including digestive physiology of horses, nutrient requirements for different classes of horses and feed management.  Ration evaluation and balancing, as well as problem solving will be a core component to this course."}, {"summer": false, "name": "Regulation of Metabolism", "prerequisites": "Prerequisite: BCH 451, GN 311, a course in physiology, cell biology", "spring": false, "number": "571", "fall": true, "units": " 3", "description": "Study of hormonal, enzymatic and molecular-genetic regulation of carbohydrate and lipid metabolism; emphasis on mammalian species."}, {"summer": false, "name": "Current Topics in Genomics and Proteomics in Animal Science", "prerequisites": "Prerequisite: ANS 215 or GN 411", "spring": true, "number": "575", "fall": false, "units": " 3", "description": "The objective of this course is to provide students with an integrated exposure to the major current concepts in genomics and proteomics.  Genomic and proteomic methods will be covered at a level that will allow students to read and comprehend articles dealing with animal genome research."}, {"summer": false, "name": "Topical Problems in Animal Science", "spring": true, "number": "590", "fall": true, "units": " 1-3", "description": "Selection or assignment of special problems in various phases of animal science."}, {"summer": false, "name": "Animal Science Seminar", "spring": true, "number": "601", "fall": true, "units": " 1"}, {"summer": false, "name": "Seminar In Biology Of Reproduction", "prerequisites": "Prerequisite: ANS(PHY) 702", "spring": true, "number": "602", "fall": false, "units": " 2", "description": "Current topics in animal reproduction presented by reproductive physiologists from various Research Triangle institutions. Student presentations of research projects or library projects in area of animal reproduction."}, {"summer": false, "name": "Reproductive Physiology Seminar", "spring": true, "number": "603", "fall": true, "units": " 1"}, {"summer": false, "name": "Animal Breeding and Genetics Seminar", "spring": true, "number": "604", "fall": true, "units": " 1"}, {"summer": false, "name": "Topical Problems in Animal Science", "spring": true, "number": "610", "fall": true, "units": " 1-6", "description": "Selection or assignment of special problems in various phases of animal science."}, {"summer": "True", "name": "Practicum in Animal Science", "spring": "True", "number": "641", "fall": "True", "units": " 1-3"}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "685", "fall": true, "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "688", "fall": true, "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "689", "fall": true, "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": true, "name": "Master's Exam", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "690", "fall": true, "units": " 1-6", "description": "For students in non-thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam."}, {"summer": true, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "693", "fall": true, "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": true, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "695", "fall": true, "units": " 1-9", "description": "Thesis research."}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "696", "fall": false, "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": true, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "699", "fall": true, "units": " 1-3", "description": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis."}, {"summer": false, "name": "Protein and Amino Acid Metabolism", "prerequisites": "Prerequisite: ANS/BCH 571 and ZO 421 and a 400-level nutrition course, such as NTR 400, 415, or 419, or equivalent type course numbers here.", "spring": true, "number": "701", "fall": false, "units": " 3", "description": "Study of protein and amino acid metabolism, regulation, dietary requirements and techniques for their investigation in human and other animals."}, {"summer": false, "name": "Reproductive Physiology of Mammals", "prerequisites": "Prerequisite: ZO 421", "spring": true, "number": "702", "fall": true, "units": " 3", "description": "Survey of reproductive strategies among vertebrates; in-depth coverage of mammalian reproductive physiology; gametogenesis, fertilization, embryonic and fetal development, parturition, puberty, neuroendrocrine control mechanisms in male and female mammals."}, {"summer": "True", "name": "Mammalian Embryo Manipulation", "prerequisites": "Prerequisite: ANS 702 or consent of instructor", "spring": "True", "number": "706", "fall": "True", "units": " 3", "description": "Mammalian embryo development and micromanipulation.  Topics in mammalian embryo manipulation to be considered include: blastocysts, embryo development in vitro, in vitro fertilization, in vitro oocyte maturation, molecular analysis of development, transgenesis by DNA microinjection or somatic cell nuclear transfer, and applications of gene transfer."}, {"summer": false, "name": "Genetics of Animal Improvement", "prerequisites": "Prerequisite: GN 311 and ST 512", "spring": true, "number": "708", "fall": false, "units": " 3", "description": "Emphasis on the utilization of basic principles of population and quantitative genetics in animal improvement. Factors affecting genic and genotypic frequencies and methods of estimating genetic and nongenetic variance, heritabilities and breeding values. The roles of mating systems and selection procedures in producing superior genetic populations."}, {"summer": "True", "name": "Energy Metabolism", "prerequisites": "Prerequisite: BCH 553", "spring": "True", "number": "709", "fall": "True", "units": " 3", "description": "Relationship of biochemical and physiological events within cell, tissue, organ and system with nutrient needs as sources of energy for productive animal life.  Digestion, absorption and metabolism of energy sources.  Processes of energy transformations within the body in relation to energetics, biological oxidation, anabolic and catabolic systems, metabolic control, partitioning and efficiency."}, {"summer": false, "name": "Quantitative Genetics and Breeding", "prerequisites": "Prerequisite: GN 509, ST 512", "spring": false, "number": "713", "fall": true, "units": " 3", "description": "Quantitative and population genetic theory of breeding problems; partitioning of genetic variance, maternal effects, genotype by environment interaction and genetic correlation; selection indexes; design and analysis of selection experiments; marker-assisted selection."}, {"summer": false, "name": "Advances in Gastrointestinal Pathophysiology", "prerequisites": "Prerequisite: PHY 503, PHY 504", "spring": false, "number": "764", "fall": true, "units": " 3", "description": "This course will focus on advanced gastrointestinal physiology and the pathophysiology of deseases of relevance to scientsts involved in animal-related research.  In particular, the course will cover the pathophysiology of ulceration, infectious diarrhea, ischemia, motility disorders, and inflammatory diseases of the gut.  An in-depth review paper will be required based on recent literature rgarding a specific gastrointestinal disease."}, {"summer": false, "name": "Mineral Metabolism", "prerequisites": "Prerequisite: ANS(NTR,PO) 415, BCH 451 and ZO 421", "spring": false, "number": "775", "fall": true, "units": " 3", "description": "Requirements, function, distribution, absorption, excretion and toxicity of minerals in humans and domestic animals. Interactions between minerals and other factors affecting mineral metabolism or availability. Emphasis on mechanisms associated withmineral functions and the metabolic bases for the development of signs of deficiency."}, {"summer": "True", "name": "Mammalian Endocrinology", "prerequisites": "Prerequisite: BCH 451, ZO 421", "spring": "True", "number": "780", "fall": "True", "units": " 3", "description": "Mammalian endocrine system with emphasis on ontogeny and anatomy of key organs; synthesis and action of hormones. Role of hormones in regulation of physiological processes such as metabolism, exocrine function, digestion, ion balance, behavior, lactation, growth and reproduction."}, {"summer": false, "name": "Digestion and Metabolism in Ruminants", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "785", "fall": false, "units": " 3", "description": "Advanced concepts in ruminant digestion and metabolism, with emphasis on bovine, ovine, and caprine species.  Major topics include voluntary intake, ruminal fermentation, mechanisms and rates of digestion, absorption and passage of dietary components, and postabsorptive metabolism of carbohydrates, lipds, and proteins.  New developments in feeding systems, feed additives and the prevention and treatment of metabolic disorders."}, {"summer": false, "name": "Advanced Special Topics in Animal Science", "spring": true, "number": "790", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Animal Science Seminar", "spring": true, "number": "801", "fall": true, "units": " 1"}, {"summer": false, "name": "Seminar In Biology Of Reproduction", "prerequisites": "Prerequisite: ANS(PHY) 702", "spring": true, "number": "802", "fall": false, "units": " 2", "description": "Current topics in animal reproduction presented by reproductive physiologists from various Research Triangle institutions. Student presentations of research projects or library projects in area of animal reproduction."}, {"summer": false, "name": "Reproductive Physiology Seminar", "spring": true, "number": "803", "fall": true, "units": " 1"}, {"summer": false, "name": "Animal Breeding and Genetics Seminar", "spring": true, "number": "804", "fall": true, "units": " 1"}, {"summer": false, "name": "Topical Problems in Animal Science", "spring": true, "number": "810", "fall": true, "units": " 1-6", "description": "Selection or assignment of special problems in various phases of animal science."}, {"summer": "True", "name": "Practicum in Animal Science", "spring": "True", "number": "841", "fall": "True", "units": " 1-3"}, {"summer": true, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "885", "fall": true, "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment"}, {"summer": true, "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "890", "fall": true, "units": " 1-9", "description": "For students who are preparing for and taking written and/or oral preliminary exams."}, {"summer": true, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "893", "fall": true, "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": true, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "895", "fall": true, "units": " 1-9", "description": "Dissertation research"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "896", "fall": false, "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": true, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "899", "fall": true, "units": " 1-3", "description": "For students who have completed all credit hours, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations."}]