[{"summer": "True", "name": "Experiencing Architecture", "spring": "True", "number": "140", "fall": "True", "units": " Performing Arts", "description": "Contemporary and historic houses, public buildings and cities illustrate the practical and aesthetic aspects of architecture. The basic elements of architectural form, design process, and architectural criticism."}, {"summer": "True", "name": "An Introduction to Architecture", "prerequisites": "Prerequisite: D 104 and BED-A students; Corequisite: D 105", "spring": "True", "number": "162", "fall": "True", "units": " 3", "description": "The purpose of architecture examined through its practices, theories and key principles.  Lectures, projects, and readings expose students to the diverse world of ideas, creative work and practical considerations which make up the discipline of architecture."}, {"summer": "True", "name": "Architectural Design: Environment", "prerequisites": "Prerequisite: D 105; BED-A students only; Corequisite: ARC 211", "spring": "True", "number": "201", "fall": "True", "units": " 6", "description": "Investigation of the relationships between environment and built form. Solar orientation, topography, vegetation, and constructed context in relationship to user needs as parameters for justifying design proposals.  Particular emphasis on architectural conventions of communication."}, {"summer": "True", "name": "Architectural Design: Form", "prerequisites": "Prerequisite: ARC 201 and BED-A students", "spring": "True", "number": "202", "fall": "True", "units": " 6", "description": "Investigation of relationships between idea and form. Composition and precedent as parameters for generating, developing, and justifying architectural form.  Particular emphasis on electronic media in drawing and modeling."}, {"summer": "True", "name": "Natural Systems and Architecture", "prerequisites": "Prerequisite: D 105", "spring": "True", "number": "211", "fall": "True", "units": " 3", "description": "Restricted to students in BEDA Program.  Relationship between natural and architectural systems.  Exploration of the implications of natural forces - sun, wind and daylight- on architecture.  Energy-conscious architectural design and site planning strategies to fulfill thermal comfort requirements of people in designed environments."}, {"summer": "True", "name": "Structures and Materials", "spring": "True", "number": "232", "fall": "True", "units": " 3", "description": "Construction materials related to structural applications. Theory of structures and introduction to quantitative analysis. Implications for design. Historical examples and current practices. Laboratory and field trips required."}, {"summer": "True", "name": "Introduction to World Architecture", "spring": "True", "number": "241", "fall": "True", "units": " Performing Arts", "description": "History of the built environment (buildings, urban planning, and associated arts) in western and non-western cultures, ranging from dawn of civilization to dawn of modern era, including high-style architecture, vernacular buildings, and traditional forms."}, {"summer": "True", "name": "History of Western Architecture", "prerequisites": "Prerequisite: ARC 241, ARC 242", "spring": "True", "number": "242", "fall": "True", "units": " 3", "description": "History of western architecture (including some landscape architecture and city planning) from the beginnings of the Renaissance in early 15th century to late 19th century in the United States."}, {"summer": "True", "name": "Digital Representation", "prerequisites": "Prerequisite: BED-A students or Master of Arch, Track 3 students", "spring": "True", "number": "251", "fall": "True", "units": " 3", "description": "Project based methodological investigation of digital representation in architecture including: two- three- and four-dimensional media.  Purchase of laptop and necessary software required."}, {"summer": "True", "name": "Architectural Travel Study I", "prerequisites": "Prerequisite: ARC 141 and ARC 142", "spring": "True", "number": "289", "fall": "True", "units": " 3", "description": "The study of cities, architectural sites, buildings, building complexes, and architectural elements conducted independently by students as part of a planned travel-study tour.  Includes advance research and approval of proposed study topic and itinerary.  Students will document study through sketches, analytical notations, and a summary paper.   Departmental Approval Required"}, {"summer": "True", "name": "Special Topics in Architecture", "spring": "True", "number": "292", "fall": "True", "units": " 1-3", "description": "Topics of current interest in Architecture.  Normally used to develop new courses."}, {"summer": "True", "name": "Architectural Design: Intermediate", "prerequisites": "Prerequisite: ARC 202 and Jr standing in BED-A", "spring": "True", "number": "301", "fall": "True", "units": " 6", "description": "Studies in architectural design.  Projects of many types and scales are employed to investigate issues in architecture.  Emphasis is on independent exploration of design values and their implications."}, {"summer": "True", "name": "Architectural Design: Technology", "prerequisites": "Prerequisite: ARC 301, ARC 331, ARC 432; BED-A students; Co-requisite ARC 332", "spring": "True", "number": "302", "fall": "True", "units": " 6", "description": "An investigation of technical systems of building - structure, environmental control/energy, materials, enclosure, and circulation, their fabrication and assembly and their capacity to affect form and tectonic structure- as fundamental elements of the design process.  Particular emphasis on physical models."}, {"summer": "True", "name": "Architectural Structures I", "prerequisites": "Prerequisite: ARC 232", "spring": "True", "number": "331", "fall": "True", "units": " 3", "description": "Structural design process. Combined role of imposed loads and architectural function in shaping the form of the  building. Interaction of elements in structural systems containing beams, columns, trusses,  space frames, slabs, arches, vaults, domes,cables, cable networks, fabrics and diaphrams.  Case studies emphasized."}, {"summer": "True", "name": "Architectural Structures II", "prerequisites": "Prerequisite: ARC 331", "spring": "True", "number": "332", "fall": "True", "units": " 3", "description": "Structural systems  explored through case studies and design projects. Emphasis on interaction of structural elements. Tracing of loads in structural systems. Sizing of tensile elements, columns, trusses, and flexural elements. Design and sizing of joints."}, {"summer": "True", "name": "Architectural Design: Urban", "prerequisites": "Prerequisite: ARC 302 and BED-A student", "spring": "True", "number": "401", "fall": "True", "units": " 6", "description": "An architectural design studio intended to explore and integrate design issues of all types within an urban environment.  Emphasis will be placed on both formal and technical issues of urban sites including transportation and land use planning, phasing of projects over time, relationships to other structures, and the application of development codes, regulations, and urban design principles to the fabric of the city."}, {"summer": "True", "name": "Architectural Design: Advanced", "prerequisites": "Prerequisite: ARC 401 and BED-A students", "spring": "True", "number": "402", "fall": "True", "units": " 6", "description": "Advanced architectural design studios in which projects of many types and scales are employed to investigate a range of educational, theoretical and professional studies.  Particular emphasis on independent research and exploration of design issues and their implications as defined by faculty."}, {"summer": "True", "name": "Architectural Design Fundamentals: Environment", "prerequisites": "Prerequisite: Masters of Architecture students; Co-requisite: ARC 211", "spring": "True", "number": "403", "fall": "True", "units": " 6", "description": "An introductory architectural design studio for M. Arch, Track 3 students investigating the relationship between environment and built form.  Solar orientation, climate, topography, vegetation, and constructed context in relationship to user needs as parameters for design proposals.  Particular emphasis on design fundamentals and conventions of architectural communication."}, {"summer": "True", "name": "Architectural Design Fundamentals: Form", "prerequisites": "Prerequisite: Masters of Architecture Track 3 students; ARC 403; Co-requisite: ARC 251", "spring": "True", "number": "404", "fall": "True", "units": " 6", "description": "An introductory architectural design studio for M. Arch. Track 3 students investigating relationships between idea and form.  Composition and precedent as parameters for generating, developing, and justifying architectural form.  Particular emphasison electronic media in drawing and modeling."}, {"summer": "True", "name": "Architectural Design Fundamentals: Technology", "prerequisites": "Prerequisite: Master of Architecture students; ARC 404; Co-requisite: ARC 331 and ARC 432", "spring": "True", "number": "405", "fall": "True", "units": " 6", "description": "An introductory architectural design studio for M. Arch. Track 3 students in which the technical systems of building - structure, environmental control/energy, materials, enclosure, and circulation; their fabrication and assembly; and their capacityto affect form and tectonic expression - are explored as fundamental elements of the design process.  Particular emphasis on physical models."}, {"summer": "True", "name": "Environmental Control Systems", "prerequisites": "Prerequisite: ARC 211", "spring": "True", "number": "414", "fall": "True", "units": " 3", "description": "Studies in light, heat, moisture, air motion, and sound in architectural environments.  Mechanical, electrical and/or electronic equipment for illumination, heating, cooling, ventilation, vertical transportation and communication in buildings.  Water and waste, fire protection and safety, and acoustic systems in architecture."}, {"summer": "True", "name": "Architectural Construction Systems", "prerequisites": "Prerequisite: ARC 232", "spring": "True", "number": "432", "fall": "True", "units": " 3", "description": "Building construction systems related to architectural design. Historical and  current building practices. Implications for design and systems selection. Case studies.  Field trips are required.\t\t\t\t"}, {"summer": "True", "name": "History of Contemporary Architecture", "prerequisites": "Prerequisite: ARC 241, ARC 242; BED-A students, Bachelor of Architecture students,  or Masters of Architecture students", "spring": "True", "number": "441", "fall": "True", "units": " 3", "description": "A survey and critical examination of modern architecture from its origins in 19th-century philosophy and technology to the most recent developments in world architecture.\t"}, {"summer": "True", "name": "History of NC Architecture", "prerequisites": "Prerequisite: ARC 241, ARC 242", "spring": "True", "number": "442", "fall": "True", "units": " 3", "description": "Survey of NC Architecture from 17th-century settlement to World War II. Coverage of a wide range of building types and development patterns."}, {"summer": "True", "name": "Architectural Drawing", "prerequisites": "Prerequisite: Master of Architecture Track 3 student", "spring": "True", "number": "450", "fall": "True", "units": " 3", "description": "Introduction to freehand and constructed drawing including planimetric drawing and three-dimensional techniques of axonometric, isometric, and perspective. Freehand on-site drawing in various media and the art of the design sketch. Basics of visual composition and diagramming."}, {"summer": "True", "name": "Architecture International Studio", "prerequisites": "Prerequisite: ARC 302, Participation in off-campus program.", "spring": "True", "number": "490", "fall": "True", "units": " 6", "description": "Exploration of architectural problems and development of design solutions in an international setting.  Studio projects focused on current conditions found in the host culture, profession, and community."}, {"summer": "True", "name": "Special Topics in Architecture", "spring": "True", "number": "492", "fall": "True", "units": " 1-3", "description": "Topics of current interest in Architecture.  Normally used to develop new courses."}, {"summer": "True", "name": "Independent Study in Architecture", "prerequisites": "Prerequisite: BED-A students with Junior standing and a GPA greater than or equal to 3.0.", "spring": "True", "number": "495", "fall": "True", "units": " 1-3", "description": "Special projects in architecture developed under the direction of a faculty member on a tutorial basis."}, {"summer": "True", "name": "Architectural Design: Professional Studio", "prerequisites": "Prerequisite: M.Arch Track 1 and Track 3 student, ARC 405 or BEDA Degree (or equivalent)", "spring": "True", "number": "500", "fall": "True", "units": " 6", "description": "A comprehensive and integrative architectural design studio for M.Arch students involving the execution of a project in sufficient depth to understand the opportunities and discipline resulting from the inclusion of building."}, {"summer": "True", "name": "Professional Architecture Studio I", "prerequisites": "Prerequisite: BEDA degree", "spring": "True", "number": "501", "fall": "True", "units": " 6", "description": "Design studio investigations aimed at the development of an understanding of the major issues confronting the contemporary architect and at the expanding of problem solving abilities in architectural design."}, {"summer": "True", "name": "Professional Architecture Studio II", "prerequisites": "Prerequisite: ARC 501", "spring": "True", "number": "502", "fall": "True", "units": " 6", "description": "Design investigation aimed at the development of an understanding of the major issues confronting the contemporary architect and at the expanding of problem solving abilities in architectural design.  This is an individualized, final project studio."}, {"summer": "True", "name": "Advanced Architectural Design (Series)", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "503", "fall": "True", "units": " 6", "description": "Advanced studies in architectural design. Projects concerning various aspects of building design, urban design and community design in comprehensive and integrative manner."}, {"summer": "True", "name": "Tectonics and Craft", "prerequisites": "Prerequisite: Architecture Majors, ARC 432", "spring": "True", "number": "530", "fall": "True", "units": " 3", "description": "Studies of construction and material form in architecture. Case studies of select examples of contemporary architecture that exemplify the technique and craft of modern construction. Analysis of functional, tectonic, and experiential aspects of building methods within the context of economics and culture. Examination of assembly as a determinant of building form."}, {"summer": "True", "name": "Design of Architectural Details", "spring": "True", "number": "534", "fall": "True", "units": " 3", "description": "Using detail patterns based on function, constructability, and aesthetics, students analyze existing successful building details, diagnose problems in existing buildings, and design details for their own projects.  Restricted to Bachelors and Masters students in Architecture."}, {"summer": "True", "name": "Experiments in Architecture Prototypes", "prerequisites": "Prerequisite:ARC 232 or equivalent", "spring": "True", "number": "535", "fall": "True", "units": " 3", "description": "Examination of significant architecture prototypes of the Modern Movement.  Seminar will investigate the effectiveness of prototypes in proposing solutions to technological, social, and environmental issues such as housing, education, and sustainability.  Students will explore the possibilities of prototype design and construction in contemporary practice.  Field trips required."}, {"summer": "True", "name": "Architectural Theory", "spring": "True", "number": "540", "fall": "True", "units": " 3", "description": "This course provides an introduction to the major themes and associated figures of architectural theory.  It focuses on 20th and 21st century texts with a particular emphasis on historicism, phenomenology, structuralism and post-structuralism.  Each week there is assigned reading from a range of texts, including extra-disciplinary writers. Lectures and discussions serve to identify principal themes, connect to contemporary issues, and establish relevancy to architectural design.  Restricted to M. Arch, B. Arch, and BEDA Seniors. Non-architecture majors by instructor's permission."}, {"summer": "True", "name": "Architecture, Culture, and Meaning", "spring": "True", "number": "541", "fall": "True", "units": " 3", "description": "This course focuses on architecture as a cultural artifact and provides an overview of the interrelationship of architectural form, organization, symbolism, use and meaning. A broad range of examples from a variety of cultures, religions, and historical periods are covered (including \"non-Western\"), illustrated by detailed case studies. Syncretic, holistic and homological approaches to understanding the meaning and significance of architecture are emphasized. Phenomenological and hermeneutical methods of interpretation are introduced and pertinent philosophical traditions discussed. Restricted to M.Arch., B.Arch., and BEDA seniors. Non-architecture majors by instructor's permission."}, {"summer": "True", "name": "Sacred Architecture", "spring": "True", "number": "542", "fall": "True", "units": " 3", "description": "This course focuses on the meaning and cultural significance of sacred architecture, including its environmental and socio-political contexts, and doctrinal and liturgical influences. The course is structured according to the world's principal faiths and presented comparatively and holistically.  There is a particular emphasis on the communicative roles of architecture and the symbolism and ritual use of sacred places. Contemporary theoretical methodologies are introduced and applied as means establish relevancy to contemporary issues and architectural design. Restricted to graduate students."}, {"summer": "True", "name": "Analysis of Precedent", "prerequisites": "Prerequisite: Grad. standing", "spring": "True", "number": "543", "fall": "True", "units": " 3", "description": "Investigation of architectural elements, relationships and ordering ideas through comparative graphic analysis of buildings designed by architects. Emphasis on buildings as physical artifacts."}, {"summer": "True", "name": "Theory of Building Types", "prerequisites": "Prerequisite: Two ARC studios", "spring": "True", "number": "546", "fall": "True", "units": " 3", "description": "Theoretical implications and practical applications of typology in architecture. Analysis and documentation of selected building types in their historical evolution. Graphic identification of type characteristics."}, {"summer": "True", "name": "Vernacular Architecture", "prerequisites": "Prerequisite: M.Arch student without an undergraduate degree in architecture must have completed ARC 211,ARC 241,ARC 232", "spring": "True", "number": "548", "fall": "True", "units": " 3", "description": "Readings in theories of vernacular architecture.  Case studies of selected examples of vernacular architecture of the world: architectural analysis of utilitarian, tectonic, and perceptual aspects of buildings and urban fabrics against the background of place and culture.  Examination of influences of various vernacular traditions on contemporary practice."}, {"summer": "True", "name": "The Practice of Architecture", "spring": "True", "number": "561", "fall": "True", "units": " 3", "description": "A lecture course examination of the practice of architecture through a lecture course, with emphasis upon both normative and emerging procedures in the private architectural firm. Special attention upon the role and function of the practicing architect, legal and regulatory conditions, the nature of professional services, office management and project management processes."}, {"summer": "True", "name": "Legal Issues in Architecture", "prerequisites": "Prerequisite: Architecture Majors, ARC 561", "spring": "True", "number": "562", "fall": "True", "units": " 3", "description": "The main principles of law affecting the profession of architecture as it is influenced by contracts, torts, agency, property, and environmental restrictions."}, {"summer": "True", "name": "Anatomy of the City", "spring": "True", "number": "570", "fall": "True", "units": " 3", "description": "A morphological investigation of cities throughout urban history, with emphasis on formal principles of spatial organization. Part one: examination of the descriptive properties of cities in terms of interdisciplinary concepts and principles. Part two: examination of the organizational characteristics of urban space."}, {"summer": "True", "name": "Urban House", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "571", "fall": "True", "units": " 3", "description": "This seminar is intended to investigate the interrelationships between the form of housing and the demands of a rapidly changing society.    Reference is made to the physical, economic, social, cultural,  and economic factors that influence housing design."}, {"summer": "True", "name": "Place and Place Making", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "574", "fall": "True", "units": " 3", "description": "Examination of the definitions, concepts and emergent research findings useful in explaining the human sense of place through seminar-lecture course. Particular emphasis upon those physical aspects and relationships influencing this sense of place and affording some designer control."}, {"summer": "True", "name": "Community Design", "spring": "True", "number": "576", "fall": "True", "units": " 3", "description": "Processes through which citizens shape and manage built environment.  Strategic planning, visioning process, community action, and mediation will be discussed and illustrated with case study examples from architecture, landscape architecture and planning.  Analysis and assessment from case studies of participation techniques such as charrette, study circles, and visual appraisal."}, {"summer": "True", "name": "Sustainable Communities", "spring": "True", "number": "577", "fall": "True", "units": " 3", "description": "Historical precedents of sustainable communities.  Examination of the Garden City, the New Towns Movement, and the New Urbanism.  Comparison of sustainable communities to urban visions of Wright, Corbusier, Soleri and others.  Virtual cities and digital communities."}, {"summer": "True", "name": "Project Preparation Seminar", "spring": "True", "number": "581", "fall": "True", "units": " 3", "description": "Quantitative and qualitative conditions, considerations and determinants as preparation for architectural design. Emphasis on research methods, data collection and interpretation, theoretical discourse, site analysis, programming and architectural precedent. Required enrollment in B.Arch."}, {"summer": "True", "name": "Architectural Travel Study II", "spring": "True", "number": "589", "fall": "True", "units": " 3", "description": "Independent study while traveling. Submission of sketchbook/journal and paper upon return. Research on topic of concentration and approval of itinerary in advance required. Graphic documentation and critical evaluation of buildings and urban spaces.Required of all participants in Dept. of Architecture Foreign Exchange and Summer Abroad Programs. Restricted to departmental approval."}, {"summer": "True", "name": "Special Topics in Architecture", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "590", "fall": "True", "units": " 1-3", "description": "Topics of current interest by faculty in the Department of Architecture.  Subjects under this number normally to test and develop new courses."}, {"summer": "True", "name": "Final Project Studio In Architecture", "prerequisites": "Prerequisite: 18 hrs. of ARC 503 and ARC 697", "spring": "True", "number": "598", "fall": "True", "units": " 6", "description": "Final project for graduate students supervised by members of their graduate advisory committee. Requires department approval."}, {"summer": "True", "name": "Independent Study", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "630", "fall": "True", "units": " 1-6", "description": "Development of research and projects in various aspects of architecture under the direction of architecture faculty member on tutorial basis. Requires a faculty sponsor and departmental approval."}, {"summer": "True", "name": "Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "685", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "688", "fall": "True", "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": "True", "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "689", "fall": "True", "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": "True", "name": "Summer Thesis Res", "spring": "True", "number": "696", "fall": "True", "units": " 1"}, {"summer": "True", "name": "Final Project Research in Architecture", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "697", "fall": "True", "units": " 1-6", "description": "Investigation of selected problems and projects in architecture of particular interest to graduate students under the direction of a faculty member on a tutorial basis. Credits and content vary to meet the scope of the project proposal."}, {"summer": "True", "name": "Summer Dissert Res", "spring": "True", "number": "896", "fall": "True", "units": " 1"}]