[{"summer": "True", "name": "Introduction to Drug Development and Careers in Biomanufacturing", "prerequisites": "Prerequisite: BIO 183 and Corequisite of CH 221", "spring": "True", "number": "220", "fall": "True", "units": " 1", "description": "Introduction to discovery and development of biopharmaceuticals, industrial enzymes, food ingredients and biologics.  Discussion of majors that prepare students for positions in the biotechnology industry.  Lectures from staff and from professionalsin the biotechnology industry focus on drug development, biopharmaceutical process development, design of biomanufacturing facilities, overview of methods used for manufacturing biopharmaceuticals, drug and enzyme purification, formulation, as well as careers in FDA compliance documentation related to manufacturing products using microbial biotechnology."}, {"summer": "True", "name": "Principles and Applications of Bioseparations", "prerequisites": "Prerequisite: CH 223", "spring": "True", "number": "330", "fall": "True", "units": " 2", "description": "Objectives, strategies, and approaches for recovery and purification of biomolecules, especially recombinant proteins.  Description of common purification equipment, processes and materials used for cell lysis, precipitation, flocculation, membrane filtration, column chromatography, and centrifugation.  Laboratories provide students with exposure to various techniques and the parameters that control protein isolation and purification of a recombinant protein.  This is a half-semester course.  Students who have completed BIT(CHE) 464 may not complete this course for credit."}, {"summer": "True", "name": "Foundations of Recombinant Microorganisms for Biomanufacturing", "prerequisites": "Prerequisite: BIO 183", "spring": "True", "number": "363", "fall": "True", "units": " 2", "description": "Introduction to basic biomanufacturing techniques with particular focus on the most commonly used recombinant microbes in industry.  Includes microbial identification, metabolism, and growth kinetics; recombinant production and analysis of low molecular weight molecules, alcohols, recombinant enzymes and others.  The laboratory portion of this half-semester course provides students with practical experience on basic biomanufacturing techniques carried out in small scale"}, {"summer": "True", "name": "Introduction to Downstream Process Development", "prerequisites": "Prerequisite: BEC 330 or graduate standing", "spring": "True", "number": "436", "fall": "True", "units": " 2", "description": "Objectives, strategies, and approaches for recovery and purification of biomolecules, especially recombinant proteins.  Laboratories in the intermediate-scale pilot plant provide students with exposure to various unit operations and the parameters that control protein isolation and purification of a recombinant protein produced by an E. coli.  This is a half-semester course.  Students who have completed BEC 436 may not take BEC 536 for credit."}, {"summer": "True", "name": "Expression Systems in Biomanufacturing", "prerequisites": "Prerequisite: BEC(MB) 320 or MB 351/352", "spring": "True", "number": "440", "fall": "True", "units": " 3", "description": "Introduction to various expression systems, their advantages and disadvantages.  Basic techniques in DNA cloning, cell transformation and optimization of protein expression.  Selection, archiving and characterization of production line.  Media development and parameters affecting expression and yield.  The lab portion of the course provides students with practical experience in DNA cloning and protein expression techniques in diverse expression systems."}, {"summer": "True", "name": "Insect Cells Protein Expression", "prerequisites": "Prerequisite: BEC(MB) 320 or BIT410/510", "spring": "True", "number": "442", "fall": "True", "units": " 2", "description": "Introduction to the insect cells expression system, and its advantages and disadvantages. Introduction to expression of recombinant proteins with baculovirus. Outline of antibody and antibody fragments as well as other complex proteins. Basic techniques used for growth and maintenance of insect cell cultures. The lab portion of the course provides students with practical experience in protein expression techniques in the insect cells expression system. This is a half-semester course. Students who have completed BEC 442 may not take BEC 542 for credit."}, {"summer": "True", "name": "Fundamentals of Bio-Nanotechnology", "prerequisites": "Prerequisite: MA 241, PY 208, CH 223", "spring": "True", "number": "462", "fall": "True", "units": " 3", "description": "Concepts of nanotechnology are applied in the synthesis, characterization, recognition and application of biomaterials on the nanoscale.  Emphasis will be given to hands-on experience with nanostructured biomaterials; students will also be familiarized with the potential impact of these materials on different aspects of society and potential hazards associated with their preparation and application."}, {"summer": "True", "name": "Fermentation of Recombinant Microorganisms", "prerequisites": "Prerequisite: CH 223 and Corequisite: (BEC 320 or BIT 410 or BCH 452 or MB 352)", "spring": "True", "number": "463", "fall": "True", "units": " 2", "description": "Introduction to fermentation and protein chemistry.  Theory behind laboratory techniques and overview of industrial scale expression systems.  Laboratory sessions involve use of microbial expression vectors, fermentation systems, and large-scale purification of recombinant protein.  Half semester course, first part."}, {"summer": false, "name": "Global Regulatory Affairs for Medical Products", "prerequisites": "Prerequisite: Senior standing", "spring": true, "number": "475", "fall": true, "units": " 3", "description": "This lecture-based course introduces students to the quality systems used to meet the regulatory requirements for developing, testing, manufacturing, and selling medical products in the global marketplace. It provides a general background for those going into the medical products field, but is especially useful to students preparing for a career in the Regulatory Affairs or Quality Assurance Department within a pharmaceutical, biomanufacturing, or medical device company. BEC 575 students must have graduate standing."}, {"summer": "True", "name": "cGMP Fermentation Operations", "prerequisites": "Corequisite: BBS/BEC 426", "spring": "True", "number": "480", "fall": "True", "units": " 2", "description": "Application of microbial fermentation techniques at production scale and evaluation of the inherent issues resulting from the integration of microbial fermentation unit operations, scale-up/production, and current Good Manufacturing (cGMP) compliance.  Lectures prepare students for pilot-scale laboratory experiences in media preparation, bioreactor operation, process utilities, and manufacturing quality systems that simulate microbial cell growth and product expression in a commercial cGMP facility.  This is a half-semester course. Students who have completed BEC 480 may not take BEC 580 for credit."}, {"summer": "True", "name": "Tissue Engineering Technologies", "prerequisites": "Prerequisite: BIT 466 or permission of instructor", "spring": "True", "number": "483", "fall": "True", "units": " 2", "description": "In this half-semester laboratory module, students will gain practical experience with two key elements of tissue engineering: tissue building and angiogenesis.  Using advanced culture techniques, students will construct a complex living tissue that closely resembles its natural counterpart, then assess its ability to support ingrowth of capillaries (angiogenesis). The effects of different biomaterials and angiogenic factors will be evaluated.  The engineered tissue will be embedded, sectioned and stained for histological analysis."}, {"summer": "True", "name": "cGMP Downstream Operations", "prerequisites": "Corequisite: BEC 436", "spring": "True", "number": "485", "fall": "True", "units": " 2", "description": "Application of downstream bioprocessing techniques at production scale and evaluation of the inherent issues resulting from the integration of recovery and purification unit operations, scale-up/production issues, and current Good Manufacturing Practice (cGMP) compliance. Lectures prepare students for pilot-scale laboratory experiences in cell removal, cell disruption, purification, and manufacturing quality systems that simulate downstream bioprocessing in a commercial cGMP facility.  This is a half-semester course. Students who have completed BEC 485 may not take BEC 585 for credit."}, {"summer": "True", "name": "Animal Cell Culture Engineering", "prerequisites": "Prerequisite: (CHE 447 or BEC 463 or BEC 420 or BIT 466)", "spring": "True", "number": "488", "fall": "True", "units": " 2", "description": "Design and operation of animal cell culture bioreactors for therapeutic protein production. Topics include: batch, fed-batch and perfusion bioreactors. agitation and aeration for mixing and oxygen mass transfer, bioreactor monitoring and control, optimizing bioreactor performance, and single-use (disposal) bioreactors. This is a half-semester course."}, {"summer": "True", "name": "Special Topics in Biomanufacturing", "spring": "True", "number": "495", "fall": "True", "units": " 1-4", "description": "Offered as needed to present materials not normally available in regular course offerings or for offering of new courses on a trial basis.  Departmental approval required."}, {"summer": "True", "name": "Biomanufacturing Research Projects", "spring": "True", "number": "497", "fall": "True", "units": " 1-3", "description": "Introduction to biomanufacturing research through experimental, theoretical, and literature studies.  Oral and written presentation of reports.  Departmental approval required."}, {"summer": "True", "name": "Biological Processing Science", "prerequisites": "Prerequisite: BCH 451 or graduate standing", "spring": "True", "number": "532", "fall": "True", "units": " 2", "description": "Fundamental scientific principles underlying the recovery, purification and formulation of biologics (biotherapuetics), especially proteins, are examined. Emphasis is placed on delineating the key chemical and physical properties of biomolecules that impact processing and formulation development. Laboratories in the analytical and small-scale purification facility provide students with 'hands-on' exposure to key scientific principles and small scale unit operations. This is a half-semester course."}, {"summer": "True", "name": "Introduction to Downstream Process Development", "spring": "True", "number": "536", "fall": "True", "units": " 2", "description": "Objectives, strategies, and approaches for recovery and purification of biomolecules, especially recombinant proteins.  Laboratories in the intermediate-scale pilot plant provide students with exposure to various unit operations and the parameters that control protein isolation and purification of a recombinant protein produced by an E. coli.  This is a half-semester course.  Students who have completed BEC 436 may not take BEC 536 for credit."}, {"summer": "True", "name": "Insect Cells Protein Expression", "prerequisites": "Prerequisite: BEC(MB) 320 or BIT410/510", "spring": "True", "number": "542", "fall": "True", "units": " 2", "description": "Introduction to the insect cells expression system, and its advantages and disadvantages. Introduction to expression of recombinant proteins with baculovirus. Outline of antibody and antibody fragments as well as other complex proteins. Basic techniques used for growth and maintenance of insect cell cultures. The lab portion of the course provides students with practical experience in protein expression techniques in the insect cells expression system. This is a half-semester course. Students who have completed BEC 442 may not take BEC 542 for credit."}, {"summer": "True", "name": "Fundamentals of Bio-Nanotechnology", "prerequisites": "Prerequisite: MA 241, PY 208, CH 223", "spring": "True", "number": "562", "fall": "True", "units": " 3", "description": "Concepts of nanotechnology are applied in the synthesis, characterization, recognition and application of biomaterials on the nanoscale.  Emphasis will be given to hands-on experience with nanostructured biomaterials; students will also be familiarized with the potential impact of these materials on different aspects of society and potential hazards associated with their preparation and application."}, {"summer": false, "name": "Global Regulatory Affairs for Medical Products", "spring": true, "number": "575", "fall": true, "units": " 3", "description": "This lecture-based course introduces students to the quality systems used to meet the regulatory requirements for developing, testing, manufacturing, and selling medical products in the global marketplace. It provides a general background for those going into the medical products field, but is especially useful to students preparing for a career in the Regulatory Affairs or Quality Assurance Department within a pharmaceutical, biomanufacturing, or medical device company. BEC 575 students must have graduate standing."}, {"summer": "True", "name": "Advanced Biomanufacturing and Biocatalysis", "prerequisites": "Graduate standing in engineering or life-science graduate program", "spring": "True", "number": "577", "fall": "True", "units": " 3", "description": "Overview of biomanufacturing using microorganisms (bacteria, yeast, fungi), eukaryotic cells (hybridomas, insect, plant, CHO) and recombinant enzymes focusing on methods used in industry.  Course will emphasize process design for optimization of heterologous protein expression, metabolic/cell line engineering, metabolomics, protein engineering to alter enzymes and antibodies.  Pathway engineering strategies include developing microbes to produce new therapeutic compounds or overproduce primary metabolites, antibiotics, biotherapeutics, therapeutic enzymes, diagnostics, recombinant vaccines, and biopharmaceuticals.  Utilization of immobilized biocatalysts, and microbial kinetics are covered."}, {"summer": "True", "name": "cGMP Fermentation Operations", "prerequisites": "Prerequisite: BBS(BEC) 426", "spring": "True", "number": "580", "fall": "True", "units": " 2", "description": "Application of microbial fermentation techniques at production scale and evaluation of the inherent issues resulting from the integration of microbial fermentation unit operations, scale-up/production, and current Good Manufacturing (cGMP) compliance.  Lectures prepare students for pilot-scale laboratory experiences in media preparation, bioreactor operation, process utilities, and manufacturing quality systems that simulate microbial cell growth and product expression in a commercial cGMP facility.  This is a half-semester course. Students who have completed BEC 480 may not take BEC 580 for credit."}, {"summer": "True", "name": "Tissue Engineering Technologies", "prerequisites": "Prerequisite: BIT 468", "spring": "True", "number": "583", "fall": "True", "units": " 2", "description": "In this half-semester laboratory module, students will gain practical experience with two key elements of tissue engineering: the construction of a complex living tissue that closely resembles its natural counterpart, and the assessment of the angiogenic potential of he engineered tissue.  The effects of different biomaterials and angiogenic factors will be evaluated."}, {"summer": "True", "name": "cGMP Downstream Operations", "prerequisites": "Prerequisite: BEC 436", "spring": "True", "number": "585", "fall": "True", "units": " 2", "description": "Application of downstream bioprocessing techniques at production scale and evaluation of the inherent issues resulting from the integration of recovery and purification unit operations, scale-up/production issues, and current Good Manufacturing Practice (cGMP) compliance. Lectures prepare students for pilot-scale laboratory experiences in cell removal, cell disruption, purification, and manufacturing quality systems that simulate downstream bioprocessing in a commercial cGMP facility.  This is a half-semester course. Students who have completed BEC 485 may not take BEC 585 for credit."}, {"summer": "True", "name": "Industry Practicum in Biomanufacturing", "spring": "True", "number": "590", "fall": "True", "units": " 3", "description": "Technical, operations, project management and regulatory compliance problems related to the design of a biomanufacturing process for cGMP manufacture of therapeutic antibodies, Fc-fusion proteins or antibody fragments to be used as human biotherapeutics.  The BTEC simulated cGMP manufacturing facility will be the basis for solving problems."}, {"summer": "True", "name": "Special Topics in Biomanufacturing", "spring": "True", "number": "595", "fall": "True", "units": " 1-4", "description": "Offered to present graduate course content not available in existing courses or for offering of new graduate courses on a trial basis.  Departmental approval required."}, {"summer": "True", "name": "Biomanufacturing Seminar", "spring": "True", "number": "601", "fall": "True", "units": " 1", "description": "Weekly seminars on topics of current interest in biomanufacturing and affiliated subjects. Seminars will be presented by resident faculty members, graduate students and visiting lectures from industry, government regulatory agencies such as the FDA or from academic programs related to biomanufacturing."}, {"summer": "True", "name": "Biomanufacturing Research Projects", "prerequisites": "Prerequisite: Graduate standing in engineering, biological science or physical science", "spring": "True", "number": "669", "fall": "True", "units": " 1-4", "description": "Introduction to biomanufacturing research through experimental, theoretical and literature studies under the mentorship of a member of the graduate faculty.  Oral and written presentation of reports.  Deptartmental approval required."}]