[{"summer": "True", "name": "Biology in the Modern World", "prerequisites": "Credit is not allowed for BIO 105 and BIO 181 or BIO 125.", "spring": "True", "number": "105", "fall": "True", "units": " 3", "description": "Principles and concepts of biology including cellular structure and function, metabolism and energy transformation, homeostasis, reproduction, heredity, diversity of life, ecology, evolution and animal behavior. Emphasis on human affairs and human examples.  For non-science students. Students may not receive credit for both BIO 105 and (BIO 115 or BIO 181 or BIO 183)."}, {"summer": "True", "name": "Biology in the Modern World Laboratory", "prerequisites": "Corequisite: BIO 105", "spring": "True", "number": "106", "fall": "True", "units": " 1", "description": "Laboratory experience in biological principles to complement BIO 105.  For non-science students.  Students may not receive credit for both BIO 106 and (BIO 116, BIO 181 or BIO 183)."}, {"summer": "True", "name": "Survey of Animal Diversity", "spring": "True", "number": "140", "fall": "True", "units": " 3", "description": "Classification and phylogeny of animals; patterns of diversification in body design and relationship between body design and the environment; study of selected animal assemblages. Students may not receive credit for both BIO 140 and BIO 350 or BIO 402 or BIO 403 or ZO 150."}, {"summer": "True", "name": "Animal Diversity Laboratory", "prerequisites": "Prerequisite: BIO 140", "spring": "True", "number": "141", "fall": "True", "units": " 1", "description": "Observation of living animals, dissections of preserved specimens, and microscopy; emphasis on classification of animals, patterns of diversification in body design, and relationship between body design and the environment. Students may not receive credit for both BIO 141 and BIO 350 or BIO 402 or BIO 403 or ZO 150."}, {"summer": "True", "name": "Introduction to Environmental Research", "spring": "True", "number": "165", "fall": "True", "units": " 5", "description": "Introduction to environmental research is a hands-on learning experience for incoming freshmen interested in pursuing scientific research.  The course introduces students to scientific methods and research through active participation in research on an environmental problem involving chemicals of environmental concern.  Students will explore a topic in this field through guided readings, field samplings, and lab experimentation.  Restricted to incoming freshmen who have been accepted into the HHMI RISE program"}, {"summer": "True", "name": "Introductory Biology: Ecology, Evolution, and Biodiversity", "prerequisites": "Credit is not allowed for BIO 181 and BIO 105 or BIO 125.", "spring": "True", "number": "181", "fall": "True", "units": " 4", "description": "Emphasis on interactions of organisms with their environments, evolutionary change and role of natural selection in the evolution of life forms, biological diversity in the context of form and function of organisms, and on critical thinking, problem solving, and effective communication. Cannot receive credit for both BIO 181 and (BIO 105 or BIO 106 or BIO 115 or BIO 116)."}, {"summer": "True", "name": "Introductory Biology: Cellular and Molecular Biology", "prerequisites": "Prerequisite: BIO 181 or CH 101", "spring": "True", "number": "183", "fall": "True", "units": " 4", "description": "Basic concepts and principles of molecular, cellular, and developmental biology.  Emphasis will be on the physical basis of life, the cell as the fundamental unit of life, the mechanisms involved in the development of multicellular organisms and on critical thinking, problem solving, experimental design, and effective communication. Cannot receive credit for both BIO 183 and (BIO 105 or BIO 106 or BIO 115 or BIO 116)."}, {"summer": "True", "name": "Basic Human Anatomy and Physiology", "prerequisites": "Prerequisite: C- or better in BIO 183", "spring": "True", "number": "212", "fall": "True", "units": " 4", "description": "Major emphasis on structure and function of the muscular, skeletal, circulatory and nervous systems of humans.  Credit in both BIO 212 and BIO 301 or BIO 302 is not allowed."}, {"summer": "True", "name": "Marine Biology", "prerequisites": "Prerequisite: MEA 200 or BIO 181", "spring": "True", "number": "220", "fall": "True", "units": " 3", "description": "Introduction to marine plants and animals, their adaptations to life in the sea and ecological interactions in selected marine environments (e.g. coral reefs, deep sea, salt marshes). Interactions of man with the sea: food from the seas, biology of diving. Optional trip."}, {"summer": "True", "name": "Understanding Structural Diversity through Biological Illustration", "spring": "True", "number": "227", "fall": "True", "units": " 3", "description": "Biological concepts of diversity and anatomy taught through direct observation and illustrative techniques.  Lecture topics include plant ID and structure, microscopic life forms, animal anatomy and identification.  Laboratory work emphasizes close observation of structures and comparative anatomy as well as illustrative techniques to produce accurate drawings of specimens.  Students will be required to provide their own transportation for one field trip."}, {"summer": "True", "name": "Human-Animal Interactions", "spring": "True", "number": "233", "fall": "True", "units": " 3", "description": "This course is designed to explore the relationship humans share with other animals and nature. We will study the early history of animal domestication and the influence of animals on human culture and religion. We will also explore our relationships to animals as pets, food, research subjects, and wildlife. All subjects will be covered through interaction with quest speaker, assigned readings, case studies, and class discussion."}, {"summer": "True", "name": "Animal Anatomy and Physiology", "prerequisites": "Prerequisite: C- or better in BIO 183", "spring": "True", "number": "250", "fall": "True", "units": " 4", "description": "Roles of physical laws, environmental challenges, and evolutionary history in shaping animal structure and function.  Selected examples from invertebrates and vertebrates.  Laboratory in anatomy and physiology, hypothesis generation and testing and data analysis and presentation."}, {"summer": "True", "name": "Research in the Life Sciences I: Research Skills", "prerequisites": "Prerequisite: C- or better in BIO 181 and Corequisite: BIO 183", "spring": "True", "number": "267", "fall": "True", "units": " 3", "description": "This course is designed to help first year students learn basic skills associated with scientific research.  Class structure is interactive and relies on group collaboration for most projects.  Students will become confident in reading and analyzing scientific literature, communicating scientific principles, compiling a poster presentation, presenting at scientific conferences, and attending local scientific symposia as well as practicing some basic laboratory techniques.  The 2-semester Research PackTrack Program (BIO 267 and 269) is designed to prepare undergraduates for an original research experience in a scientific laboratory. A B- or better in BIO 267 is required to take BIO 269.  Students in BIO 267 are required to attending one research symposium outside of regular class time."}, {"summer": "True", "name": "Research in the Life Sciences II: Guided Research", "prerequisites": "Prerequisite: C- or better in BIO 183 and B- or better in BIO 267", "spring": "True", "number": "269", "fall": "True", "units": " 3", "description": "This course is designed to provide students with a laboratory framework for conducting original research and (together with BIO 267) preparation to move on to conducting research in a scientific laboratory.  Students will explore the binding characteristics of bacterially-expressed estrogen receptor genes by generating their own research goals, writing research proposals, conducting original independent research, and presenting their findings in at least one poster symposium.  This course is the second part of the Research PackTrack program, and students in this course will have earned a B- or better in the first course (BIO 267)."}, {"summer": "True", "name": "Special Topics in Biology", "spring": "True", "number": "295", "fall": "True", "units": " 0-4", "description": "Experimental offerings in Biology."}, {"summer": "True", "name": "Emergency Medical Technician Basic", "prerequisites": "Prerequisite: PEH 281", "spring": "True", "number": "300", "fall": "True", "units": " 4", "description": "This course leads to eligibility for optional certification as an emergency medical technician basic with the state of North Carolina and the National Registry of Emergency Medical Technicians.  Topics include: roles and responsibilities; medical/legal considerations; respiratory/cardiac emergencies; CPR and airway adjuncts; bleeding and shock; trauma management; medical emergencies and their management; environmental emergencies; emergency childbirth; pediatrics; geriatrics; exposure to hazardous situations; introduction to hazardous materials; psychological emergencies; patient packaging and triage; stabilization and transport of the sick and injured; communications and report writing. Two Saturday classes are required.  Certification requires additional time, fees and internship liability insurance."}, {"summer": "True", "name": "Emergency Medical Technician Intermediate I", "prerequisites": "Prerequisite: PEH 300 and EMT Basic Certification", "spring": "True", "number": "301", "fall": "True", "units": " 4", "description": "This course, together with a second course in this series, leads to eligibility for optional certification as an Emergency Medical Technician Intermediate with the state of North Carolina and the National Registry of Emergency Medical Technicians.  Topics include: foundations of the EMT-Intermediate, overview of human systems, emergency pharmacology, venous access and medication administration, airway management and ventilation, history taking, techniques of physical examination, patient assessment in the field, clinical decision making, communications, documentation, trauma and trauma systems, blunt trauma, penetrating trauma, hemorrhage and shock, burns, thoracic trauma, abdominal trauma, and trauma management skills.  Two Saturday classes required.  Internship insurance required."}, {"summer": "True", "name": "General Parasitology", "prerequisites": "Prerequisite: C- or better in BIO 181 and BIO 183", "spring": "True", "number": "315", "fall": "True", "units": " 3", "description": "General principles of parasitic symbiosis.  Emphasis on life cycles, epidemiology, and pathology of major parasites of humans and domestic animals."}, {"summer": "True", "name": "Primate Ecology and Evolution", "prerequisites": " BIO 183, and one of the following courses: ANT 251, BIO 212, BIO 250, BIO/PB 330, BIO 350, BIO/PB 360, BIO 410 , BIO 422, BIO 424, or BIO 488", "spring": "True", "number": "317", "fall": "True", "units": " 3", "description": "A comprehensive survey of the behavior, evolution, and ecology of nonhuman primates. Special emphasis will be placed in the evolution of cognitive abilities, social systems, and behavioral patterns that are unique to primates, including the evolution of language. Topics include primate taxonomy, evolution of the extant primates, geographic distribution, social behavior, reproductive behavior and strategies, parental behavior, communication, and cognitive. Classes will consist of interactive lectures, films, and class discussions."}, {"summer": "True", "name": "Evolutionary Biology", "prerequisites": "Prerequisite: C- or better in BIO 181and BIO 183", "spring": "True", "number": "330", "fall": "True", "units": " 3", "description": "Principles and patterns of organic evolution. Topics will include the origin of life, patterns of genetic variation, adaptations, natural selection, and the formation of species, the relationship between micro and macroevolution, and the importance of evolution to humans and medicine."}, {"summer": "True", "name": "Captive Animal Biology", "prerequisites": "Prerequisite: C- or better in BIO 181 and one of the following (BIO 140 or 250 or 260 or 350 or NTR 301 or ANS 150 or 205 or GN 311)", "spring": "True", "number": "333", "fall": "True", "units": " 3", "description": "This course serves to introduce interested students to historical and current captive animal conservation efforts. We will discuss in detail a variety of issues essential to the management of wild animals in a captive setting including ethics, nutrition, reproduction, behavior, and population management."}, {"summer": "True", "name": "Animal Phylogeny and Diversity", "prerequisites": "Prerequisite: A grade of C- or better in BIO 181 and sophomore standing.  Credit is not allowed for both BIO 350 and BIO 402/403", "spring": "True", "number": "350", "fall": "True", "units": " 4", "description": "Phylogenetic history and adaptive radiation of animals; contrast of environmental determinants of biodiversity in tropical and polar regions; modern approaches to phylogeny; role of humans in influencing biodiversity. Students may not receive credit for both BIO 350 and BIO 140 or ZO 150 or BIO 402 or BIO 403."}, {"summer": "True", "name": "Wildlife Management", "prerequisites": "Prerequisite:BIO 181", "spring": "True", "number": "353", "fall": "True", "units": " 3", "description": "Historical development of Wildlife Management from anecdotal, observational practices to modern, scientific approaches used around the world. Principles of population analysis, management, protection and conservation of animals, particularly those of conservation, aesthetic, sport or food values in urban, rural and wilderness areas. Ethics of hunting and trapping. Contradictory objectives challenging modern wildlife managers."}, {"summer": "True", "name": "Ecology", "prerequisites": "Prerequisite: C- or better in BIO 181", "spring": "True", "number": "360", "fall": "True", "units": " 4", "description": "The science of ecology, including factors which control distribution and population dynamics of organisms, structure and function of biological communities, and energy flow and nutrient cycling in ecosystems; contrasts among the major biomes; and principles governing ecological responses to global climatic and other environmental changes."}, {"summer": "True", "name": "Developmental Biology", "prerequisites": "Prerequisite: C- or better in BIO 183", "spring": "True", "number": "361", "fall": "True", "units": " 3", "description": "In this course students will discover the amazing journey that cells must take to get from an egg to an embryo, form a mature adult, and reproduce in order to continue the life cycle.  Students will relate science to everyday life using developmental biology as a forum to integrate many aspects of biology from the molecules in single cells to the complete organism and how it is influenced by evolution and the environment."}, {"summer": "True", "name": "Developmental Anatomy of the Vertebrates", "prerequisites": "Prerequisite: C- or better in BIO 181 or BIO 140", "spring": "True", "number": "370", "fall": "True", "units": " 3", "description": "An integrated study of the functional anatomy, phylogeny, and embryonic development of organ systems in vertebrate animals."}, {"summer": "True", "name": "Developmental Anatomy Laboratory", "prerequisites": "Prerequisite: C- or better in BIO 181 or BIO 140", "spring": "True", "number": "375", "fall": "True", "units": " 2", "description": "A hands-on study of embryonic development and organ systems in vertebrate animals, utilizing microscopic examination of living and preserved embryos, demonstrations of skeletons and mammalian organs, and dissections of preserved shark, salamander, and mink."}, {"summer": "True", "name": "Invertebrate Biology", "prerequisites": "Prerequisite: A grade of C- or better in BIO 181 and BIO 183.  Credit is not allowed for both BIO 350 and BIO 402/403.", "spring": "True", "number": "402", "fall": "True", "units": " 4", "description": "Over 90% of all animals are invertebrates, and many invertebrate species have proven extremely useful in medical and research applications.  This course will survey invertebrate groups or clades (excluding the Protista), and will emphasize their functional biology, phylogeny, ecology, behavior, and use as models in research.  Lab will emphasize an experimental approach and will involve work primarily with live material. Students may not receive credit for both BIO 402 and BIO 350 or BIO 140."}, {"summer": "True", "name": "Functional Histology", "prerequisites": "Prerequisite: C- or better in BIO 183", "spring": "True", "number": "405", "fall": "True", "units": " 3", "description": "Offered only as a distance education course via the internet.  Functional Histology describes the cellular structure of tissues and organs.  Human organs are emphasized, with brief consideration given to variation in other mammals.  Tissue and organ structure is related to function, including examples of malfunction (histopathology).  The course is especially appropriate for students planning a career in veterinary science, medicine, or allied health fields. Offered by distance education only."}, {"summer": "True", "name": "Introduction to Animal Behavior", "prerequisites": "Prerequisite: C- or better in BIO 181and BIO 183", "spring": "True", "number": "410", "fall": "True", "units": " 3", "description": "Studies in animal behavior in vertebrates and invertebrates, focusing on the mechanisms and evolution of animal behavior. Topics include neural, hormonal, and genetic bases of behavior; foraging; anti-predator defenses; mating systems and sexual selection; social behavior; communication; parental care; territoriality and habitat selection."}, {"summer": "True", "name": "Cell Biology", "prerequisites": "Prerequisite: C- or better in BIO 183 and CH 221", "spring": "True", "number": "414", "fall": "True", "units": " 3", "description": "The chemical and physical bases of cellular structure and function with emphasis on methods and interpretations."}, {"summer": "True", "name": "Limnology", "prerequisites": "Prerequisite: C- or better in BIO/PB 360", "spring": "True", "number": "419", "fall": "True", "units": " 4", "description": "Structure and function of lakes and ponds, including physical, chemical and biological controls of productivity and species composition of aquatic plants and animals, and effects of pollution on water quality. One local weekend field trip is required.Credit in both ZO 419 and ZO 519 is not allowed"}, {"summer": "True", "name": "Introduction to Fisheries Science", "prerequisites": "Prerequisite: C- or better in BIO/PB 360", "spring": "True", "number": "420", "fall": "True", "units": " 3", "description": "Role of fish in aquatic ecosystems, fish biology, fish ecology, fisheries management and conservation.  Emphasis on aquatic ecosystems and food webs, life history and ecology of important sport and commercial fishes, population and community dynamics, and theory and practice of fisheries management and conservation.  Case studies from freshwater, estuarine and marine systems."}, {"summer": "True", "name": "Advanced Human Anatomy and Physiology", "prerequisites": "Prerequisite: C- or better in BIO 250 or BIO 212", "spring": "True", "number": "421", "fall": "True", "units": " 3", "description": "A comprehensive survey of the processes involved in the function of specialized cells, tissues and organ systems. Emphasis on basic concepts with orientation toward mammalian and human systems."}, {"summer": "True", "name": "Biological Clocks", "prerequisites": "Prerequisite: C- or better in BIO 250 or BIO 212", "spring": "True", "number": "422", "fall": "True", "units": " 3", "description": "The anatomy, physiology, and development of biological clocks in a variety of organisms, including humans.  Credit in both BIO 422 and ZO 522 is not allowed."}, {"summer": "True", "name": "Introduction to Fisheries Sciences Laboratory", "prerequisites": "Corequisite: FW/BIO 420", "spring": "True", "number": "423", "fall": "True", "units": " 1", "description": "General anatomy and identification of common freshwater, estuarine and marine fish, functional morphology, age and growth analyses, fish health and diets.  Computer analyses of bioenergetic and population dynamics."}, {"summer": "True", "name": "Endocrinology", "prerequisites": "Prerequisite: C- or better in BIO 250 or BIO 212", "spring": "True", "number": "424", "fall": "True", "units": " 3", "description": "This course will explore the function of hormones and bioactive compounds in regulating animal physiology and homeostasis.  Topics will include a study of hormones and their mechanism of actions in regulating various biological processes including development and growth; reproduction; feeding, digestion and metabolism; ion and water balance; stress and immunity; and sex determination.  The methods used to study hormones and their physiological functions will also be addressed.  80% of enrollment is restricted to Biological Sciences and Zoology students with the remaning 20% open for all other majors."}, {"summer": "True", "name": "General Entomology", "prerequisites": "Prerequisite: BIO 181 or BIO 140 or ZO 150 or BIO 350", "spring": "True", "number": "425", "fall": "True", "units": " 3", "description": "Explores the science of entomology by focusing on the basic principles of systematics, morphology, physiology, development, behavior, ecology, and control of insects. Field trips provide opportunities to collect insects and study their adaptations to a wide variety of natural environments."}, {"summer": "True", "name": " Physiology Lab", "prerequisites": "Prerequisite: C- or better in BIO 212 or BIO 250; Corequisite: BIO 421", "spring": "True", "number": "426", "fall": "True", "units": " 1", "description": "A comprehensive laboratory course surveying the process involved in the function and structure of specialized cells, tissues, and organ systems. Emphasis will be on problem solving and critical thinking skills."}, {"summer": "True", "name": "Fisheries and Wildlife Administration", "prerequisites": "Prerequisite: PS 201, PS 202; FW/BIO 420, FW/BIO 353", "spring": "True", "number": "430", "fall": "True", "units": " 3", "description": "Describes and compares the administrative structures and programs of federal and state fish and wildlife agencies and develops an understanding of the basis on which these agencies function. Evaluates the interrelationships that fisheries-wildlife professionals, special interest groups, public agencies and legislative bodies play in resource  management programs."}, {"summer": "True", "name": "The Human Animal: An Evolutionary Perspective", "prerequisites": "Prerequisite: C- or better in one of the following: BIO 317, BIO/PB 330, BIO 410, PSY 406, or PSY 416", "spring": "True", "number": "440", "fall": "True", "units": " 3", "description": "An in-depth look at the evolution of a wide range of human behaviors, and some aspects of physiology as well.  We will critically explore the perceptions we hold of ourselves and the research that has sought to lend new insights into the fundamental bases of human behavior.  New uses of evolutionary theory, including the field of evolutionary psychology, will be examined using a comparative approach and careful readings from primary and secondary literature in evolutionary biology and psychology.  Classes will be largely discussion based."}, {"summer": "True", "name": "Biology of Fishes", "prerequisites": "Prerequisite: C- or better in BIO/PB 360", "spring": "True", "number": "441", "fall": "True", "units": " 3", "description": "Behavior, evolution, physiology and ecology of fishes, emphasizing their adaptations for life in streams, lakes, and oceans."}, {"summer": "True", "name": "Biology of Fishes Laboratory", "prerequisites": "Corequisite: BIO 441", "spring": "True", "number": "442", "fall": "True", "units": " 1", "description": "Field and laboratory exercises with the common fish species and communities of North Carolina. Field trips to local streams and lakes plus weekend trips to coastal, estuarine, and mountain habitats."}, {"summer": "True", "name": "Principles of Biological Oceanography", "spring": "True", "number": "449", "fall": "True", "units": " 3", "description": "Biological productivity and trophic relationships in plankton, nekton and benthos; community ecology of selected habitats (estuaries, intertidal zones, coral reefs, deep sea); and adaptation of organisms to the marine environment.  Credit is not allowed for both MEA/BIO 449 and MEA/BIO 549"}, {"summer": "True", "name": "Field Ecology and Methods", "prerequisites": "Prerequisite: C- or better in ST 311 and BIO 360", "spring": "True", "number": "460", "fall": "True", "units": " 4", "description": "Field Ecology and Methods will expose senior students with interests in Ecology and Evolution to the diverse field approaches used to address ecological questions.  The course considers and implements a variety of field approaches ranging from microcosm experiments to global studies of patterns and diversity.  Course is restricted to seniors."}, {"summer": "True", "name": "Capstone Course in Molecular, Cellular, and Developmental Biology", "prerequisites": "Prerequisite: C- or better in BIO 361, BIO/PB 414, and one of the following: BCH 351 or BCH 451 or BIT 410 or GN 311.", "spring": "True", "number": "482", "fall": "True", "units": " 3", "description": "Topical problems in molecular, cellular, and developmental biology. BIO 482 provides a challenging opportunity for students to integrate and apply knowledge and skills gained from their major studies. Emphasis will be placed on collaborative learning and on effective, professional communication. Topics and instructors will vary from semester to semester. Priority will initially be given to seniors in the MCD curriculum; other students with the necessary prerequisites will be admitted on a space available basis."}, {"summer": "True", "name": "Capstone Course in Integrative Physiology and Neurobiology", "prerequisites": "Prerequisite: C- or better in BIO 424, BIO 488, and one of the following: BIO/PB 414 or BCH 351 or BCH 451 or GN 311 or ST 311.", "spring": "True", "number": "483", "fall": "True", "units": " 3", "description": "Topical problems in integrative physiology and neurobiology. BIO 483 provides a challenging opportunity for students to integrate and apply knowledge and skills gained from their major studies. Emphasis will be placed on collaborative learning and on effective, professional communication. Topics and instructors will vary from semester to semester. Priority will initially be given to seniors in the IPN curriculum; other students with the necessary prerequisites will be admitted on a space available basis."}, {"summer": "True", "name": "Capstone Course in Human Biology", "prerequisites": "Prerequisite: C- or better in BIO 421, MB 351 and one of the following: BCH 351 or BCH 451 or GN 311 or ST 311.", "spring": "True", "number": "484", "fall": "True", "units": " 3", "description": "Topical problems in human biology. BIO 484 provides a challenging opportunity for students to integrate and apply knowledge and skills gained from their major studies. Emphasis will be placed on collaborative learning and on effective, professional communication. Topics and instructors will vary from semester to semester. Priority will initially be given to seniors in the HB curriculum; other students with the necessary prerequisites will be admitted on a space available basis."}, {"summer": "True", "name": "Capstone Course in Ecology, Evolution, and Conservation Biology", "prerequisites": "Prerequisite: C- or better in BIO/PB 330, BIO/PB 360, and one of the following: BIO 460 or GN 311 or NR 406 or ST 311.", "spring": "True", "number": "485", "fall": "True", "units": " 3", "description": "Topical problems in ecology, evolution, and conservation biology. BIO 485 provides a challenging opportunity for students to integrate and apply knowledge and skills gained from their major studies. Emphasis will be placed on collaborative learning and on effective, professional communication. Topics and instructors will vary from semester to semester. Priority will initially be given to seniors in the EEC curriculum; other students with the necessary prerequisites will be admitted on a space available basis."}, {"summer": "True", "name": "Capstone Course in Zoology", "prerequisites": "Prerequisite: C- or better in BIO 250, BIO/PB 360, and one of the following: BIO 350 or BIO 402/403 or GN 311 or ST 311.", "spring": "True", "number": "486", "fall": "True", "units": " 3", "description": "Topical problems in zoology. BIO 486 provides a challenging opportunity for students to integrate and apply knowledge and skills gained from their major studies. Emphasis will be placed on collaborative learning and effective, professional communication. Topics and instructors will vary from semester to semester. Priority will initially be given to seniors in the SZO curriculum; other students with the necessary prerequisites will be admitted on a space available basis."}, {"summer": "True", "name": "Neurobiology", "prerequisites": "Prerequisite: C- or better in BIO 250 or BIO 212", "spring": "True", "number": "488", "fall": "True", "units": " 3", "description": "Overview of the neurosciences, with a focus on fundamental principles in the function, structure, and development of the nervous system.  Topics include neuroanatomy, electrical signaling, synaptic transmission, sensory and motor systems, neural development, neural plasticity, and complex brain functions.  Multiple levels of analysis, from molecular to behavioral, with an emphasis on the mammalian nervous system."}, {"summer": "True", "name": "External Learning Experience", "prerequisites": "Prerequisite: Sophomore standing", "spring": "True", "number": "492", "fall": "True", "units": " 1-6", "description": "Learning experience in agriculture and life sciences within an academic framework with facilities and resources external to the campus.  Contact and arrangements with prospective supervisors by the student.  Prior approval by faculty advisor, prospective supervisor, and departmental teaching coordinator."}, {"summer": "True", "name": "Special Problems in Biological Sciences", "prerequisites": "Prerequisite: Sophomore standing", "spring": "True", "number": "493", "fall": "True", "units": " 1-6", "description": "Learning experience in agriculture and life sciences within an academic framework with campus facilities and resources.  Contact and arrangements with prospective supervisors by the student.  Prior approval by faculty advisor, prospective supervisor, and department teaching coordinator."}, {"summer": "True", "name": "Special Topics in Biology", "spring": "True", "number": "495", "fall": "True", "units": " 1-6", "description": "Individualized study, under faculty supervision, of biological topics, and developmental course on a trial basis."}, {"summer": "True", "name": "Experience and the Brain", "prerequisites": "Prerequisite: BIO 488 or ZO 588", "spring": "True", "number": "518", "fall": "True", "units": " 3", "description": "This seminar considers how an individual's behavioral interactions with the world (i.e., experience) can alter the structure and/or function of the adult brain.  Emphasis will be on reading and critically discussing the primary research literature."}, {"summer": "True", "name": "Population Ecology", "prerequisites": "Co-requisite: ST 511", "spring": "True", "number": "560", "fall": "True", "units": " 3", "description": "Dynamics of natural populations. Current work, theories and problems dealing with population growth, fluctuation, limitation and patterns of dispersion, species interactions, community structure and ecological genetics. One semester of calculus and a junior/senior level ecology course are required."}, {"summer": "True", "name": "Conservation Biology", "spring": "True", "number": "561", "fall": "True", "units": " 3", "description": "Conservation Biology applies principles from ecology, genetics, and other biological disciplines to the conservation of biological diversity.  This course will train students in techniques in population ecology such as population viability analysis; community ecology and theories of biodiversity; and reserve selection algorithms.  The class will examine threats to biodiversity such as habitat fragmentation and loss, climate change, and invasion by exotic species.  These issues will be considered within the context of economoic, social, and legal constraints.  Graduate status or permission of instructor."}]