[{"summer": "True", "name": "Current Topics in Biotechnology", "prerequisites": "Prerequisite: High School Biology", "spring": "True", "number": "100", "fall": "True", "units": " 4", "description": "This course provides both science and non-science students an opportunity to learn about current issues in biotechnology that play a role in our society. Topic areas will include contemporary and historical applications of biotechnology. From alternative fuel sources to the ramifications of the elucidation of the human genome on health care issues, advances in biotechnology are constantly reshaping the world we live in. Students will give presentations and participate in discussions in the classroom, as well as be engaged in the laboratory on a variety of different topics in biotechnology that affects all our lives."}, {"summer": "True", "name": "Phage Hunters", "spring": "True", "number": "210", "fall": "True", "units": " 3", "description": "This course offers first-year students an opportunity for mentored research.  Students will apply the scientific method to make novel discoveries.  Students will isolate and characterize naturally-occurring bacteriophage (viruses that infect bacteria, but not humans) from the environment.  They will present their data to each other, and the genome of one phage will be sequenced.  Students have the option to continue in a second semester to annotate that genome, culminating in a submission to genbank and a poster presentation.  Students in the course are part of the National Genome Research Initiative funded by The Howard Hughes Medical Institute.  Student should have had a high school biology course before taking this course."}, {"summer": "True", "name": "Phage Genomics", "prerequisites": "Prerequisite: BIT(MB) 210", "spring": "True", "number": "211", "fall": "True", "units": " 2", "description": "This course offers first-year students an opportunity for mentored research. Student will apply the scientific method to make novel discoveries. Students will build on the work they began in BIT/MB 210; The novel phage isolated in the previous semester will undergo genome sequencing over winter break, and in this course students will learn to analyze and annotate the genome sequence. This semester will culminate in a submission to genbank and a poster presentation. Students in the course are part of the national genome research initiative funded by the Howard Hughes Medical Institute."}, {"summer": "True", "name": "Special Topics in Biotechnology", "spring": "True", "number": "295", "fall": "True", "units": " 1-3", "description": "Offered as needed to present materials not normally available in regular course offerings or for offering of new courses on a trial basis."}, {"summer": "True", "name": "Manipulation of Recombinant DNA", "prerequisites": "Prerequisite: BIO 183 or ZO/BIO 160 and CH 223 with a C- or better", "spring": "True", "number": "410", "fall": "True", "units": " 4", "description": "Introduction to molecular biology and protein chemistry. Theory behind laboratory techniques and overview of cloning strategies starting from nucleic acid or protein sequence data. Laboratory sessions involve subcloning, preparation of competent cells, transformation, screening recombinant DNA by colony hybridization and PCR, SDS-PAGE of recombinant protein, affinity purification, and western blots."}, {"summer": "True", "name": "Gene Expression Analysis: Microarrays", "prerequisites": "Prerequisite: BIT 410 or BIT 510", "spring": "True", "number": "462", "fall": "True", "units": " 2", "description": "Microarray analysis is an evolving technique with its basis in the dynamic properties of the nucleic acid hybridization. We will review current theory, techniques, instrumentation, troubleshooting, analysis tools, and advanced protocols for microarray analysis. Students will have the opportunity to utilize skills learned during lecture in a laboratory environment and have access to exceptional instrumentation. At the conclusion of this course, students should feel comfortable with microarray experimental design, its tools, an analysis of generated data. This is a half-semester course. Student must register for both lecture and lab sections"}, {"summer": "True", "name": "Protein Purification", "prerequisites": "Prerequisite: BIT 410 or BIT 510 or BCH 454", "spring": "True", "number": "464", "fall": "True", "units": " 2", "description": "Comparison of several different chromatography techniques for protein purification.  Construction of purification tables and SDS-and native-PAGE analysis.  Cost-benefit analysis of industrial-scale procedures.  Half semester course, second part."}, {"summer": "True", "name": "Real-time PCR Techniques", "prerequisites": "Prerequisite: BIT 410 or BIT 510", "spring": "True", "number": "465", "fall": "True", "units": " 2", "description": "Real time PCR is an evolving technique with its basis in the dynamic properties of the polymerase chain reaction and fluorescent detection. We will review current real-time theory, techniques, machinery, troubleshooting, tools, and advanced protocols for sequence detection including SYBR green, TaqMan, Beacons, multiplexing, and single nucleotide polymorphism analysis. Students will have the opportunity to utilize skills learned during lecture in a laboratory environment. At the conclusion of this course, students should feel comfortable with real-time experimental design, its tools, and analysis of generated data. This is a half-semester course.  Student must register for both lecture and lab sections."}, {"summer": "True", "name": "Animal Cell Culture Techniques", "prerequisites": "Prerequisite: BIT 410 or BIT 510 or BCH 454", "spring": "True", "number": "466", "fall": "True", "units": " 2", "description": "Introduction to animal cell culture techniques.  Aseptic technique for vertebrate cell culture, media formulation, primary cell culture, long-term maintenance of cell lines, application of molecular techniques to in vitro situations.  Half semester course, second part."}, {"summer": "True", "name": "PCR and DNA Fingerprinting", "prerequisites": "Prerequisite: BIT 510", "spring": "True", "number": "467", "fall": "True", "units": " 2", "description": "Introduction to polymerase chain reaction.  Optimization of PCR reactions and primer design for DNA sequences using DNA databases available on the web.  Laboratory sections include using rapid techniques for isolating and sequencing DNA from small amounts of sample and forensic identification of individuals using isolated human hairs.  Credit is not allowed for both BIT 467 and BIT 567."}, {"summer": "True", "name": "Genome Mapping", "prerequisites": "Prerequisite: BIT 410 or BIT 510 or BCH 454", "spring": "True", "number": "468", "fall": "True", "units": " 2", "description": "Students will be introduced to basic techniques in genetic and physical mapping.  The principles of DNA marker development, marker detection, genetic and physical mapping and DNA sequencing will be addressed from a practical view with an emphasis onagricultural applications.  This is a half semester course.  Student must register for both lecture and lab sections."}, {"summer": "True", "name": "RNA Interference and Model Organisms", "prerequisites": "Prerequisite: BIT 410 or BIT 510 or BCH 454", "spring": "True", "number": "471", "fall": "True", "units": " 2", "description": "Introduction and history of RNA interference technology.  Principles, mechanism, and applications of RNA interference in model organisms.  Laboratory sessions include RNA interference-mediated silencing of genes in plants, C. elegeans, and mammalian cell culture.  This is a half-semester course (8 weeks). Student may not earn credit for both BIT 471 and BIT 571."}, {"summer": "True", "name": "Experimental Analysis of Protein-Protein Interactions", "prerequisites": "Prerequisite: BIT 410 or BCH 454", "spring": "True", "number": "473", "fall": "True", "units": " 2", "description": "The interactions of proteins mediate numerous biological processes of cells. This course focuses on ways to identify and study protein-protein interactions, focusing on the advantages and limitations of each technique and how to apply the methods in a laboratory setting. In lab, students will perform a yeast two-hybrid experiment and a co-immunoprecipitation from proteins expressed in mammalian cell culture to confirm detected interactions. This a half-semester course."}, {"summer": "True", "name": "Plant Genetic Engineering", "prerequisites": "Prerequisite: BIT 410 or BIT 510 or BCH 454 or PB 421", "spring": "True", "number": "474", "fall": "True", "units": " 2", "description": "This course covers fundamental hands-on techniques and strategies in plant genetic engineering. Plants are major sources of food, fiber and fuel and provide model systems for both fundamental and applied research. Students will learn techniques for stable and transient transformation of plants and plant cell cultures and selection and detection of transgene expression. Additional topics covered will include methods to generate and screen for mutants, synthetic biology and applications of plant genetic engineering. This is a half-semester course. Credit is not allowed for both BIT 474 and BIT 574."}, {"summer": "True", "name": "Applied Bioinformatics", "prerequisites": "Prerequisite: BIT 410 or BCH 454 or GN 311", "spring": "True", "number": "476", "fall": "True", "units": " 2", "description": "The haploid human genome occupies a total of just over 3 billion DNA base pairs. This information is not contained in books, but stored in electronic databases. Computational biology utilizes infer function by comparative analysis. This course is designed for life scientists from all fields to introduce them to the power of bioinformatics and enable them to access and utilize biological information in databases for their own research."}, {"summer": "True", "name": "Plant Tissue Culture and Transformation", "spring": "True", "number": "481", "fall": "True", "units": " 2", "description": "Basic techniques in plant tissue culture and transformation. Empirical approaches to techniques in plant tissue culture, designing transgenes for expression in specific plant cell organelles and tissues, use of reporter genes to optimize transformation, and troubleshooting transformation. Laboratory sessions provide hands-on experience with plant tissue culture and transformation. Use of reporter genes, fluorescence microscopy and digital imaging. Half semester course, first part."}, {"summer": "True", "name": "External Learning Experience", "spring": "True", "number": "492", "fall": "True", "units": " 1-6", "description": "A learning experience in the area of biotechnology within an academic framework that utilizes facilities and resources which are external to the campus.  Contact and arrangements with prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, and the departmental teaching coordinator prior to the experience.  Project must be approved by the Academic Coordinator or Program Director of the Biotechnology Program."}, {"summer": "True", "name": "Special Problems in Biotechnology", "spring": "True", "number": "493", "fall": "True", "units": " 1-6", "description": "A learning experience within an academic framework that utilizes campus facilities and resources.  Contact and arrangements with prospective mentor(s) must be initiated by student and approved by a faculty adviser, the prospective mentor, and the departmental teaching coordinator prior to the experience.  Project must be approved by the Academic Coordinator of Program Director of the Biotechnology Program."}, {"summer": "True", "name": "Special Topics in Biotechnology", "spring": "True", "number": "495", "fall": "True", "units": " 1-3", "description": "Offered as needed to present materials not normally available in regular course offerings or for offering of new courses on a trial basis."}, {"summer": "True", "name": "Ethical Issues in Biotechnology", "spring": "True", "number": "501", "fall": "True", "units": " 1", "description": "Students investigate and discuss current controversial issues in biotechnology.  This course emphasizes thinking about new technologies in a rational and thoughtful way."}, {"summer": "True", "name": "Core Technologies in Molecular and Cellular Biology", "prerequisites": "Prerequisite: Equivalent of CH 223 and MB 351 or GN 411", "spring": "True", "number": "510", "fall": "True", "units": " 4", "description": "Basic technologies of recombinant DNA procedures, gene expression, isolation and identification of nucleic acids and proteins."}, {"summer": "True", "name": "Gene Expression: Microarrays", "prerequisites": "Prerequisite: BIT 410 or BIT 510", "spring": "True", "number": "562", "fall": "True", "units": " 2", "description": "Microarray analysis is an evolving technique with its basis in the dynamic properties of the nucleic acid hybridization. We will review current theory, techniques, instrumentation, troubleshooting, analysis tools, and advanced protocols for microarray analysis. Students will have the opportunity to utilize skills learned during lecture in a laboratory environment and have access to exceptional instrumentation. At the conclusion of this course, students should feel comfortable with microarray experimental design, its tools, an analysis of generated data. This is a half-semester course. Student must register for both lecture and lab sections"}, {"summer": "True", "name": "Fermentation of Recombinant Microorganisms", "spring": "True", "number": "563", "fall": "True", "units": " 2", "description": "Introduction to fermentation and protein chemistry.  Theory behind laboratory techniques and overview of industrial scale expression systems.  Laboratory session sinvolve use of microbial expression vectors, fermentation systems, and large-scale purification of recombinant protein.  Half semester course, first part."}, {"summer": "True", "name": "Protein Purification", "spring": "True", "number": "564", "fall": "True", "units": " 2", "description": "Comparison of several different chromatography techniques for protein purification.  Construction of purification tables and SDS-and native-PAGE analysis.  Cost-benefit analysis of industrial-scale procedures.  Half semester course, second part."}, {"summer": "True", "name": "Real-time PCR Techniques", "prerequisites": "Prerequisite: BIT 410 or BIT 510", "spring": "True", "number": "565", "fall": "True", "units": " 2", "description": "Real time PCR is an evolving technique with its basis in the dynamic properties of the polymerase chain reaction and fluorescent detection. We will review current real-time theory, techniques, machinery, troubleshooting, tools, and advanced protocols for sequence detection including SYBR green, TaqMan, Beacons, multiplexing, and single nucleotide polymorphism analysis. Students will have the opportunity to utilize skills learned during lecture in a laboratory environment. At the conclusion of this course, students should feel comfortable with real-time experimental design, its tools, and analysis of generated data. This is a half-semester course."}, {"summer": "True", "name": "Animal Cell Culture Techniques", "spring": "True", "number": "566", "fall": "True", "units": " 2", "description": "Introduction to animal cell culture techniques.  Aseptic technique for vertebrate cell culture, media formulation, primary cell culture, long-term maintenance of cell lines, application of molecular techniques to in vitro situations.  Half semester course, second part."}, {"summer": "True", "name": "Pcr DNA Fingerprin", "spring": "True", "number": "567", "fall": "True", "units": " 2", "description": "Introduction to polymerase chain reaction.  Optimization of PCR reactions and primer design for DNA sequences using DAN databases available on the web.  Laboratory sections include using rapid techniques for isolating and sequencing DNA from small amounts of sample and forensic identification of individuals using isolated human hairs."}, {"summer": "True", "name": "Genome Mapping", "prerequisites": "Prerequisite: BIT 410 or BIT 510 or BCH 454", "spring": "True", "number": "568", "fall": "True", "units": " 2", "description": "Basic techniques in genetic and physical mapping.  The principles of DNA marker development, marker detection, genetic and physical mapping and DNA sequencing will be addressed from a practical view with an emphasis on agricultural applications.  This is a half semester course.  Student must register for both the lecture and the lab."}, {"summer": "True", "name": "RNA Purification and Analysis", "prerequisites": "Prerequisite: BIT 410 or BIT 510", "spring": "True", "number": "569", "fall": "True", "units": " 2", "description": "Laboratory-intensive course covering techniques in RNA purification and analysis including: isolation of quality RNA; quantification by gel and spectrophotometer; separation by gel electrophoresis; reverse transcription PCR; and Northern blotting using non-radioactive labeling and detection by chemi-luminescense. Half semester course."}, {"summer": "True", "name": "RNA Interference and Model Organisms", "prerequisites": "Prerequisite: BIT 410 or BIT 510 or BCH 454", "spring": "True", "number": "571", "fall": "True", "units": " 2", "description": "Introduction and history of RNA interference technology. Principles, mechanism, and applications of RNA interference in model organisms. Laboratory sessions include RNA interference-mediated silencing of genes in lants, C. Elegans, and mammalian cell culture.  This is a half-semster course (8 weeks). Student may not earn credit for both BIT 471 and BIT 571."}, {"summer": "True", "name": "Proteomics", "spring": "True", "number": "572", "fall": "True", "units": " 3", "description": "Introduction and history of the field of proteomics followed by the principles and applications of proteomics technology to understand protein expression and protein post-transitional modifications. Laboratory sessions include growing yeast with stable-isotope labeled amino acids, protein purification, Western blots, protein identification and quantification, and protein bioinformatic analysis. This is a half-semester course."}, {"summer": "True", "name": "Protein-Protein Interactions", "prerequisites": "Prerequisite: BIT 410 or BIT 510 or BCH 454", "spring": "True", "number": "573", "fall": "True", "units": " 2", "description": "The interactions of proteins mediate numerous biological processes of cells. This course focuses on ways to identify and study protein-protein interactions. Students will apply a variety of methods for studying protein-protein interactions, focusing on the advantages and limitations of each technique and how to apply the methods in a laboratory setting. In lab, students will perform a yeast two-hybrid experiment and a co-immunoprecipitation from proteins expressed in mammalian cell culture to confirm detected interactions. This is a half-semester course."}, {"summer": "True", "name": "Plant Genetic Engineering", "prerequisites": "Prerequisite: BIT 410 or BIT 510 or BCH 454 or PB 421", "spring": "True", "number": "574", "fall": "True", "units": " 2", "description": "This course covers fundamental hands-on techniques and strategies in plant genetic engineering. Plants are major sources of food, fiber and fuel and provide model systems for both fundamental and applied research. Students will learn techniques for stable and transient transformation of plants and plant cell cultures and selection and detection of transgene expression. Additional topics covered will include methods to generate and screen for mutants, synthetic biology and applications of plant genetic engineering. This is a half-semester course. Credit is not allowed for both BIT 474 and BIT 574."}, {"summer": "True", "name": "Plant Transformatn", "spring": "True", "number": "581", "fall": "True", "units": " 2"}, {"summer": "True", "name": "Special Topics", "spring": "True", "number": "595", "fall": "True", "units": " 1-3", "description": "Offered as needed to present materials not normally available in regular course offerings or for offering of new courses on a trial basis."}, {"summer": "True", "name": "Summer Thesis Res", "spring": "True", "number": "696", "fall": "True", "units": " 1"}, {"summer": "True", "name": "Advanced Special Topics", "prerequisites": "Prerequisite: BIT 510", "spring": "True", "number": "815", "fall": "True", "units": " 1-6", "description": "Intensive three-week or six-week courses in advanced technologies such as DNA sequencing, downstream processing, immunological techniques, construction of c-DNA libraries, mammalian embryo manipulation, plant transformation, bioreactor design, cloning in gram positive bacteria, electron microscopy or techniques in yeast molecular biology."}, {"summer": "True", "name": "Summer Dissert Res", "spring": "True", "number": "896", "fall": "True", "units": " 1"}]