[{"summer": false, "name": "Computer Methods in Biomedical Engineering", "prerequisites": "Prerequisite: BME matriculated students", "spring": false, "number": "201", "fall": true, "units": " 3", "description": "Students develop computer-based problem solving techniques using Excel and MATLAB to solve introductory problems in Biomedical Engineering.  Emphasis is on developing solution algorithms, implementing these with spreadsheets and computer programming, and presenting results in a clear and concise manner. Students registered for BME 201 who fail to matriculate into BME will be dropped from the course."}, {"summer": false, "name": "Introduction to the Materials Science of Biomaterials", "prerequisites": "Prerequisite: C- or better in CH 101, CH 102 and PY 205", "spring": true, "number": "203", "fall": false, "units": " 3", "description": "This course introduces fundamental physical principles governing the structure, processing, properties and performance of metallic, ceramic and polymeric materials.  Relationships are developed defining how mechanical, physical and chemical properties are controlled by microstructure and chemistry.  Material failure modes are develped with an emphasis on biocompatibility and the applications/performance of materials in the human body.  Basic aspects of material biocompatibility are presented, leading into studies of the current and future applications of biomaterials."}, {"summer": false, "name": "Biomedical Measurements", "prerequisites": "Prerequisite: BME Majors", "spring": false, "number": "204", "fall": true, "units": " 3", "description": "This course will introduce students to modern topics in biomedical engineering and areas of emphasis in the biomedical engineering curriculum through the study and use of biomedical measurement tools. The course will include a lecture and a laboratory component."}, {"summer": false, "name": "Biomedical Electronics", "prerequisites": "Prerequisite: MA 242, PY 208.  For BME Majors only.", "spring": true, "number": "210", "fall": false, "units": " 4", "description": "Fundamentals of analog and digital circuit analysis and design as applied to biomedical instrumentation and measurement of biological potentials.  Passive circuit components, node and mesh analysis, transient behavior, operational amplifiers, frequency response, analog filter design, diode, transistors, biological signal acquisition, binary math and logical operators, digital circuit design, circuit simulation tools and techniques. Laboratory exercises supplement the topics presented in class lectures."}, {"summer": false, "name": "Biomedical Engineering Design and Manufacturing I", "prerequisites": "Prerequisite: BME Majors", "spring": true, "number": "252", "fall": true, "units": " 1", "description": "Students will learn the basic tools of design such as solid modeling by means of web-based tutorials and a series of small CAD project assignments. Students will learn to use current software for design, analysis, and computer-aided manufacturing (CAM). Students will also be introduced to modern manufacturing through the transition from CAD (Computer-Aided Design) to CAM using modern rapid manufacturing equipment to carry out one small, well-defined design and manufacturing project."}, {"summer": false, "name": "Human Physiology for Engineers I", "prerequisites": "Prerequisite: BME 201 and either ZO 160 or BIO 183, BME Majors, Corequisite: BME 311", "spring": false, "number": "301", "fall": true, "units": " 3", "description": "This course includes a quantitative approach to human physiology from the biomedical engineering perspective with an emphasis on neural, sensory, muscle, and cardiac physiology. Autonomic neural and somatic motor control will be discussed. Engineering applications, including neural stimulators, functional imaging, cochlear implants, artificial noses, vestibular implants, visual implants, artificial larynges, pacemakers and defibrillators will be discussed. Assignments include computer-based exercises using MATLAB."}, {"summer": false, "name": "Human Physiology for Engineers II", "prerequisites": "Prerequisite: BME 301.  For BME Majors only.", "spring": true, "number": "302", "fall": false, "units": " 3", "description": "This course explores a quantitative approach to human physiology from the biomedical engineering perspective with an emphasis on systems physiology described using mechanical properties. Topics include the physiological and mechanical behavior of the blood vessels, lungs, kidney muscles and larynx. In the course lab exercises, students investigate mechanical properties of fluids, electrolyte exchange in dialysis, spirometry and blood pressure measurement among other topics. The course culminates with the design of a novel laboratory experiment."}, {"summer": false, "name": "Linear Systems in Biomedical Engineering", "prerequisites": "Prerequisite: BME 201 and (ECE 331 or BME 210). Corequisite: BME 301 and MA 341. For BME Majors only.", "spring": false, "number": "311", "fall": true, "units": " 3", "description": "Fundamentals of linear systems analysis as applied to problems in biomedical modeling and instrumentation.  Properties of biomedical systems and signals.  Representation of continuous- and discrete-time signals and system response.  Convolution.  Fourier analysis in continuous and discrete domains. Laplace transform.  Frequency response and its application in biomedical systems.  Filter design.  Circuit analogs to mechanical and thermodynamics systems and their applications in modeling biomedical systems.  Applications in biomedical instrumentation.  Students use MATLAB to simulate and analyze biomedical linear systems. BME majors only."}, {"summer": false, "name": "Analog and Digital Circuits Laboratory", "prerequisites": "Prerequisite: ECE 331, BME Majors", "spring": false, "number": "312", "fall": true, "units": " 1", "description": "Laboratory in analog and digital circuit analysis. Electrical safety; Exercises in resistor networks, capacitors and inductors, steady-state and dynamic circuit behavior, active circuits, amplifiers, logic gates, combinatorial and sequential circuits, elementary digital system design, A/D conversion, biomedical applications."}, {"summer": false, "name": "Analytical and Experimental Methods for Biomedical Engineers", "prerequisites": "Prerequisite: BME 201; MAE 208 or CE 215; MAE 314 or CE 313; MA 341", "spring": true, "number": "342", "fall": false, "units": " 3", "description": "Experimental and analytic tools are developed and used to solve problems in biomedical engineering.  Techniques include kinematic analysis, closed form and finite element analysis of stresses and strains in a body, and failure analysis.  Transducersnecessary for experimental analysis and testing are introduced.  Students learn advanced software packages such as the finite element program ANSYS and the dynamic analysis program ADAMS to assist in their analyses."}, {"summer": false, "name": "Biomedical Engineering Design and Manufacturing II", "prerequisites": "Prerequisite: BME 252; BME majors", "spring": true, "number": "352", "fall": false, "units": " 2", "description": "Students will be required to continue their use of the tools learned in Biomedical Design and Manufacturing I in the context of modern design practices and manufacturing processes. The organizational and project management tools of moderm design will be introduced, and a technical discussion of a modern manufacturing technology will be introduced each week."}, {"summer": false, "name": "Biomedical Signal Processing", "prerequisites": "Prerequisite: BME 311, ST 370", "spring": true, "number": "412", "fall": false, "units": " 3", "description": "Fundamentals of continuous- and discrete-time signal processing as applied to problems in biomedical instrumentation.  Properties of biomedical signals and instruments.  Descriptions of random noise and signal processes.  Interactions between randombiomedical signals and systems.  Wiener filtering.  Sampling theory.  Discrete-time signal analysis.  Applications of Z-transform and discrete Fourier transform.  Digital filter design methods for biomedical instruments.  BME or MS or PHD; credit not allowed for both BME 412 and BME 512."}, {"summer": false, "name": "Fundamentals of Biomedical Instrumentation", "prerequisites": "Prerequisite: BME 210 or BME 312", "spring": true, "number": "422", "fall": false, "units": " 3", "description": "Fundamentals of biomedical instrument design and implementation. Sensing mechanisms, sensor microfabrication methods, sensor interfacing circuits, analog-to-digital conversion, biosignal capture and storage, embedded microprocessors, data compression methods, system integration and prototyping.  Laboratory exercises using LabVIEW and MATLAB,  supplement the topics presented in class lectures.  Students build a sensor using cleanroom facilities in the BME department as part of a semester-long design project."}, {"summer": false, "name": "Bioelectricity", "prerequisites": "Prerequisite: BME 302 or (ZO 421 and a course in electrical circuits)", "spring": true, "number": "425", "fall": false, "units": " 3", "description": "Quantitative analysis of excitable membranes and their signals, including plasma membrane characteristics, origin of electrical membrane potentials, action potentials, voltage clamp experiments, the Hodgkin-Huxley equations, propagation, subthresholdstimuli, extracellular fields, membrane biophysics, and electrophysiology of the heart.  Design and development of an electrocardiogram analysis system."}, {"summer": false, "name": "Biomechanics", "prerequisites": "Prerequisite: ZO 160 or BIO 183; BME 342; ST 370", "spring": false, "number": "441", "fall": true, "units": " 3", "description": "Students study human body kinematics, force analysis of joints, and the structure and composition of biological materials.  Emphasis is placed on the measurement of mechanical properties and the development and understanding of models of biological material mechanical behavior."}, {"summer": false, "name": "Cardiovascular Biomechanics", "prerequisites": "Prerequisite: BME 302, BME 342 and (MAE 308 or CE 382)", "spring": true, "number": "443", "fall": false, "units": " 3", "description": "Engineering principles as applied to the cardiovascular system.  Anatomy of cardiovascular system; form and function of blood and blood vessels.  Electric analogs; continuum mechanics with derivation of equations of motion; and constitutive models of soft tissue mechanics, with attention to normal, diseased, and adaptive processes.  Programming project required.  Credit is not allowed for both BME 443 and BME 543."}, {"summer": false, "name": "Biomedical Engineering Senior Design I", "prerequisites": "Prerequisite: BME 302, BME 352, and either ENG 331 or ENG 333, and completion of two of the suggested BME electives for their area of emphasis ; BME majors", "spring": false, "number": "451", "fall": true, "units": " 3", "description": "Design concepts of engineering problems: objectives, specifications, manufacturing, prior art, and analysis.  Oral and written exercises in reverse engineering. Lectures in national and international standards, quality control, intellectual propertylaw, and engineering ethics.  Team projects to design, build, and deliver a prototype device to aid a disabled person or other appropriate biomedical engineering project that provides an opportunity for real world engineering design and community outreach."}, {"summer": false, "name": "Biomedical Engineering Senior Design II", "prerequisites": "Prerequisite: BME 451, BME Majors", "spring": true, "number": "452", "fall": false, "units": " 3", "description": "Continuation of BME 451.  Project analysis, design, scheduling, construction, and testing.  Advanced written and oral technical communication.  Teamwork and the function of engineering design in society.  Major team project with a biomedical engineering theme."}, {"summer": false, "name": "Polymeric Biomaterials Engineering", "prerequisites": "Prerequisite: PY 208 and (TE 200 or CH 220 or CH 221)and(MAE 206 or CE 214)", "spring": false, "number": "466", "fall": true, "units": " 3", "description": "In-depth study of the engineering design of biomedical polymers and implants.  Polymeric biomaterials, including polymer synthesis and structure, polymer properties as related to designing orthopedic and vascular grafts.  Designing textile products as biomaterials including surface modification and characterization techniques.  Bioresorbable polymers."}, {"summer": false, "name": " Implants Requirements", "prerequisites": "Prerequisite: (ZO 160 or BIO 183) and (MAE 314 or CE 313)", "spring": true, "number": "467", "fall": false, "units": " 3", "description": "Application of engineering and biological principles to understand the structure and performance of tendons, ligaments, skin, and bone; bone mechanics; viscoelasticity of soft biological tissues; models of soft biological tissues; mechanics of skeletal muscle; and tissue-derived devices as well as interfaces between native tissues and synthetic devices."}, {"summer": false, "name": "Biomedical Microcontroller Applications", "prerequisites": "Prerequisite: BME 422.  BME Majors only", "spring": false, "number": "480", "fall": true, "units": " 3", "description": "Overview of microcontroller-based systems, including applications, architecture, number systems, and languages. Students gain experience using a PIC-based microcontroller to input information  from a user and output information using LEDs and LCD displays. Student will learn capabilities of the PIC through in class exercises and weekly programming assignments. Both assembly language and PIC-based C are used. Students develop a PIC-based heart rate monitor and work in pairs on a BME-related project of their choice."}, {"summer": false, "name": "Tissue Engineering Technologies", "prerequisites": "Prerequisite: BIT 466 or permission of instructor", "spring": false, "number": "483", "fall": true, "units": " 2", "description": "In this half-semester laboratory module, students will gain practical experience with two key elements of tissue engineering: tissue building and angiogenesis.  Using advanced culture techniques, students will construct a complex living tissue that closely resembles its natural counterpart, then assess its ability to support ingrowth of capillaries (angiogenesis). The effects of different biomaterials and angiogenic factors will be evaluated.  The engineered tissue will be embedded, sectioned and stained for histological analysis."}, {"summer": false, "name": "Tissue Engineering Fundamentals", "prerequisites": "Prerequisite: (ZO 160 or BIO 183), CH 221, and (MAE 301 or MSE 301 or CHE 315 or TE 303)", "spring": true, "number": "484", "fall": false, "units": " 3", "description": "This course covers essential concepts of organ and tissue design and engineering using living components, including cell-based systems and cells/tissues in combination with biomaterials, synthetic materials and/or devices. Topics include: In vivo tissue structure and function; Isolation and culture of primary cells and stem cells; Principles of cellular differentiation; Mass transport processes in cell culture systems; Design, production and seeding of scaffolds for 3D culture; Design of bioreactors to support high-density cell growth; State-of-the-art engineered tissue systems; Clinical translation; and Ethics."}, {"summer": true, "name": "Special Topics in Biomedical Engineering", "spring": true, "number": "495", "fall": true, "units": " 1-4", "description": "Offered as needed for presenting material not normally available in regular BME Department courses or for new BME courses on a trial basis."}, {"summer": true, "name": "Undergraduate Research in Biomedical Engineering", "spring": true, "number": "498", "fall": true, "units": " 3", "description": "Opportunity for hands-on faculty mentored research project in biomedical engineering. Course may be a stand-alone project completed in one semester/summer or serve as part of a two-semester project. Approved plan of work required with significant independent research culminating in a final paper and presentation at the NC State Undergraduate Research Symposium or other appropriate venue. Students must identify an advisor from within the BME faculty with whom to work on a regular basis. The advisor must approve the student prior to the student registering for the course. The BME Undergraduate Coordinator must approve the use of the course as a restricted elective for the BME degree.  Departmental Approval Required"}, {"summer": false, "name": "Biomedical Signal Processing", "prerequisites": "Prerequisite: BME 311, and ST 370 or ST 371", "spring": true, "number": "512", "fall": false, "units": " 3", "description": "Fundamentals of continuous- and discrete-time signal processing as applied to problems in biomedical instrumentation.  Properties of biomedical signals and instruments.  Descriptions of random noise and signal processes.  Interactions between randombiomedical signals and systems.  Wiener filtering.  Sampling theory.  Discrete-time signal analysis.  Applications of Z-transform and discrete Fourier transform.  Digital filter design methods for biomedical instruments.  BME or graduate standing only; credit is not allowed for both BME 412 and BME 512."}, {"summer": false, "name": "Medical Instrumentation", "spring": false, "number": "522", "fall": true, "units": " 3", "description": "Fundamentals of medical instrumentation systems, sensors, and biomedical signal processing. Example instruments for cardiovascular and respiratory assessment. Clinical laboratory measurements, theraputic and prosthetic devices, and electrical safetyrequirements. Students should have background in electronics design using operational amplifiers."}, {"summer": false, "name": "Bioelectricity", "prerequisites": "Prerequisite: BME 302 or ZO 421 and a course in electrical circuits, Senior standing or Graduate standing", "spring": false, "number": "525", "fall": true, "units": " 3", "description": "Quantitative analysis of excitable membranes and their signals, including plasma membrane characteristics, origin of electrical membrane potentials, action potentials, voltage clamp experiments, the Hodgkin-Huxley equations, propagation, subthreshold stimuli, extracellular fields, membrane biophysics, and electrophysiology of the heart.  Design and development of an electrocardiogram analysis system.  Credit not given for both BME 485 and BME 585"}, {"summer": false, "name": "Digital Control Systems", "prerequisites": "Prerequisite: ECE 435 and Graduate Standing in Engineering", "spring": false, "number": "536", "fall": true, "units": " 3", "description": "Discrete system dynamics, sampled-data systems, mathematical representations of analog/digital and digital/analog conversions, open- and -closed-loop systems, input-output relationships, state-space and stability analyses, time and frequency domain analysis with emphasis on time domain.  Design and implementation of digital controllers.  Design project including hardware implementation."}, {"summer": false, "name": "Biomechanics", "prerequisites": "Prerequisite: ZO 160 or BIO 183, BME 342, ST 370", "spring": false, "number": "541", "fall": true, "units": " 3", "description": "Students study human body kinematics, force analysis of joints, and the structure and composition of biological materials. Emphasis is placed on the measurement of mechanical properties and the development and understanding of models of biological material. Credit is not allowed for both BME 441 and BME 541."}, {"summer": "True", "name": "Cardiovascular Biomechanics", "spring": "True", "number": "543", "fall": "True", "units": " 3", "description": "Engineering principles are applied to the cardiovascular system.  Anatomy of cardiovascular system; form and function of blood and blood vessels.  Electric analogs; continuum mechanics with derivation of equations of motion; and constitutive models of soft tissue mechanics, with attention to normal, diseased, and adaptive processes.  Programming project required."}, {"summer": false, "name": "Medical Imaging: Ultrasonic, Optical, and Magnetic Resonance Systems", "prerequisites": "Prerequisite: BME 412, ST 370 or ST 371, and PY 208", "spring": false, "number": "550", "fall": true, "units": " 3", "description": "Physical and mathematical foundations of ultrasonic, optical, and magnetic resonance imaging systems in application to medical diagnostics.  Each imaging modality is examined on a case-by-case basis, highlighting the following critical system characteristics: (1) underlying physics of the imaging system, including the physical mechanisms of data generation and acquisition; (2) image creation, and (3) basic processing methods of high relevance, such as noise reduction."}, {"summer": "True", "name": "Medical Device Design I", "spring": "True", "number": "551", "fall": "True", "units": " 3", "description": "Student multidisciplinary teams work with local medical professionals to define specific medical device concepts for implementation.  Medical specialty immersion with clinical departments at local medical centers; design input based on stakeholder-needs assessment' market analysis and intellectual property review; new medical devices with broad markets; design output and device specification; product feasibility and risk assessment; design for medical device manufacturing."}, {"summer": "True", "name": "Medical Device Design II", "spring": "True", "number": "552", "fall": "True", "units": " 3", "description": "Student groups build and test prototypes of devices designed in the first course of this series.  Good manufacturing practices; process validation; FDA quality system regulations; design verification and validation; regulatory approval planning; andintellectual property protection.  Students will work with local patent attorneys and/or agents to draft a patent application.  The final prototypes will be evaluated by clinicians for potential use with patients."}, {"summer": "True", "name": "Medical Imaging: X-ray, CT, and Nuclear Medicine Systems", "prerequisites": "Prerequisite: BME 311, ST 370 or ST 371, and PY 208", "spring": "True", "number": "560", "fall": "True", "units": " 3", "description": "Overview of medical imaging systems using ionizing radiation.  Interaction of radiation with matter.  Radiation production and detection.  Radiography systems and applications.  Tomography.  PET and SPECT systems and applications."}, {"summer": false, "name": "Polymeric Biomaterials Engineering", "prerequisites": "Prerequisite: PY 208 and (TE 200 or CH 220 or CH 221)and(MAE 206 or CE 214)", "spring": false, "number": "566", "fall": true, "units": " 3", "description": "In-depth study of the engineering design of biomedical polymers and implants.  Polymeric biomaterials, including polymer synthesis and structure, polymer properties as related to designing orthopedic and vascular grafts.  Designing textile products as biomaterials including surface modification and characterization techniques.  Bioresorbable polymers. Credit for TE 466 and TE 566 is not allowed."}, {"summer": false, "name": "Tissue Engineering Technologies", "prerequisites": "Prerequisite: BIT 466/566 or Permission of Instructor", "spring": false, "number": "583", "fall": true, "units": " 2", "description": "In this half-semester laboratory module, students will gain practical experience with two key elements of tissue engineering: the construction of a complex living tissue that closely resembles its natural counterpart, and the assessment of the angiogenic potential of he engineered tissue.  The effects of different biomaterials and angiogenic factors will be evaluated."}, {"summer": false, "name": "Tissue Engineering Fundamentals", "prerequisites": "Prerequisite: BIO 183 and CH 221 and (MAE 301 or MSE 301 or CHE 315 or TE 303)", "spring": true, "number": "584", "fall": false, "units": " 3", "description": "Essential concepts of organ and tissue design and engineering using living components, including cell-based systems and cells/tissues in combination with biomaterials, synthetic materials and/or devices.  In vivo tissue structure and function; isolation and culture of primary cells and stem cells; principles of cellular differentiation; mass transport processes in cell culture systems; design, production and seeding of scaffolds for 3D culture; design of bioreactors to support high-density cell growth; state-of-the-art engineered and tissue systems; clinical translation; and ethics."}, {"summer": true, "name": "Special Topics in Biomedical Engineering", "prerequisites": "Prerequisite: Senior or Graduate standing in Engineering or physical or biological sciences or textiles", "spring": true, "number": "590", "fall": true, "units": " 1-4", "description": "A study of topics in the special fields under the direction of the graduate faculty."}, {"summer": true, "name": "Special Problems in Biomedical Engineering", "prerequisites": "Prerequisite: Graduate standing in BME", "spring": true, "number": "620", "fall": true, "units": " 1-4", "description": "Selection of a subject by each student on which to do research and write a technical report on the results.  Subject may pertain to the student's particular interest in any area of study in biomedical engineering."}, {"summer": true, "name": "Internship in Biomedical Engineering", "prerequisites": "Prerequisite: Graduate standing in BME", "spring": true, "number": "650", "fall": true, "units": " 1", "description": "Students obtain professional experience through advanced engineering work in industrial and commercial settings under joint supervision of a member of the graduate faculty and an outside professional."}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "685", "fall": true, "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": true, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "693", "fall": true, "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": true, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "695", "fall": true, "units": " 1-9", "description": "Thesis research."}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "696", "fall": false, "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": false, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "699", "fall": true, "units": " 1-3", "description": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis."}, {"summer": true, "name": "Advanced Special Topics in Biomedical Engineering", "prerequisites": "Prerequisite: Graduate standing in engineering, physical, or biological sciences or textiles", "spring": true, "number": "790", "fall": true, "units": " 1-3", "description": "A study of topics in advanced or emerging special areas under the direction of the graduate faculty.  Experimental doctoral level courses."}, {"summer": false, "name": "Advanced Seminar in Biomedical Engineering", "prerequisites": "Prerequisite: Doctoral student in BME or other engineering, physical science, or biological science majors, or textiles", "spring": true, "number": "802", "fall": true, "units": " 1", "description": "Elaboration of advanced subject areas, techniques and methods related to professional interest through presentations of personal and published works; opportunity for students to present and critically defend ideas, concepts, and inferences; opportunity for distinguished scholars to present results of their work.  Discussions to uncover analytical solutions and analogies between problems in biomedical engineering and other technologies, and to present relationship of biomedical engineering to society."}, {"summer": true, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "885", "fall": true, "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning but the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": true, "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "890", "fall": true, "units": " 1-9", "description": "For students who are preparing for and taking written and/or oral preliminary exams."}, {"summer": true, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "893", "fall": true, "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": true, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "895", "fall": true, "units": " 1-9", "description": "Dissertation research."}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "896", "fall": false, "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": true, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "899", "fall": true, "units": " 1-3", "description": "For students who have completed all credit hour, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations."}]