[{"summer": "True", "name": "Fundamentals of Biomedical Sciences", "spring": "True", "number": "565", "fall": "True", "units": " 3", "description": "Introductory course for students interested in gaining a broad understanding of: comparative genomics, comparative immunology, comparative physiology, pharmacokinetics, emerging zoonotic diseases, epidemiology and translational research models and methods. This course also provides an overview of current technologies relevant to comparative biomedical research and a foundation for implementing the scientific method (e.g. experimental design, data analyses, statistics). Priority will be given tofirst-year students in CBS graduate program; Enrollment of all students requires consent of instructor."}, {"summer": "True", "name": "Methods in Biomedical Sciences", "spring": "True", "number": "570", "fall": "True", "units": " 1", "description": "Introductory course for students interested in gaining a broad understanding of various laboratory methods used in molecular, cellular and \"omics\" based biomedical research."}, {"summer": "True", "name": "Clinical Veterinary Epidemiology", "prerequisites": "Prerequisite: ST 511", "spring": "True", "number": "580", "fall": "True", "units": " 3", "description": "To expose students to the concepts and principles of epidemiology from the perspective of assessing health and disease in animal and human populations, and the measures to control disease status.  Specifically to study the principles and concepts ofveterinary epidemiology, to learn basic epidemiology methodology, critically review major veterinary care studies, and enhance oral and written communication skills."}, {"summer": "True", "name": "Special Topics", "spring": "True", "number": "595", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Seminar In Biology Of Reproduction", "prerequisites": "Prerequisite: ANS(PHY) 702", "spring": "True", "number": "602", "fall": "True", "units": " 2", "description": "Current topics in animal reproduction presented by reproductive physiologists from various Research Triangle institutions. Student presentations of research projects or library projects in area of animal reproduction."}, {"summer": "True", "name": "Special Topics In Veterinary Medical Sciences", "prerequisites": "Prerequisite: Senior standing or Graduate standing", "spring": "True", "number": "610", "fall": "True", "units": " 1-3", "description": "Designed to present new or special subject matter within the scope of pathology, veterinary microbiology, morphology or pharmacology. The studies may include independent investigations, seminars and/or formal lectures."}, {"summer": "True", "name": "Professional Conduct in Biomedical Research", "spring": "True", "number": "662", "fall": "True", "units": " 1", "description": "Plagiarism, authorship, fraud, safety, sexual harassment, IACUC, consulting agreements, serving as an expert witness, contacting elected officials, working with press, human subjects committee, and related topics."}, {"summer": "True", "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "685", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "688", "fall": "True", "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": "True", "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "689", "fall": "True", "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": "True", "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "693", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "695", "fall": "True", "units": " 1-9", "description": "Thesis research"}, {"summer": "True", "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "696", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "699", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis."}, {"summer": "True", "name": "Veterinary Histology", "prerequisites": "Prerequisite: BCH 451", "spring": "True", "number": "730", "fall": "True", "units": " 3", "description": "The structure of cells, tissues and organs of domestic animals using light microscopy."}, {"summer": "True", "name": "Applied Veterinary Anatomy I", "prerequisites": "Prerequisite: DVM", "spring": "True", "number": "731", "fall": "True", "units": " 4", "description": "Graduate veterinarian provided with detailed anatomic information relevant to surgical and medical problems in domestic carnivores. Designed for graduate veterinarians in pursuit of advanced training in areas of anatomy, physiology, surgery, radiology and pathology."}, {"summer": "True", "name": "Biological Light and Electron Microscopy:Principles and Practice", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "732", "fall": "True", "units": " 5", "description": "Principles and applications of various tools for the optical visualization of cells and tissues, with information about how to best ascertain structure-function relationships. Introduction to sample preparation for light and electron microscopy, microtomy, and the theory and utilization of transmission-and scanning electron microscopes, light microscopes and confocal laser scanning microscopes. In addition, cytochemistry, cryotechniques, immunocytochemistry, digital imaging techniques, telemedicine, and silver-based photography techniques will be covered."}, {"summer": "True", "name": "Toxicologic Pathology I", "prerequisites": "Prerequisite: DVM Majors", "spring": "True", "number": "743", "fall": "True", "units": " 3", "description": "A review of principles and practices of toxicologic pathology and a survey of common spontaneous and chemically induced lesions by organ systems with emphasis on recognition and interpretation."}, {"summer": "True", "name": "Principles Of Analytical Epidemiology", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "754", "fall": "True", "units": " 3", "description": "Principles of epidemiology related to investigation of disease involving agent-host-environment concepts. Stress on epidemiological techniques and experimental design. Main focus on descriptive, analytical and experimental epidemiology pertinent to disease etiology and prevention."}, {"summer": "True", "name": "Immunoparasitology", "prerequisites": "Prerequisite: MB 751", "spring": "True", "number": "755", "fall": "True", "units": " 2", "description": "Helminth and protozoal parasite immune evasion and immunomodulation; consequences of parasite-induced immunopathogenesis; learning from failed attempts to develop protective vaccines against protozoa and helminths."}, {"summer": "True", "name": "Molecular Technologies for Epidemiologic Investigation", "prerequisites": "Prerequisite: Introductory Epidemiology", "spring": "True", "number": "760", "fall": "True", "units": " 3", "description": "The course is designed to help students refine their ability to select and interpret molecular diagnostic technologies for epidemiologic disease surveillance and investigation."}, {"summer": "True", "name": "Principles of Pharmacology", "spring": "True", "number": "762", "fall": "True", "units": " 3", "description": "The action of drugs in animals and man including basic principles of drug disposition, pharmacokinetics, drug resistance, and signal transduction.  Modification of physiological processes by drugs influencing nervous, renal, cardiovascular, and endocrine systems and the antimicrobic and antineoplastics agents."}, {"summer": "True", "name": "Advances in Gastrointestinal Pathophysiology", "prerequisites": "Prerequisite: PHY 503, PHY 504", "spring": "True", "number": "764", "fall": "True", "units": " 3", "description": "This course will focus on advanced gastrointestinal physiology and the pathophysiology of deseases of relevance to scientsts involved in animal-related research.  In particular, the course will cover the pathophysiology of ulceration, infectious diarrhea, ischemia, motility disorders, and inflammatory diseases of the gut.  An in-depth review paper will be required based on recent literature rgarding a specific gastrointestinal disease."}, {"summer": "True", "name": "Cell Biology", "prerequisites": "Prerequisite: BCH 451, BIO 183, CH 223", "spring": "True", "number": "770", "fall": "True", "units": " 3", "description": "Advanced cell and organelle structure and function and recent advances in molecular biology. Emphasis on current literature and application of research procedures."}, {"summer": "True", "name": "Cancer Biology", "prerequisites": "Prerequisite: CBS 770", "spring": "True", "number": "771", "fall": "True", "units": " 4", "description": "A comprehensive graduate course focusing on the molecular and cellular bases of cancer.  Targets of oncogenic mutations will be discussed as well as their impact on cell proliferation, cell survival, and the invasion of normal tissues by tumorigeniccells.  State-of-the-art technologies to detect oncogenic mutations and characterize transformed cells will be discussed as well as therapeutic strategies for the rational treatment of cancer."}, {"summer": "True", "name": "Advanced Developmental Biology", "spring": "True", "number": "773", "fall": "True", "units": " 2", "description": "In-depth coverage of current concepts and new research technologies in developmental biology. Biochemical aspects of germ cell maturation and early development, molecular and genetic regulation of morphogenesis, cellular interaction for organogenesis, hormones and growth factors mediated cellular differentiation and growth, molecular basis of neoplasia apopotises and gene therapy."}, {"summer": "True", "name": "Epidemiology Of Infectious Diseases Of International Importance", "spring": "True", "number": "774", "fall": "True", "units": " 3", "description": "Discussion of infectious diseases and epidemiological principles. Stress on selected enteric, zoonotic, nosocomial diseases of worldwide importance. Consideration of population dynamic techniques related to host-vector-agent."}, {"summer": "True", "name": "Veterinary Production Epidemiology", "spring": "True", "number": "780", "fall": "True", "units": " 2", "description": "Examination of tools, limits, advantages and disadvantages specific to veterinary epidemiology and its execution.  Assessment of means of disease prevention and outbreak investigation; mathematical simulation and economics; plus monitoring and evaluation of disease control programs; use of a multiple-species orientation. Application of the above epidemiologic techniques and their roles in assisting producers, practitioners and regulators."}, {"summer": "True", "name": "Marine Mammal Medicine", "prerequisites": "Prerequisite: Graduate standing or enrollment in DVM curriculum", "spring": "True", "number": "782", "fall": "True", "units": " 2", "description": "Discussion of disease issues in free ranging and captive cetaceans, pinnipeds and marine mustelids with emphasis on species found in North American waters. Examination of anatomic, physiologic and behavioral basis of health and population managementand assessment of diagnostic and therapeutic approaches to disease in these species."}, {"summer": "True", "name": "Advanced Immunology", "prerequisites": "Prerequisite: MB (IMM) 741", "spring": "True", "number": "783", "fall": "True", "units": " 3", "description": "In depth study of the basic cellular and molecular mechanisms of immunity, including antigen processing and presentation, T cell development, initiation of the immune response, effector mechanisms, and immunological memory.  The course is designed for advanced graduate students who wish to focus on the current concepts in immunology."}, {"summer": "True", "name": "Advanced and Molecular Pharmacology", "prerequisites": "Prerequisite: CBS 762", "spring": "True", "number": "785", "fall": "True", "units": " 2", "description": "A course for graduate students providing a comprehensive investigation of current topics in Pharmacology with an emphasis on molecular and cellular approaches in lecture and discussion formats.  Faculty will introduce each subject area and students will read recent articles, present seminars, and write professional-grade papers."}, {"summer": "True", "name": "Pharmacokinetics", "prerequisites": "Prerequisite: CBS 560, working knowledge of calculus", "spring": "True", "number": "787", "fall": "True", "units": " 3", "description": "Mathematical models to describe disposition of drugs and toxic chemicals in the animal body. Areas including classic compartmental and nonlinear models as well as physiological approaches. Discussion of application of these techniques to toxicologicstudies."}, {"summer": "True", "name": "Special Topics in Clinical Pathology", "prerequisites": "Prerequisite: Those holding the DVM degree", "spring": "True", "number": "790", "fall": "True", "units": " 1-3", "description": "New, fundamental and in-depth understanding of selected topics in clinical pathology (blood coagulation, acid-base balance, hematology, cytology, and clinical chemistry).  A new topic selected each semester. Students read pertinent current journal articles and references and lead weekly discussion sessions.  Stress upon clinical spplication of this information."}, {"summer": "True", "name": "Special Topics in Comparative Biomedical Sciences", "prerequisites": "Prerequisite: Graduate Students, DVM or equivalent degree", "spring": "True", "number": "795", "fall": "True", "units": " 1-3", "description": "Special Topics in Comparative Biomedical Sciences"}, {"summer": "True", "name": "CBS Seminar", "spring": "True", "number": "800", "fall": "True", "units": " 1", "description": "Presentation and discussions on ongoing research and current topics in biomedical sciences."}, {"summer": "True", "name": "Seminar In Biology Of Reproduction", "prerequisites": "Prerequisite: ANS(PHY) 702", "spring": "True", "number": "802", "fall": "True", "units": " 2", "description": "Current topics in animal reproduction presented by reproductive physiologists from various Research Triangle institutions. Student presentations of research projects or library projects in area of animal reproduction."}, {"summer": "True", "name": "Seminar in Surgical Pathology", "prerequisites": "Prerequisite: Those holding the DVM or equivalent degree", "spring": "True", "number": "803", "fall": "True", "units": " 1", "description": "Description and interpretation of microscopic changes in tissues from diseased domestic and laboratory animals.  Students attend and participate in a one-hour weekly seminar where microscopic lesions described, interpreted and discussed."}, {"summer": "True", "name": "Seminar in Necropsy Pathology", "prerequisites": "Prerequisite: Those holding the DVM or equivalent degree", "spring": "True", "number": "804", "fall": "True", "units": " 1", "description": "Description and interpretation of gross changes in tissues from diseased domestic animals.  Students attend daily (M-F) 15-to 30-minute review of necropsy lesions presented by a member of the graduate staff."}, {"summer": "True", "name": "Seminar in Veterinary Microbiology/Immunology", "spring": "True", "number": "807", "fall": "True", "units": " 1", "description": "Presentation of ongoing research and current topics in microbiology."}, {"summer": "True", "name": "Special Topics", "prerequisites": "Prerequisite: Senior standing or Graduate standing", "spring": "True", "number": "810", "fall": "True", "units": " 1-3", "description": "Designed to present new or special subject matter within the scope of pathology, veterinary microbiology, morphology or pharmacology. The studies may include independent investigations, seminars and/or formal lectures."}, {"summer": "True", "name": "Special Topics Pathology", "prerequisites": "Prerequisite: Those holding the DVM degree", "spring": "True", "number": "812", "fall": "True", "units": " 1-4", "description": "Specific topics of study assigned in various laboratories involved in veterinary microbiology investigation.  Students conduct in-dept studies of assigned problem areas."}, {"summer": "True", "name": "Special Topics Laboratory Pharmology", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "813", "fall": "True", "units": " 1-3", "description": "Involvement in practical participation in the normal research activities of different laboratories working in pharmacological research.  Students pursue a semi-independent project."}, {"summer": "True", "name": "Advanced Topics in Virology", "prerequisites": "Prerequisite: VMM 924 or MB 718", "spring": "True", "number": "815", "fall": "True", "units": " 1", "description": "Selected topics of current interest in virology.  A new topic selected each time course is offered to keep the advanced gradute students up to date on the most recent developments in these fields."}, {"summer": "True", "name": "Advanced Topics In Immunology", "prerequisites": "Prerequisite: MB 751", "spring": "True", "number": "816", "fall": "True", "units": " 1", "description": "Selected topics of current interest in immunology.  A different topic will be covered each semester to focus on the most recent developments in the field."}, {"summer": "True", "name": "Advanced Topics In Zoological Medicine I", "prerequisites": "Prerequisite: Graduate standing or enrollment in DVM curriculum", "spring": "True", "number": "817", "fall": "True", "units": " 2", "description": "Selected topics of current interest in clinical zoological medicine focused on marine mammals, fish, reptiles, amphibians, waterfowl, ratites, raptors and medical issues in free-ranging wildlife. Review of current clinical and basic science literature, student-lead discussion sessions and participation in faculty-lead discussions."}, {"summer": "True", "name": "Advanced Topics in Zoological Medicine", "prerequisites": "Prerequisite: Graduate standing or enrollment in DVM curriculum", "spring": "True", "number": "818", "fall": "True", "units": " 2", "description": "This course provides breadth and depth of knowledge in zoological medicine to prepare Zoological Medicine residents to pass American College of Zoological Medicine (ACZM) boards.  Veterinary students are exposed to more in depth information related to zoological medicine than covered in their core curriculum.  Each Fall (CBS 817) and Spring (CBS 818) semesters, different aspects of zoological medicine are covered.  Topics rotate every 3 years so that all major groups of animals within the sub-groups, avian, aquatic, herptile, wildlife, and zoo are addressed."}, {"summer": "True", "name": "Special Problems", "spring": "True", "number": "820", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Techniques in Pharmacological Research", "prerequisites": "Prerequisite: BCH 452B or CH 315 and Graduate standing", "spring": "True", "number": "860", "fall": "True", "units": " 2", "description": "Theory and applications of modern scientific instrumentation to analysis of tissues, body fluids and drugs in pharmacological research. Discussion of appropriate aspects of the pharmacological use of spectroscopy, microscopy, chromatography, electrophoresis, radioisotope usage and centrifugation."}, {"summer": "True", "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "885", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "One Health: From Philosophy to Practice", "spring": "True", "number": "886", "fall": "True", "units": " 2", "description": "Graduate/professional seminar (with team project) addressing intersections of veterinary medicine, human medicine, and environmental health.  Co-listed at UNC CH Gillings School of Global Public Health and Duke University School of Medicine.  Includes participants from these three institutions, plus related private-sector members, non-governmental organizations, and government professionals.  Its purpose is to facilitate understanding of one health as a system of systems, and promote cross-campus and cross-discipline interactions.  Weekly evening course held at NC Biotechnology Center, RTP. Requires graduate student standing at NCSU or professional student standing within the College of Veterinary Medicine.   Limit: 15 students per university."}, {"summer": "True", "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "890", "fall": "True", "units": " 1-9", "description": "For students who are preparing for and taking written and/or oral preliminary exams."}, {"summer": "True", "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "893", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "895", "fall": "True", "units": " 1-9", "description": "Dissertation research."}, {"summer": "True", "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "896", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "899", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hour, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations."}]