[{"summer": "True", "name": "Chemical Process Principles", "prerequisites": "Prerequisite: Grade of C- or better in MA 241, PY 205, and (CH 201 or CH 221)", "spring": "True", "number": "205", "fall": "True", "units": " 4", "description": "Engineering methods of treating material balances, stoichiometry, phase equilibrium calculations, thermophysics, thermochemistry and the first law of thermodynamics. Introduction to equation solving packages and spreadsheets for solving problems related to chemical engineering calculations."}, {"summer": "True", "name": "Introduction to Chemical Engineering Analysis", "prerequisites": "Prerequisite: C- or better in CHE 205 and MA 242; Corequisite: MA 341", "spring": "True", "number": "225", "fall": "True", "units": " 3", "description": "Introduction of mathematical and computational tools for analyzing chemical engineering problems.  Sequential modular and equation-based simulation of steady-state chemical processes using advanced spreadsheet methods and multivariate root-finding algorithms.  Material and energy balances on transient processes and their solution using analytical and numerical methods.  Introduction to microscopic material and energy balances using the \"shell balance\" approach to develop the governing differential equations.  Solutions to steady-state boundary value problems in heat conduction and Fickian diffusion."}, {"summer": "True", "name": "Transport Processes I", "prerequisites": "Prerequisite: Grade of C- or better in both CHE 225 and MA 341", "spring": "True", "number": "311", "fall": "True", "units": " 3", "description": "Fundamental aspects of momentum and heat transfer, and the use of  these fundamentals in solving problems in transport operations."}, {"summer": "True", "name": "Transport Processes II", "prerequisites": "Prerequisite: Grade of C- or better in CHE 311", "spring": "True", "number": "312", "fall": "True", "units": " 3", "description": "Fundamental aspects of mass transfer and the use of these basic principles in solving problems in  transport operations."}, {"summer": "True", "name": "Chemical Process Thermodynamics", "prerequisites": "Prerequisite: Grade of C- or better in CHE 225", "spring": "True", "number": "315", "fall": "True", "units": " 3", "description": "Laws of thermodynamics and their application to chemical engineering problems, both in theory and in practice. Criteria of equilibrium in physical and chemical  changes. Behavior of real fluids, including mixtures."}, {"summer": "True", "name": "Thermodynamics of Chemical and Phase Equilibria", "prerequisites": "Prerequisite: Grade of C- or better in CHE 315", "spring": "True", "number": "316", "fall": "True", "units": " 3", "description": "Systematic study of chemical reaction equilibria and phase equilibria. Use of fugacity, activity and chemical potential concepts for predicting the effect of such variables as temperature, pressure on equilibrium compositions. Methods for measuring and estimating thermodynamic properties important to equilibrium calculation in real systems."}, {"summer": "True", "name": "Chemical Engineering Lab I", "prerequisites": "Prerequisite: CHE 311", "spring": "True", "number": "330", "fall": "True", "units": " 4", "description": "Laboratory experiments in unit operations of heat transfer and fluid flow. Laboratory safety, technical report  writing, statistics, experimental design, error analysis and instrumentation."}, {"summer": "True", "name": "Chemical Engineering Lab II", "prerequisites": "Prerequisite: CHE 312, CHE 330", "spring": "True", "number": "331", "fall": "True", "units": " 2", "description": "Laboratory experiments in mass transfer and reaction kinetics.  Experimental planning, technical report writing and oral presentations are emphasized."}, {"summer": "True", "name": "Professional Development Seminar", "spring": "True", "number": "395", "fall": "True", "units": " 1", "description": "Professional development and topics of current interest in chemical engineering."}, {"summer": "True", "name": "Process Systems Analysis and Control", "prerequisites": "Prerequisite: (MA 341 and TE 205) or CHE 312", "spring": "True", "number": "435", "fall": "True", "units": " 3", "description": "Dynamic analysis and continuous control of chemical and material engineering processes. Process modeling; stability analysis, design and selection of control schemes. Solution of differential equations using Laplace transform techniques."}, {"summer": "True", "name": "Design and Analysis of Chemical Reactors", "prerequisites": "Prerequisite: CHE 316", "spring": "True", "number": "446", "fall": "True", "units": " 3", "description": "Characterization and measurement of the rates of homogeneous and heterogeneous reactions. Design and analysis of chemical reactors. Credit cannot be received for both CHE 446 and CHE 546."}, {"summer": "True", "name": "Bioreactor Engineering", "prerequisites": "Prerequisite: BCH 451, CHE 312, CHE 316", "spring": "True", "number": "447", "fall": "True", "units": " 3", "description": "Design and analysis of chemical reactors with emphasis on enzyme-catalyzed reactions, microbial fermentation, and animal cell culture.  Empirical kinetics of enzymatic reactions and cell growth.  Design and scale-up of suspension bioreactors.  Immobilized-enzyme and immobilized-cell bioreactors, including the classical Thiele reaction-diffusion analysis."}, {"summer": "True", "name": "Chemical Engineering Design I", "prerequisites": "Prerequisite: CHE 312", "spring": "True", "number": "450", "fall": "True", "units": " 3", "description": "Applications of cost accounting, cost estimation for new equipment, manufacturing cost and measures of  profitability. Use of computer simulation design and cost programs. Procedures for sizing unit operations commonly encountered in the chemical process industry. Heuristics for selection of separation processes and heat exchanger network synthesis."}, {"summer": "True", "name": "Chemical Engineering Design II", "prerequisites": "Prerequisite: CHE 450, and (CHE 446 or CHE 447)", "spring": "True", "number": "451", "fall": "True", "units": " 3", "description": "Chemical process design and optimization. The interplay of economic and technical factors  in process development, site selection, project design, and production management. Comprehensive design problems."}, {"summer": "True", "name": "Polymer Technology and Engineering", "prerequisites": "Prerequisite: MSE 380", "spring": "True", "number": "455", "fall": "True", "units": " 3", "description": "This course will cover commercial polymers, polymer blends and miscibility, dynamic mechanical behavior, Boltzmann superposition principle, ultimate properties of polymers, polymer rheology and processing, recycling and design and selection of polymeric materials.  Guest instructors from industry will give presentations on contemporary topics in polymer technology and engineering.  Field trips are required."}, {"summer": "True", "name": "Nano-Electronic Materials", "prerequisites": "Prerequisite: CHE 311 and CHE 315", "spring": "True", "number": "460", "fall": "True", "units": " 3", "description": "Plasma and thermal inorganic chemical processes in semiconductor device fabrication.  Thin films and electronic devices.  Kinetics and chemical transport in electronic materials synthesis, modification and etching. Plasma physics and chemistry, reactors and process diagnostics. Credit for both CHE 460 and CHE 760 is not allowed."}, {"summer": "True", "name": "Polymer Sciences and Technology", "prerequisites": "Prerequisite: CH 223, CHE 316", "spring": "True", "number": "461", "fall": "True", "units": " 3", "description": "Concepts and techniques for polymerization of macromolecules.  Structure, properties, and applications of commercially important polymers."}, {"summer": "True", "name": "Fundamentals of Bio-Nanotechnology", "prerequisites": "Prerequisite: MA 241, PY 208, CH 223", "spring": "True", "number": "462", "fall": "True", "units": " 3", "description": "Concepts of nanotechnology are applied in the synthesis, characterization, recognition and application of biomaterials on the nanoscale.  Emphasis will be given to hands-on experience with nanostructured biomaterials; students will also be familiarized with the potential impact of these materials on different aspects of society and potential hazards associated with their preparation and application."}, {"summer": "True", "name": "Colloidal and Nanoscale Engineering", "spring": "True", "number": "462", "fall": "True", "units": " 3", "description": "The first part of this course will present the fundamentals of nanoscale colloidal processes, including interactions and self-assembly of particles, surfactants and biomolecules.  The applications of these fundamentals to the nanotechnology and engineering on the nanoscale will be discussed.  The nanoscience has led to the development of many new technologies with relevance to chemical engineering, including microfluidics, lab-on-a-chip, bioarrays and bioassays.  These emerging technologies will be presented and discussed in the second half of this course."}, {"summer": "True", "name": "Fermentation of Recombinant Microorganisms", "prerequisites": "Prerequisite: CH 223 and Corequisite: (BEC 320 or BIT 410 or BCH 452 or MB 352)", "spring": "True", "number": "463", "fall": "True", "units": " 2", "description": "Introduction to fermentation and protein chemistry.  Theory behind laboratory techniques and overview of industrial scale expression systems.  Laboratory sessions involve use of microbial expression vectors, fermentation systems, and large-scale purification of recombinant protein.  Half semester course, first part."}, {"summer": "True", "name": "Protein Purification", "prerequisites": "Prerequisite: BIT 410 or BIT 510 or BCH 454", "spring": "True", "number": "464", "fall": "True", "units": " 2", "description": "Comparison of several different chromatography techniques for protein purification.  Construction of purification tables and SDS-and native-PAGE analysis.  Cost-benefit analysis of industrial-scale procedures.  Half semester course, second part."}, {"summer": "True", "name": "Colloidal and Nanoscale Engineering", "spring": "True", "number": "465", "fall": "True", "units": " 3", "description": "The first part of this course will present the fundamentals of nanoscale colloidal processes, including interactions and self-assembly of particles, surfactants and biomolecules.  The applications of these fundamentals to the nanotechnology and engineering on the nanoscale will be discussed.  The nanoscience has led to the development of many new technologies with relevance to chemical engineering, including microfluidics, lab-on-a-chip, bioarrays and bioassays.  These emerging technologies will be presented and discussed in the second half of this course."}, {"summer": "True", "name": "Polymer Rheology", "prerequisites": "Prerequisite: CHE 311", "spring": "True", "number": "467", "fall": "True", "units": " 3", "description": "Theoretical principles and experimental techniques associated with flow and deformation of polymer systems.  Systems include: meffs and solutions, suspension, gels, emulsions, and thixotropic materials."}, {"summer": "True", "name": "Advances in Pollution Prevention: Environmental Management for the Future", "prerequisites": "Prerequisite: PY 208, MA 341", "spring": "True", "number": "475", "fall": "True", "units": " 3", "description": "Design of industrial processes which minimize or eliminate wastes.  Regulations and the corporate organization of current pollution prevention efforts.  Current pollution prevention research.  Product life cycle analysis and the application to design of more efficient processes."}, {"summer": "True", "name": "Animal Cell Culture Engineering", "spring": "True", "number": "488", "fall": "True", "units": " 2", "description": "Design and operation of animal cell culture bioreactors for therapeutic protein production. Topics include: batch, fed-batch and perfusion bioreactors. agitation and aeration for mixing and oxygen mass transfer, bioreactor monitoring and control, optimizing bioreactor performance, and single-use (disposal) bioreactors. This is a half-semester course."}, {"summer": "True", "name": "Honors Thesis Preparation", "prerequisites": "Prerequisite: CHE 497, Senior standing", "spring": "True", "number": "495", "fall": "True", "units": " 1", "description": "Development and presentation of Honors Thesis in Chemical Engineering and discussion of graduate school selection and preparation."}, {"summer": "True", "name": "Chemical Engineering Projects I", "prerequisites": "Prerequisite: Junior standing", "spring": "True", "number": "497", "fall": "True", "units": " 3", "description": "Introduction to chemical engineering research through experimental, theoretical and  literature studies. Oral and written presentation of reports."}, {"summer": "True", "name": "Chemical Engineering Projects II", "prerequisites": "Prerequisite: Junior standing", "spring": "True", "number": "498", "fall": "True", "units": " 1-3", "description": "Projects in research, design or development in various areas of chemical  engineering."}, {"summer": "True", "name": "Process System Analysis and Control", "prerequisites": "Prerequisite: CHE 312", "spring": "True", "number": "525", "fall": "True", "units": " 3", "description": "Dynamic analysis and continuous control of chemical engineering processes.  Process modeling; stability analysis, design and selection of control schemes.  Solution of differential equations using Laplace transform techniques. Credit for both CHE 425 and CHE 525 is not allowed."}, {"summer": "True", "name": "Polymer Science and Technology", "prerequisites": "Prerequisite: CHE 223, CHE 316", "spring": "True", "number": "543", "fall": "True", "units": " 3", "description": "Concepts and techniques for polymerization of macromolecules. Structure, properties, and applications of commercially important polymers."}, {"summer": "True", "name": "Design and Analysis of Chemical Reactors", "prerequisites": "Prerequisite: CHE 316", "spring": "True", "number": "546", "fall": "True", "units": " 3", "description": "Characterization and measurement of rates of homogeneous and heterogeneous reactions.  Design and analysis of chemical reactors. Credit for both CHE 446 and CHE 546 is not allowed."}, {"summer": "True", "name": "Biochemical Engineering", "prerequisites": "Prerequisite: CHE 312 and (CHE 446 or CHE 447)", "spring": "True", "number": "551", "fall": "True", "units": " 3", "description": "Enzyme and microbial kinetics and reactor designs for processes involving enzymes and single and mixed cultures. Samples drawn from full range of applications: food processing, single cell proteins, tissue culture and vaccines, monoclonal antibodies, recombinant DNA and hybridomas, artificial organs, biological waste treatment and environmental processes."}, {"summer": "True", "name": "Chemical Processing Of Electronic Materials", "prerequisites": "Prerequisite: CHE 312 and CHE 446", "spring": "True", "number": "560", "fall": "True", "units": " 3", "description": "Plasma and thermal inorganic chemical processes in semiconductor device fabrication. Thin films and electronic devices. Kinetics and chemical transport in electronic materials synthesis, modification and etching. Plasma physics and chemistry, reactors and process diagnostics. Credit for both CHE 460 and CHE 560 is not allowed."}, {"summer": "True", "name": "Fermentation of Recombinant Microorganisms", "spring": "True", "number": "563", "fall": "True", "units": " 2", "description": "Introduction to fermentation and protein chemistry.  Theory behind laboratory techniques and overview of industrial scale expression systems.  Laboratory session sinvolve use of microbial expression vectors, fermentation systems, and large-scale purification of recombinant protein.  Half semester course, first part."}, {"summer": "True", "name": "Advances in Pollution Prevention:  Environmental Management", "prerequisites": "Prerequisite: PY 208, MA 341", "spring": "True", "number": "575", "fall": "True", "units": " 3", "description": "Design of industrial processes which minimize or eliminate wastes.  Regulations and the corporate organization of current pollution prevention efforts.  Current pollution prevention research.  Product life cycle analysis and the application to design of more efficient processes. Credit will not be given for CHE 475 and CHE 575."}, {"summer": "True", "name": "Advanced Biomanufacturing and Biocatalysis", "prerequisites": "Graduate standing in engineering or life-science graduate program", "spring": "True", "number": "577", "fall": "True", "units": " 3", "description": "Overview of biomanufacturing using microorganisms (bacteria, yeast, fungi), eukaryotic cells (hybridomas, insect, plant, CHO) and recombinant enzymes focusing on methods used in industry.  Course will emphasize process design for optimization of heterologous protein expression, metabolic/cell line engineering, metabolomics, protein engineering to alter enzymes and antibodies.  Pathway engineering strategies include developing microbes to produce new therapeutic compounds or overproduce primary metabolites, antibiotics, biotherapeutics, therapeutic enzymes, diagnostics, recombinant vaccines, and biopharmaceuticals.  Utilization of immobilized biocatalysts, and microbial kinetics are covered."}, {"summer": "True", "name": "Special Topics in Chemical Engineering", "spring": "True", "number": "596", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Chemical Engineering Projects", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "597", "fall": "True", "units": " 1-3", "description": "Independent study of some phase of chemical engineering or related field."}, {"summer": "True", "name": "Seminar", "spring": "True", "number": "601", "fall": "True", "units": " 1", "description": "Weekly seminars on topics of current interest given by resident faculty members, graduate students and visiting lecturers."}, {"summer": "True", "name": "Special Topics", "spring": "True", "number": "610", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "685", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "688", "fall": "True", "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": "True", "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "689", "fall": "True", "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": "True", "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "690", "fall": "True", "units": " 1-6", "description": "For students in non-thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam."}, {"summer": "True", "name": "Master's Supervised Reasearch", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "693", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "695", "fall": "True", "units": " 1-9", "description": "Thesis research."}, {"summer": "True", "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "696", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"prerequisites": "Prerequisite: Graduate standing in CHE", "description": "Independent study of some phase of chemical engineering or related field.", "number": "697", "name": "Advanced Chemical Engineering Projects"}, {"summer": "True", "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "699", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis."}, {"summer": "True", "name": "Introduction to Chemical Engineering Research", "spring": "True", "number": "701", "fall": "True", "units": " 2", "description": "Introduction to graduate research guidelines and practices.  Topics include research ethics, electronic literature searching, research proposal structure, technical writing styles, research problem identification, advisor expectations, intellectual property and patents, laboratory notebooks, proposal creation and oral presentation. Graduate standing in chemical engineering or permission of instructor."}, {"summer": "True", "name": "Chemical Engineering Research Proposition", "prerequisites": "Prerequisite: CHE 701", "spring": "True", "number": "702", "fall": "True", "units": " 2", "description": "Preparation of a professional quality chemical engineering research proposal.  Includes selecting a novel research topic, drafting and finalizing the proposal according to NSF formats, and orally presenting and defending the proposal to a faculty advisory committee.  Ethics in proposal preparation."}, {"summer": "True", "name": "Chemical Engineering Process Modeling", "prerequisites": "Prerequisite: (CHE 312, MA 301 or MA 341) or equivalent", "spring": "True", "number": "711", "fall": "True", "units": " 3", "description": "Applications of methods of mathematical analysis to formulation and solution of problems in transport phenomena, process dynamics and chemical reaction engineering."}, {"summer": "True", "name": "Thermodynamics I", "prerequisites": "Prerequisite: CHE 316 or equivalent", "spring": "True", "number": "713", "fall": "True", "units": " 3", "description": "In-depth coverage of chemical engineering thermodynamics principles. Application of non-ideal fluid-phase chemical potentials to problems in phase and chemical reaction equilibria. Relations of molecular structure and intermolecular forces to macroscopic thermodynamic properties."}, {"summer": "True", "name": "Transport Phenomena", "prerequisites": "Prerequisite: CHE 311 or equivalent", "spring": "True", "number": "715", "fall": "True", "units": " 3", "description": "A theoretical unified study of transport of momentum, energy and matter. Introduction to diffusional operations including coupled heat and mass transfer in light of the theory."}, {"summer": "True", "name": "Chemical Reaction Engineering", "prerequisites": "Prerequisite: CHE 446 or CHE 447 or equivalent", "spring": "True", "number": "717", "fall": "True", "units": " 3", "description": "Rates and mechanisms of homogeneous and heterogeneous reactions. Design, analysis and scale-up of batch and continuous chemical reactors."}, {"summer": "True", "name": "Advanced Chemical Reaction Engineering", "prerequisites": "Prerequisite: CHE 717", "spring": "True", "number": "718", "fall": "True", "units": " 3", "description": "Topics relating to design, analysis and operation of homogeneous and heterogeneous chemical reactors."}, {"summer": "True", "name": "Electrochemical Systems Analysis", "prerequisites": "Prerequisite: CHE 715, 717", "spring": "True", "number": "719", "fall": "True", "units": " 3", "description": "Electrochemical thermodynamics, electrochemical kinetics and catalysis, coupled charge and material transport in an electric field and electrophoretic effects. Design and analysis of electrochemical reactors. Survey of electrochemical industry."}, {"summer": "True", "name": "Separation Processes For Biological Materials", "prerequisites": "Prerequisite: CHE 721 or CHE 551", "spring": "True", "number": "752", "fall": "True", "units": " 3", "description": "Definition and engineering analysis of major bioseparation techniques useful in product isolation and purification. Solid-liquid separation, crystallization, filtration, extraction, chromatography, membrane processes, distillation, drying, combined operations and process economics."}, {"summer": "True", "name": "Polymer Blends and Alloys", "prerequisites": "Prerequisite: CHE 316 or MAT 301", "spring": "True", "number": "761", "fall": "True", "units": " 3", "description": "Thermodynamics, morphological characteristics and properties of multiphase polymer systems composed of homopolymers or copolymers.  Interfacial characteristics and modification of multicomponent polymer blends through emulsification and reactive blending.  Microphase ordering in block copolymers, and emerging technolgies employing these nanostructured materials.  Conformational properties and dynamics of macromolecules constrained near an interface."}, {"summer": "True", "name": "Multi-Scale Modeling of Matter", "prerequisites": "Prerequisite: Graduate level thermodynamics, and differential and integral calculus", "spring": "True", "number": "775", "fall": "True", "units": " 3", "description": "Current methods for modeling liquids, soft matter (polymers, surfactant solutions, colloids, liquid crystals, etc), nano-structured materials (nanoparticles, nano-composites, nano-porous materials, etc.), biomolecular systems, and reacting systems at the electronic, atomistic, meso-scale and continuum levels.  Graduate level thermodynamics and differential and integral calculus required."}, {"summer": "True", "name": "Special Topics In Chemical Engineering", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "796", "fall": "True", "units": " 1-3", "description": "Directed reading of chemical engineering literature, introduction to research methodology, and lectures and seminar discussion on topics which vary from term to term."}, {"summer": "True", "name": "Chemical Engineering Projects", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "797", "fall": "True", "units": " 1-3", "description": "Independent study of some phase of chemical engineering or related field."}, {"summer": "True", "name": "Advanced Chemical Engineering Projects", "prerequisites": "Prerequisite: Graduate standing in CHE", "spring": "True", "number": "798", "fall": "True", "units": " 1-3", "description": "Independent study of some phase of chemical engineering or related field."}, {"summer": "True", "name": "Seminar", "spring": "True", "number": "801", "fall": "True", "units": " 1", "description": "Weekly seminars on topics of current interest given by resident faculty members, graduate students and visiting lecturers."}, {"summer": "True", "name": "Special Topics", "spring": "True", "number": "810", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "885", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "890", "fall": "True", "units": " 1-9", "description": "For students who are preparing for and taking written and/or oral preliminary exams."}, {"summer": "True", "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "893", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "895", "fall": "True", "units": " 1-9", "description": "Dissertation research."}, {"summer": "True", "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "896", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "899", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hour, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations."}]