[{"summer": "True", "name": "Public Speaking", "spring": "True", "number": "110", "fall": "True", "units": " Performing Arts", "description": "Research skills, topic selection, speech organization, skills in speech delivery. Listening for analysis and evaluation of in-class speech presentation."}, {"summer": true, "name": "Interpersonal Communication", "spring": true, "number": "112", "fall": true, "units": " 3", "description": "Interpersonal communication competence: self-concept, self-disclosure, active listening, verbal and nonverbal communication, and conflict management."}, {"summer": false, "name": "Communication Media in a Changing World", "prerequisites": "Credit is not allowed for both COM 200 and COM 250", "spring": true, "number": "200", "fall": true, "units": " 3", "description": "Communication in a Changing World traces the evolution of media from prehistory to today.  The course examines the place and influence of the major media companies that control to an unrealized extent both access to, and the content of, the contemporary mediascape.  The course challenges students to examine their use of media from cellphone, to computer, music and gaming platforms."}, {"summer": true, "name": "Introduction to Persuasion Theory", "spring": true, "number": "201", "fall": true, "units": " 3", "description": "Impacts of persuasive communication on attitudes and behavior. Uses humanistic and social scientific theories to explain the persuasive process."}, {"summer": false, "name": "Small Group Communication", "spring": true, "number": "202", "fall": true, "units": " 3", "description": "Theory and practice of effective communication in small groups, including: stages of group development, role emergence, leadership functions, decision making strategies, conflict management, and the significance of power."}, {"summer": false, "name": "Argumentation and Advocacy", "spring": true, "number": "211", "fall": true, "units": " 3", "description": "Theory-based analysis of public argument in specialized settings of law, politics, academic debate, business and organizations, and interpersonal relations."}, {"summer": true, "name": "Introduction to Public Relations", "spring": true, "number": "226", "fall": true, "units": " 3", "description": "Public relations as a communication function of organizations. Public relations process, principles, history, and practice. Analysis of environmental, organizational, communication, and audience influences on public relations practice; career opportunities."}, {"summer": false, "name": "Introduction to Communication Theory", "prerequisites": "Prerequisite: Communication Majors", "spring": true, "number": "230", "fall": true, "units": " 3", "description": "Micro- and macro-analytic theories used in the study of human communication: perspectives and assumptions of major theories; utility and application of major theories; contexts, cultures, and media."}, {"summer": false, "name": "Communication Inquiry", "prerequisites": "Prerequisite: Communication Majors", "spring": true, "number": "240", "fall": true, "units": " 3", "description": "Qualitative and quantitative methods of inquiry in communication:  types of questions; strategies for answering questions; nature of evidence; advantages and disadvantages of different methods; reference tolls in the field; and channels of distribution for research-based information."}, {"summer": false, "name": "Communication and Technology", "prerequisites": "Prerequisite: Communication Majors. Credit is not allowed for both COM 250 and COM 200", "spring": true, "number": "250", "fall": true, "units": " 3", "description": "Examination of past and current intersections of technology, culture, and communication.  Implications for future intersections.  Impact of technology and communication policy.  Methods of message evaluation.  Exposure to technology applications in the discipline.  Basic technology skills for the competent communicator.  Practical experience in interactive communication technology."}, {"summer": false, "name": "Media History and Theory", "prerequisites": "Prerequisite: COM 230", "spring": true, "number": "257", "fall": true, "units": " 3", "description": "Historical development and social implications of telecommunications, print, photography, film, broadcasting, and computer-mediated communication.  Theoretical and methodological approaches to the field of communication media: media history; media economics and policy; media effects and power; media as producers of meaning; media audiences; media technologies; and roles of the media in social, cultural, and political change."}, {"summer": true, "name": "Electronic Media Writing: Theory and Practice", "prerequisites": "Prerequisite: COM 230", "spring": true, "number": "267", "fall": true, "units": " 3", "description": "Media writing as a social practice. Roles of writing and writers in media production processes.  Social, political, economic, and professional conditions that enable or constrain writing and the writer.  Specific media writing genres and formats.  Research and preparation for media writing.  Students write research-based scripts for news, commentary, and fictional genres in radio, television, film, and emerging media."}, {"summer": false, "name": "Communication Internship-Non-Local", "prerequisites": "Prerequisite: Communication Majors", "spring": true, "number": "296", "fall": false, "units": " 1", "description": "Non-local directed work experience for Communication majors with supervision from the work site and the University. COM 296 may be taken more than once only with the permission of the Internship Director and the Assoc. Dept. Head."}, {"summer": false, "name": "Special Projects in Communication", "spring": true, "number": "298", "fall": true, "units": " 1-3", "description": "A special projects course  to be utilized for guided research or experimental classes at the sophomore level, topic determined by instructor."}, {"summer": false, "name": "Presentational Speaking", "prerequisites": "Prerequisite: COM 110", "spring": true, "number": "301", "fall": true, "units": " 3", "description": "Design, organization and delivery of oral presentations for policy determination, policy implementation, and sales."}, {"summer": false, "name": "Managing Meetings", "spring": false, "number": "302", "fall": true, "units": " 3", "description": "Rules and customs of meetings in committees, assemblies and organizations; meeting management and group leadership; parliamentary motions and strategies."}, {"summer": false, "name": "Digital Audio Production", "prerequisites": "Prerequisite: COM 267", "spring": true, "number": "307", "fall": true, "units": " 3", "description": "Basic principles of digital audio production, including studio operation, performing, writing and producing."}, {"summer": false, "name": "Advanced Audio Production", "prerequisites": "Prerequisite: COM 307", "spring": true, "number": "314", "fall": false, "units": " 3", "description": "Advanced multichannel techniques for audio  production. Studio acoustics, audio signal processing, and advanced microphone techniques, writing, and performing."}, {"summer": false, "name": "Phonetics", "spring": true, "number": "315", "fall": false, "units": " 3", "description": "Articulatory and acoustic phonetics; application of  the International Phonetic Alphabet with vocal and ear training."}, {"summer": false, "name": "Public Relations Writing", "prerequisites": "Prerequisite: COM 226 and ENG 316", "spring": true, "number": "316", "fall": true, "units": " 3", "description": "Communication processes and procedures of public relations programs.  Media techniques, preparation of materials, channels of distribution."}, {"summer": false, "name": "Television Production", "prerequisites": "Prerequisite: COM 267", "spring": true, "number": "317", "fall": true, "units": " 3", "description": "Basic techniques of television studio production, including producing, writing, directing and electronic graphics production."}, {"summer": "True", "name": "Survey of Rhetorical Theory", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": "True", "number": "321", "fall": "True", "units": " 3", "description": "Principles of rhetorical theory from its classical origins through the modern period to the present time.  Key concepts and theories that provide a critical understanding of the processes of persuasive symbol use."}, {"summer": false, "name": "Nonverbal Communication", "prerequisites": "Prerequisite: COM 112", "spring": true, "number": "322", "fall": true, "units": " 3", "description": "Theory and  research in nonverbal communication, including: environment; space; physical appearance, movement; eyes and facial expressions; and vocal cues. Nonverbal communication in personal, workplace and cross-cultural setting."}, {"summer": false, "name": "Anatomy and Physiology of Speech", "spring": false, "number": "325", "fall": true, "units": " 3", "description": "Anatomy and physiology of the speech mechanism including the muscular, skeletal, and nervous system structures  involved in respiration, phonation, and articulation."}, {"summer": false, "name": "Critical Analysis of Communication Media", "prerequisites": "Prerequisite: COM 240 and COM 257, Corequisite: COM 240", "spring": true, "number": "327", "fall": true, "units": " 3", "description": "Theoretical frameworks, methods, and aims of various approaches to critical analysis of the media.  Critiques of power over media production; social biases of informational, fictional, and hybrid media content; and historical forms of audiences and the public.  Critical awareness of the media's effects in politics, public culture, and everyday life."}, {"summer": false, "name": "Relational Communication", "prerequisites": "Prerequisite: COM 112", "spring": true, "number": "332", "fall": true, "units": " 3", "description": "Communication patterns in the development and deterioration of interpersonal relationships. Functional and dysfunctional communication behaviors in family relationships."}, {"summer": false, "name": "Language Development", "spring": false, "number": "335", "fall": true, "units": " 3", "description": "Syntactic, semantic, morphologic, and pragmatic development from birth through adolescence. The influence of cognitive and social development on language development. First language acquisition versus second language learning."}, {"summer": false, "name": "Newsletter Writing and Production", "spring": true, "number": "336", "fall": true, "units": " 3", "description": "Newsletters are an important part of the corporate, non-profit, government, and small business portfolio of communication tools. Just about all organizations use newsletters - print or electronic - to reach their audiences with their key messages. Many young public relations practitioners start their careers working on newsletters for their organization or their clients. Students in this course will work collaboratively to write and produce a newsletter as well as other public relations publications."}, {"summer": false, "name": "Interviewing", "prerequisites": "Prerequisite: Junior standing.", "spring": true, "number": "342", "fall": true, "units": " 3", "description": "Theory and practice of effective communication skills applied in various types of professional interviews. In-class interviewing."}, {"summer": false, "name": "Film Production", "prerequisites": "Prerequisite: COM 267", "spring": false, "number": "344", "fall": true, "units": " 3", "description": "Principles of cinematography, production, and editing technologies for film.  Script, shoot, and edit short 16mm films.  Post-production on digital non-linear editing systems.  Critical analysis of production of classic and contemporary feature films."}, {"summer": false, "name": "Case Studies in Public Relations", "prerequisites": "Prerequisite: COM 226 and COM 230", "spring": true, "number": "346", "fall": true, "units": " 3", "description": "Application of theory, principles, and problem-solving techniques used in public relations to organizational case studies."}, {"summer": false, "name": "Digital Video Production", "prerequisites": "Prerequisite: COM 267", "spring": true, "number": "357", "fall": true, "units": " 3", "description": "Principles of producing, directing, and editing techniques for digital video.  Students script, storyboard, shoot, and edit short video projects."}, {"summer": false, "name": "Communication and Gender", "prerequisites": "Prerequisite: Junior standing, COM 112", "spring": true, "number": "362", "fall": true, "units": " 3", "description": "Effects of gender on the interpersonal communication process.  Construction of gendered identities via communication practices.  Examination of theories of gender and the role of gender in organizational, institutional, and media communication practices."}, {"summer": "True", "name": "History of Film to 1940", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": "True", "number": "364", "fall": "True", "units": " Performing Arts, Global Knowledge", "description": "Technological developments and aesthetic movements that shaped international cinema production from the beginning of the industry to 1940.  Formal evolution in camera movement, editing, sound, narrative form, and the documentary.  The rise to prominence of Hollywood and international cinemas in historical, economic, and cultural contexts."}, {"summer": false, "name": "Multimedia Production and Digital Culture", "prerequisites": "Prerequisite: COM 267", "spring": true, "number": "367", "fall": false, "units": " 3", "description": "Production lab and seminar combined.  Digital production of visual images, audio, and video for the web.  Readings in theories of visual communication and electronic culture.  Critical analysis of assumptions underlying development and deployment ofelectronic media, and their social, economic and political impact.  Development of practical skills and critical thinking."}, {"summer": "True", "name": "History of Film From 1940", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": "True", "number": "374", "fall": "True", "units": " Performing Arts, Global Knowledge", "description": "Technological developments and aesthetic movements that have shaped international cinema production from 1940 to the present.  Evolution in camera movement, editing, sound, narrative form, and the documentary.  Post-war Hollywood cinema and international film industries (both established and emerging) in historical, economic and cultural context."}, {"summer": false, "name": "Speech Science", "prerequisites": "Prerequisite:  COM 325", "spring": true, "number": "385", "fall": false, "units": " 3", "description": "Acoustic properties of speech sounds and the dynamics of speech sound production.  Initial experience with basic clinical instrumentation used to measure respiratory, phonatory, and atriculatory movements and the acoustic events that result from these movements.  Lab assignments using basic instrumentation and computer software are completed outside of class."}, {"summer": true, "name": "Quantitative Communication Research Methods", "prerequisites": "Prerequisite: COM 240", "spring": true, "number": "386", "fall": true, "units": " 3", "description": "Design and implementation of communication research methods, including experimental and survey research procedures.  Use of computer software for statistical analysis."}, {"summer": false, "name": "Advanced Television Production", "prerequisites": "Prerequisite: COM 224", "spring": true, "number": "387", "fall": false, "units": " 3", "description": "Television program production utilizing advanced production techniques. Emphasis on refinement of writing, producing, and directing skills through work in TV studio on production of  sophisticated program formats."}, {"summer": false, "name": "International and Crosscultural Communication", "spring": false, "number": "392", "fall": false, "units": " 3", "description": "Patterns and problems of verbal and non-verbal forms of crosscultural communication. Avoidance and management of cultural conflict arising from awareness of characteristics and crosscultural communication. Impact on communication of differing cultural perspectives."}, {"summer": false, "name": "Studies in Rhetoric and Digital Media", "prerequisites": "Prerequisite: ENG 101", "spring": true, "number": "395", "fall": true, "units": " 3", "description": "Study of the influence of emerging technologies on rhetorical theory and practice. Rhetorical analysis of texts, including visual and audio texts.  Invention and construction of digital media texts as a means of engaging rhetorical theory and analysis.  Topics vary to adapt to emerging technologies and changing vernacular practices."}, {"summer": false, "name": "Advanced Group Communication", "prerequisites": "Prerequisite: COM 202", "spring": true, "number": "402", "fall": false, "units": " 3", "description": "Communication processes and outcomes in groups with complex, strategic, and critical public or corporate functions.  Focus on participating in, intervening in, leading, and constructing group processes.  Advanced theory with application."}, {"summer": "True", "name": "Rhetorical Criticism", "prerequisites": "Prerequisite: Junior standing", "spring": "True", "number": "411", "fall": "True", "units": " 3", "description": "Rhetorical analysis of public speeches, social movements, political campaigns, popular music, advertising, and religious communication. Neo-Aristotelian criticism, movement studies, genre criticism, dramatistic analysis, content analysis, fantasy theme analysis."}, {"summer": false, "name": "Advanced Topics in Communication and Race", "prerequisites": "Prerequisite: COM 257, Corequisite: COM 250", "spring": true, "number": "417", "fall": true, "units": " 3", "description": "Advanced topics seminar examining construction of racial and ethnic identities through communication practices.  Exploration of theories of race and identity and the ways communication works to construct, undermine, and reinforce understanding across social groups."}, {"summer": false, "name": "Communication Law", "prerequisites": "Prerequisite: Junior standing.", "spring": false, "number": "421", "fall": true, "units": " 3", "description": "Explores the historical, philosophical, and legal foundations of communication rights and responsibilities.  Philosophies and regulations affecting sources, messages, channels, receivers, and situations provide the central focus of the course."}, {"summer": "True", "name": "Game Studies", "spring": "True", "number": "427", "fall": "True", "units": " 3", "description": "Exploration of inter-relations among mobile technologies (cell phones, PDAs), location-based activities, and playful/social spaces.  Investigates three main areas: (1) the definition of basic gaming concepts (community, narrative, play, and space); (2) the history of games as social events, with particular emphasis on multi-user domains (MUDs); and (3) the definition of games, which use the physical space as the game environment, such as pervasive games, location-based games, and hybrid realitygames.  Discussion of inter-connections among games, education, and art.  Jr/Sr Standing."}, {"summer": false, "name": "Communication in Political Campaigns", "prerequisites": "Prerequisite: COM 110 or COM 201", "spring": false, "number": "431", "fall": true, "units": " 3", "description": "Roles of analysis and criticism of oral communication in political campaigns; analysis of special political communication situations; ghostwriting, news conferences, negative advertising."}, {"summer": false, "name": "Environmental Communication", "prerequisites": "Prerequisite: COM 230 or STS 214", "spring": false, "number": "436", "fall": true, "units": " 3", "description": "Critical analysis of environmental discourse in organizational, mass media, political, cultural, and international contexts.  Investigates public participation in environmental advocacy and deliberation; environmental conflict management; rhetoricalconstructions of nature and human relationships with nature; environmental justice; environmental risk communication; and competing ecological paradigms.  Must hold Junior/Senior standing."}, {"summer": false, "name": "Advanced Digital Video", "prerequisites": "Prerequisite: COM 357", "spring": true, "number": "437", "fall": false, "units": " 3", "description": "Hands-on experience in digital video production.  Production of instructional videotapes.  Practical experience in all phases of production process, including pre-production organization and critical analysis of final product."}, {"summer": false, "name": "Ethical Issues in Communication", "prerequisites": "Prerequisite: COM 110, 112", "spring": true, "number": "441", "fall": false, "units": " 3", "description": "Critical analysis of ethical problems in interpersonal and public communication practices."}, {"summer": false, "name": "Communication and Conflict Management", "prerequisites": "Prerequisite: COM 112", "spring": false, "number": "442", "fall": true, "units": " 3", "description": "Examination of conflict styles and theories; conflict management strategies such as negotiation and third party intervention; and relevant contexts for conflict such as workplace, families, and interpersonal relationships.  Practical, theoretical and critical analyses of conflict and negotiation in variety of contexts."}, {"summer": false, "name": "Communication and Globalization", "prerequisites": "Corequisite: COM 327", "spring": false, "number": "447", "fall": true, "units": " 3", "description": "History and current trends in globalization of media, information, and telecommunications technologies, organizations, policies, and contents.  Political cultural implications of globalization, including debates over corporate vs. public control of global communication, U.S. dominance vs. international cooperation, and the global influence of American culture.  Internet-based group research projects on globalization in collaboration with students in other countries."}, {"summer": false, "name": "Visual Rhetoric", "prerequisites": "Prerequisite: COM 201 or COM 321", "spring": true, "number": "451", "fall": false, "units": " 3", "description": "Examine the rhetorical strategies employed in various primarily visual forms of communication including advertising, photography, digital images, visual art, and public commemorative artifacts and sites.  Explore the concepts and methods used to rhetorically analyze and interpret visual images and artifacts.   Includes one or more required field trips to which students will provide own transportation."}, {"summer": true, "name": "Organizational Communication", "prerequisites": "Prerequisite: COM 230", "spring": true, "number": "456", "fall": true, "units": " 3", "description": "Role of human communication in organizations, the assumptions inherent in management philosophies about effective communication, and an investigation of the relationships among communication, job satisfaction, productivity, development, and employeemotivation."}, {"summer": false, "name": "Media and the Family", "prerequisites": "Corequisite: COM 327", "spring": false, "number": "457", "fall": true, "units": " 3", "description": "Impact of mediated messages upon children and the family unit.  Origins of the empirical literature and continuing research.  Assessment of the qualitative literature.  Implications of commercial structure of the media industries on the structure and distribution of media messages designed for children and families.  Consideration of both pro- and anti-social impacts."}, {"summer": false, "name": " Development", "spring": true, "number": "466", "fall": false, "units": " 3", "description": "Nonprofit Leadership and Development is a service-learning course in which students will be expected to make a 20-hour commitment to service in a local nonprofit organization. Students will critically examine theories of communication and leadershipwith concentration on issues pertaining to nonprofits such as working with executive boards, volunteer management, and resource development. Students are responsible for transportation and purchase of internship insurance."}, {"summer": false, "name": "Advanced Topics in Gender and Communication", "prerequisites": "Prerequisite: COM 327 or COM 362", "spring": true, "number": "467", "fall": true, "units": " 3", "description": "Advanced Topics seminar examining construction of gender identities through communication practices.  History and analysis of gender representations.  Theoretical and critical approaches to social, political, and economic impact of gender constructions."}, {"summer": false, "name": "Public Relations Campaigns", "prerequisites": "Prerequisite: COM 226, COM 316, COM 386 and Corequisite: COM 346 (Note: COM 346 may be taken as a prerequisite or co-requisite)", "spring": true, "number": "476", "fall": true, "units": " 3", "description": "Management of the public relations function in organizations and public relations counseling;  communication theory and nature of materials emanating from public relations departments and counseling firms, practical analysis and development of public relations publicity and campaigns."}, {"summer": "True", "name": "Mobile Tech Cultr", "spring": "True", "number": "477", "fall": "True", "units": " 3", "description": "Mobile communication technologies and their influence on communication patterns and social behavior. conceptualization of cell phones beyond mobile telephones, as internet access points and gaming devices. History, current uses and future perspectives for the social use of mobile interfaces. The creation of new mobile communities. The influence of mobile images on communication and the creation of mobile networks. Use of mobile phones across cultures and places, such as Asia, Scandinavia, Africa, and Latin America."}, {"summer": false, "name": "Internet and Society", "prerequisites": "Prerequisite: COM 230 and COM 257", "spring": false, "number": "487", "fall": true, "units": " 3", "description": "Exploration of major issues involved in the growth of computer-mediated communication and information technologies.  Construction of self and body; relation of information technology to social, civic, and political life; gender, race, and class as continuing critical points; knowledge and intellectual property; the implications of software and design on the nature of communication, knowledge, and information."}, {"summer": false, "name": "Advanced Topics in Public Relations", "spring": true, "number": "493", "fall": true, "units": " 3", "description": "This course addresses current trends and recent development in the public relations profession through extensive analysis of industry practices. Course content will change each semester subject to faculty availability, but may include topics such as social media, media relations, crisis communication, international public relations, and other public relations specializations. Juniors and Seniors only."}, {"summer": false, "name": "Communication Internship", "prerequisites": "Prerequisite: Junior standing, Communication Majors", "spring": true, "number": "496", "fall": true, "units": " 3", "description": "Directed work experience for Communication majors with supervision from the work site and the University."}, {"summer": false, "name": "Advanced Topic in Communication", "prerequisites": "Prerequisite: Nine hours of communication courses, Junior standing", "spring": true, "number": "498", "fall": true, "units": " 1-3", "description": "Advanced study of contemporary theories, methods, practices, processes, or issues related to the field of communication.  Topic varies."}, {"summer": false, "name": "Advanced Independent Study in Communication", "prerequisites": "Prerequisite: Nine credits in Communication courses. Junior standing or Senior standing in Communication", "spring": true, "number": "499", "fall": true, "units": " 1-3", "description": "Special projects in communication developed under the direction of a faculty member on a tutorial basis. Must have permission of department to enroll. May enroll only twice."}, {"summer": false, "name": "Verbal Data Analysis", "prerequisites": "Prerequisite: ENG 513 or ENG 527 or COM 541 or COM 542", "spring": false, "number": "506", "fall": true, "units": " 3", "description": "Research strategies for understanding how spoken and written language shapes activities (e.g., design, instruction, counseling, gaming interactions, e-commerce, etc.). Tracking patterned uses of language as verbal data (e.g., grammatically topically, thematically), formulating research questions, and designing studies to answer those questions through quantitative descriptive means. Sampling, collecting and managing data, developing coding schemes, achieving reliability, using descriptive statistical measures, and reporting the results."}, {"summer": false, "name": "History Of Rhetoric", "spring": false, "number": "514", "fall": true, "units": " 3", "description": "Historical development of rhetorical theory with attention to contemporaneous rhetorical practice and philosophical trends. Major focus on the classical period with briefer coverage of medieval, Renaissance, 18th-century, and 19th-century developments. Implications for contemporary theory and practice, including pedagogical practice."}, {"summer": false, "name": "Rhetorical Criticism:  Theory and Practice", "prerequisites": "Prerequisite: Graduate Standing or the equivalent of COM/ENG 321 or COM/ENG 411", "spring": false, "number": "516", "fall": true, "units": " 3", "description": "Development, achievements, limitation of major critical methods in the 20th century, including neo-Aristotelian, generic, metaphoric, dramatistic, feminist, social-movement, fantasy-theme and postmodern approaches.  Criticism of political discourse,institutional discourse, discourses of law, medicine, religion, education, science, the media.  Relations between rhetorical and literary criticism and other forms of cultural analysis."}, {"summer": false, "name": "Communication and Globalization", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "521", "fall": true, "units": " 3", "description": "Economic, political, cultural dimensions of globalization.  Role of information and communication technologies, networks, institutions, and practices in human social organization."}, {"summer": false, "name": "Critical Approaches to Organizational Communication", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "522", "fall": false, "units": " 3", "description": "Overview of critical and interpretive organizational communication research studies.  Application of insights to enriching and transforming working lives."}, {"summer": false, "name": "International and Intercultural Communication", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "523", "fall": false, "units": " 3", "description": "Survey of intercultural, cross-cultural, and international communication theories and issues."}, {"summer": false, "name": "Political Communication in Organizations", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "524", "fall": false, "units": " 3", "description": "Explore effects of modern communication techniques on political life in organizations.  Examine formulation and articulation of political messages for private organizations and governmental institutions."}, {"summer": false, "name": "Communication and Decision-Making", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "525", "fall": false, "units": " 3", "description": "Communication in decision-making process from individual, group, organizational perspectives.  classical and contemporary decision theories, communication and decision problems, applied field consideration."}, {"summer": false, "name": "Media Ownership", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "526", "fall": false, "units": " 3", "description": "Identify major media companies worldwide areas of dominance.  Examine commercial, cultural, social, political implications of contemporary media ownership patterns."}, {"summer": false, "name": "Seminar in Organizational Conflict Management", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "527", "fall": false, "units": " 3", "description": "Examination of conflict antecedents, interventions, outcomes through multiple texts, journal articles.  Emphasis on workplace conflict, organizational outcomes, dispute system design.  Evaluation through participation in class discussion, independent papers, research project, presentation."}, {"summer": false, "name": "Communication Culture and Technology", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "528", "fall": false, "units": " 3", "description": "Examine Communication technology via historical examples.  Inquiry into the development of early sound and screen technologies.  Analysis of computer-mediated Communication genres."}, {"summer": false, "name": "Communication Campaigns", "spring": true, "number": "529", "fall": false, "units": " 3", "description": "Prepares students to design, implement, monitor, and evaluate a successful communication campaign for a health, public relations, or political organization that is grounded in sound theoretical approaches.  The students conduct focus groups for audience research and professionally present a campaign plan to a real client for any of the mentioned types of organizations.  The course emphasizes theoretical and hands on practical skills to developing successful communication campaigns."}, {"summer": true, "name": "Interpersonal Communication in Science and Technology Organizations", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "530", "fall": false, "units": " 3", "description": "Blends theory and research to understand and analyze interpersonal communication practices and issues within organizations, including managing impressions and conversations, engaging in active listening, managing conflict, influencing others, and communicating in teams. Focus on developing and maintaining effective interpersonal at work and improving student's communication competence."}, {"summer": false, "name": "Communication Consulting", "spring": false, "number": "532", "fall": true, "units": " 3", "description": "This course provides an introduction to the art and methods of consulting particularly as applied to communication problems in organizational settings. It also provides students the opportunity to develop and/or refine training and facilitation skills and to link communication theory and research to organizational practice. Graduate standing required."}, {"summer": false, "name": "Environmental Communication", "spring": false, "number": "536", "fall": true, "units": " 3", "description": "Research and critical analysis of environmental discourse in organizational, media, political, cultural, and international contexts. Investigates public participation in environmental advocacy and deliberation; environmental conflict management; rhetorical constructions of nature, human relationships with nature; environmental justice, environmental risk communication; and competing ecological paradigms. Graduate standing required."}, {"summer": "True", "name": "Gaming and Social Networks", "spring": "True", "number": "537", "fall": "True", "units": " 3", "description": "Exploration of inter-relations among mobile technologies (cell phones, PDAs), location-based activities, and playful/social spaces.  Investigates: (1) the definition of basic gaming concepts (community, narrative, play, and space); (2) the history of games as social environments, with particular emphasis on multi-user domains (MUDs); and (3) the definition of games, which use the physical space as the game environment, such as pervasive games, location-based games, and hybrid reality games.  Discussion of inter-connections among games, education, and art.  By permission of department."}, {"summer": false, "name": "Risk Communication", "spring": false, "number": "538", "fall": true, "units": " 3", "description": "Comprehensive review of principles, theory, research, and practices involving consensus building; associated with environmental, health and safety; enabling analysis and management of risks.  Emphasis on risks associated with emerging science and technology.  No quantitative experience necessary.  Graduate standing required."}, {"summer": "True", "name": "Fund Development", "spring": "True", "number": "539", "fall": "True", "units": " 3", "description": "Identifies and assesses techniques and best practices of fund development, annual giving, capital campaigns, endowments.  Topics include setting achievable goals, organizing and staffing a fund development campaing, and identifying donors.  Discusses links between fund development and organization mission and governance, ethical issues, and government regulations.  PBS status or Graduate standing."}, {"summer": false, "name": "Quantitative Research Methods in Applied Communication", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "541", "fall": true, "units": " 3", "description": "Introduction to research methods in applied communication.  Knowledge of design, implementation, and analysis of various quantitiative research methods."}, {"summer": false, "name": "Qualitative Research Methods in Applied Communication", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "542", "fall": true, "units": " 3", "description": "Theoretical and practical dimensions of conducting qualitative research. Issues include asking good questions, field observation, ethics, focus groups, interviews, representation of data, analyzing texts and discourse, writing qualitative reports."}, {"summer": false, "name": "Visual Content Analysis", "spring": false, "number": "543", "fall": true, "units": " 3", "description": "Research methods class in social science-orientated quantitative or qualitative analysis.  Students will advance visual research by developing and/or testing theoretical concepts for visual media.  Readings will focus on analytic techniques and concepts for still or moving images in digital or traditional media.  Contexts include social media, organizational websites, blogs, online news sites, films, games, mobile media, and more.  Students use qualitative and quantitative analysis software.  Graduate standing required"}, {"summer": "True", "name": "Nonprofit Marketing and Public Relations", "spring": "True", "number": "546", "fall": "True", "units": " 3", "description": "Survey of the marketing and public relations principles and practices applicable to nonprofit organizations."}, {"summer": "True", "name": "Mobile Technologies and Social Practices", "spring": "True", "number": "547", "fall": "True", "units": " 3", "description": "Mobile communication technologies and their influence on communication patterns and social behavior.  Conceptualization of cell phones beyond mobile telephones, as Internet access points and gaming devices.  History, current uses and future perspectives for the social use of mobile interfaces.  The creation of new mobile communities.  The influence of mobile images on communication and the creation of mobile networks.  Use of mobile phones across cultures and places, such as Asia, Scandinavia, Africa, and Latin America.  Permission of department."}, {"summer": false, "name": "Contemporary Rhetorical Theory", "spring": true, "number": "554", "fall": false, "units": " 3", "description": "Contemporary rhetorical theory covering the 20th and 21st centuries. Conceptual connections with and disruptions of the classical tradition and its, successors; relationship between rhetorical  theory and philosophical trends, institutional histories, socioeconomic circumstances, and pedagogical needs. Attention to current issues such as the revival of invention, rhetorical agency, and ethics."}, {"summer": false, "name": "Seminar In Organizational Communication", "prerequisites": "Prerequisite: Advanced Undergraduate standing or Graduate standing", "spring": true, "number": "556", "fall": false, "units": " 3", "description": "Theoretic and applied approaches for studying communication perspectives of organizational behavior. Topics relate communication with organizational theories, research methods, leadership, power, attraction, conflict and theory development."}, {"summer": false, "name": "Human Communication Theory", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": true, "number": "561", "fall": true, "units": " 3", "description": "The role of theory in study of human communication.  General social scientific theories as well as context-based theories including interpersonal, public, group, organizational and mass communication contexts."}, {"summer": false, "name": "Communication and Social Change", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "562", "fall": true, "units": " 3", "description": "Examine persuasive theories and methods including compliance gaining techniques.  Evaluate effectiveness of public communication campaigns directed at social change."}, {"summer": false, "name": "Public Relations Theory", "spring": true, "number": "563", "fall": false, "units": " 3", "description": "Study the theoretical body of knowledge in public relations and its application to practice. Graduate Standing required."}, {"summer": false, "name": "Seminar In Crisis Communication", "spring": true, "number": "566", "fall": false, "units": " 3", "description": "Working within theoretical perspectives of communication, conflict management and organizational designs, a theoretical understanding for crisis communication, including thorough guidelines for strategic communication planning for, managing and evaluating crises."}, {"summer": false, "name": "Visual Rhetoric: Theory and Criticism", "prerequisites": "Graduate Students Only", "spring": true, "number": "581", "fall": false, "units": " 3", "description": "Application of visual theory to rhetoric and of rhetorical theory to visual forms of communication. Discussion and analysis may include advertising, photography, news and informational media, political communication, instructional material, scientific visualization, visual arts, public commemorative artifacts, internet and other digital media."}, {"summer": false, "name": "Teaching College Communication", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "585", "fall": true, "units": " 3", "description": "Introduction to communication education theory and research.  Course divided into primary parts: 1)education theory and philosphy and 2)instructional design theory and practice."}, {"summer": true, "name": "Special Topics In Communication", "spring": true, "number": "598", "fall": true, "units": " 1-3", "description": "Detailed investigation of a special topic in communication. No more than 6 hrs. may be used as credit toward graduation with master's degree."}, {"summer": false, "name": "Independent Study in Communication", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "630", "fall": true, "units": " 1-3", "description": "Special projects course to be utilized for guided research at graduate level.  Topic determined by instructor.  No more than 6 hrs. may be used as credit toward graduation with master's degree."}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "685", "fall": true, "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "688", "fall": true, "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "689", "fall": true, "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": false, "name": "MR Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "695", "fall": true, "units": " 1-6", "description": "Thesis Research"}, {"summer": "True", "name": "Summer Thesis Res", "spring": "True", "number": "696", "fall": "True", "units": " 1"}, {"summer": false, "name": "Special Topics in Communication", "spring": true, "number": "798", "fall": true, "units": " 3", "description": "Intensive exploration of specialized or emerging topics in an area of communication theory, rhetoric, media, or other aspect of Communication studies.  Emphasis on student research and writing.  May be used to test and develop new courses.  May be repeated for credit.  Doctoral students only."}, {"summer": false, "name": "Directed Readings in Communication", "spring": true, "number": "810", "fall": true, "units": " 1-6", "description": "Intensive study of a specific topic from various specializations of the Communication faculty.  Negotiation between the student and the director for variable credit and approved by Director of Graduate Studies.  May be repeated for credit.  Doctoralstudents only."}, {"summer": "True", "name": "Summer Dissert Res", "spring": "True", "number": "896", "fall": "True", "units": " 1"}]