[{"summer": "True", "name": "History and Theory of Communication Technology", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "701", "fall": "True", "units": " 3", "description": "Intensive study of the evolution of communication systems and of essential historical, theoretical, and critical accounts of such systems and their implications. Foundation course for doctoral study."}, {"summer": "True", "name": "Rhetoric and Digital Media", "prerequisites": "Prerequisite: COM/ENG 514 or 516 or ENG 515, Doctoral student", "spring": "True", "number": "702", "fall": "True", "units": " 3", "description": "Intensive critical study and evaluation of the conceptual vocabulary of rhetoric and its application to digital communication and digital media. Focus may include the following concepts: community, genre, figuration, argument, narrative, dialogue, deliberation, topoi, pathos, ethos, kairos."}, {"summer": "True", "name": "Communication in Networked Society", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "703", "fall": "True", "units": " 3", "description": "Intensive study of theories, histories, and practices of networked communication. Emergence, development, acceptance, and dissolution of a variety of networks organized around information and communication technologies. Survey of network theory and methods for studying networks, networked communication practices, and their effects on issues such as identity, labor, organization, power, etc. Research/applications project developed in consultation with the instructor."}, {"summer": "True", "name": "Technologies and Pedagogies in the Communication Arts", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "704", "fall": "True", "units": " 3", "description": "Theories, research, and practices using technologies in the teaching and learning of the communication arts in higher education. Design and implementation of instructional strategies, design and management of technology facilities, ethical and professional issues."}, {"summer": "True", "name": "Issues in Communication, Rhetoric, and Digital Media", "prerequisites": "Prerequisite: CRD 701, 702, 703, 704, Doctoral student", "spring": "True", "number": "790", "fall": "True", "units": " 3", "description": "A seminar examining problems and issues of interdisciplinary inquiry in the context of digital media. Synthesis of research and scholarship from multiple disciplinary perspectives as it applies to issues in communication, rhetoric, and digital media. Emphasis on developing collaborative research projects drawing on multiple disciplinary perspectives."}, {"summer": "True", "name": "Special Topics in Communication, Rhetoric, and Digital Media", "prerequisites": "Prerequisite: CRD 701", "spring": "True", "number": "791", "fall": "True", "units": " 3", "description": "An intensive seminar examining a particular topic or issue in the communication and rhetoric of digital media."}, {"summer": "True", "name": "Colloquium in Communication, Rhetoric, and Digital Media", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "809", "fall": "True", "units": " 1", "description": "Professional development, ethical inquiry, and discussion and evaluation of interdisciplinary research in a colloquium setting.  In successive fall semesters, students participate in three one-credit colloquia that include faculty and students from across the program."}, {"summer": "True", "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "885", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment"}, {"summer": "True", "name": "Doctoral Preliminary Exam", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "890", "fall": "True", "units": " 1-9", "description": "For students who are preparing for and taking written and/or oral preliminary exams."}, {"summer": "True", "name": "Doctoral Supervised Research", "spring": "True", "number": "893", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "895", "fall": "True", "units": " 1-9", "description": "Dissertation research."}, {"summer": "True", "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "896", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "899", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hour, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations."}]