[{"summer": false, "name": "Introductory Topics in Crop, Soil and Turfgrass Sciences", "spring": false, "number": "103", "fall": true, "units": " 1", "description": "Introduction to the scope, purpose, and objectives of a university education with an emphasis on areas related to Crop, Soil and Turfgrass Sciences.  Students will explore university, college and departmental resources, academic policies and procedures, opportunities for minors, career opportunities, and current trends and issues in our related disciplines. Students cannot receive credit for both CS 103 and ALS 103. Freshman Only; PAA, PAB, PAC, PAE, PCB, SST, TFG"}, {"summer": false, "name": "Introduction to Turfgrass Management", "prerequisites": "Prerequisite: BIO 181(preferred) or ZO 160(alternate) BO 200, or CS 213", "spring": false, "number": "200", "fall": true, "units": " 4", "description": "Turfgrass selection, establishment, maintenance, and pest management in lawns, golf courses, athletic fields, and roadside care; Emphasis on understanding the impact of the environment on management practices and turfgrass performance. Field trips in laboratory."}, {"summer": true, "name": "Lawns and Sports Turf", "spring": true, "number": "210", "fall": true, "units": " 3", "description": "Utilization of turfgrasses for lawns and recreational areas. Emphasis on: the cultural and environmental benefits of grassed areas, concepts of grass growth and development, selecting adapted grasses for proper use, techniques for successful establishment and management of cool-and-warm-season turfgrasses, fertilization, irrigation, aeration, and pest management.  The history and benefit of natural and artificial sports fields will also be discussed. Credit will not be awarded for both CS 200 and CS 210."}, {"summer": false, "name": "Plant Genetics", "prerequisites": "Prerequisite: BIO 183 or ZO 160", "spring": true, "number": "211", "fall": false, "units": " 3", "description": "Fundaments of plant genetics.  Genetic basis for plant improvement.  Genetic analysis of Mendelian traits, molecular structure and organization of genetic material, crop biotechnology, distribution and behavior of genes in populations."}, {"summer": false, "name": " Production", "prerequisites": "Prerequisite: BIO 181(preferred) or ZO 160(alternate) or BO 200", "spring": true, "number": "213", "fall": true, "units": " 4", "description": "Fundamental structure and reproductive features of crops.  Their adaptation and importance in global agriculture.  Practices and inputs needed for economic production of a quality product and interaction of these factors within the constraints of climate, soils, and topography in maintaining a quality environment."}, {"summer": false, "name": "Oilseed Crop Production", "spring": false, "number": "216", "fall": true, "units": " 3", "description": "Fundamental agronomic practices associated with the production of oilseed crops (soybean, peanuts and cotton). Discussions will include crop growth and development stages, variety characteristics, planting strategies, fertility and pest management programs, harvest and storage options, and the use of technologies associated with the production and maintenance of quality oilseed crops."}, {"summer": false, "name": "Cereal Grain Crop Production", "spring": true, "number": "218", "fall": false, "units": " 2", "description": "Fundamental agronomic practices associated with the productio of cereal grain crops (corn and small grains). Discussions will include crop growth and development stages, how to choose the best varities and hybrids, planting strategies, fertility and pest management programs, harvest and t=storage options, and the use of technologies associated with the production and maintenance of quality grain."}, {"summer": false, "name": "Seeds, Biotechnology and Societies", "spring": false, "number": "224", "fall": true, "units": " 3", "description": "An exploration of seeds, how seeds are the delivery system for crop biotechnology and how a specific culture's perception of science and agriculture influence the acceptance or rejections of modern genetic technologies. Topics include seed germination, survival and preservation; seed industry influence on societies and how societies are influencing the seed industry; seed production - commercially and at home; how our diverse genetic resources are preserved; how biotechnology is applied to agriculture and delivered through seeds; the impact biotech is having on the seed industry and subsequently on us and global agriculture; concerns and potential benefits of biotechnology application to crops."}, {"summer": false, "name": "Introduction to Agroecology", "prerequisites": "Prerequisite: BIO 105 or BIO 181 or BIO/ZO 160 or BO 200 or BO 250 or HS 201 or CS 213", "spring": false, "number": "230", "fall": true, "units": " 3", "description": "This course will examine the biological and physical attributes of farming systems and their associated ecological and social impacts in temperate and tropical regions.  It will address the ecological consequences of indigenous food and fiber production systems, conventional agricultural systems and \"alternative\" systems that incorporate biological pest control and natural nutrient inputs.  Students will examine several case studies that integrate their understanding of concepts."}, {"summer": false, "name": " Soil Sciences", "spring": false, "number": "290", "fall": true, "units": " 1", "description": "This course is designed to prepare students for careers in Plant and Soil Sciences.  Student discussions with faculty and industry professionals will center on structure and requirements for internship and jobs, research and extension opportunities,resume building and writing, professionalism and professional development, interpersonal skills, undergraduate program management, and career planning.  Student development of an e-portfolio is required.   Must hold sophomore or junior standing in: TAA, TAB, TAC, TSS, TFG."}, {"summer": false, "name": "Grassland Management for Natural Resources Conservation", "prerequisites": "Prerequisite: BIO 181(preferred) or ZO 160(alternate) CS 213, SSC 200", "spring": false, "number": "312", "fall": true, "units": " 3", "description": "Basic principles and practices of production and utilization of pasture and forage crops; impact on developing sustainable systems for livestock feed, soil and water conservation; use of computers to assist in whole farm planning and information retrieval."}, {"summer": true, "name": "Independent Study in Crop Science", "spring": true, "number": "398", "fall": true, "units": " 1-3", "description": "Individualized study in the areas of crop science. Topic and credit hours will be determined by the instructor and student. This course may be taken a maximum of two times, provided the topics of study are sufficiently different."}, {"summer": false, "name": "Turf Cultural Systems", "prerequisites": "Prerequisite: C- or better in CS 200", "spring": true, "number": "400", "fall": false, "units": " 3", "description": "Topics include:  golf course design considerations, fertilizer characteristics and application techniques, irrigation programming, construction of high use turfgrass areas, calibration of spreaders and sprayers, aerification, pesticide fate and development of effective management systems."}, {"summer": false, "name": "Crop Ecology", "prerequisites": "Prerequisite: PB 321 or PB 421", "spring": false, "number": "411", "fall": true, "units": " 3", "description": "Ecology and production of major agronomic crops of economic importance. Impact of key environmental stress factors on production processes and management strategies.  Environmental issues pertaining to sustainable cropping systems.  Manipulation of canopy climate and rooting environment for enhanced crop performance in the context of global climate change.  Ecological analysis of abiotic - and biotic-derived crop disorders."}, {"summer": false, "name": "Plant Breeding", "prerequisites": "Prerequisite: GN 411 or ANS 215", "spring": true, "number": "413", "fall": false, "units": " 2", "description": "Discussion of reproductive systems of  higher plants; the genetic basis for plant improvement and the selection, evaluation, and  utilization of crop varieties."}, {"summer": false, "name": "Weed Science", "prerequisites": "Prerequisite: CH 220", "spring": false, "number": "414", "fall": true, "units": " 4", "description": "History, current status and fundamentals of weed biology and cultural, biological, and chemical weed control; properties and uses of herbicides; weed identification; proper use of herbicide application equipment; current weed management practices incrops and non-cropland situations."}, {"summer": false, "name": "Integrated Pest Management", "prerequisites": "Prerequisite: BIO 181(preferred) or ZO 160(alternate) or BO 200 or BO 250", "spring": true, "number": "415", "fall": false, "units": " 3", "description": "History, principles, and application of techniques for managing plant pests. Theory and practice of integrating pest control tactics to manage pests within economic, environmental, and sociological constraints.  Topics include pest monitoring methodology, economic aesthetic thresholds, biological control, efficient pesticide use, biotechnology, and global positioning systems."}, {"summer": false, "name": "Seed Physiology", "prerequisites": "Prerequisite: PB 321 or PB 421 or FOR 303", "spring": true, "number": "424", "fall": false, "units": " 3", "description": "This course will explore the physiological processes associated with seed formation, development, maturation, germination, and deterioration of agronomic and horticultural species.  We will also study the physiological aspects of seed dormancy, how dormancy is manifested and overcome in cultivated and noncultivated systems and dormancy's impact on weed seedbank ecology."}, {"summer": false, "name": "Advanced Agroecology", "spring": true, "number": "430", "fall": false, "units": " 4", "description": "This course applies agroecological principles introduced in CS 230 and critical thinking to evaluate various agroecosystems.  Students will examine food, fiber, and other commodity production systems for security, productivity, and sustainability and address the simultaneous need to protect natural environments and the biodiversity on which agroecosystems depend.  Topics include discussion of national and international government policies, research programs, and education programs that influence the future application of agroecosystem principles."}, {"summer": false, "name": "Geographic Information Systems in Production Agriculture", "prerequisites": "Prerequisite: SSC 200", "spring": true, "number": "440", "fall": false, "units": " 3", "description": "Fundamentals of the global positioning system, geographic information systems, and site-specific management.  Geospatially located soil sampling strategies will be addressed as well as appropriate interpolation methods for point-sampled data.  The course will cover variable rate fertilizer recommendation models and the technology necessary for variably applying fertilizer.  Spatial measurement of crop yields."}, {"summer": false, "name": "Soil-Crop Management Systems", "prerequisites": "Prerequisite: CS 213, CS 414, SSC 342, SSC 452, Senior standing", "spring": true, "number": "462", "fall": false, "units": " 3", "description": "Unites principles of soil science and crop science with those of allied areas into realistic agronomic applications; practical studies in planning and evaluation of soil and crop management systems."}, {"summer": false, "name": "Turf Management Systems and Environmental Quality", "prerequisites": "Prerequisite: CS 400 and Senior standing", "spring": false, "number": "465", "fall": true, "units": " 3", "description": "Integration of turfgrass management systems and the use of BMPs and IPM to protect environmental quality.  Examination of water quality issues relative to turf.  Application of Best Management Practice and Integrated Pest Management strategies. Credit cannot be received for both CS 465 and CS 565.  Senior standing."}, {"summer": false, "name": "Advanced Turfgrass Pest Management", "prerequisites": "Prerequisite: C- or better in CS 200", "spring": true, "number": "470", "fall": false, "units": " 2", "description": "Characteristics and ecology of turfgrass weed, insect, and disease pests; identification and diagnosis of turfgrass pests, strategies for managing pests including cultural, mechanical, biological, and chemical methods; development of integrated pestmanagement programs, characteristics and modes of action for herbicides, insecticides, fungicides, and plant growth regulators; behavior and fate of pesticides in soil; and the development and management of pesticide resistant pest populations."}, {"summer": false, "name": "Senior Seminar in Crop Science and Soil Science", "prerequisites": "Prerequisite: Senior standing in Agronomy, Plant and Soil Sciences, or Turfgrass Science", "spring": true, "number": "490", "fall": false, "units": " 1", "description": "Review and discussion of current topics in crop science, soil science, agronomy and natural resource management. Preparation and presentation of scientific information in written and oral format. Senior standing in Agronomy, Plant and Soil Sciences, or Turfgrass Science."}, {"summer": false, "name": "External Learning Experience", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "492", "fall": true, "units": " 1-6", "description": "A learning experience in agriculture and life sciences within an academic framework that utilizes facilities and resources which are external to the campus. Contact and arrangements with prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior  to the experience."}, {"summer": false, "name": "Special Problems in Crop Science", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "493", "fall": true, "units": " 1-6", "description": "A learning experience in agriculture and life sciences within an academic framework that  utilizes campus facilities and resources. Contact and arrangements with prospective  employers must be initiated by student and approved by a faculty adviser, the prospective employer the departmental teaching coordinator and the academic dean prior to the experience."}, {"summer": true, "name": "Special Topics in Crop Science", "spring": true, "number": "495", "fall": true, "units": " 1-6", "description": "Offered as needed to present materials not normally available in regular course offerings or for offering of new courses on a trial basis."}, {"summer": false, "name": " Diagnosis", "prerequisites": "Prerequisite: PP 315", "spring": false, "number": "502", "fall": true, "units": " 2", "description": "Introduction to the basic principles of disease causality in plants and the methodology for the study and diagnosis of plant diseases caused by fungi.  Identification of plant-pathogenic fungi.  Research project, disease profiles and field trips arerequired."}, {"summer": false, "name": "Seed Physiology", "prerequisites": "Prerequisite: CH 220 or CH 221 and PB 321 or PB 421 or FOR 303", "spring": true, "number": "524", "fall": false, "units": " 3", "description": "This course will explore the physiological processes associated with seed formation, development, maturation, germination, and deterioration of agronomic and horticultural species.  We will also study the physiological aspects of seed dormancy, how dormancy is manifested and overcome in cultivated and noncultivated systems and dormancy's impact on weed seedbank ecology."}, {"summer": false, "name": "Plant Breeding Methods", "prerequisites": "Prerequisite: ST 511, Corequisite: ST 512", "spring": false, "number": "541", "fall": true, "units": " 3", "description": "Overview of plant breeding methods for advanced undergraduate and beginning graduate students. Covers principles and concepts of inheritance, germplasm resources, pollen control, measurement of genetic variances, and heterosis. Special topics include heritability, genotype-environment interaction, disease resistance, and polyploidy. In-depth coverage on methods for breeding cross-pollinated and self-pollinated crops. Prepares students for advanced plant breeding courses."}, {"summer": false, "name": "Turf Management Systems and Environmental Quality", "prerequisites": "Prerequisite: CS 400", "spring": false, "number": "565", "fall": true, "units": " 3", "description": "Integration of turfgrass management systems and the use of BMPs and IPM to protect environmental quality.  Examination of water quality issues relative to turf.  Application of Best Management Practice and Integrated Pest Management strategies. Credit cannot be received for both CS 465 and CS 565."}, {"summer": "True", "name": "Special Topics", "spring": "True", "number": "590", "fall": "True", "units": " 1-3"}, {"description": "Special problems in various phases of crop science. Problems may be selected or will be assigned. Emphasis on review of recent and current research. Credits Arranged.", "number": "591", "name": "Special Problems"}, {"summer": false, "name": "Seminar", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "601", "fall": true, "units": " 1", "description": "Review and discussion of scientific articles, progress reports in research and special problems of interest to agronomists. Maximum of two credits allowed toward master's degree; however, additional credits toward doctorate allowed."}, {"summer": true, "name": "Special Problems", "spring": true, "number": "620", "fall": true, "units": " 1-3", "description": "Special problems in various phases of crop science. Problems may be selected or will be assigned. Emphasis on review of recent and current research. Credits Arranged."}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "685", "fall": true, "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "688", "fall": true, "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "689", "fall": true, "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": false, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "690", "fall": true, "units": " 1-6", "description": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam."}, {"summer": true, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "693", "fall": true, "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": true, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "695", "fall": true, "units": " 1-9", "description": "Thesis research."}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "696", "fall": false, "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": true, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "699", "fall": true, "units": " 1-3", "description": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis."}, {"summer": false, "name": "Crop Physiology: Plant Response to Environment", "prerequisites": "Prerequisite: BO 321 or BO 421, CH 223", "spring": false, "number": "714", "fall": true, "units": " 3", "description": "Examines interactions between plants and the environment. Light environment, plant canopy development, photosynthesis, source-sink relations, growth analysis, growth regulation, water relations, and environmental stresses are addressed."}, {"summer": false, "name": "Weed Management Systems", "prerequisites": "Prerequisite: CS 414", "spring": false, "number": "717", "fall": true, "units": " 1", "description": "Weed management systems including integration of cultural, biological, mechanical and chemical methods for vegetables, fruits, ornamentals, turf, small grains, corn, tobacco, cotton, peanuts, aquatic and non-cropland settings.  Taught second 5 weeksof semester.  Drop date is by last day of 3rd week of minicourse."}, {"summer": false, "name": "Molecular Biology In Plant Breeding", "prerequisites": "Prerequisite: CS(GN,HS) 741, GN 701, GN 702, GN 703", "spring": true, "number": "720", "fall": false, "units": " 3", "description": "Theory and principles of molecular biology applied to plant breeding. Experimental approaches to induce genetic change, cytoplasmic recombination, haploid utilization and potentials of molecular techniques for solving breeding problems."}, {"summer": false, "name": "Pesticide Chemistry", "prerequisites": "Prerequisite: CH 201 and 221", "spring": true, "number": "725", "fall": false, "units": " 1", "description": "Chemical properties of pesticides including hydration and solvation, ionization, volatilization, lipophilicity, molecular structure and size, and reactivity and classification according to chemical description, mode of action or ionizability. Taughtduring the first 5 weeks of semester. Drop date is last day of 3rd week of the minicourse."}, {"summer": false, "name": "Pesticide Behavior and Fate In the Environment", "prerequisites": "Prerequisite: CS(HS,SSC,TOX) 725,SSC 200", "spring": true, "number": "727", "fall": false, "units": " 2", "description": "Sorption/desorption, soil reactivity, movement, volatilization, bioavailability, degradation and stability of pesticides in the environment. Taught during the last 10 weeks of semester. Drop date is last day of 3rd week of the minicourse."}, {"summer": false, "name": "Herbicide Behavior In Plants", "prerequisites": "Prerequisite: BO 751 and BO 752 and CS(HS,SSC) 725", "spring": true, "number": "729", "fall": false, "units": " 2", "description": "Chemical, physiological and biochemical actions of herbicides in plants including uptake, translocation, metabolism and mechanism of action."}, {"summer": false, "name": "Quantitative Genetics In Plant Breeding", "prerequisites": "Prerequisite: CS(GN, HS) 541, ST 712, course in quantitative genetics recommended", "spring": true, "number": "745", "fall": false, "units": " 1", "description": "Theory and principles of plant quantitative genetics.  Experimental approaches of relationships between type and source of genetic variability, concepts of inbreeding, estimations of genetic variance and selection theory."}, {"summer": false, "name": "Breeding Methods", "prerequisites": "Prerequisite: CS (GN, HS) 741, ST 535", "spring": true, "number": "746", "fall": false, "units": " 2", "description": "Theory and principles of plant breeding methodology including population improvement, selection procedures, genotypic evaluation, cultivar development and breeding strategies."}, {"summer": "True", "name": "Special Topics", "spring": "True", "number": "795", "fall": "True", "units": " 1-3"}, {"summer": false, "name": "Seminar", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "801", "fall": true, "units": " 1", "description": "Review and discussion of scientific articles, progress reports in research and special problems of interest to agronomists. Maximum of two credits allowed toward master's degree; however, additional credits toward doctorate allowed."}, {"summer": true, "name": "Special Problems", "spring": true, "number": "820", "fall": true, "units": " 1-3", "description": "Special problems in various phases of crop science. Problems may be selected or will be assigned. Emphasis on review of recent and current research. Credits Arranged."}, {"summer": false, "name": "Plant Breeding Laboratory", "prerequisites": "Prerequisite: CS(GN,HS)741", "spring": true, "number": "860", "fall": false, "units": " 1", "description": "Visitation of plant breeding projects in the Depts. of CS and HS at NC State, along with commercial seed companies. Discussion and viewing of breeding objectives, methods and equipment and teaching and practice of hybridization methods."}, {"summer": false, "name": "Plant Breeding Laboratory", "prerequisites": "Prerequisite: CS(GN,HS)741", "spring": false, "number": "861", "fall": true, "units": " 1", "description": "Visitation of plant breeding projects in the Depts. of CS and HS at NC State, along with commercial seed companies. Discussion and viewing of breeding objectives, methods and equipment and teaching and practice of hybridization methods."}, {"summer": true, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "885", "fall": true, "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": true, "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "890", "fall": true, "units": " 1-9", "description": "For students who are preparing for and taking written and/oral preliminary exams."}, {"summer": true, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "893", "fall": true, "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": true, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "895", "fall": true, "units": " 1-9", "description": "Dissertation research."}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "896", "fall": false, "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": true, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "899", "fall": true, "units": " 1-3", "description": "For students who have completed all credit hour, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations."}]