[{"summer": "True", "name": "Introduction to Computing-FORTRAN", "prerequisites": "Corequisite: (E115 or PAMS 100) and (MA 121 or MA 131 or MA 141)", "spring": "True", "number": "112", "fall": "True", "units": " 3", "description": "Problem solving through writing FORTRAN programs. Particular elements include: careful development of FORTRAN programs from specifications; documentation and style; appropriate use of control structures, data types and subprograms; abstractions and verification; engineering applications."}, {"summer": false, "name": "Introduction to MATLAB", "prerequisites": "Corequisite: (E 115 or PAMS 100) and (MA 121 or MA 131 or MA 141)", "spring": true, "number": "113", "fall": true, "units": " 3", "description": "Problem solving through writing MATLAB programs. Particular elements include: careful development of MATLAB programs from specifications; documentation and style; appropriate use of control structures, data types and subprograms; abstractions and verification; engineering applications."}, {"summer": "True", "name": "Introduction to Computing-C++", "prerequisites": "Corequisite: (E115 or PAMS 100) and (MA 121 or MA 131 or MA 141)", "spring": "True", "number": "114", "fall": "True", "units": " 3", "description": "An introductory course in computing in C++.  Emphasis on algorithm development and problem solving. Particular elements include: careful and methodical development of C++ programs from specifications; documentation and style; appropriate use of control structures, data types and subprograms; data abstraction and verification; numeric and nonnumeric applications; introduction to object-oriented programming and design."}, {"summer": "True", "name": "Introduction to Computing - Java", "prerequisites": "Corequisite: (E115 or PAMS 100) and (MA 121 or MA 131 or MA 141)", "spring": "True", "number": "116", "fall": "True", "units": " 3", "description": "An introductory course in computing in Java.  Emphasis on algorithm development and problem solving.  Careful and methodical development of Java applications and applets from specifications; documentation and style; appropriate use of control structures; classes and methods; data types and data abstraction; object-oriented programming and design; graphical user interface design."}, {"summer": "True", "name": "Introduction to Computers and Their Uses", "spring": "True", "number": "200", "fall": "True", "units": " 3", "description": "Survey of basic principles of computer hardware, communications, operating systems, microcomputer issues, security, impact on society, system development, and use in organizations.  Hands-on use of software, including operating system commands, wordprocessing, spreadsheets, and database managers.  Demonstration and application of current end-user applications. May not be used by CSC major as a restricted elective."}, {"summer": "True", "name": "Programming Concepts", "prerequisites": "Prerequisite: CSC 114 with a grade of C- or better", "spring": "True", "number": "214", "fall": "True", "units": " 3", "description": "Software design in a high-level language: abstract data types, modular programming, management of large programs. Dynamic memory management: linked lists, pointers, allocation and deallocation. Alternate programming paradigms: recursive list processing, object-oriented programming."}, {"summer": "True", "name": "Programming Concepts - Java", "prerequisites": "Prerequisite: CSC 116 with a grade of C- or better", "spring": "True", "number": "216", "fall": "True", "units": " 3", "description": "The second course in computing, intended for majors.  Emphasis is placed on interpretation of inductive definitions (functions and data types); testing strategies; specification and implementation of finite-state machine; encapsulation; polymorphism; inheritance; class invariants; and resource management"}, {"summer": "True", "name": "Applied Discrete Mathematics", "prerequisites": "Prerequisite: MA 101 or equivalent completed in high school.", "spring": "True", "number": "224", "fall": "True", "units": " 3", "description": "Formal logic. Methods of proof including induction. Introduction to grammars and finite state machines. Recurrence relations and asymptotic behavior of functions. Sets and counting. Boolean expressions and logic networks. Graphs and relations."}, {"summer": "True", "name": "Discrete Mathematics for Computer Scientists", "prerequisites": "Prerequisite: MA 101 or equivalent completed in high school ; CSC,CSU Majors and minors;CPE,CPU Majors", "spring": "True", "number": "226", "fall": "True", "units": " 3", "description": "Propositional logic and the predicate calculus.  Logic gates and circuits.  Methods of proof.  Elementary set theory.  Mathematical induction.  Recursive definitions and algorithms.  Solving recurrences.  The analysis of algorithms and asymptotic growth of functions.  Elementary combinatorics.  Introduction to graph theory.  Ordered sets, including posets and equivalence relations.  Introduction to formal languages and automata."}, {"summer": "True", "name": "C and Software Tools", "prerequisites": "Prerequisite: CSC 216 with a C- or better and CSC or CSU Majors and Minors.", "spring": "True", "number": "230", "fall": "True", "units": " 3", "description": "Details of C programming as compared with Java; Lexical structure, syntax, semantics, and pragmatics (idioms, common uses) of C; Stages of compliation, linking and execution; Strings, arrays, structures, pointers, and memory management; C libraries;Tools for design, maintenance, and debugging of programs; Separate compliation, modular programming; Integrated development environments."}, {"summer": "True", "name": "Computer Organization and Assembly Language", "prerequisites": "Prerequisite: CSC 214 with a grade of C- or better", "spring": "True", "number": "234", "fall": "True", "units": " 3", "description": "Number systems, von Neuman machines, instruction sets and machine code, data representation, assemblers and assembly language programming, compilers, external and internal processor organization, memory, I/O organization and devices. Detailed study of a contemporary processor architecture."}, {"summer": "True", "name": "Computer Organization and Assembly Language for Computer Scientists", "prerequisites": "Prerequisite: CSC 216 with a C- or better and CSC or CSU Majors and Minors.", "spring": "True", "number": "236", "fall": "True", "units": " 3", "description": "Computer architecture topics required by professional software developers, including binary and hexadecimal numbers, hardware component organization, machine instruction sets, assembler language programming, linking assembler language with high-level languages, program testing, computer hardware design issues, computer software design issues, and trends in current computer design."}, {"summer": "True", "name": "Concepts and Facilities of Operating Systems", "prerequisites": "Corequisite: CSC 234", "spring": "True", "number": "244", "fall": "True", "units": " 3", "description": "The history and evolution of operating systems, concepts of process management, memory addressing and allocation, files and protection, deadlocks and distributed systems."}, {"summer": "True", "name": "Concepts and Facilities of Operating Systems for Computer Scientists", "prerequisites": "Prerequisite: CSC 230; Corequisite: CSC 236; CSC and CSU Majors and Minors", "spring": "True", "number": "246", "fall": "True", "units": " 3", "description": "Fundamental concepts of computer operating systems for computer scientists, including memory management, file systems, process management, distributed systems, deadlocks, and basic security and system accounting."}, {"summer": "True", "name": "Web Page Development", "prerequisites": "Prerequisite: E 115 or equivalent knowledge of EOS/Unity system", "spring": "True", "number": "251", "fall": "True", "units": " 1", "description": "Syntax and semantics of HTML (HyperText Markup Language).  Students will learn necessary skills to develop web pages on their EOS/Unity account.  In addition to mechanics, design aspects and bandwidth conservancy are covered.  Several pages will be created including a final project."}, {"summer": "True", "name": "Introduction to Software Testing", "prerequisites": "Prerequisite: CSC 112 or CSC 114 or CSC 116", "spring": "True", "number": "252", "fall": "True", "units": " 1", "description": "Introduction to software testing provides an understanding of what software testing is and its key role in determining the quality of a software application for the customer.  It covers the software test life cycle phases; test planning, acquisitionand execution, how the software test life cycle aligns with the software development life cycle, and the different levels of software testing."}, {"summer": "True", "name": "String Processing Languages", "prerequisites": "Prerequisite: Programming knowledge", "spring": "True", "number": "255", "fall": "True", "units": " 1", "description": "Syntax and semantics of a string manipulation language, currently SNOBOL 4.  Application of the language to programming problems in non-numeric areas.  Discussion of other string processing languages such as PERL."}, {"summer": "True", "name": "Introduction to Java", "prerequisites": "Prerequisite: CSC 214", "spring": "True", "number": "257", "fall": "True", "units": " 1", "description": "Introduction to the Java programming language. Object-oriented techniques and language syntax.  Java class libraries including strings, graphical interfaces, events, exceptions, arguments, threads, file i/o, and networking."}, {"summer": "True", "name": "Foundations of Interactive Game Design", "spring": "True", "number": "281", "fall": "True", "units": " 3", "description": "Surveys history, technology, narrative, ethics, and design of interactive computer games.  Work in teams to develop novel game designs and computer games.  Introduction to the interplay of narrative, technology, rule systems, play and culture in the creation of interactive games.  Programming experience not required.  Enrollment restricted to students with at least sophomore status."}, {"summer": "True", "name": "Special Topics in Computer Science", "spring": "True", "number": "295", "fall": "True", "units": " 1-3", "description": "Special topics in CSC at the early undergraduate level."}, {"summer": "True", "name": "Introduction to Numerical Methods", "prerequisites": "Prerequisite: CSC 116 and MA 305, CSC Majors or 2.75 GPA", "spring": "True", "number": "302", "fall": "True", "units": " 3", "description": "Numerical computations with digital computers; floating point arithmetic and implications of round-off error. Algorithms and computer techniques for the numerical solution of problems in: function evaluation; zeros of functions; interpolation; numerical differentiation and integration; linear systems of equations; curve fitting; solutions of non-linear equations; numerical solutions of ordinary differential equations."}, {"summer": "True", "name": "Data Structures", "prerequisites": "Prerequisite: CSC 214 and CSC 224 with a grade of C- or better", "spring": "True", "number": "314", "fall": "True", "units": " 3", "description": "A survey of fundamental abstract data types along with efficient implementations for each.  Emphasizes asymptotic running time as a measure of program performance.  Lists, stacks, queues, sparse arrays, binary trees, heaps, balanced search trees, and hash tables. Illustrative applications such as graph, text-processing, or geometric algorithms."}, {"summer": "True", "name": "Data Structures for Computer Scientists", "prerequisites": "Prerequisite: CSC 216 and CSC 226 with a grade of C- or better; CSC, CSU Majors and Minors and CPE Majors", "spring": "True", "number": "316", "fall": "True", "units": " 3", "description": "Abstract data types; abstract and implementation-level views of data types.  Linear and branching data structures, including stacks, queues, trees, heaps, hash tables, graphs, and others at discretion of instructor.  Best, worst, and average case asymptotic time and space complexity as a means of formal analysis of iterative and recursive algorithms."}, {"summer": "True", "name": "Software Engineering", "prerequisites": "Prerequisite: CSC 230 and either CSC 314 or CSC 316", "spring": "True", "number": "326", "fall": "True", "units": " 3", "description": "Application of product engineering methods to software: quality assurance, project management, requirements analysis, specifications, design, development, testing, production and maintenance."}, {"summer": "True", "name": "Automata, Grammars, and Computability", "prerequisites": "Prerequisite: Grade of C- or better in CSC 226, CSC Majors or 2.75 GPA", "spring": "True", "number": "333", "fall": "True", "units": " 3", "description": "Study of three classical formal models of computation--finite state machines, context-free grammars, and Turing machines--and the corresponding families of formal languages.  Power and limitations of each model.  Parsing.  Non-determinism. The Halting Problem and undecidability. The classes P and NP, and NP-completeness."}, {"summer": "True", "name": "Information Systems Management", "prerequisites": "Prerequisite: Successful completion of the Software Skills Test", "spring": "True", "number": "340", "fall": "True", "units": " 3", "description": "Fundamentals of information systems development and use in organizational setting.  Information systems (IS), concepts, hardware, software, telecommunications, database management.  IS development, applications  and management in telecommunications,database management, various business processes, global issues, security and ethical challenges."}, {"summer": "True", "name": "Applied Web-based Client-Server Computing", "prerequisites": "Prerequisite: CSC 216 with a grade of C- or better", "spring": "True", "number": "342", "fall": "True", "units": " 3", "description": "This course explores client-server computing on the World Wide Web.  The course focuses on the architecture of web-based client-server applications and accepted industry practices.  Students work in teams to develop web applications with dynamic content delivery."}, {"summer": "True", "name": "Ethics in Computing", "prerequisites": "Prerequisite: Junior standing, CSC Majors or 2.7 minimum GPA", "spring": "True", "number": "379", "fall": "True", "units": " 1", "description": "Discussion of the concern for the way in which computers pose new ethical questions or pose new versions of standard moral problems and dilemmas. Study of ethical concepts to guide the computer professional. Computer professional codes of ethics. Use of case studies to relate to ethical theory. Ethical and legal use of software. Conflicts of interest."}, {"summer": "True", "name": "Data and Computer Communications Networks", "prerequisites": "Prerequisite: ST 370 and CSC 246", "spring": "True", "number": "401", "fall": "True", "units": " 3", "description": "Basic concepts of data communication networking and computer communications architectures, including packet/circuit/virtual-circuit switching, layered communication architecture and OSI layers, general description of DLC, network and transport layers, some detailed protocol study of Ethernet, ATM and TCP/IP. Credit is not allowed for both CSC 401 and ECE 407."}, {"summer": "True", "name": "Network Projects", "prerequisites": "Prerequisite: CSC 401", "spring": "True", "number": "402", "fall": "True", "units": " 3", "description": "Under the supervision of faculty members, students engage in projects that may include communication architecture implementation, networking technology assessment, network performance evaluation, and network administration.  Comprehensive written and oral project report required. No auditing."}, {"summer": "True", "name": "Introduction to Computer Security", "prerequisites": "Prerequisite: CSC 246", "spring": "True", "number": "405", "fall": "True", "units": " 3", "description": "Basic concepts and techniques in information security and management such as risks and vulnerabilities, applied cryptography, program security, malicious software, authentication, access control, operating systems security, multilevel security, trusted operating systems, database security, inference control, physical security, and system assurance and evaluation.  Coverage of high-level concepts such as confidentiality, integrity, and availability applied to hardware, software, and data."}, {"summer": "True", "name": "Introduction to Artificial Intelligence", "prerequisites": "Prerequisite: CSC 316", "spring": "True", "number": "411", "fall": "True", "units": " 3", "description": "Overview and definitions of Artificial Intelligence (AI).   Search, including depth-first and breadth-first techniques with backtracking.  Knowledge representation with emphasis on logical methods, Horn databases, resolution, quantification, unification, skolemization and control issues;  non-monotonic reasoning; frames; semantic nets.  AI systems, including planning, learning, natural language and expert systems.  An AI programming language may be taught at the instructor's discretion."}, {"summer": "True", "name": "Electronic Commerce Technology", "prerequisites": "Prerequisite: CSC 316", "spring": "True", "number": "413", "fall": "True", "units": " 3", "description": "An introduction to the technologies underlying electronic commerce.  Topics include Web protocols and languages, Web mining, product ontologies, security anonymity, privacy, recommendation systems, personalization, auctions, trading agents, and intellectual property."}, {"summer": "True", "name": "Introduction to Combinatorics", "prerequisites": "Prerequisite: MA 225 or CSC 226", "spring": "True", "number": "416", "fall": "True", "units": " 3", "description": "Basic principles of counting: addition and multiplication principles, generating functions, recursive methods, inclusion-exclusion, pigeonhole principle; basic concepts of graph theory: graphs, digraphs, connectedness, trees; additional topics from:Polya theory of counting, Ramsey theory; combinatorial optimization - matching and covering, minimum spanning trees, minimum distance, maximum flow; sieves; mobius inversion; partitions; Gaussian numbers and q-analogues; bijections and involutions; partially ordered sets."}, {"summer": "True", "name": "Theory of Programming Languages", "prerequisites": "Prerequisite: CSC 316", "spring": "True", "number": "417", "fall": "True", "units": " 3", "description": "Theory of programming languages with emphasis on programming language semantics and implementation issues.  Formal models of syntax and semantics.  Static versus dynamic scoping.  Parameter passing mechanisms.  Garbage collection.  Programming in alternate paradigms such as applicative, functional, logic, and object-oriented programming languages."}, {"summer": "True", "name": "Automated Learning and Data Analysis", "prerequisites": "Prerequisite: ST 370 and MA 305, and a grade of C- or better in either CSC 226 or LOG 201", "spring": "True", "number": "422", "fall": "True", "units": " 3", "description": "Introduction to the problems and techniques for automated discovery of knowledge in databases.  Topics include representation, evaluation, and formalization of knowledge for discovery; classification, prediction, clustering, and association methods.Selected applications in commerce, security, and bioinformatics. Students cannot get credit for both CSC 422 and CSC 522."}, {"summer": "True", "name": "Information Resources Management", "prerequisites": "Prerequisite: CSC/BUS 340", "spring": "True", "number": "423", "fall": "True", "units": " 3", "description": "Information Resources Management as a process that encompasses strategic planning, the implementation of new technology, dramatic changes to both the corporate Management Information Services and traditional information systems architecture, and the emerging role of end user computing to enable a business enterprise to operate effectively. May not be used as a CSC restricted elective."}, {"summer": "True", "name": "Engineering Knowledge- Based Services", "prerequisites": "Prerequisite: CSC 316", "spring": "True", "number": "425", "fall": "True", "units": " 3", "description": "Applied knowledge representation and reasoning, including formal methods for explicit representation of knowledge, pragmatics of methods for acquiring knowledge from experts, and reasoning methods organized to support configuration, diagnosis, scheduling, information, integration and interpretation, and other major service types. Credit is not allowed for both CSC 425 and CSC 525."}, {"summer": "True", "name": "Introduction to Numerical Analysis I", "prerequisites": "Prerequisite: MA 301 and programming language proficiency", "spring": "True", "number": "427", "fall": "True", "units": " 3", "description": "Theory and practice of computational procedures including approximation of functions by interpolating polynomials, numerical differentiation and integration, and solution of ordinary differential equations including both initial value and boundary value problems.  Computer applications and techniques."}, {"summer": "True", "name": "Introduction to Numerical Analysis II", "prerequisites": "Prerequisite: MA 405 and programming language proficiency; MA (CSC) 427 is not a prerequisite", "spring": "True", "number": "428", "fall": "True", "units": " 3", "description": "Computational procedures including direct and iterative solution of linear and nonlinear equations, matrices and eigenvalue calculations, function approximation by least squares, smoothing functions, and minimax approximations."}, {"summer": "True", "name": "File Organization and Processing", "prerequisites": "Prerequisite: CSC 230 and CSC 316", "spring": "True", "number": "431", "fall": "True", "units": " 3", "description": "Hardware characteristics of storage devices.  Basic file organizations including sequential, direct, and indexed sequential; hashing and collision resolution; perfect hashing; signatures; bloom filters; sorting and other bit level structures. Tree structures including binary search trees, B-trees, and trees.  Dynamic hashing techniques. Structures including grid files.  Applying file structures to practical problems."}, {"summer": "True", "name": "Database Management Systems", "prerequisites": "Prerequisite: CSC 316, CSC Majors", "spring": "True", "number": "440", "fall": "True", "units": " 3", "description": "Introduction to database concepts.  This course examines the logical organization of databases: the entity-relationship model; the relational data model and its languages.  Functional dependencies and normal forms.  Design, implementation, and optimization of query languages; security and integrity, concurrency control, transaction processing, and distributed database systems."}, {"summer": "True", "name": "Introduction to Simulation", "prerequisites": "Prerequisite: MA 242, ST 372, programming proficiency", "spring": "True", "number": "441", "fall": "True", "units": " 3", "description": "Discrete-event stochastic simulation for the modeling and analysis of systems.  Programming of simulation models in a simulation language.  Input data analysis, variance reduction techniques, validation and verification, and analysis of simulation output.  Random number generators and random variate generation."}, {"summer": "True", "name": "Web Services", "prerequisites": "Prerequisite: CSC 316", "spring": "True", "number": "450", "fall": "True", "units": " 3", "description": "Concepts, theories, and techniques for Web services.  This course examines architectures for Web applications based on the classical publish, find, and bind triangle.  It considers the description, discovery, and engagement of Web services.  It emphasizes Web service composition.  Key topics include semantics, transactions, processes, agents, quality of service, and compliance."}, {"summer": "True", "name": "Software for Wireless Sensor Systems", "prerequisites": "Prerequisite: (CSC 246 or ECE 306) and CSC 230 and CSC 316", "spring": "True", "number": "453", "fall": "True", "units": " 3", "description": "Development of software for wireless computer systems. Software designs for applications and networking in this environment, including algorithms for ad hoc discovery, routing, and secure data transfer. Software interface to related sensors and subsystems including global positioning system. Algorithms for power management. Programming required."}, {"summer": "True", "name": "Human-Computer Interaction", "prerequisites": "Prerequisite: CSC 316", "spring": "True", "number": "454", "fall": "True", "units": " 3", "description": "A survey of concepts and techniques for user interface design and human computer interaction.  Emphasizes user-centered design, interface development techniques, and usability evaluation."}, {"summer": "True", "name": "Computer Architecture and Multiprocessors", "prerequisites": "Prerequisite: CSC 236 and CSC 316", "spring": "True", "number": "456", "fall": "True", "units": " 3", "description": "Major components of digital computers and the organization of these components into systems.  Begins with single processor systems and extends to parallel systems for multiprocessing.  Topics include computer organization, instruction set design, cache memory, pipelined processors, and multiprocessors.  Recent developments in PC and desktop architectures are also studied."}, {"summer": "True", "name": "Digital Systems Interfacing", "prerequisites": "Prerequisite: A grade of C- or better in either ECE 206 or CSC 312", "spring": "True", "number": "460", "fall": "True", "units": " 3", "description": "Concepts of microcomputer system architecture and applications to fundamental computer hardware.  Theoretical and practical aspects of interfacing and a variety of microprocessor peripheral chips with specific microprocessor/microcomputer systems from both hardware and software points of view."}, {"summer": "True", "name": "Computer Graphics", "prerequisites": "Prerequisite: MA 305, CSC 230 and CSC 316", "spring": "True", "number": "461", "fall": "True", "units": " 3", "description": "Principles of computer graphics with emphasis on two-dimensional and aspects of three-dimensional raster graphics. Topics include: graphics hardware devices, lines and polygons, clipping lines and polygons to windows, graphical user interface, vectors, projections, transformations, polygon fill.  Programming projects in C or C++."}, {"summer": "True", "name": "Advanced Computer Graphics Projects", "prerequisites": "Prerequisite: CSC 461, CSC Majors", "spring": "True", "number": "462", "fall": "True", "units": " 3", "description": "Principles of computer graphics with emphasis on three-dimensional graphics. Topics include: 3-D projections and transformations, curves and surfaces, color and texture, animation, visualization, and global illumination techniques.  Programming project required."}, {"summer": "True", "name": "Multimedia Technology", "prerequisites": "Prerequisite: CSC 246", "spring": "True", "number": "467", "fall": "True", "units": " 3", "description": "Methods of creating, recording, compressing, parsing, editing and playing back on a computer the following media: sound, music, voice, graphics, images, video, and motion.  Introduction to basic principles: signal processing, information theory, real-time scheduling.  Also includes discussion of standards, programming tools and languages, storage and I/O devices, networking support, legal issues, user interfaces, and applications.  Includes significant hands-on experience."}, {"summer": "True", "name": "Network Security", "prerequisites": "Prereequisite: CSC 230", "spring": "True", "number": "474", "fall": "True", "units": " 3", "description": "Basic concepts and techniques in information security and management such as risks and vulnerabilities, applied cryptography, authentication, access control, multilevel security, multilateral security, network attacks and defense, intrusion detection, physical security, copyright protection, privacy mechanisms, security management, system assurance and evaluation, and information warfare.  Coverage of high-level concepts such as confidentiality, integrity, and availability applied to hardware, software, and data.  Credit not allowed for both CSC 474 and CSC 574."}, {"summer": "True", "name": "Game Engine Foundations", "prerequisites": "Prerequisite: CSC 316", "spring": "True", "number": "481", "fall": "True", "units": " 3", "description": "An introduction to game engines, the technologies underlying computer and console game development.  This course will cover engine components, architectures, and designs. Topics include asset management, resource management, event management, memory management, timelines, multithreading, network architectures, and game object models. A sequence of programming assignments will lead students through the implementation of their own game engine, which they will use to design their own game."}, {"summer": "True", "name": "Advanced Computer Game Projects", "prerequisites": "Prerequisite: CSC 481", "spring": "True", "number": "482", "fall": "True", "units": " 3", "description": "Principles of computer game development with emphasis on 3D first-person game engines.  Topics include: advanced character behavior control, procedural content generation, large scale mulit-player game design and infrastructure, serious games for education, training and other applications, the game production pipeline and project built on top of a commercial game engine.  Consideration of the game production pipeline, including project pitches, requirements and design detail.  Programming project with written and oral reporting is required.  Enrollment open to CSC majors only."}, {"summer": false, "name": "Building Game AI", "prerequisites": "Prerequisite: CSC 316", "spring": true, "number": "484", "fall": false, "units": " 3", "description": "In this course we will examine Artificial Intelligence (AI) techniques that are used in the design of computer games. We will look at techniques for game playing as well as the design of AI opponents tasked with creating \"good experiences\" for players. The course will begin with a discussion of general AI, common algorithms, data structures, and representations. From there, we will cover topics in character movement, pathfinding, decision making, strategy, tactics, and learning. In a sequence of programming assignments students will create increasingly sophisticated AI implementations. Students will also critically review the projects conducted by graduate students enrolled in CSC584. CSC majors only."}, {"summer": "True", "name": "Innovating in Technology", "prerequisites": "Prerequisite: CSC 316", "spring": "True", "number": "485", "fall": "True", "units": " 3", "description": "Importance of innovation to the success of the technical individual, State, and Nation. Techniques for becoming more innovative. Innovations important to recent generations. Innovations needed to help humankind. Applying new technologies, e.g. search engines and the Internet, to innovation. Strategies for innovation. Why ideas fail. Why failures are important to successes. Factors influencing success, especially the human interface. Students will develop proof-of-concept prototype or requirements document, write proposal for potential funding, and make oral presentation of innovation. Team work encouraged."}, {"summer": "True", "name": "Senior Design Project", "prerequisites": "Prerequisite: CSC 326 ; CSC Majors", "spring": "True", "number": "492", "fall": "True", "units": " 3", "description": "Application of software engineering principles and basic computer science to the total development of a software system.  Consideration of the software system design process, including requirements and design detail.  Development and evaluation of a prototype accomplished through design team activity.  Comprehensive written and oral project report is required. Open to CSC majors."}, {"summer": "True", "name": "Special Topics in Computer Science", "spring": "True", "number": "495", "fall": "True", "units": " 1-6", "description": "Used for the following types of study: readings in the literature of computer science, introductory research projects, major computer programming projects, seminars, or new course development. Work may be done in any CSC area such as software, hardware utilization, programming languages, numerical methods or telecommunications. Departmental Approval Required."}, {"summer": "True", "name": "Independent Research in Computer Science", "spring": "True", "number": "499", "fall": "True", "units": " 1-6", "description": "Independent investigation of a research problem under faculty supervision. Departmental Approval Required."}, {"summer": "True", "name": "Operating Systems Principles", "prerequisites": "Prerequisite: CSC 244, CSC 314 and MA 421", "spring": "True", "number": "501", "fall": "True", "units": " 3", "description": "Fundamental issues related to the design of operating systems. Process scheduling and coordination, deadlock, memory management and elements of distributed systems."}, {"summer": "True", "name": "Computational Applied Logic", "prerequisites": "Prerequisite: CSC 333 of LOG 335 or LOG 435", "spring": "True", "number": "503", "fall": "True", "units": " 3", "description": "Introduction to the conceptual and formal apparatus of mathematical logic, to mathematical concepts underlying the process of logical formalization, and to the applications of various logics across a broad spectrum of problems in computer science and artificial intelligence."}, {"summer": "True", "name": "Design and Analysis Of Algorithms", "prerequisites": "Prerequisite: CSC 314 and CSC 224", "spring": "True", "number": "505", "fall": "True", "units": " 3", "description": "Algorithm design techniques: use of data structures, divide and conquer, dynamic programming, greedy techniques, local and global search. Complexity and analysis of algorithms: asymptotic analysis, worst case and average case, recurrences, lower bounds, NP-completeness. Algorithms for classical problems including sorting, searching and graph problems (connectivity, shortest paths, minimum spanning trees)."}, {"summer": "True", "name": "Architecture Of Parallel Computers", "prerequisites": "Prerequisite: CSC 312, or CSC 456, or ECE 406.", "spring": "True", "number": "506", "fall": "True", "units": " 3", "description": "The need for parallel and massively parallel computers.  Taxonomy of parallel computer architecture, and programming models for parallel architectures.  Example parallel algorithms.  Shared-memory vs. distributed-memory architectures.  Correctness and performance issues.  Cache coherence and memory consistency.  Bus-based and scalable directory-based multiprocessors.  Interconnection-network topologies and switch design.  Brief overview of advanced topics such as multiprocessor prefetching and speculative parallel execution."}, {"summer": "True", "name": "Software Engineering", "prerequisites": "Prerequisite: CSC 314 and CSC 224", "spring": "True", "number": "510", "fall": "True", "units": " 3", "description": "An introduction to software life cycle models; size estimation; cost and schedule estimation; project management; risk management; formal technical reviews; analysis, design, coding and testing methods; configuration management and change control; and software reliability estimation. Emphasis on large development projects. An individual project required following good software engineering practices throughout the semester."}, {"summer": "True", "name": "Compiler Construction", "prerequisites": "Prerequisite: CSC 314 and 333", "spring": "True", "number": "512", "fall": "True", "units": " 3", "description": "Theory and practice of compiler writing. Lexical analysis, table driven LL(1), LR(1) and LALR(1) parsers, code generation, flow analysis, run-time storage organization and optimization. Writing a compiler using software tools a significant part of course."}, {"summer": "True", "name": "Electronic Commerce Technology", "prerequisites": "Prerequisite: CSC 501", "spring": "True", "number": "513", "fall": "True", "units": " 3", "description": "Exploration of technological issues and challenges underlying electronic commerce.  Distributed systems; network infrastructures; security, trust, and payment solutions; transaction and database systems; and presentation issues.  Project required. No Audits."}, {"summer": "True", "name": "Object-Oriented Languages and Systems", "prerequisites": "Prerequisite: CSC 316", "spring": "True", "number": "517", "fall": "True", "units": " 3", "description": "Object-oriented languages and systems built with object-oriented software components. Object-oriented design methodologies, such as CRC cards and the Unified Modeling Language (UML).  Requirement analysis.  Design patterns.  Agile methods.  Object-oriented programming environments, such as the Eclipse platform.  Platforms for Web services, such as J2EE.  Project required."}, {"summer": "True", "name": "Artificial Intelligence I", "prerequisites": "Prerequisite: CSC 316 and either CSC 224 or LOG 201 or LOG 335 or background in symbolic logic", "spring": "True", "number": "520", "fall": "True", "units": " 3", "description": "Introduction to and overview of artificial intelligence. Study of AI programming language such as LISP or PROLOG. Elements of AI problem-solving technique. State spaces and search techniques. Logic, theorem proving and associative databases. Introduction to knowledge representation, expert systems and selected topics including natural language processing, vision and robotics."}, {"summer": "True", "name": "Artificial Intelligence Programming", "prerequisites": "Prerequisite: CSC 520 or CSC 411", "spring": "True", "number": "521", "fall": "True", "units": " 3", "description": "Introduction to techniques for developing AI systems and programming in a language of AI, Common Lisp. Implementation and extension of systems for problem solving, pattern matching, rule-based processing, machine learning, planning, and related areas."}, {"summer": "True", "name": "Automated Learning and Data Analysis", "prerequisites": "Prerequisite: CSC 226 or LOG 201, ST 370, MA 305", "spring": "True", "number": "522", "fall": "True", "units": " 3", "description": "Introduction to the problems and techniques for automated discovery of knowledge in databases.  Topics include representation, evaluation, and formalization of knowledge for discovery; classification, prediction, clustering, and association methods.Selected applications in commerce, security, and bioinformatics. Students cannot get credit for both CSC 422 and CSC 522."}, {"summer": "True", "name": "Engineering Knowledge- Based Services", "prerequisites": "Prerequisite: CSC 316", "spring": "True", "number": "525", "fall": "True", "units": " 3", "description": "Applied knowledge representation and reasoning, including formal methods for explicit representation of knowledge, pragmatics of methods for acquiring knowledge from experts, and reasoning methods organized to support configuration, diagnosis, scheduling, information, integration and interpretation, and other major service types. Credit is not allowed for both CSC 425 and CSC 525."}, {"summer": "True", "name": "Computational Methods for Molecular Biology", "prerequisites": "Prerequisite: CSC 314, Corequisite: CSC 505", "spring": "True", "number": "530", "fall": "True", "units": " 3", "description": "Computer algorithms supporting genomic research:  DNA sequence comparison and assembly, hybridization mapping, phylogenetic reconstruction, genome rearrangement, protein folding and threading."}, {"summer": "True", "name": "Database Management concepts and Systems", "prerequisites": "Prerequisite: CSC 316", "spring": "True", "number": "540", "fall": "True", "units": " 3", "description": "Advanced database concepts.  Logical organization of databases: the entity-relationship model; the relational data model and its languages.  Functional dependencies and normal forms.  Design, implementation, and optimization of query languages; security and integrity, consurrency control, transaction processing, and distributed database systems."}, {"summer": "True", "name": "Advanced Data Structures", "prerequisites": "Prerequisite: CSC 314", "spring": "True", "number": "541", "fall": "True", "units": " 3", "description": "Complex and specialized data structures relevant to design and development of effective and efficient software. Hardware characteristics of storage media. Primary file organizations. Hashing functions and collision resolution techniques. Low level and bit level structures including signatures, superimposed coding, disjoint coding and Bloom filters. Tree and related structures including AVL trees, B*trees, tries and dynamic hashing techniques."}, {"summer": "True", "name": "Management Decision and Control Systems", "prerequisites": "Prerequisite: CSC 423 or BUS 541", "spring": "True", "number": "546", "fall": "True", "units": " 3", "description": "Planning, design, and development and implementation of comprehensive computer-based information systems to support management decisions. Formal information systems principles; information requirements analysis; knowledge acquisition techniques; information modeling. Information resource management for quality operational control and decision support; system evaluation, process improvement and cost effectiveness."}, {"summer": "True", "name": "Parallel Systems", "prerequisites": "Prerequisite: CSC 246 or CSC 451 or CSC 501", "spring": "True", "number": "548", "fall": "True", "units": " 3", "description": "Basic concepts of parallel computation; parallel programming models and algorithm design; load balancing and performance optimization; parallel I/0 and high-end storage systems; high performance parallel applications."}, {"summer": "True", "name": "Human-Computer Interaction", "prerequisites": "Prerequisite: CSC 314", "spring": "True", "number": "554", "fall": "True", "units": " 3", "description": "Basic theory and concepts of human-computer interaction.  Human and computational aspects.  Cognitive engineering. Practical HCI skills. Significant historical case studies. Current technology and future directions in user interface development."}, {"summer": "True", "name": "Multimedia Computing and Networking", "prerequisites": "Prerequisite: CSC 501 and CSC/ECE 570", "spring": "True", "number": "557", "fall": "True", "units": " 3", "description": "An introduction to the technologies that support the creation of sound, images, and video on the computer, and transmission across networks. Physical and perceptual properties of each media type. Operations on multimedia, including recording, processing, and playback. Important compression methods and standards, such as JPEG and MPEG. Techniques for providing low-latency, bounded-error, multicast transmission in packet-switched networks."}, {"summer": "True", "name": "Computer Graphics", "prerequisites": "Prerequisite: CSC Majors", "spring": "True", "number": "562", "fall": "True", "units": " 3", "description": "Principles of computer graphics with emphasis on three-dimensional graphics.  3-D progjections and transformations, curves and surfaces, color and texture, animation, visualization, and global illumination techniques.  Programming project required."}, {"summer": "True", "name": "Graph Theory", "prerequisites": "Prerequisite: CSC 224 or MA 351.", "spring": "True", "number": "565", "fall": "True", "units": " 3", "description": "Basic concepts of graph theory. Trees and forests. Vector spaces associated with a graph. Representation of graphs by binary matrices and list structures. Traversability. Connectivity. Matchings and assignment problems. Planar graphs. Colorability. Directed graphs. Applications of graph theory with emphasis on organizing problems in a form suitable for computer solution."}, {"summer": "True", "name": "Computer Networks", "prerequisites": "Prerequisite: ECE 206 or CSC 312, ST 371, CSC 258 and Senior standing or Graduate standing", "spring": "True", "number": "570", "fall": "True", "units": " 3", "description": "General introduction to computer networks.  Discussion of protocol principles, local area and wide area networking, OSI stack, TCP/IP and quality of service principles.  Detailed discussion of topics in medium access control, error control coding, and flow control mechanisms.  Introduction to networking simulation, security, wireless and optical networking."}, {"summer": "True", "name": "Internet Protocols", "prerequisites": "Prerequisite: CSC/ECE 570", "spring": "True", "number": "573", "fall": "True", "units": " 3", "description": "Principles and issues underlying provision of wide area connectivity through interconnection of autonomous networks.  Internet architecture and protocols today and likely evolution in future.  Case studies of particular protocols to demonstrate how fundamental principles applied in practice.  Selected examples of networked clinet/server applications to motivate the functional requirements of internetworking.  Project required."}, {"summer": "True", "name": "Computer and Network Security", "prerequisites": "Prerequisite: (CSC 316) and (CSC 401 or CSC/ECE 570)", "spring": "True", "number": "574", "fall": "True", "units": " 3", "description": "Security policies, models, and mechanisms for secrecy, integrity, and availability. Basic cryptography and its applications; operating system models and mechanisms for mandatory and discretionary controls; introduction to database security; securityin distributed systems; network security (firewalls, IPsec, and SSL); and control and prevention of viruses and other rogue programs."}, {"summer": "True", "name": "Introduction to Wireless Networking", "prerequisites": "Prerequisite: ECE/CSC 570", "spring": "True", "number": "575", "fall": "True", "units": " 3", "description": "Introduction to cellular communications, wireless local area networks, ad-hoc and IP infrastructures. Topics include: cellular networks, mobility mannagement, connection admission control algorithms, mobility models, wireless IP networks, ad-hoc routing, sensor networks, quality of service, and wireless security."}, {"summer": "True", "name": "Networking Services: QoS, Signaling, Processes", "prerequisites": "Prerequisite: CSC/ECE 570", "spring": "True", "number": "576", "fall": "True", "units": " 3", "description": "Topics related to networking services, signaling for setting up networking services, such as SIP and IMS, networking architectures for providing QoS for networking services, such as MPLS, DiffServ and RAC, signaling protocols for setting up QoS connections in the transport stratum, such as LDP and RSVP-TE, video-based communications, and capacity planning models for dimensioning services."}, {"summer": "True", "name": "Introduction to Computer Performance Modeling", "prerequisites": "Prerequisite: CSC 312 or ECE 206 and MA 421", "spring": "True", "number": "579", "fall": "True", "units": " 3", "description": "Workload characterization, collection and analysis of performance data, instrumentation, tuning, analytic models including queuing network models and operational analysis, economic considerations."}, {"summer": "True", "name": "Numerical Analysis I", "prerequisites": "Prerequisite: MA 405; MA 425 or MA 511; high-level computer language", "spring": "True", "number": "580", "fall": "True", "units": " 3", "description": "Algorithm behavior and applicability. Effect of roundoff errors, systems of linear equations and direct methods, least squares via Givens and Householder transformations, stationary and Krylov iterative methods, the conjugate gradient and GMRES methods, convergence of method."}, {"summer": "True", "name": "Computer Models of Interactive Narrative", "spring": "True", "number": "582", "fall": "True", "units": " 3", "description": "A theoretical and practical study of the computational models supporting the creation of interactive narrative systems.  Topics include basic introductions to cognitive, linguistic and film theoretic models of narrative; representations and reasoning techniques from artificial intelligence related to the creation of storylines, dialog, camera control and other features of narrative in text-based and/or 3D virtual worlds; mechanisms for controlling character behavior in multi-agent multi-user stories; and applications of these techniques ranging from interactive entertainment to educational software to training simulations."}, {"summer": "True", "name": "Introduction to Parallel Computing", "prerequisites": "Prerequisite: CSC 302 or MA 402 or MA/CSC 428 or MA/CSC 580", "spring": "True", "number": "583", "fall": "True", "units": " 3", "description": "Introduction to basic parallel architectures, algorithms and programming paradigms; message passing collectives and communicators; parallel matrix products, domain decomposition with direct and iterative methods for linear systems; analysis of efficiency, complexity and errors; applications such as 2D heat and mass transfer."}, {"summer": "True", "name": "Enterprise Storage Architecture", "prerequisites": "Prerequisite: CSC 246 and CSC 401 and CSC 316", "spring": "True", "number": "588", "fall": "True", "units": " 3", "description": "An introduction to storage systems architecture in an enterprise. Begins with a review of the individual components of a system (eg, hard disk drives, network interfaces), and shows how to aggregate those into storage systems. Tradeoffs involving factors such as cost, complexity, availability, power and performance. Discussion of information management strategies, including data migration. Guest lectures by representatives from local industry. Students work in teams on a semester-long project."}, {"summer": "True", "name": "Special Topics In Computer Science", "prerequisites": "Prerequisite: B average in technical subjects", "spring": "True", "number": "591", "fall": "True", "units": " 1-6", "description": "Topics of current interest in computer science not covered in existing courses."}, {"summer": "True", "name": "Computer Science Graduate Orientation", "spring": "True", "number": "600", "fall": "True", "units": " 1", "description": "Introduction for new graduate students to (a) information about graduate program, department, and university resources, and (b) research projects conducted by CSC faculty."}, {"summer": "True", "name": "Master's Independent Study", "spring": "True", "number": "630", "fall": "True", "units": " 1-3", "description": "Individual investigation of topics under the direction of member(s) of the graduate faculty."}, {"summer": "True", "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "685", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "688", "fall": "True", "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": "True", "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "689", "fall": "True", "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": "True", "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "690", "fall": "True", "units": " 1-6", "description": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam."}, {"summer": "True", "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "693", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "695", "fall": "True", "units": " 1-9", "description": "Thesis research."}, {"summer": "True", "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "696", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "699", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis."}, {"summer": "True", "name": "Operating Systems Security", "prerequisites": "Prerequisite: CSC 501", "spring": "True", "number": "705", "fall": "True", "units": " 3", "description": "Fundamentals and advanced topics in operating system (OS) security. Study OS level mechanisms and policies in investigating and defending against real-world attacks on computer systems, such as self-propagating worms, stealthy rootkits and large-scale botnets. OS security techniques such as authentication, system call monitoring, as well as memory protection. Introduce recent advanced techniques such as system-level randomization and hardware virtualization."}, {"summer": "True", "name": "Automata, Languages and Computability Theory", "prerequisites": "Prerequisite: CSC 224 required, CSC 333 recommended", "spring": "True", "number": "707", "fall": "True", "units": " 3", "description": "Formal models of language and computation; finite automata and regular languages, pushdown automata and context-free languages, Turing machines. Relative power of models, Chomsky hierarchy. Inherent complexity of problems: undecidability, computational complexity, intractable problems."}, {"summer": "True", "name": "Software Testing and Reliability", "prerequisites": "Prerequisite: CSC 510", "spring": "True", "number": "712", "fall": "True", "units": " 3", "description": "An advanced introduction to software testing and reliability.  The course is a balanced mixture of theory, practice, and application.  Methods, techniques, and tools for testing software and producing reliable and secure software are used and analyzed.  Software reliability growth models and techniques for improving and predicting software reliability are examined, and their practical use is demonstrated. Good knowledge of C++ or Java.  Knowledge of the basics of statistics, calculus, and linear algebra."}, {"summer": "True", "name": "Real Time Computer Systems", "prerequisites": "Prerequisite: CSC 451 or CSC 501", "spring": "True", "number": "714", "fall": "True", "units": " 3", "description": "Design and implementation of computer systems required to provide specific response times. Structure of a real-time kernel, fixed and dynamic priority scheduling algorithms, rate monotonic scheduling theory, priority inheritance protocols, real-timebenchmarks, case study of a real-time kernel."}, {"summer": "True", "name": "Artificial Intelligence II", "prerequisites": "Prerequisite: CSC 520", "spring": "True", "number": "720", "fall": "True", "units": " 3", "description": "A second course in artificial intelligence emphasizing advanced concepts of AI including logic programming, automatic programming, natural language understanding, visual perception by machine, learning and inference, intelligent computer-aided instruction, knowledge representation, robotics and other topics to be chosen by instructor. Students asked to write programs in AI programming language such as LISP and PROLOG."}, {"summer": "True", "name": "Advanced Topics in Machine Learning", "prerequisites": "Prerequisite: CSC 520", "spring": "True", "number": "722", "fall": "True", "units": " 3", "description": "A broad range of advanced topics in machine learning, the building of computer-based systems that can adapt to their environment and learn from their own experience. Theory of learnability, technical details of various learning methods, combination of multiple methods, evaluation of methods, and related topics (at the discretion of the instructor)."}, {"summer": "True", "name": "Advanced Distributed Systems", "prerequisites": "Prerequisite: CSC 501 or equivalent.  Programming in C++ or Java in Unix environments", "spring": "True", "number": "724", "fall": "True", "units": " 3", "description": "Principles in the design and implementation of modern distributed systems; recent techniques used by real-world distributed systems such as peer-to-peer file sharing, enterprise data center, and internet search engines; state-of-the-art architectures, algorithms, and performance evaluation methodologies in distributed systems."}, {"summer": "True", "name": "Database Management Systems", "prerequisites": "Prerequisite: CSC 431 or 541", "spring": "True", "number": "742", "fall": "True", "units": " 3", "description": "Database concepts. Database design. Data models: entity-relationship and relational. Data manipulation languages including SQL. Data Dictionaries. Query processing. Concurrency. Software development environments using a database system. Expert, object-oriented, multimedia and distributed database systems. Database systems architecture. Use of a commercial database management system."}, {"summer": "True", "name": "Secure Data Management", "prerequisites": "Prerequisite: CSC/ECE 574 and (CSC 440 or CSC 540). Background in databases and basic security concepts required.", "spring": "True", "number": "743", "fall": "True", "units": " 3", "description": "Advanced topics in secure data management with techniques in traditional database management systems as well as in recent advances in emerging areas. Emphasis on new security issues and challenges imposed by the Internet and the Web on cross-organization data sharing and management. Example topics include XML, data management in P2P, trust management, data authorship, and the integration of security and privacy policies with information systems."}, {"summer": "True", "name": "Service-Oriented Computing", "prerequisites": "Prerequisite: CSC 540: Database Management Concepts and Systems", "spring": "True", "number": "750", "fall": "True", "units": " 3", "description": "Concepts, theories, and techniques for computing with services. This course examines architectures for Web applications based on the classical publish, find, and bind triangle, but formulates it at a higher level. It considers sophisticated approaches for the description, discovery, and engagement of services, especially over the Web and the Grid. This course emphasizes service composition. Key topics include semantics, transactions, processes, agents, quality of service, compliance, and trust."}, {"summer": "True", "name": "Advanced Topics in Computer Graphics", "prerequisites": "Prerequisite: Graduate standing in Computer Science", "spring": "True", "number": "761", "fall": "True", "units": " 3", "description": "Understanding and discussing current advances and research topics in computer graphics.  Possible topics include nonphotorealistic rendering, modeling natural phenomena, illumination and rendering techniques, model simplification, animation, visualization, graphics hardware.  Learning to critique research papers from important venues in the computer graphics field.  Learning to read, interpret, and present computer graphics research papers in a conference-type environment."}, {"summer": "True", "name": "Computer Simulation Techniques", "prerequisites": "Prerequisite: ST 512 and a scientific programming language", "spring": "True", "number": "762", "fall": "True", "units": " 3", "description": "Basic discrete event simulation methodology: random number generators, simulation designs, validation, analysis of simulation output. Applications to various areas of scientific modeling. Simulation language such as SLAM and GPSS. Computer assignments and projects."}, {"summer": "True", "name": "Code Optimization for Scalar and Parallel Programs", "prerequisites": "Prerequisite: CSC 512, or CSC 548, or CSC 501", "spring": "True", "number": "766", "fall": "True", "units": " 3", "description": "Advanced research issues in code optimization for scalar and parallel programs; program analysis, scalar and parallel optimizations as well as various related advanced topics."}, {"summer": "True", "name": "Survivable Networks", "spring": "True", "number": "772", "fall": "True", "units": " 3", "description": "Principles of network and service continuity and related metrics; the theory of network availability, survivability, and restoration; a comprehensive coverage of network architectures, protocols, algorithms, and related technology for survivability; advanced topics in network survivability; hands-on experience in the implementation of protocols and software for survivable systems and the operation of survivable networks."}, {"summer": "True", "name": "Advanced Topics in Internet Protocols", "prerequisites": "Prerequisite: CSC/ECE 573", "spring": "True", "number": "773", "fall": "True", "units": " 3", "description": "Cutting-edge concepts and technologies to support internetworking in general and to optimize the performance of the TCP/IP protocol suite in particular. Challenges facing and likely evolution for next generation intenetworking technologies. This course investigates topics that include, but may be not limited to: Internet traffic measurement, characteriztion and modeling, traffic engineering, network-aware applications, quality of service, peer-to-peer systems, content-distribution networks, sensor networks, reliable multicast, and congestion control."}, {"summer": "True", "name": "Advanced Network Security", "prerequisites": "Prerequisite: CSC/ECE 570, CSC/ECE 574", "spring": "True", "number": "774", "fall": "True", "units": " 3", "description": "A study of network security policies, models, and mechanisms. Topics include: network security models; review of cryptographic techniques; internet key management protocols; electronic payments protocols and systems; intrusion detection and correlation; broadcast authentication; group key management; security in mobile ad-hoc networks; security in sensor networks."}, {"summer": "True", "name": "Advanced Topics in Wireless Networking", "prerequisites": "Prerequisite: ECE/CSC 575", "spring": "True", "number": "775", "fall": "True", "units": " 3", "description": "Reviews the current state of research in wireless networks, network architectures, and applications of wireless technologies; students will design, organize, and implement or simulate systems in a full-semester research project.  For students with background in networking and communications who wish to explore research and development topics."}, {"summer": "True", "name": "Design and Performance Evaluation of Network Systems and Services", "prerequisites": "Prerequisite: CSC(ECE) 570 and CSC(ECE) 579", "spring": "True", "number": "776", "fall": "True", "units": " 3", "description": "Introduction to the design and performance evaluation of network services.  Topics include top-down network design based on requirements, end-to-end services and network system architecture, service level agreements, quantitative performance evaluation techniques.  Provides quantitative skills on network service traffic and workload modeling, as well as, service applications such as triple play, internet (IPTV), Peer-to-peer (P2P), voice over IP (VoIP), storage, network management, and access services."}, {"summer": "True", "name": "Telecommunications Network Design", "prerequisites": "Prerequisite: CSC(ECE) 570", "spring": "True", "number": "777", "fall": "True", "units": " 3", "description": "Analytic modeling and topological design of telecommunications networks, including centralized polling networks, packet switched networks, T1 networks, concentrator location problems, routing strategies, teletraffic engineering and network reliability."}, {"summer": "True", "name": "Optical Networks", "prerequisites": "Prerequisite: CSC/ECE 573, CSC/ECE 576, CSC/ECE 579, CSC/ECE 570", "spring": "True", "number": "778", "fall": "True", "units": " 3", "description": "A study of optical networks with wavelength division multiplexing (WDM) technology.  Topics include: optical fiber and transmission technology; first generation optical networks (SONET); optical access networks; wavelength routing networks; related protocols and standards."}, {"summer": "True", "name": "Advanced Computer Performance Modeling", "prerequisites": "Prerequisite: CSC, ECE or OR 761", "spring": "True", "number": "779", "fall": "True", "units": " 3", "description": "In-depth study of computer performance modeling techniques such as exact and approximate analysis of queuing networks and direct and iterative numerical solutions of queuing systems."}, {"summer": "True", "name": "Numerical Analysis II", "prerequisites": "Prerequisite: MA 580", "spring": "True", "number": "780", "fall": "True", "units": " 3", "description": "Approximation and interpolation, Fast Fourier Transform, numerical differentiation and integration, numerical solution of initial value problems for ordinary differential equations."}, {"summer": "True", "name": "Parallel Algorithms and Scientific Computation", "prerequisites": "Prerequisite: MA/CSC 583, or MA/CSC 580 and some parallel computing", "spring": "True", "number": "783", "fall": "True", "units": " 3", "description": "Multiprocessing and vector architectures including current hardware and software.  Parallel implementations of numerical inear algebra algorithms for matrix products, linear systems as well as nonlinear algebraic systems and eigenvalue problems.  Applications to science and engineering including 3D space and system models."}, {"summer": "True", "name": "Advanced Topics In Computer Science", "spring": "True", "number": "791", "fall": "True", "units": " 1-6", "description": "Advanced topics of current interest in computer science not covered by existing courses."}, {"summer": "True", "name": "Seminar in Computer Science", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "801", "fall": "True", "units": " 1-3", "description": "Faculty and graduate student research presentations and discussions centered around current research problems in Computer Science and advanced theories in these areas.  Students are expected to make presentations of published works and, depending onthe course credit received and their academic degree progress, present their own research results.  Critical discussions of the various research approaches and results and their relationships based on the presentations and additional readings and research. Departmental Approval Required."}, {"summer": "True", "name": "Doctoral Independent Study", "spring": "True", "number": "830", "fall": "True", "units": " 1-3", "description": "Individual investigation of advanced topics under the direction of member(s) of the graduate faculty."}, {"summer": "True", "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "885", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Doctoral Preliminary Exam", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "890", "fall": "True", "units": " 1-9", "description": "For students who are preparing for and taking written and/or oral preliminary exams."}, {"summer": "True", "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "893", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "895", "fall": "True", "units": " 1-9", "description": "Dissertation research"}, {"summer": "True", "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "896", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "899", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hour, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations."}]