[{"summer": "True", "name": "Current Trends in Afrocentric and World Dance", "spring": "True", "number": "210", "fall": "True", "units": " 1", "description": "This course provides direct experience in choreographic and performance processes for members of Panoramic Dance Project, NC State Dance Program's student company dedicated to Afrocentric and other culturally driven dance works.  The course includes study of dance technique, choreographic craft, and the examination of content and identity in dance.  Choreographic content varies from semester to semester.  Permission only; acceptance by formal audition."}, {"summer": "True", "name": "Ballet", "spring": "True", "number": "264", "fall": "True", "units": " 1", "description": "Beginning level ballet technique course.  Fundamental ballet concepts and vocabulary introduced through barre and center exercises and combinations."}, {"summer": "True", "name": "Dance Composition", "prerequisites": "Prerequisite: PE 264 or PE 274", "spring": "True", "number": "272", "fall": "True", "units": " Performing Arts", "description": "Creative problem-solving using the components of movement composition. Development of movement vocabulary through structured improvisation. Development of a thematic phrase.  Manipulation of the thematic phrase through various choreographic devices. Structure of the developed materials."}, {"summer": "True", "name": "Modern Dance I", "spring": "True", "number": "274", "fall": "True", "units": " 1", "description": "Introduction of movement and dance concepts and techniques through theory and analysis, improvisation and composition, structured dance exercises combinations."}, {"summer": "True", "name": "Modern Dance II", "prerequisites": "Prerequisite: PE/DAN 274", "spring": "True", "number": "275", "fall": "True", "units": " 1", "description": "Continuation of Modern Dance I. Emphasis on design of body in space, movement qualities and musicality through structured technical exercises and combinations."}, {"summer": "True", "name": "Special Topics in Dance", "spring": "True", "number": "290", "fall": "True", "units": " 1-4", "description": "Examination of selected topics in dance.  May be repeated for credit provided course content is different each time."}, {"summer": "True", "name": "Problems of Dance Performance", "prerequisites": "Prerequisite: Audition", "spring": "True", "number": "295", "fall": "True", "units": " 2", "description": "Practical performing experience in a company setting. Rehearsal, performance and production of concert dance."}, {"summer": "True", "name": "Adv Spec Top Dance", "spring": "True", "number": "490", "fall": "True", "units": " 1-4"}, {"summer": "True", "name": "Independent Study in Dance", "prerequisites": "Prerequisite: DAN 272, Dan 295, Dance Program approval required.", "spring": "True", "number": "498", "fall": "True", "units": " 1-3", "description": "Independent study in special choreographic or performance projects approved by and done under the direction of the Dance Program."}]