[{"summer": "True", "name": " Problem Solving", "prerequisites": "Prerequisite: Engineering Majors, Freshman standing", "spring": "True", "number": "101", "fall": "True", "units": " 1", "description": "An introduction to the College of Engineering as a discipline and profession.  Emphasis on engineering design, interdisciplinary teamwork, and problem solving from a general engineering perspective.  Overview of academic policies affecting undergraduate engineering students.  Exposure to College of Engineering and university-wide programs and services."}, {"summer": "True", "name": "Introduction to Computing Environments", "spring": "True", "number": "115", "fall": "True", "units": " 1", "description": "Introduction to the NC State computing system, and to student-owned computing resources. Includes topics such as maintaining your own computer, learning about campus-based computing resources and applications (how to access and use them), ethics andprofessionalism in the use of computing resources, introduction to web development and other campus resources."}, {"summer": "True", "name": "Academic and Professional Preparation for Engineering I", "spring": "True", "number": "144", "fall": "True", "units": " 1", "description": "Assist new freshmen engineering students in the transition from high school to the collegiate environment. Cover critical-thinking; problem solving techniques; academic skills and time management."}, {"summer": "True", "name": "Academic and Professional Preparation for Engineering II", "spring": "True", "number": "145", "fall": "True", "units": " 1", "description": "Engineering as a field of study and profession.  Career and professional development, goal setting, decision making and effective communication strategies."}, {"summer": "True", "name": "Special Topics Engineering", "spring": "True", "number": "298", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Fundamentals of Engineering(FE) Exam Preparation", "prerequisites": "Prerequisite: Engineering Majors, Senior standing, Graduate students, or PBS status", "spring": "True", "number": "490", "fall": "True", "units": " 1", "description": "Preparation for graduating seniors in engineering to take the Fundamentals of Engineering (FE) Examination.  Information on how to register for the FE exam, exam strategy, and a review of selected science and engineering topics through active learning exercises directed at working sample examination problems. Credit may not be counted toward graduation"}, {"summer": "True", "name": "Engineering Research Projects", "prerequisites": "Prerequisite: Junior standing in College of Engineering, Engineering Scholars Program or Engineering Research Center Scholars", "spring": "True", "number": "497", "fall": "True", "units": " 1-3", "description": "Projects in research, design or development in engineering or computer science."}, {"summer": "True", "name": "Dynamic Systems and Multivariable Control I", "prerequisites": "Prerequisite: MA 341, MA 405", "spring": "True", "number": "531", "fall": "True", "units": " 3", "description": "Introduction to modeling, analysis and control of linear discrete-time and continuous-time dynamical systems. State space representations and transfer methods. Controllability and observability. Realization. Applications to biological, chemical, economic, electrical, mechanical and sociological systems."}, {"summer": "True", "name": "Dynamic Systems and Multivariable Control II", "prerequisites": "Prerequisite: OR(E,MA) 531", "spring": "True", "number": "731", "fall": "True", "units": " 3", "description": "Stability of equilibrium points for nonlinear systems. Liapunov functions. Unconstrained and constrained optimal control problems. Pontryagin's maximum principle and dynamic programming. Computation with gradient methods and Newton methods. Multidisciplinary applications."}]