[{"summer": true, "name": "Principles of Microeconomics", "prerequisites": "Credit is not allowed for both EC 201 and EC 205 or ARE 201.", "spring": true, "number": "201", "fall": true, "units": " 3", "description": "Scarcity, production possibilities, and opportunity cost. Supply and demand analysis, free markets, the price system, and government policy. Microeconomic analysis of business decisions in competitive and noncompetitive markets.  Labor markets, capital, and natural resource markets, and externalities.  Market breakdown, income redistribution, and role of government.  Free  trade, tariffs, and gains from international trade. Credit will not be given for both EC 201 and either ARE 201 or EC 205."}, {"summer": true, "name": "Principles of Macroeconomics", "prerequisites": "Prerequisite: EC 201 or ARE 201", "spring": true, "number": "202", "fall": true, "units": " 3", "description": "Aggregate economic analysis emphasizing current public policy issues.  Determinants of level and rate of growth of total output.  Causes of unemployment and business cycles, inflation, and exchange rate fluctuations.  Effects of monetary policy (money supply) and fiscal policy (government spending, taxes, deficits) on these problems.  Trade surpluses/deficits and impact of international events and policies on national economies. Credit will not be given for both EC 202 and EC 205."}, {"summer": true, "name": "Fundamentals of Economics", "prerequisites": "Credit is not allowed for both EC 205 and EC 201 or ARE 201.", "spring": true, "number": "205", "fall": true, "units": " 3", "description": "Fundamental ideas in economics: scarcity, substitution, opportunity cost, marginal analysis, gross domestic product, real and nominal magnitudes.  Supply and demand analysis.  Microeconomic analysis of pricing in competitive and noncompetitive markets.  Macroeconomic analysis of production, employment, the price level, and inflation.  Monetary and fiscal policy and the stabilization of the economy.  Comparative advantage and international trade. Credit will not be given for both EC 205 and either EC 201 or ARE 201.  Credit will not be given for both EC 205 and EC 202."}, {"summer": false, "name": "Intermediate Microeconomics", "prerequisites": "Prerequisite: MA 121 or 131 or MA 141; EC 201 or EC 205 or ARE  201. Credit is not allowed for both EC 301 and EC 310.", "spring": false, "number": "301", "fall": false, "units": " 3", "description": "Functioning of the market economy, role of prices in determining the allocation of resources, the functioning of the firm in the economy, forces governing the production and consumption of economic goods. Credit not allowed in more than one of EC 301, 310, 401."}, {"summer": true, "name": "Intermediate Macroeconomics", "prerequisites": "Prerequisite: (EC 201 or EC 205 or ARE 201)and (MA 121 or MA 131 or MA 141)", "spring": true, "number": "302", "fall": true, "units": " 3", "description": "Applied, analytical course in aggregate economics:  business cycles, stabilization policy, inflation, costs of disinflation, international trade, and economic growth.  Interaction of consumers and businesses with government economic policies; unemployment, interest rates, and output growth.  Impacts of government deficits, trade deficits, and monetary policies."}, {"summer": true, "name": "Introduction to Financial Markets and Institutions", "prerequisites": "Prerequisite: EC 201 or EC 205 or ARE 201. Credit is not allowed for both EC 304 and EC 404.", "spring": true, "number": "304", "fall": true, "units": " 3", "description": "Financial assets, markets and institutions.  Stock and bond markets.  Measurement and determination of rates of return on financial assets.  Banks and other financial intermediaries including their management and regulation.  Roles of the Federal Reserve System and monetary policy in determining interest rates, economic activity and foreign exchange rates. Credit will not be given for both EC 304 and EC 404."}, {"summer": "True", "name": "A Closer Look at Capitalism", "prerequisites": "Prerequisite: EC 201 or EC 205 or ARE 201.", "spring": "True", "number": "305", "fall": "True", "units": " 3", "description": "Comparison of market allocation to government allocation.  Criteria for evaluating economic systems.  How markets create value.  Relationship of economic freedom to political freedom and economic growth.  Applications to policies such as antitrust policy, education  policy, and environmental policy."}, {"summer": "True", "name": "Managerial Economics", "prerequisites": "Prerequisite: EC 201 or EC 205 or ARE 201. Credit is not allowed for both EC 310 and EC 301.", "spring": "True", "number": "310", "fall": "True", "units": " 3", "description": "Microeconomic principles applied to decision-making in the firm.  Present value analysis.  The relationship between accounting and economic concepts of cost.  Criteria and procedures for decision-making under uncertainty.  Economic allocation by markets and the price system.  Sources of market power and competitive advantage.  Applications to product pricing and advertising. Credit not allowed in more than one of EC 301, 310, 401."}, {"summer": false, "name": "Economics of Law", "prerequisites": "Prerequisite: ARE 201 or EC 201 or EC 205", "spring": true, "number": "312", "fall": false, "units": " 3", "description": "Economic principles used to analyze the law.  How law reflects social pursuit of economic goals.  The meaning of efficiency in the law.  Uncertainty and insurance. The role of property rights. Property rules versus liability rules.  Economics of penalties. Criminal law versus tort law. Economics of tort, contract, property, crime, marriage, and intellectual property."}, {"summer": false, "name": "Introduction to Resource and Environmental Economics", "prerequisites": "Prerequisite: ARE 201 or EC 201 or EC 205", "spring": true, "number": "336", "fall": true, "units": " 3", "description": "Application of basic economic tools to understand and evaluate environmental/resource policies.  Concepts such as property rights, non-market goods, allocation over time, externalities, and public goods. Current policy issues such as global climate change, evaluating natural resource damages from oil spills, reducing the costs of regulations, protecting estuaries, and dealing with non-point source pollution."}, {"summer": true, "name": "Introduction to International Economics", "prerequisites": "Prerequisite: EC 201 or EC 205 or ARE 201.", "spring": true, "number": "348", "fall": true, "units": " 3", "description": "Application of basic economic analysis to international economic events and policies.  Gains from trade, impacts of trade restrictions, international systems of payments, global capital markets, and balancing international with domestic macroeconomic policies.  Current policy issues such as economic integration (customs unions and free trade areas), a common European currency, and the role of international trade in economic growth and development."}, {"summer": false, "name": "Data Analysis for Economists", "prerequisites": "Prerequisite: (BUS/ST 350 or ST 302 or ST 361or ST 370 or ST 372)", "spring": false, "number": "351", "fall": true, "units": " 3", "description": "Tools for describing and analyzing data as used in economics.  Probability, random variables, sampling, point and interval estimation.  Hypothesis testing and regression analysis with emphasis on economic applications."}, {"summer": false, "name": "The Political Economy of the Market Process", "prerequisites": "Prerequisite: EC 201 or 205 or ARE 201", "spring": true, "number": "377", "fall": false, "units": " 3", "description": "The institutional, philosophical and economic foundations of markets. Social and political implications of private property, voluntarism and the forms of social cooperation derived from markets. The effects of public policies intended to alter the economic outcomes of markets. The morality of markets, legal and institutional settings, cooperation and the nature of exchange, the social function of prices."}, {"summer": false, "name": "Money, Financial Markets, and the Economy", "prerequisites": "Prerequisite: (EC 302 or BUS 320) and (BUS/ST 350, or ST 302, or ST 361, or ST 370, or ST 372). Credit is not allowed for both EC 404 and EC 304.", "spring": false, "number": "404", "fall": false, "units": " 3", "description": "Roles of money, credit, and financial institutions in the modern economy.  Determination of level and structure of interest rates and exchange rates, determination of security prices.  Management and regulation of financial institutions.  Federal Reserve System and monetary policy.  Statistical analysis of financial and monetary data. Credit will not be given for both EC 304 and EC 404."}, {"summer": false, "name": "Public Finance", "prerequisites": "Prerequisite: EC/ARE 301 or EC 310", "spring": true, "number": "410", "fall": true, "units": " 3", "description": "A micro-economic analysis of the  rationale for public expenditure and taxation. Externalities, pollution and public policy, income redistribution and public welfare, public goods, collective choice and political institutions, public budgeting techniques and cost-benefit analysis, taxation and tax policy, state-local finance and fiscal federalism."}, {"summer": false, "name": "Competition, Monopoly and Public Policy", "prerequisites": "Prerequisite: EC/ARE 301 or EC 310", "spring": true, "number": "413", "fall": false, "units": " 3", "description": "Current theories of industrial organization with specific reference to such topics as cartels, industrial concentration, vertical integration, franchise contracts, ownership and control of  firms, multipart and discriminatory pricing, and tie-in sales. Economic aspects of antitrust law and government regulation of industry."}, {"summer": false, "name": "Labor Economics", "prerequisites": "Prerequisite: EC/ARE 301 or EC 310", "spring": true, "number": "431", "fall": true, "units": " 3", "description": "An economic approach to the labor  market and its problems including unemployment and the determination of wages, hours and working conditions under various labor market structures. The economic effects of  trade unions. Introduction to human capital theory."}, {"summer": false, "name": "Environmental Economics", "prerequisites": "Prerequisite: EC/ARE 301 or EC 310", "spring": true, "number": "436", "fall": false, "units": " 3", "description": "Usefulness of economics in understanding pollution, congestion, conservation and other environmental problems.  Relevant economic tools such as pricing schemes, abatement cost curves, damage functions and benefit-cost analysis.  Pollution taxes, regulations, marketable permits and subsidies considered in designing alterations, in the incentive system.  Current public policy alternatives in the context of non-market decision-making."}, {"summer": false, "name": "Health Economics", "prerequisites": "Prerequisite: EC/ARE 301 or EC 310", "spring": true, "number": "437", "fall": true, "units": " 3", "description": "Application of micro-economic tools to the analysis of public and private policy issues concerning health care financing and delivery in the United States."}, {"summer": false, "name": "International Trade", "prerequisites": "Prerequisite: EC/ARE 301 or EC 310", "spring": true, "number": "448", "fall": true, "units": " 3", "description": "Determinants of commodity composition of trade and analysis of tariffs, quotas, and transport costs.  Treatment of international investment including multinational corporations. Analysis of the effects of tariffs and quotas.  Relationship between international trade and economic growth."}, {"summer": false, "name": "International Finance", "prerequisites": "Prerequisite: EC/ARE 301 or EC 310", "spring": true, "number": "449", "fall": true, "units": " 3", "description": "Study of international markets and their effects on firms, investors and national economics. Topics include: futures and options in foreign exchange, management of foreign exchange risk, exchange rate determination, and macroeconomic policy in an open economy."}, {"summer": false, "name": "Introduction to Econometrics", "prerequisites": "Prerequisite: (EC/ARE 301 or EC 310) and EC 302 and EC/ST 351", "spring": true, "number": "451", "fall": false, "units": " 3", "description": "The measurement, specification, estimation and interpretation of functional relationships through single equation least-square techniques. Applications of simple and multiple regression, curvilinear regression and various transformations to demand, cost, production, consumption and investment relationships."}, {"summer": "True", "name": "Forecasting for Business and Economics", "prerequisites": "Prerequisite: EC 351", "spring": "True", "number": "452", "fall": "True", "units": " 3", "description": "The use of statistical tools to develop forecasts for business and economics.   Data collection problems and types of data.  Time series approach to forecasting.  Use of regressions and surveys for forecasting.  Forecast evaluation and presentation of forecasts."}, {"summer": false, "name": "Evolution of the American Economy", "prerequisites": "Prerequisite: EC/ARE 301 or EC 310", "spring": true, "number": "471", "fall": false, "units": " 3", "description": "Relationship of modern economic development to the history of America. Analysis of contemporary  problems and issues with reference to their origins in the historical growth of the economy."}, {"summer": false, "name": "Economics of  Financial Institutions and Markets", "prerequisites": "Prerequisite:( MA 121 or MA 131 or MA 141), and [BUS 320 or EC 302]", "spring": true, "number": "474", "fall": false, "units": " 3", "description": "Management, development and regulation of U.S. financial markets and institutions. Management of major financial intermediaries and their historical development. Analysis of major financial assets and their markets. The role and history of the Federal Reserve and other financial regulators."}, {"summer": false, "name": "Introduction to Economic Research", "prerequisites": "Prerequisite: (EC 301 or EC 310) and (BUS/ST 350, or ST 302, or ST 361, or ST 370, or ST 372)", "spring": true, "number": "480", "fall": false, "units": " 3", "description": "Finding economic data.  Critically analyzing newspaper and journal articles using economic reasoning.  Developing, writing, and presenting economic analysis."}, {"summer": false, "name": "Research Seminar in Economics", "prerequisites": "Prerequisite: (EC/ARE 301 or EC 310) and EC 302; and (BUS/ST 350, or ST 302, or ST 361, or ST 370, or ST 372)", "spring": true, "number": "490", "fall": true, "units": " 3", "description": "The final course for students completing the undergraduate programs in economics.  Students study a selected economic issue, make classroom presentations related to the seminar topic, and write research papers."}, {"summer": "True", "name": "Economics of Business Strategy", "prerequisites": "Prerequisite EC 301 or EC 310", "spring": "True", "number": "491", "fall": "True", "units": " 3", "description": "Capstone course for students in the business economics concentration. Application of analytical economics to strategic decisions in business.  Students will analyze and present case studies of strategic issues."}, {"summer": "True", "name": "Special Topics in Economics", "spring": "True", "number": "495", "fall": "True", "units": " 1-6", "description": "Examination of special topics in economics not normally treated in other courses, or offering of new courses on a trial basis."}, {"summer": true, "name": "Independent Study in Economics", "spring": true, "number": "498", "fall": true, "units": " 1-6", "description": "Detailed investigation of topics of particular interest to advanced undergraduates under faculty direction on a tutorial basis. Credits and content determined by  faculty member in consultation with Director of Undergraduate Programs."}]