[{"summer": "True", "name": "Introduction to Middle Grades Education", "prerequisites": "Prerequisite: MSL Majors and unclassified students in MSL", "spring": "True", "number": "102", "fall": "True", "units": " 2", "description": "Introduction to the Middle Grades Academy and middle school teaching from the perspective of \"What do I bring to teaching?\"  Students will formulate an initial teaching philosophy as well as engage in an introspective examination of their beliefs, attitudes, talents, strengths, and weaknesses in relation to teaching early adolescents.  Students are required to provide their own transportation."}, {"summer": "True", "name": "Intro to Instructional Technology for Educators", "spring": "True", "number": "201", "fall": "True", "units": " 2", "description": "Beginning teachers in North Carolina are required to demonstrate mastery of technology skills, to be able to use that technology in their classrooms and teach the state computer skills curriculum.  This hands-on course covers the basic skills included in the National Educational Technology Standards for Teachers.  In this course students will begin the process of creating technology artifacts for the teaching portfolio, required for initial licensure."}, {"summer": "True", "name": "Intro to Teaching", "prerequisites": "Prerequisite: Sophomore standing; Corequisite: ED 204", "spring": "True", "number": "204", "fall": "True", "units": " 1-2", "description": " Risk Management for details on acquiring the insurance and the current charge.  This course is restricted to Teacher Education majors."}, {"summer": "True", "name": "Introduction to Teaching Humanities and social Sciences", "prerequisites": "Prerequisite: Sophomore standing", "spring": "True", "number": "205", "fall": "True", "units": " 3", "description": "For prospective teachers in secondary and middle years social studies, English, language arts, and foreign languages.  An emphasis on differing aspects and procedures of instruction and analysis of competencies required of teachers.  Field work in avariety of education settings including an extended period in one curriculum area."}, {"summer": "True", "name": "Special Topics in Education", "spring": "True", "number": "296", "fall": "True", "units": " 1-3", "description": "Individual or group study of particular areas of education at the freshman and sophomore levels.  Specific topics will vary from semester to semester."}, {"summer": "True", "name": "Principles of Teaching Diverse Populations", "prerequisites": "Prerequisite: ED 204", "spring": "True", "number": "305", "fall": "True", "units": " 3", "description": "Impact of cultural factors on experiences of teachers and students in contemporary schools. Teaching techniques and development of instructional plans to enhance schooling experiences of culturally diverse students."}, {"summer": "True", "name": "Middle Years Reading", "prerequisites": "Prerequisite: Six hours in ED or PSY", "spring": "True", "number": "306", "fall": "True", "units": " 3", "description": "Reading skills in middle years education developed with emphasis on application of the reading process to content area."}, {"summer": "True", "name": "Teaching Writing Across the Curriculum", "prerequisites": "Prerequisite: ENG 112", "spring": "True", "number": "307", "fall": "True", "units": " 3", "description": "For prospective teachers of all disciplines in middle/high school. Practical strategies for writing as a learning tool and for teaching writing.  Lesson plans, assignments, experiences appropriate to content areas.  Focus on writing, writing instruction, and technology.  Separate sections for Middle Grades (MSL) and English (LTN) majors."}, {"summer": "True", "name": "Teaching in the Middle Years", "prerequisites": "Prerequisite: Six hours in ED or PSY", "spring": "True", "number": "309", "fall": "True", "units": " 3", "description": "Nature and purposes of middle grades education.  Early adolescent development, curriculum, teaching/learning methods, school organization, and characteristics of effective middle years teachers.  Includes field experience."}, {"summer": "True", "name": "Health Promotion and Disease Prevention", "prerequisites": "Prerequisite: For credentialed health professionals only", "spring": "True", "number": "332", "fall": "True", "units": " 3", "description": "Emphasis on education of the public regarding general health concerns including cancer, cardiovascular disease, accident prevention, nutrition, drugs, alcohol, mental health, sexuality, and environmental hazards."}, {"summer": "True", "name": "Health Care Delivery", "spring": "True", "number": "333", "fall": "True", "units": " 3", "description": "The historical basis of health care delivery in the U. S. with emphasis on hospitals, health maintenance organizations, ambulatory care centers, ambulatory surgery, nursing homes, and private care practice.  Philosophical issues of funding health care, promoting health care, and the training of health care workers."}, {"summer": "True", "name": "Planning Classroom and Clinical Curricula", "prerequisites": "Prerequisite: For Certification Majors: EOE 101, 205 ; For Non-Certification Majors: EOE 101.  For credentialed health professionals", "spring": "True", "number": "335", "fall": "True", "units": " 3", "description": "Procedures for planning health occupations curricula for classroom and clinical settings.  Practice in writing, updating, and refining health curriculum with emphasis on selection and sequencing.  Comparison of styles of writing curricula.  Roles and responsibilities of healthy curriculum planner."}, {"summer": "True", "name": "Strategies for Teaching a Health Occupations Course", "prerequisites": "Prerequisite: For credentialed health professionals", "spring": "True", "number": "336", "fall": "True", "units": " 3", "description": "Planning and implementation of effective instructional strategies for clinical and classroom settings.  The nature of the teaching/learning process, psychological and philosophical aspects of teacher choice of various strategies."}, {"summer": "True", "name": "Literature for Adolescents", "prerequisites": "Prerequisite: Junior standing.", "spring": "True", "number": "405", "fall": "True", "units": " 3", "description": "The history, types, and characteristics of literature for adolescents. Emphasizes reading and analyzing the literature by exploring the themes, literary elements, and rationale for teaching literature for adolescents. Addresses ways in which this literature can be integrated and implemented in English/Language Arts curriculum."}, {"summer": "True", "name": "Human Relations and Discipline in the Classroom", "prerequisites": "Prerequisite: PSY 304 or EDP 304 and 6 hours of education", "spring": "True", "number": "414", "fall": "True", "units": " 3", "description": "Designed to help prospective teachers foster positive interpersonal relationships in classrooms, build a sense of community and create a purposive  environment for learning. Investigates issues such as group building, active listening, and major approaches to discipline. Uses case studies and problem solving methods."}, {"summer": "True", "name": "Teaching Exceptional Students in the Mainstreamed Classroom", "prerequisites": "Prerequisite: Six hours in ED or PSY", "spring": "True", "number": "416", "fall": "True", "units": " 3", "description": "Provides classroom teachers in all disciplines and grade levels with a knowledge of various handicapping conditions, as well as with techniques to assist exceptional students within the mainstreamed classroom. Required for MSL majors."}, {"summer": "True", "name": "Methods and Materials in Teaching Modern Foreign Languages", "prerequisites": "Prerequisite: Admission to Professional Semester, Corequisite: ECI 424", "spring": "True", "number": "423", "fall": "True", "units": " 4", "description": "Methods and materials of teaching French or Spanish grades K-12 with an emphasis on lesson and unit planning, second language acquisition, national standards, and demonstrations/practice teaching in micro-lessons.  This course provides opportunities for prospective French and Spanish teachers to integrate knowledge of their language with effective materials, strategies, and methods of instruction to prepare students for K-12 French or Spanish teaching.  The course has a required fieldwork component in local K-12 schools, and students are responsible for their own transportation to and from the schools."}, {"summer": "True", "name": "Student Teaching in French or Spanish", "prerequisites": "Prerequisite: Admission to Professional semester, Corequisite: ECI 423", "spring": "True", "number": "424", "fall": "True", "units": " 12", "description": "Teaching experience for prospective teachers of French or Spanish in a selected elementary, middle or high school under the supervision of a cooperating teacher and a university faculty supervisor.  Additional school observations and on campus seminars are a part of this course.  The course has a required fieldwork component in local K-12 schools, and students are responsible for their own transportation to and from the schools.  Students are covered under the General Statute affording liability protection."}, {"summer": "True", "name": "Methods and Materials in Teaching English as a Second Language", "prerequisites": "Prerequisite: Admission to Teacher Education Candidacy or admission to ESL Licensure Program", "spring": "True", "number": "425", "fall": "True", "units": " 3", "description": "Methodologies and current approaches to teaching English as a Second Language.  Techniques and strategies for teaching reading, writing, listening, speaking and culture.  Selection, adaptation, and creation of instructional materials for various levels of proficiency and teaching situations. Evaluation and assessment of written and oral language proficiency through standardized and non-standardized assessment tools."}, {"summer": "True", "name": "Methods and Materials for Teaching Language Arts in the Middle Grades", "prerequisites": "Prerequisite: ECI 205,ELP 344,PSY 304 or EDP 304,ECI 309, ECI 306, ECI 307, Senior standing, candidacy in Middle Grades Teacher Education, Corequisite: ECI 435", "spring": "True", "number": "430", "fall": "True", "units": " 4", "description": "Inquiry, activity-oriented course provides opportunities for prospective language arts middle school teachers to integrate knowledge of English with effective materials, strategies, methods of instruction. Students observe middle school classes, plan lessons, and units, practice varied classroom strategies, technologies in micro-lessons.  Prepared students for teaching language arts with other content areas in middle schools."}, {"summer": "True", "name": "Methods and Materials for Teaching Social Studies in the Middle Grades", "prerequisites": "Prerequisite: Admission to professional semester", "spring": "True", "number": "435", "fall": "True", "units": " 4", "description": "For preservice middle school social studies teachers.  Focus on: teaching and evaluation skills, adaptation of instruction to individual learner differences, identification and creation of instructional materials appropriate for use in social studies teaching."}, {"summer": "True", "name": "Medical Law and Ethics", "spring": "True", "number": "438", "fall": "True", "units": " 3", "description": "Ethical and legal issues involved in delivering health care, such as euthanasia, reproductive technology, organ transplants, patients' rights, and confidentiality.  Classical ethical theories and principles.  Systematic review procedures and currentmedical law used to examine current case dilemmas in the health professions."}, {"summer": "True", "name": "Internship in Teaching English as a Second Language", "prerequisites": "Prerequisite: Admission to ESL Licensure Program, Corequisite: Teacher Licensure in any primary area", "spring": "True", "number": "440", "fall": "True", "units": " 3", "description": "Skills and techniques required in teaching ESL in a public school setting.  15 hours of classroom observation and 30 hours in direct instruction.  Demonstration of competencies essential for teaching ESL."}, {"summer": "True", "name": "Field Experience in Business and Marketing Education", "prerequisites": "Prerequisite: Junior standing", "spring": "True", "number": "442", "fall": "True", "units": " 3", "description": " Risk Management for details on acquiring the insurance and the current charge.  This course is restricted to Teacher Education majors."}, {"summer": "True", "name": "Administration of Business and Marketing Education", "prerequisites": "Prerequisite: ED 204 and ECI 204 and MKE Business and Marketing Education Major", "spring": "True", "number": "444", "fall": "True", "units": " 3", "description": "Development of successful business and information technology, and marketing education programs. Program promotion, managing cooperative education experiences, managing DECA and FBLA chapters, and determining professional development strategies. Primary roles of the business and information technology and marketing education teachers' classroom instruction. Program management, classroom management, management of career-technical student organizations, cooperative education, and program development."}, {"summer": "True", "name": "New Literacies, Emerging Technologies, and Electronic Portfolios", "prerequisites": "Prerequisite: Senior Standing; Corequisite: ECI 430 and ECI 435", "spring": "True", "number": "445", "fall": "True", "units": " 2", "description": "Inquiry, activity-oriented course designed to engage students in theory and practice related to 21st century skills, new literacies, and emerging technologies, as well as focused support for developing the culminating electronic portfolio. Course provides opportunity for pre-service, English Language Arts/ Social Studies middle School teachers to integrate knowledge of English and Social Studies with emerging technologies and digital literacy applications."}, {"summer": "True", "name": "Curriculum and Methods of Teaching Business and Marketing Education", "prerequisites": "Prerequisite: Admission to Teacher Education Candidacy ; MKE Business and Marketing Education Majors", "spring": "True", "number": "446", "fall": "True", "units": " 4", "description": " Risk Management for details in acquiring the insurance and the current charge. MKE students only."}, {"summer": "True", "name": "Student Teaching in Business and Marketing Education", "prerequisites": "Prerequisite: Admission to Professional Semester ; MKE Business and Marketing Education Majors, Corequisite: ECI 494", "spring": "True", "number": "447", "fall": "True", "units": " 9", "description": " Risk Management for details on acquiring the insurance and the current charge. MKE students only."}, {"summer": "True", "name": "E-Business Applications in Business and Marketing Education", "prerequisites": "Prerequisite: Junior standing", "spring": "True", "number": "448", "fall": "True", "units": " 3", "description": "Emphasis on design and construction of advanced web pages, business and marketing applications of electronic commerce, as well as economic, social, legal, and ethical issues that are related to conducting business in a virtual environment. Content prepares students to apply principles to the business and marketing education curriculum in the public schools. Credit for both ECI 448 and ECI 548 is not allowed."}, {"summer": "True", "name": "Methods and Materials in Teaching English", "prerequisites": "Prerequisite: ECI 205, ELP 344, PSY 304 or EDP 304; Senior standing and admission to Teacher Education candidacy with a Major in English", "spring": "True", "number": "450", "fall": "True", "units": " 4", "description": "Methods and materials of teaching English in grades 9-12, with an emphasis on lesson planning and demonstrations/practice in teaching literature, study skills, speaking, listening, and writing. Taught during the first seven weeks of the semester."}, {"summer": "True", "name": "Teaching Reading Across Disciplines", "prerequisites": "Prerequisite: Six hours in ED or PSY", "spring": "True", "number": "451", "fall": "True", "units": " 3", "description": "Facilitates study of methods and materials for teaching literacy across disciplines. Develops instructional strategies in the use of print and digital texts and media to support disciplinary learning."}, {"summer": "True", "name": "Student Teaching in English/Language Arts", "prerequisites": "Prerequisite: Admission to Student Teaching Professional Semester ; For MSL students: ECI 430; 416, 464. For LTN students: ECI 450", "spring": "True", "number": "454", "fall": "True", "units": " 1-12", "description": "Provides the prospective teacher with experience in the techniques and skills involved in teaching English in secondary schools or Language Arts in middle schools in a selected off-campus station.  Student  interns become familiar with the total school program, eventually carrying a full teaching load,  and participate in relevant school and community activities.  Students are required to provide their own transportation.  LTN and MSL majors only."}, {"summer": "True", "name": "Methods and Materials in Teaching Secondary Social Studies", "prerequisites": "Prerequisite: ECI 205, ELP 344, Sr. standing and admission to professional semester with a major in either history, sociology, political science", "spring": "True", "number": "460", "fall": "True", "units": " 4", "description": "Teaching techniques, innovations, and development of teaching and evaluation skills in the area of secondary school social studies. Adaptation of instruction to individual learner differences, and selection and design of instructional materials. Taught during the first six weeks of the semester. Taught during the first six weeks of the semester."}, {"summer": "True", "name": "Student Teaching in Social Studies", "prerequisites": "Prerequisite: Admission to professional semester, Corequisite: For LTH, LTP, LTS students: ECI 460. For MSL students: ECI 454, 430, 416", "spring": "True", "number": "464", "fall": "True", "units": " 1-8", "description": "Skills and techniques in teaching social studies in secondary and middle schools. Each student spends  ten weeks in a selected off-campus center. The student demonstrates competencies essential  for teaching social studies, becomes familiar with thetotal school program, and participates in a variety of school and community activities."}, {"summer": "True", "name": "Educational Implications of Learning and Developmental Theory", "prerequisites": "Prerequisite: NC TEACH Participants", "spring": "True", "number": "471", "fall": "True", "units": " 3", "description": "Topics related to human psychological development. Cognitive, social, physical changes, and their interaction among adolescence. Departmental Approval Required."}, {"summer": "True", "name": "Interaction of Classroom Management and Instruction", "prerequisites": "Prerequisite: ECI 471 ; NC TEACH Participants", "spring": "True", "number": "472", "fall": "True", "units": " 3", "description": "Topics related to teaching in the content area and classroom management. Lesson planning, principles applied to education, measurement and evaluation procedures, behavior therapy, and student motivation. Departmental Approval Required."}, {"summer": "True", "name": "Subject Specific Methods", "prerequisites": "Prerequisite: ECI 472 ; NC TEACH Participants, Corequisite: ECI 474", "spring": "True", "number": "473", "fall": "True", "units": " 3", "description": "Topics related to cultural factors and how they affect teachers and students in the classroom. Instructional techniques and the development of instructional plans that enhance schooling experiences of culturally diverse students. Departmental Approval Required."}, {"summer": "True", "name": "Curriculum and Instruction Practices 1", "prerequisites": "Prerequisite: ECI 472 ; NC TEACH participants, Corequisite: ECI 473", "spring": "True", "number": "474", "fall": "True", "units": " 3", "description": "Topics related to essential skills and concepts needed by beginning teachers. The class focuses on questioning, test preparation, discussion skills, familiarity with national standards, multiple teaching strategies, and assessment + evaluation of students. Departmental Approval Required."}, {"summer": "True", "name": "Peer Mentoring in Alternative Licensure", "prerequisites": "Prerequisite: ECI 474 ; NC TEACH Participants, Corequisite: ECI 476", "spring": "True", "number": "475", "fall": "True", "units": " 3", "description": "Topics related to observing and evaluating fellow teachers in relation to the national state teaching competencies. Classroom observations, videotaping, and group evaluations that are shared and discussed with fellow teachers. Departmental Approval Required."}, {"summer": "True", "name": "Curriculum and Instruction Practices 2", "prerequisites": "Prerequisite: ECE 474 ; NC TEACH Participants, Corequisite: ECI 475", "spring": "True", "number": "476", "fall": "True", "units": " 3", "description": "Topics related to inquiry, activity based instruction, and constructivist principles. Analysis of principles, strategies and application of new teaching approaches. Departmental Approval Required."}, {"summer": "True", "name": "Senior Seminar in Business and Marketing Education", "prerequisites": "Prerequisite: Admission to Professional Semester ; MKE Business and Marketing Education Majors, Corequisite: ECI 447", "spring": "True", "number": "494", "fall": "True", "units": " 3", "description": "Discussion and analysis of problems, trends, and issues experienced while student teaching in the public schools."}, {"summer": "True", "name": "Special Topics in Education", "prerequisites": "Prerequisite: Junior standing or Senior standing", "spring": "True", "number": "496", "fall": "True", "units": " 1-3", "description": "Individual or group study of special topics in professional education.  The topic and mode of study are determined by the faculty member after discussion with the student."}, {"summer": "True", "name": "Theory and Practice In Teaching Diverse Populations", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "500", "fall": "True", "units": " 3", "description": "Analysis of literature and research in related to impact of cultural factors on teaching and learning in contemporary schools.  Exploration of teaching techniques and curricular directions designed to improve school experiences for diverse populations in K-12 settings."}, {"summer": "True", "name": "Foundations of Curriculum", "prerequisites": "Prerequisite: 12 sem. hrs. graduate ED and PSY", "spring": "True", "number": "501", "fall": "True", "units": " 3", "description": "Origin, development, and current status of elementary and secondary school curriculum and an evaluation of trends and issues likely to influence the curriculum in the future."}, {"summer": "True", "name": " Practice", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "505", "fall": "True", "units": " 3", "description": "An exploration of theory and practice issues related to foreign language teaching.  Inquiry into proficiency-oriented instruction, innovative methodological approaches, the National Standards and learning scenarios, integrating culture, options for testing and assessment, content-based instruction, the role of grammar in second language acquisition, teaching foreign language students with learning disabilities, and Foreign Language in the Elementary School (FLES) in North Carolina.  Students will examine case studies related to these topics and engage in a classroom action research project."}, {"summer": "True", "name": "Instructional Technology in Foreign Language Education: Addressing the National", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "506", "fall": "True", "units": " 3", "description": "Hands-on experience in appropriately selecting and applying a number of instructional technologies to foreign language teaching and learning in relation to the current National Standards.  Analysis and use of effective technology tools including hardware, software, and courseware. Emphasis will be on the application of Technology-Enhanced Language Learning (TELL) as it integrates the National Standards' goals of Communication, Cultures, Connections, Comparisons, and Communities."}, {"summer": "True", "name": "Social Justice Education", "prerequisites": "Prerequisite: ECI 500", "spring": "True", "number": "507", "fall": "True", "units": " 3", "description": "Introduction to principles of social justice education and their centrality in progressive policies and pedagogies that lead to equity in all teaching contexts. Students will develop strategies for successfully incorporating a social justice education framework in scholarship and professional practice."}, {"summer": "True", "name": "Teachers as Leaders", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "508", "fall": "True", "units": " 3", "description": "Examines teacher leadership research, theory, and practice. Prepares teachers to assume leadership roles in classrooms, schools, school systems, and the larger educational community.  Independent research projects required."}, {"summer": "True", "name": "Special Problems in Curriculum and Instruction", "prerequisites": "Prerequisite: Six hours of ED or PSY", "spring": "True", "number": "509", "fall": "True", "units": " 1-6", "description": "In-depth study of topical problems in curriculum and instruction selected from areas of current concern to practitioners in education."}, {"summer": "True", "name": "Research Applications In Curriculum and Instruction", "prerequisites": "Prerequisite: ST 507, Doctoral student, C and I Major", "spring": "True", "number": "510", "fall": "True", "units": " 3", "description": "Focus on current issues and research methods used in the areas of curriculum development and supervision, instructional technology, English education, middle grades education, reading education, social studies education and special education."}, {"summer": "True", "name": "Computer Applications and Curriculum Integration", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "511", "fall": "True", "units": " 3", "description": "Use and evaluation of existing educational software, research findings with respect to integration of computers and new technologies in instruction."}, {"summer": "True", "name": "Emerging Technologies for Teaching and Learning", "spring": "True", "number": "512", "fall": "True", "units": " 3", "description": "Designed for K-12 educators, course focuses on how to effectively integrate emerging technologies into teaching and learning. Reviews and evaluates research related to teaching and learning in the 21st century. Students apply their understanding and knowledge through the development and evaluation of emerging teaching and learning practices, such as blogs, streaming videos, podcasts, wikis, e-portfolios, and gaming. Graduate standing only."}, {"summer": "True", "name": "Videography for Education", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "513", "fall": "True", "units": " 3", "description": "Development and implementation of educational video in a variety of settings.  Technical skills in relation to the uses of educational video.  Conventions and genres of educational videos; representation; aesthetics; pedagogy; uses of education video within educational contexts and situations."}, {"summer": "True", "name": "Multimedia Design and Applications in Instruction", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "514", "fall": "True", "units": " 3", "description": "Instructional design principles underlying development of computer-based instructional software and multimedia, and multimedia applications in K-12 settings."}, {"summer": "True", "name": "Internet Applications and Web Page Design in Instruction", "prerequisites": "Prerequisite: ECI 511, ECI 514", "spring": "True", "number": "515", "fall": "True", "units": " 3", "description": "Review of research findings related to Internet usage and web-based applications in K-12 environment.  Internet applications in classroom, online projects and activities, educational web page design and evaluation, building and publishing educational web pages, educational applications of multimedia and form on web."}, {"summer": "True", "name": "Design and Evaluation Of Instructional Materials", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "516", "fall": "True", "units": " 3", "description": "Characteristics and selection of various media for instruction and their use in educational settings. Design and production of instructional materials. Analysis of research in the field. Individualized projects and assignments. Application of grounded research and theory concerning learning to design of instructional materials. Structured projects and practical experiences used to transfer design principles and evaluate instructional products."}, {"summer": "True", "name": "Advanced Multimedia Design and Applications in Instruction", "prerequisites": "Prerequisite: ECI 511, ECI 514", "spring": "True", "number": "517", "fall": "True", "units": " 3", "description": "Advanced study and application of instructional design principles underlying development, evaluation, and integration of multimedia and hypermedia in K-12 settings."}, {"summer": "True", "name": "Program and Staff Development in Instructional Technology", "prerequisites": "Prerequisite: ECI 511, ECI 514, ECI 515, ECI 642", "spring": "True", "number": "518", "fall": "True", "units": " 3", "description": "Study and application of principles related to educational computing and technology planning, facilities and resource management, and technology staff development in K-12 settings."}, {"summer": "True", "name": "Special Problems in Instructional Technology", "prerequisites": "Prerequisite: Six hours of ED or PSY", "spring": "True", "number": "519", "fall": "True", "units": " 1-6", "description": "In-depth study of topical problems in instructional technology selected from areas of current concern to practitioners in education."}, {"summer": "True", "name": "The Teaching Of Composition", "prerequisites": "Prerequisite: 9 hrs. of ED, PSY and/or ENG;", "spring": "True", "number": "520", "fall": "True", "units": " 3", "description": "For classroom teachers. Practical field-tested ideas to help students improve as writers by focusing on composition as a process as well as a product. Activities for teaching prewriting, drafting, revising, proofreading, grammar and evaluating with suggestions for individual and group learning. Writing in content areas and composition research/ theory. To take this course in sum. as part of Capital Area Writing Project, student must apply and be selected"}, {"summer": "True", "name": "Teaching Literature For Young Adults", "prerequisites": "Prerequisite: Senior standing or Graduate standing or PBS status", "spring": "True", "number": "521", "fall": "True", "units": " 3", "description": "Designed to acquaint in-service and pre-service teachers with breadth and diversity of contemporary literature for adolescents, with emphasis on teaching young adult literature. Addresses history and themes of young adult literature, readability of materials, reading preferences, literary merit, skills that can be taught through literature, censorship, motivating students to read and organizing literature units."}, {"summer": "True", "name": "Trends and Issues in English Language Arts Education", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "522", "fall": "True", "units": " 3", "description": "Consideration of past, current, and future trends and issues in English Language arts instruction, standards, and methodologies. Examination of research, theory, and practice in concert with trends, issues, and questions. Independent research projects required."}, {"summer": "True", "name": "Teacher as Researcher", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "523", "fall": "True", "units": " 3", "description": "This course is designed to introduce the methods and skills required for designing, conducting, interpreting, and applying action research - the systematic inquiry into curriculum, instruction, teaching, and learning. This course will focus on reflective inquiry and practical applications."}, {"summer": "True", "name": "Theory and Research in Global Learning", "spring": "True", "number": "524", "fall": "True", "units": " 3", "description": "An examination of theoretical frameworks for global learning and comparative studies of various national approaches to K-12 education. This course provides  students with multiple lenses through which to consider how we teach and learn given the demands and opportunities present in our interconnected world."}, {"summer": "True", "name": "Contemporary Approaches In the Teaching Of Social Studies", "prerequisites": "Prerequisite: Advanced Undergraduate standing or Graduate standing", "spring": "True", "number": "525", "fall": "True", "units": " 3", "description": "Analysis of principles, strategies and application of new teaching approaches. Structured projects and practical experiences."}, {"summer": "True", "name": "Theory and Research On Teaching and Learning Social Studies", "prerequisites": "Prerequisite: ECI 530 or ECI 525", "spring": "True", "number": "526", "fall": "True", "units": " 3", "description": "A critical analysis of the literature relating to the teaching and learning of social studies and the drawing of implications for instructional practices."}, {"summer": "True", "name": "Strategies for Teaching English in Secondary Schools", "spring": "True", "number": "528", "fall": "True", "units": " 3", "description": "Methods and materials of teaching English in grades 9-12, with and emphasis on lesson planning and demonstrations/practice in teaching literature, study skills, speaking, listening, media literacy, and writing.  Some classes and assignments will be completed in a field setting."}, {"summer": "True", "name": "Social Studies In the Elementary School", "prerequisites": "Prerequisite: Six hrs. in ECI", "spring": "True", "number": "530", "fall": "True", "units": " 3", "description": "Advanced professional training in teaching of social studies for middle grades and elementary teachers, including in-depth introduction to research-based teaching strategies, instructional resources and literature of the field."}, {"summer": "True", "name": "Advanced Writing in Education", "spring": "True", "number": "531", "fall": "True", "units": " 3", "description": "Appropriate for any specialty area in Education.  Focus on writing required in graduate courses, research reviews for educational reports and National Board Certification, writing for educational journals, theses, and dissertations.  Opportunities to gain knowledge, tools, and strategies to meet the academic community's standards.  Strategies to develop and/or enhance form, style, content, quality of academic writing, and on researching, composing, revising, and editing.  Students will compose,self-evaluate and give feedback on the work of their peers.  Graduate status."}, {"summer": "True", "name": "Methods and Materials for Teaching Social Studies in the Middle Grades", "spring": "True", "number": "535", "fall": "True", "units": " 3", "description": "For preservice middle school social studies teachers.  Focus on: teaching and evaluation skills, adaptation of instruction to individual learner differences, identification and creation of instructional materials appropriate for use in social studies teaching.  Cannot earn credit for ECI 435 and ECI 535."}, {"summer": "True", "name": "Teaching Children's Literature", "spring": "True", "number": "537", "fall": "True", "units": " 3", "description": "Instructions for educators in quality children's literature, specific needs of young reader, genres of children's literature, strategies for instructing children's literature, ways to target reader's interests, and design of literature units."}, {"summer": "True", "name": "Reading In the Elementary School", "prerequisites": "Prerequisite: Six hrs. ED or PSY", "spring": "True", "number": "540", "fall": "True", "units": " 3", "description": "Theoretical foundations of reading instruction and current methods and materials for teaching reading, with emphasis on planning and implementing reading programs for children in kindergarten through grade six."}, {"summer": "True", "name": "Reading In the Content Areas", "prerequisites": "Prerequisite: Six hours in ED or PSY", "spring": "True", "number": "541", "fall": "True", "units": " 3", "description": "Methods in instruction for applying reading to content areas, with emphasis on means of improving comprehension, vocabulary and learning strategies in subject matter classrooms."}, {"summer": "True", "name": "Diagnosis Of Reading Disabilities", "prerequisites": "Prerequisite: ECI 540 or ECI 541", "spring": "True", "number": "543", "fall": "True", "units": " 3", "description": "Formal and informal instruments for diagnosing reading disabilities including completion of a diagnostic case study describing reading performance of a disabled reader."}, {"summer": "True", "name": "Remediation Of Reading Disabilities", "prerequisites": "Prerequisite: ECI 543", "spring": "True", "number": "544", "fall": "True", "units": " 3", "description": "Advanced approaches to reading remediation including theory and research related to remedial instructional strategies, analyses of instructional designs and evaluations of effectiveness of intervention programs."}, {"summer": "True", "name": "Theory and Research in Literacy", "prerequisites": "Prerequisite: ECI 540", "spring": "True", "number": "545", "fall": "True", "units": " 3", "description": "Advanced study of theoretical models of reading, research issues in reading and in other language processes. In-depth theoretical models of reading.  Emphasis on critical examination and analysis of research investigating reading acquisition, maturereading behavior and related language processes."}, {"summer": "True", "name": " Media", "spring": "True", "number": "546", "fall": "True", "units": " 3", "description": "Critical analysis of new literacies that are prompted by emerging technologies and participatory media in K-12. Design and application of new literacies and media instructional practices to literacy curriculum and other discipline areas."}, {"summer": "True", "name": "E-Business Applications in Business and Marketing Education", "spring": "True", "number": "548", "fall": "True", "units": " 3", "description": "Emphasis on design and construction of advanced web pages, business and marketing applications of electronic commerce, as well as economic, social, legal, and ethical issues that are related to conducting business in a virtual environment. Content prepares students to apply principles to the business and marketing education curriculum in the public schools. Credit for both ECI 448 and ECI 548 is not allowed."}, {"summer": "True", "name": "Special Problems in Reading", "prerequisites": "Prerequisite: Six hours of ED or PSY", "spring": "True", "number": "549", "fall": "True", "units": " 1-6", "description": "In-depth study of topical problems in reading education selected from areas of current concern to practitioners in education."}, {"summer": "True", "name": "Foundations Of Middle Years Education", "prerequisites": "Prerequisite: 6 hours of ED or PSY", "spring": "True", "number": "550", "fall": "True", "units": " 3", "description": "Examination of five major aspects of middle years education: (a) history and purposes of middle/junior high school, (b) pre- and early adolescent needs, interests and abilities, ? curriculum design and content, (d) teaching methods and (e) school organization. Emphasis on both theoretical understandings and effective classroom strategies."}, {"summer": "True", "name": "Teaching/Learning Approaches For Emerging Adolescents", "prerequisites": "Prerequisite: ECI 550; Graduate standing", "spring": "True", "number": "551", "fall": "True", "units": " 3", "description": "Exploration of teaching/learning approaches appropriate to emerging adolescents. Learning styles; interdisciplinary inquiry; community-based curriculum; simulations and games; learning centers; minicourses; design of physical space; all-school activities."}, {"summer": "True", "name": " Family Settings", "spring": "True", "number": "552", "fall": "True", "units": " 3", "description": "Historical and contemporary foundations of program development and evaluation in non-formal, community-based family life and youth development settings are examined including theory, research, and three holistic  program development constructs: 1) planning; 2) design and implementation; 3) impact evaluation and accountability."}, {"summer": "True", "name": "Applied Concepts in Child and Youth Development", "spring": "True", "number": "553", "fall": "True", "units": " 3", "description": " practice."}, {"summer": "True", "name": " Youth Settings", "spring": "True", "number": "554", "fall": "True", "units": " 3", "description": "To prepare educators (formal and non-formal) to better establish, lead and manage collaborations and partnerships in family settings and those that support holistic community-based youth development organizational systems.  Specific foci include: types and levels of partnerships; environmental scanning and socio-organizational linkage contextual factors affecting community collaborations; leadership factors affecting community collaborations; and human, financial and programmatic management in collaborations.  Some on-campus meetings are required."}, {"summer": "True", "name": "Organizational Systems in Youth and Family Settings", "prerequisites": "Prerequisite: ECI 506", "spring": "True", "number": "556", "fall": "True", "units": " 3", "description": "Preparation for current and future community family and youth development professionals leading and managing community-based organizations. Course includes: fundamentals of management and leadership; institutional and organizational structures; administrative and strategic planning; working with advisory and governing groups; marketing and program delivery systems; information management systems; and human resource, financial, facilities and risk management systems."}, {"summer": "True", "name": "Volunteerism in Youth and Family Settings", "spring": "True", "number": "557", "fall": "True", "units": " 3", "description": "Preparation for current and future community-based youth and family professionals to better manage volunteers in local program service delivery.  Specific foci include: volunteerism as a social phenomenon; volunteer resource management; new forms of volunteerism; and future trends in volunteerism. Restricted to graduate and post-baccalaureate students only."}, {"summer": "True", "name": "Professional Development in Business and Marketing Education", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "560", "fall": "True", "units": " 3", "description": "Designed to prepare business and marketing educators with the knowledge and skills necessary to desing and implement strategies for organizational improvement that will benefit business and marketing education programs.  Attendance and participationmeaningful, organized professional development activity is an integral component of the course."}, {"summer": "True", "name": "Curriculum and Instruction in Business and Marketing Education", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "561", "fall": "True", "units": " 3", "description": " MKZ students."}, {"summer": "True", "name": "Program Management in Business and Marketing Education", "spring": "True", "number": "562", "fall": "True", "units": " 3", "description": " MKZ students only."}, {"summer": "True", "name": "Methods and Materials in Teaching Secondary Social Studies", "spring": "True", "number": "563", "fall": "True", "units": " 3", "description": "ECI 563 is a course that involves teaching techniques, innovations, development of teaching and evaluation skills, and in-depth subject matter inquiry in the area of secondary school social studies.  Adaptation of instruction to individual learner differences, and selection and design of instructional materials will be explored.  Must be enrolled in Secondary Social Studies MAT Program."}, {"summer": "True", "name": "Advanced Instructional Strategies in Business and Marketing", "prerequisites": "Prerequisite: ECI 561", "spring": "True", "number": "566", "fall": "True", "units": " 3", "description": "Advanced strategies and techniques related to teaching and learning in the business and marketing education curricula, classrooms, work places, and technology environments in middle and secondary education.  MKZ students only."}, {"summer": "True", "name": "Special Problems in Business and Marketing Education", "spring": "True", "number": "569", "fall": "True", "units": " 1-6", "description": "In-depth study of topical problems in business and marketing education selected from areas of current concern to practitioners in education."}, {"summer": "True", "name": "Learning Disabilities", "prerequisites": "Prerequisite: ECI 585", "spring": "True", "number": "570", "fall": "True", "units": " 3", "description": "Field of learning disabilities, including definitions, prevalence, etiology, characteristics and current educational trends for educating students with learning disabilities."}, {"summer": "True", "name": "Methods and Materials In Learning Disabilities", "spring": "True", "number": "571", "fall": "True", "units": " 3", "description": "Current methods and materials for the teaching students with learning disabilities in elementary and/or secondary schools, including curriculum and instructional techniques. Focus on examination of commercial materials and development of teacher-made materials for use with students with learning disabilities."}, {"summer": "True", "name": "Resource Teaching In Special Education", "prerequisites": "Prerequisite: ECI 585", "spring": "True", "number": "572", "fall": "True", "units": " 3", "description": "Resource teaching in area of special education, with emphasis on resource teaching with students with special needs. Types of resource programs, establishment and maintenance of a program, selection of students, curriculum and materials."}, {"summer": "True", "name": "Applied Behavior Analysis for Teachers", "spring": "True", "number": "573", "fall": "True", "units": " 3", "description": "Concepts and procedures involved in design and implementation of techniques for managing the behavior of students in classroom setting. Focus on methods for defining, measuring, increasing, decreasing, maintaining, and generalizing classroom behaviors in all learners."}, {"summer": "True", "name": "Intellectual Disabilities", "prerequisites": "Prerequisite: ECI 585", "spring": "True", "number": "574", "fall": "True", "units": " 3", "description": "Content presented includes definitions, classifications, and assessment of person with intellectual disability from medical , sociological, and educational points of view. Issues related to labeling, etiology, characteristics, levels of severity, litigation, legislation, family and societal issues, history, and controversies are emphasized related to persons with intellectual disability."}, {"summer": "True", "name": "Communication Disorders In the Classroom", "prerequisites": "Prerequisite: ECI 570", "spring": "True", "number": "575", "fall": "True", "units": " 3", "description": "Occurrence of communication disorders in the school-age population, including types of disorders, prevalence, etiology, characteristics and corrective therapy. Focus on communication disorders among exceptional students and classroom teacher's role in working with communication disorders."}, {"summer": "True", "name": "Teaching Functional and Life Skills to Students with Disabilities", "prerequisites": "Prerequisite: ECI 585 and ED 574", "spring": "True", "number": "576", "fall": "True", "units": " 3", "description": "Methods of instruction and materials related to teaching children and persons with mild-moderate levels of disability are emphasized. Effective general pedagogical approaches are stressed, as well as the teaching of functional academic skills, curricula used in instructions, teaching social and adaptive behavior as well as daily living skills, and transition-related skills necessary for independent adult life."}, {"summer": "True", "name": "Education Of Severely Handicapped", "prerequisites": "Prerequisite: ECI 585 or ECI 574", "spring": "True", "number": "577", "fall": "True", "units": " 3", "description": "Severe and profound mental retardation and autism, including assessment procedures, educational and social/vocational programs, instructional strategies and evaluation. Legal and ethical issues involved in working with severely handicapped."}, {"summer": "True", "name": "Organization and Behavioral Management of Inclusive Classrooms", "spring": "True", "number": "579", "fall": "True", "units": " 3", "description": "To increase students' knowledge of persons with high incidence disabilities (i.e., learning disability, mild intellectual disability, and serious emotional disability), and how to manage the behavior of all pupils in educational environments.  Characteristics of students with  high incidence disabilities will be emphasized , as well as strategies to reduce the likelihood of problem behavior of all pupils in the classroom."}, {"summer": "True", "name": "Transition Program For Students With Mild Disabilities", "prerequisites": "Prerequisite: ECI 585", "spring": "True", "number": "580", "fall": "True", "units": " 3", "description": "Educational and other procedures involved in providing transition programming to students with mild disabilities. Examination of secondary-level special education service delivery, as well as post-secondary interventions, from critical, practical, empirical and theoretical perspectives."}, {"summer": "True", "name": "Educational Diagnosis and Prescription For Children With Exceptionalities", "prerequisites": "Prerequisite: ECI 585", "spring": "True", "number": "581", "fall": "True", "units": " 3", "description": "Concept of educational diagnosis of students with exceptionalities, including examination of educational diagnostic procedures in current use in special education. Development of informal diagnostic techniques and procedures for adapting curriculum and instruction for learner with exceptionalities."}, {"summer": "True", "name": "Behavior Disorders", "prerequisites": "Prerequisite: ECI 585", "spring": "True", "number": "583", "fall": "True", "units": " 3", "description": "Definitions, etiology, characteristics, philosophies and approaches to educational programming for children and youth with behavior disorders, including emotionally handicapped, autistic and socially maladjusted."}, {"summer": "True", "name": "Methods and Materials: Behavior Disorders", "prerequisites": "Prerequisite: ECI 583", "spring": "True", "number": "584", "fall": "True", "units": " 3", "description": "Curriculum materials, instructional strategies and behavior management techniques related to teaching children and youth with behavioral disorders including individualized instruction, group process, organization and evaluation of classroom programs, parent involvement, community resources and teachers' personal and professional growth and development."}, {"summer": "True", "name": "Education Of Exceptional Children", "prerequisites": "Prerequisite: 9 hrs. of ED or PSY", "spring": "True", "number": "585", "fall": "True", "units": " 3", "description": "Introduction to field of special education. Focus on historical overview, definitions and terminology in basic areas of exceptionality; etiological factors in exceptionality; developmental and learning characteristics of each area of exceptionality;and educational settings and strategies employed in special education. Review of current educational laws and policies affecting special education."}, {"summer": "True", "name": "Advanced Seminar In Literacy Research", "prerequisites": "Prerequisite: ECI 648", "spring": "True", "number": "603", "fall": "True", "units": " 3", "description": "Critical analyses of research and methodology in reading comprehension processes and strategies for comprehension and retention of written discourse.  Opportunity for design and conduct of a research project in reading or related area."}, {"summer": "True", "name": "Seminar on Teacher as Learner: Developmental Theory, Research and Practice", "prerequisites": "Prerequisite: Graduate standing (6 hrs course work at 500-level)", "spring": "True", "number": "606", "fall": "True", "units": " 3", "description": "Analysis of major contemporary theories and research of learning and development as a basis for individual and organizational change and development in educational settings."}, {"summer": "True", "name": "Advanced Seminar in Multicultural Education", "prerequisites": "Prerequisite: Graduate standing and ECI 500", "spring": "True", "number": "607", "fall": "True", "units": " 3", "description": "Application and analysis of research and scholarship in multicultural education and topics related to effective schools for contemporary culturally diverse student populations in K-12 settings."}, {"summer": "True", "name": "Special Problems In Curriculum and Instruction", "prerequisites": "Prerequisite: Six hrs. of ED or PSY", "spring": "True", "number": "620", "fall": "True", "units": " 1-6", "description": "In-depth study of  topical problems in curriculum and instruction selected from areas of current concern to practitioners in education."}, {"summer": "True", "name": "Independent Study in Curriculum and Instruction", "spring": "True", "number": "630", "fall": "True", "units": " 1-6", "description": "Independent curriculum or research project in curriculum and instruction."}, {"summer": "True", "name": "Practicum In Curriculum and Instruction", "prerequisites": "Prerequisite: Graduate standing in Col. of ED and PSY", "spring": "True", "number": "640", "fall": "True", "units": " 1-6", "description": "Supervised practical experiences in schools and area agencies concerned with curriculum and instruction or educational supervision."}, {"summer": "True", "name": "Practicum In Mentoring Of Teachers", "prerequisites": "Prerequisite: ECI 705, Graduate standing in College of ED and PSY", "spring": "True", "number": "641", "fall": "True", "units": " 1-6", "description": "Supervised practical experiences in which participants become mentor to a student teacher or a teacher in a school system."}, {"summer": "True", "name": "Diagnostic-Prescriptive Practicum in Reading", "prerequisites": "Prerequisite: ECI 540, ECI 541 and ECI 543; Graduate standing in College of ED and PSY", "spring": "True", "number": "645", "fall": "True", "units": " 3", "description": "Supervised teaching experience with students using diagnostic test data to prescribe remedial programs for reading-disabled individuals, implementing instructional prescriptions and evaluating success of remedial plans."}, {"summer": "True", "name": "Practicum in Business and Marketing Education", "prerequisites": "Prerequisite: ECI 569", "spring": "True", "number": "647", "fall": "True", "units": " 3", "description": "Supervised practical experiences in schools and area agencies concerned with business and marketing education."}, {"summer": "True", "name": "Practicum in Special Education", "prerequisites": "Prerequisite: Graduate standing in College of ED and PSY", "spring": "True", "number": "648", "fall": "True", "units": " 1-6", "description": "Supervised practical experiences in schools and area agencies concerned with teaching children and adolescents with disabilities."}, {"summer": "True", "name": "Internship In Curriculum and Instruction", "prerequisites": "Prerequisite: Graduate standing in Col. of ED and PSY", "spring": "True", "number": "650", "fall": "True", "units": " 1-6", "description": "Supervised opportunities for advanced professional development in contexts concerned with curriculum development and/or educational supervision."}, {"summer": "True", "name": "Internship In Instructional Technology - Computers", "prerequisites": "Prerequisite: Graduate standing in Col. of ED and PSY", "spring": "True", "number": "652", "fall": "True", "units": " 1-6", "description": "Supervised opportunities for advanced professional development in contexts concerned with instructional technology."}, {"summer": "True", "name": "Internship In Elementary Education", "prerequisites": "Prerequisite: 3 hrs. grad.-level elementary education course work, Graduate standing in Col. of ED and PSY", "spring": "True", "number": "654", "fall": "True", "units": " 1-6", "description": "Supervised opportunities for advanced professional development in contexts concerned with elementary grades education."}, {"summer": "True", "name": "Internship In Middle Grades Education", "prerequisites": "Prerequisite: ECI 550, ECI 551, Graduate standing in College. of ED and PSY", "spring": "True", "number": "656", "fall": "True", "units": " 1-6", "description": "Supervised opportunities for advanced professional development in contexts concerned with the education of young adolescents."}, {"summer": "True", "name": "Internship in Business and Marketing Education", "spring": "True", "number": "657", "fall": "True", "units": " 1-6", "description": "Supervised opportunities for advance professional development in contexts concerned with business and marketing education."}, {"summer": "True", "name": "Internship In Special Education", "prerequisites": "Prerequisite: Graduate standing in Col. of ED and PSY", "spring": "True", "number": "658", "fall": "True", "units": " 1-6", "description": "Supervised opportunities for advanced professional development in contexts concerned with special education."}, {"summer": "True", "name": "Seminar in Special Education Literacy", "prerequisites": "Prerequisite: ECI 540 or ECI 541 and ECI 581, ECI 585", "spring": "True", "number": "681", "fall": "True", "units": " 3", "description": "A case study approach is used in the seminar that requires the application of assessment techniques and instructional intervention methodologies in literacy for K-12 students with disabilities.  Assigned activities require access to and experience in schools and/or related settings.  This seminar is designed to be completed during the last half of the graduate program.  It is restricted to graduate students in SPE, SPL, SPM, SPB or consent of instructor."}, {"summer": "True", "name": "Spe Ed Seminar in Teaching Numerical Concepts", "prerequisites": "Prerequisite: ECI 585", "spring": "True", "number": "682", "fall": "True", "units": " 3", "description": "This seminar is designed to prepare special education teachers to provide empirically supported instruction in numerical concepts and skills to students with disabilities in special education and general education settings. Particular attention will be paid to student characteristics that impact learning in arithmetic and mathematics and to addressing state and national curriculum standards using instructional organization and strategies that have been shown through research to be effective for this population.  Field work in schools and/or related settings is required.  Restricted to students in SPE, SPB, SPL, SPM or by consent of instructor."}, {"summer": "True", "name": "Seminar in Special Education Learning Strategies", "prerequisites": "Prerequisite: ECI 585", "spring": "True", "number": "683", "fall": "True", "units": " 3", "description": "This seminar is designed to prepare special education teachers to evaluate and teach empirically supported learning strategies to students with disabilities in special education and collaborative settings.  Particular attention will be paid to learning strategies shown to help students with disabilities organize, learn, and apply facts, skills and routines that provide access to and mastery of critical information across the curriculum.  Field work in schools and/or related settings is required.  Restricted to graduate students in SPE, SPB, SPL, SPM or consent of instructor."}, {"summer": "True", "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "685", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the studnet in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "688", "fall": "True", "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": "True", "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "689", "fall": "True", "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": "True", "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "690", "fall": "True", "units": " 1-6", "description": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam."}, {"summer": "True", "name": "Research Projects In Curriculum and Instruction", "prerequisites": "Prerequisite: ELP 532", "spring": "True", "number": "692", "fall": "True", "units": " 1-3", "description": "Project or problem in research in education for graduate students, supervised by members of graduate faculty. Research chosen on basis of individual students' interests and not to be part of thesis or dissertation research."}, {"summer": "True", "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "693", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "695", "fall": "True", "units": " 1-9", "description": "Thesis research."}, {"summer": "True", "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "696", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "699", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their theses."}, {"summer": "True", "name": "Curriculum Theory and Development", "prerequisites": "Prerequisite: 9 sem. hrs. graduate PSY, ECI 502, ECI 514", "spring": "True", "number": "700", "fall": "True", "units": " 3", "description": "Theory and research in behavioral sciences and education designed to provide theoretical background for development of elementary and secondary curricula. Exploration of knowledge base and skills for critical review of curricula and instructional materials and provision of an application opportunity."}, {"summer": "True", "name": "Instructional Supervision Of Teachers", "spring": "True", "number": "705", "fall": "True", "units": " 3", "description": "Theory, research and practice of the professional role of a supervisor in the development of the effective and self-analytic teacher: pre-service (student teacher) and in-service (beginning and experienced teacher). For persons with at least two years of teaching experience in K-12 schools."}, {"summer": "True", "name": "Special Problems In Curriculum and Instruction", "prerequisites": "Prerequisite: Six hrs. of ED or PSY", "spring": "True", "number": "709", "fall": "True", "units": " 1-6", "description": "In-depth study of  topical problems in curriculum and instruction selected from areas of current concern to practitioners in education."}, {"summer": "True", "name": "Research Applications In Curriculum and Instruction", "prerequisites": "Prerequisite: ST 507, Doctoral student in C and I", "spring": "True", "number": "710", "fall": "True", "units": " 3", "description": "Focus on current issues and research methods used in the areas of curriculum development and supervision, instructional technology, English education, middle grades education, reading education, social studies education and special education."}, {"summer": "True", "name": "Computer Applications and Curriculum Integration", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "711", "fall": "True", "units": " 3", "description": "Use and evaluation of existing educational software, research findings with respect to integration of computers and new technologies in instruction."}, {"summer": "True", "name": "Multimedia Design and Applications in Instruction", "prerequisites": "Prerequisite: Six hrs. ED or PSY", "spring": "True", "number": "714", "fall": "True", "units": " 3", "description": "Emphasis on use and evaluation of existing educational software and research findings with respect to uses of computers in instruction."}, {"summer": "True", "name": "Internet Applications and Web Page Design in Instruction", "prerequisites": "Prerequisite: Six hrs. ED or PSY", "spring": "True", "number": "715", "fall": "True", "units": " 3", "description": "Instructional design principles underlying development of microcomputer-based instructional software and accompanying materials and programming principles and their implementation in courseware development. Additional topics include authoring languages, programming languages and graphics."}, {"summer": "True", "name": "Design and Evaluation Of Instructional Materials", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "716", "fall": "True", "units": " 3", "description": "Characteristics and selection of various media for instruction and their use in educational settings. Design and production of instructional materials. Analysis of research in the field. Individualized projects and assignments. Application of grounded research and theory concerning learning to design of instructional materials. Structured projects and practical experiences used to transfer design principles and evaluate instructional products."}, {"summer": "True", "name": "Advanced Multimedia Design and Applications in Instruction", "prerequisites": "Prerequisite: ECI 511, ECI 514", "spring": "True", "number": "717", "fall": "True", "units": " 3", "description": "Advanced study and application of instructional design principles underlying development, evaluation, and integration of multimedia and hypermedia in K-12 settings."}, {"summer": "True", "name": "Program and Staff Development in Instructional Technology", "prerequisites": "Prerequisite: ECI 511, ECI 514, ECI 515, ECI 642", "spring": "True", "number": "718", "fall": "True", "units": " 3", "description": "Study and application of principles related to educational computing and technology planning, facilities and resource management, and technology staff development in K-12 settings."}, {"summer": "True", "name": "Special Problems in Instructional Technology", "prerequisites": "Prerequisite: Six hours of ED or PSY", "spring": "True", "number": "719", "fall": "True", "units": " 1-6", "description": "In-depth study of topical problems in instructional technology selected from areas of current concern to practitioners in education."}, {"summer": "True", "name": "The Teaching Of Composition", "prerequisites": "Prerequisite: 9 hrs. of ED, PSY and/or ENG; to take this course in sum. as part of Capital Area Writing Project, student must apply and be selected", "spring": "True", "number": "720", "fall": "True", "units": " 3", "description": "For classroom teachers. Practical field-tested ideas to help students improve as writers by focusing on composition as a process as well as a product. Activities for teaching prewriting, drafting, revising, proofreading, grammar and evaluating with suggestions for individual and group learning. Writing in content areas and composition research/ theory."}, {"summer": "True", "name": "Special Problems in Social Studies Education", "prerequisites": "Prerequisite: Six hours of ED or PSY", "spring": "True", "number": "727", "fall": "True", "units": " 1-6", "description": "In-depth study of topical problems in social studies education selected from areas of current concern to practitioners in education."}, {"summer": "True", "name": "Special Problems in English Education", "prerequisites": "Prerequisite: Six hours of ED or PSY", "spring": "True", "number": "729", "fall": "True", "units": " 1-6", "description": "In-depth study of topical problems in English education selected from areas of current concern to practitioners in education."}, {"summer": "True", "name": "Literacy Theory and Research", "prerequisites": "Prerequisite: ECI 540", "spring": "True", "number": "745", "fall": "True", "units": " 3", "description": "Advanced study of theoretical models of reading, research issues in reading and in other language processes. In-depth theoretical models of reading.  Emphasis on critical examination and analysis of research investigating reading acquisition, maturereading behavior and related language processes."}, {"summer": "True", "name": "Seminar In Curriculum and Instruction", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "801", "fall": "True", "units": " 1-3", "description": "Consideration of contemporary issues, trends and recent research and development findings in curriculum and instruction."}, {"summer": "True", "name": "Advanced Seminar In Literacy", "prerequisites": "Prerequisite: ECI 545", "spring": "True", "number": "803", "fall": "True", "units": " 3", "description": "Critical analyses of research and methodology in reading comprehension processes and strategies for comprehension and retention of written discourse.  Opportunity for design and conduct of a research project in reading or related area."}, {"summer": "True", "name": "Seminar On Attention Deficit Hyperactivity Disorder, Research and Treatment", "prerequisites": "Prerequisite: 9 hrs. grad. credit in PSY or SPE", "spring": "True", "number": "804", "fall": "True", "units": " 3", "description": "Critical analysis of theory, research and interventions in Attention-Deficit-Hyperactivity-Disorder.  Reading and synthesization of literature and student-led class discussions of such topics as characteristics, diagnosis, etiology, long-term outcomes and management of ADHD."}, {"summer": "True", "name": "Seminar on Teacher as Learner: Developmental Theory, Research and Practice", "prerequisites": "Prerequisite: Graduate standing (6 hrs course work at 500-level)", "spring": "True", "number": "806", "fall": "True", "units": " 3", "description": "Analysis of major contemporary theories and research of learning and development as a basis for individual and organizational change and development in educational settings."}, {"summer": "True", "name": "Advanced Seminar in Multicultural Education", "prerequisites": "Prerequisite: Graduate standing and ECI 500", "spring": "True", "number": "807", "fall": "True", "units": " 3", "description": "Application and analysis of research and scholarship in multicultural education and topics related to effective schools for contemporary culturally diverse student populations in K-12 settings."}, {"summer": "True", "name": "Special Problems In Curriculum and Instruction", "prerequisites": "Prerequisite: Six hrs. of ED or PSY", "spring": "True", "number": "820", "fall": "True", "units": " 1-6", "description": "In-depth study of  topical problems in curriculum and instruction selected from areas of current concern to practitioners in education."}, {"summer": "True", "name": "Independent Study in Curriculum and Instruction", "spring": "True", "number": "830", "fall": "True", "units": " 1-6", "description": "Independent curriculum or research project in curriculum and instruction."}, {"summer": "True", "name": "Practicum In Curriculum and Instruction", "prerequisites": "Prerequisite: Graduate standing in Col. of ED and PSY", "spring": "True", "number": "840", "fall": "True", "units": " 1-6", "description": "Supervised practical experiences in schools and area agencies concerned with curriculum and instruction or educational supervision."}, {"summer": "True", "name": "Practicum In Mentoring", "prerequisites": "Prerequisite: ECI 705, Graduate standing in College of ED and PSY", "spring": "True", "number": "841", "fall": "True", "units": " 1-6", "description": "Supervised practical experiences in which participants become mentor to a student teacher or a teacher in a school system."}, {"summer": "True", "name": "Practicum in Business and Marketing Education", "spring": "True", "number": "847", "fall": "True", "units": " 1-6", "description": "Supervised practical experiences in schools and area agencies concerned with business and marketing education."}, {"summer": "True", "name": "Internship In Curriculum and Instruction", "prerequisites": "Prerequisite: Graduate standing in Col. of ED and PSY", "spring": "True", "number": "850", "fall": "True", "units": " 1-6", "description": "Supervised opportunities for advanced professional development in contexts concerned with curriculum development and/or educational supervision."}, {"summer": "True", "name": "Internship In Mentoring", "prerequisites": "Prerequisite: ECI 845 and ECI 705, Graduate standing in Col. of ED and PSY", "spring": "True", "number": "851", "fall": "True", "units": " 1-6", "description": "Supervised opportunities teaching educational personnel in local school systems how to serve as mentors to their colleagues."}, {"summer": "True", "name": "Directed Study in Curriculum and Instruction", "spring": "True", "number": "880", "fall": "True", "units": " 1-6", "description": "Curriculum or research project in curriculum and instruction under the direct supervision of a faculty member."}, {"summer": "True", "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "885", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "890", "fall": "True", "units": " 1-9", "description": "For students who are preparing for and taking written and/or oral preliminary exams."}, {"summer": "True", "name": "Research Projects In Curriculum and Instruction", "prerequisites": "Prerequisite: ELP 732", "spring": "True", "number": "892", "fall": "True", "units": " 1-3", "description": "Project or problem in research in education for graduate students, supervised by members of graduate faculty. Research chosen on basis of individual students' interests and not to be part of thesis or dissertation research."}, {"summer": "True", "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "893", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "895", "fall": "True", "units": " 1-9", "description": "Dissertation research."}, {"summer": "True", "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "896", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "899", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hour, tull-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations."}]