[{"summer": "True", "name": "Intro to Education", "spring": "True", "number": "100", "fall": "True", "units": " 2", "description": "This course serves as an introduction to teaching and learning in 21st century K-12 classrooms and as an orientation to the College and University experience.  through technology-assisted plenary and small group seminars, students will examine the knowledge, skills and dispositions necessary to become globally aware, ethical, reflective teachers of diverse populations in the 21st century.  Topics include academic skills, student success strategies, standards for teachers, and programs in the College of Education.  This course is restricted to Teacher Education majors only."}, {"summer": "True", "name": "Freshman Teaching Fellows Forum I", "spring": "True", "number": "101", "fall": "True", "units": " 1", "description": "Topics related to educational issues and requirements of the Teaching Fellows program. Topics will include current practices, policies and research in education.Restricted to Students Admitted to the Teaching Fellows Program"}, {"summer": "True", "name": "Freshman Teaching Fellows Forum II", "spring": "True", "number": "102", "fall": "True", "units": " 1", "description": "Topics related to educational issues and requirements of the Teaching Fellows program. Topics will include current practices, policies and research in education.Restricted to Students Admitted to the Teaching Fellows Program"}, {"summer": "True", "name": "Students Advocating for Youth I", "spring": "True", "number": "150", "fall": "True", "units": " 1", "description": "Building upon a passion for advocacy.  Investigating issues related to youth in today's North Carolina.   Exploring youth advocacy and ethics.  Exploring youth advocacy and diversity.  Exploring youth advocacy as a vocation.  Practical youth advocacy field work.  Participation in field experiences required.  Restricted to students admitted to the SAY program."}, {"summer": "True", "name": "Students Advocating for Youth II", "prerequisites": "Prerequisite: ED 150", "spring": "True", "number": "151", "fall": "True", "units": " 1", "description": "Continuing to build upon a passion for advocacy.  Understanding how legistlation and policy affects youth advocacy and youth organizations.  Exploring changes within the career field.  Exploring peer influence processes among youth.  Practical youthadvocacy field work.  Participation in field experiences required.  Field experience may extend beyond normal class time.  Restricted to students admitted to the SAY program."}, {"summer": "True", "name": "Sophomore Teaching Fellows Forum I", "prerequisites": "Prerequisite: Students in Teaching Fellows Program", "spring": "True", "number": "201", "fall": "True", "units": " 1", "description": "Topics related to educational issues and requirements of the Teaching Fellows program. Topics will include current practices, policies and research in education."}, {"summer": "True", "name": "Sophomore Teaching Fellows Forum II", "spring": "True", "number": "202", "fall": "True", "units": " 1", "description": "Topics related to educational issues and requirements of the Teaching Fellows program. Topics will include current practices, policies and research in education.Restricted to Students Admitted to the Teaching Fellows Program"}, {"summer": "True", "name": "Introduction to 21st Century Teaching", "prerequisites": "Prerequisite: Sophomore standing; Corequisite: ECI 204 or EMS 204, or EMS 205, or TDE 202", "spring": "True", "number": "204", "fall": "True", "units": " 2", "description": " Risk Management for details on acquiring the insurance and the current charge.  This course is retricted to Teacher Education majors."}, {"summer": "True", "name": "Special Topics in Education", "spring": "True", "number": "296", "fall": "True", "units": " 1-3", "description": "Individual or group study of particular areas of education at the freshman and sophomore levels.  Specific topics will vary from semester to semester."}, {"summer": "True", "name": "Junior Teaching Fellows Forum I", "spring": "True", "number": "301", "fall": "True", "units": " 1", "description": "Topics related to educational issues and requirements of the Teaching Fellows program. Topics will include current practices, policies and research in education.Restricted to Students Admitted to the Teaching Fellows Program"}, {"summer": "True", "name": "Junior Teaching Fellows Forum II", "spring": "True", "number": "302", "fall": "True", "units": " 1", "description": "Topics related to educational issues and requirements of the Teaching Fellows program. Topics will include current practices, policies and research in education.Restricted to Students Admitted to the Teaching Fellows Program"}, {"summer": "True", "name": "Tutoring Adolescents", "prerequisites": "Prerequisite: ECI 205 or EOE 207, Corequisite: EMS 203", "spring": "True", "number": "310", "fall": "True", "units": " 1", "description": "Developing skills in tutoring adolescent students.  Emphases include identifying adolescent learning difficulties, using a variety of tutoring methods and a tutorial self-evaluation process.  Requires off-campus field work."}, {"summer": "True", "name": "Classroom Assessment Principles and Practices", "prerequisites": "Prerequisite: Admission to Teacher Education Candidacy; Co-requisite: ED 312", "spring": "True", "number": "311", "fall": "True", "units": " 2", "description": " Risk Management for details on acquiring the insurance and the current charge.  This course is restricted to Teacher Education majors."}, {"summer": "True", "name": "Classroom Assessment Principles and Practices Professional Learning Lab", "prerequisites": "Prerequisite: Admission to Teacher Education Candidacy; Co-requisite: ED 311", "spring": "True", "number": "312", "fall": "True", "units": " 1", "description": " Risk Management for details on acquiring the insurance and the current charge.  This course is restricted to Teacher Education majors."}, {"summer": "True", "name": "Teaching Fellows Senior Seminar", "prerequisites": "Prerequisite: Senior standing", "spring": "True", "number": "403", "fall": "True", "units": " 1", "description": "A casebook study of first-year teacher experiences and an examination of professional, ethical, and legal issues in education as found in cases dealing with new teachers."}, {"summer": "True", "name": "Special Topics in Education", "prerequisites": "Prerequisite: Junior standing or Senior standing", "spring": "True", "number": "496", "fall": "True", "units": " 1-3", "description": "Individual or group study of special topics in professional education.  The topic and mode of study are determined by the faculty member after discussion with the student."}, {"summer": "True", "name": "Principles of Developing and Interpreting Assessment", "spring": "True", "number": "507", "fall": "True", "units": " 2", "description": "Designed to enable students to understand and use appropriate classroom assessment practices by applying knowledge of pedagogy and development to high-quality strategies for formative and summative assessment.  Students will explore best practices using developmentally-appropriate assessment strategies including authentic assessment, portfolios, and electronic portfolios, real-time feedback, open-and closed-ended formal assessments, and standardized testing.  Particular attention will be paid to examining the rationale for assessment, and the implications of assessment."}, {"summer": "True", "name": "Exploring Diversity in Classroom and Community", "spring": "True", "number": "508", "fall": "True", "units": " 3", "description": "Students will explore and apply the major philosophical and historical influences to current educational context as they relate to issues of diversity.  Focus will be placed on theoretical and practical issues of diversity in classroom settings, especially related to culture, race, gender, ethnicity, language, and socio-economic levels.  (Field-based experiences will be required)."}, {"summer": "True", "name": "Teaching Internship: MAT", "spring": "True", "number": "569", "fall": "True", "units": " 4", "description": "A supervised teaching experience requiring a minimum of 10 consecutive full-time weeks in an appropriate school classroom.  Designed to develop the knowledge, skills, and dispositions necessary for teaching at the elementary, middle and/or secondary level.  Includes regularly scheduled clinical observations and conferences.  Requires successful completion of at least 21 hrs. in the MAT program and approval by specialty area faculty.  Student responsible for transportation to placement site."}, {"summer": "True", "name": "Classroom Action Research", "spring": "True", "number": "570", "fall": "True", "units": " 1", "description": "Provides a brief introduction to educational research focusing specifically on classroom action research. Requires admission to MAT; completion of 6 hours in the program."}, {"summer": "True", "name": "Inquiry and Professional Development", "spring": "True", "number": "571", "fall": "True", "units": " 1", "description": "Builds on earlier course work (ED 570) preparing students to refine an action research proposal, collect data in a school setting, write a report, and to identify resources and activities that will support their ongoing professional development; requires 9 hours of graduate credit in the MAT curriculum."}, {"summer": "True", "name": "Teacher Leadership", "spring": "True", "number": "572", "fall": "True", "units": " 1", "description": "This course explores the multiple contexts, roles, and approaches to teacher leadership in classrooms, schools, communities, and professional organizations.  Requires at least 30 credit hours in the MAT program."}, {"summer": "True", "name": "Special Problems in Teaching and Learning", "spring": "True", "number": "590", "fall": "True", "units": " 1-6", "description": "In-depth study of topical problems in teaching and learning of current and special interest to K-12 Classroom teachers."}, {"summer": "True", "name": "Special Problems in Teaching", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "605", "fall": "True", "units": " 1-3", "description": "In-depth study of topical problems in teaching selected from areas of current concern to K-12 teachers."}, {"summer": "True", "name": "Introduction to Research Design in Education", "spring": "True", "number": "700", "fall": "True", "units": " 3", "description": "Survey of the field of educational research specifically with regard to the modes of inquiry, variety of methodologies, and ethical standards for conducting research with human participants.  Limited to doctoral students in Education or by permission of instructor."}, {"summer": "True", "name": "Applied Quantitative Methods in Education I", "prerequisites": "Prerequisite: ED 700, or ECI 510, or ELP 532, or ST 507", "spring": "True", "number": "710", "fall": "True", "units": " 3", "description": "This course is designed for educational researchers and leaders to gain experience with designing and evaluating research using a quantitative approach to answer research questions in educational research and policy analysis.  Students will examine design issues in research, create data sets, develop research questions from data provided, use a variety of descriptive and inferential procedures to answer formulated research questions, interpret the results and write the results in the language of educational research.  Restricted to doctoral students in Education or by permission of instructor."}, {"summer": "True", "name": "Applied Quantitative Methods in Education II", "prerequisites": "Prerequisite: ED 710", "spring": "True", "number": "711", "fall": "True", "units": " 3", "description": "Students will apply and enhance their quantitative skills through analysis of existing datasets.  Course goals include practicing and extending Multiple Regression knowledge and skills, generating and testing hypotheses in a multiple regression framework, and appropriately disseminating results.  Restricted to doctoral students in Education Research only."}, {"summer": "True", "name": "Introduction to Qualitative Research in Education", "spring": "True", "number": "730", "fall": "True", "units": " 3", "description": "Design of qualitative studies, conduct of field work including open-ended interviews and participant observation, analysis of data and understanding of theoretical and philosophical background of this research approach."}, {"summer": "True", "name": "Advanced Qualitative Research and Data Analysis in Education", "prerequisites": "Prerequisite: ELP 736, EAC 785 or ED 730", "spring": "True", "number": "731", "fall": "True", "units": " 3", "description": "Intensive course in the use of field-based and general qualitative research data analysis methods in the social study of education.  The course is to help participants acquire skills and gain experience in using various methodological and analytical research techniques.  The course emphasis is on the collection, management, analysis, and interpretation of qualitative data."}, {"summer": "True", "name": "Mixed Methods Research in Education", "prerequisites": "Prerequisite:ED 711,ED 730,ST 507, ELP736 or equivalent and/or permission of the instructor", "spring": "True", "number": "750", "fall": "True", "units": " 3", "description": "Explores the theoretical and practical issues surrounding the combining of quantitative and qualitative methods in educational research studies.  It addresses how to design, implement and write-up mixed methods research as well as how to critically review and interpret mixed methods research studies."}, {"summer": "True", "name": "Special Topics in Education Research", "spring": "True", "number": "795", "fall": "True", "units": " 3", "description": "This course provides in-depth instruction and applications in new or emerging areas of educational research, studies or venues. May be repeated for credit if topic changes. Doctoral students in education only."}]