[{"summer": "True", "name": "Educational Psychology", "prerequisites": "Prerequisite: Sophomore standing", "spring": "True", "number": "304", "fall": "True", "units": " 3", "description": "Psychological principles applied to education, including cognitive and personality development, individual differences, learning and behavior theory, cognitive strategies for learning and remembering, critical thinking and problem-solving strategies, student motivation, classroom management techniques, components of teacher effectiveness, measurement and student evaluation procedures, characteristics of exceptional children, mainstreaming in the classroom, and multicultural education."}, {"summer": "True", "name": "Applied Child Development", "prerequisites": "Prerequisite: Sophomore standing", "spring": "True", "number": "370", "fall": "True", "units": " 3", "description": "Students will explore how biological, cognitive, and social/emotional development affects children's learning and behavior. The course will focus on applying important theories and current findings in development to issues in education such as lesson planning, curriculum design, behavior management, motivation, an appropriate assessment. Students will also apply knowledge of development to issues such as creating actively engaging individuated experiences to deal with gifted students, students with diverse ethnic or cultural backgrounds, and students with exceptionalities or disabilities."}, {"summer": "True", "name": "Psychology of Adolescent Development", "prerequisites": "Prerequisite: PSY 200 or EDP 304", "spring": "True", "number": "476", "fall": "True", "units": " 3", "description": "Theories, principles, and issues of human psychological development emphasizing adolescence. Cognitive, social, and physical changes; their interaction.  Implications for teaching and parenting adolescents."}, {"summer": "True", "name": "Advanced Educational Psychology", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "504", "fall": "True", "units": " 3", "description": "A critical appraisal of current psychological findings relevant to educational practice and theory."}, {"summer": "True", "name": "Educational Testing and Measurement", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "560", "fall": "True", "units": " 3", "description": "The study of principles of educational testing and measurement, particularly classroom assessment, including norm and criterion referenced assessment, classroom testing methods and principles,standardized testing and measurement, item analysis, and an introduction to basic descriptive statistics.  A brief introduction to innovative assessment is also included."}, {"summer": "True", "name": "Multicultural Lifespan Development", "spring": "True", "number": "575", "fall": "True", "units": " 3", "description": "This course surveys theories, principles, and issues of psychological development throughout the lifespan. Emphasis will be placed on understanding current developmental research and its application to the enhancement of development from birth to late adulthood. Implications for helping professionals working in multicultural contexts will be provided."}, {"summer": "True", "name": "Adolescent Development", "prerequisites": "Prerequisite: 6 hours in PSY", "spring": "True", "number": "582", "fall": "True", "units": " 3", "description": "Current theories and research on development during adolescence. Topics include: physical growth, cognitive changes, relationships with peers, parents and teachers, quest for identity and independence, morality and sexuality."}, {"summer": "True", "name": "Special Problems in Educational Psychology", "spring": "True", "number": "590", "fall": "True", "units": " 1-3", "description": "In-depth study of topical problems in cognition, motivation, assessment, or other educational psychology area of current and special interest to educators."}, {"summer": "True", "name": "Special Problems in Educational Psychology", "spring": "True", "number": "605", "fall": "True", "units": " 1-3", "description": "In-depth study of topical problems in educational psychology selected from areas of current concern to educators."}, {"summer": "True", "name": "Summer Thesis Res", "spring": "True", "number": "696", "fall": "True", "units": " 1"}, {"summer": "True", "name": "Mixed Methods Research in Education", "prerequisites": "Prerequisite:ED 711,ED 730,ST 507, ELP736 or equivalent and/or permission of the instructor", "spring": "True", "number": "750", "fall": "True", "units": " 3", "description": "Explores the theoretical and practical issues surrounding the combining of quantitative and qualitative methods in educational research studies.  It addresses how to design, implement and write-up mixed methods research as well as how to critically review and interpret mixed methods research studies."}, {"summer": "True", "name": "Summer Dissert Res", "spring": "True", "number": "896", "fall": "True", "units": " 1"}]