[{"summer": "True", "name": "Introduction to Mechatronics Laboratory", "spring": "True", "number": "180", "fall": "True", "units": " 2", "description": "The objective of this course is to introduce students to the mechatronic engineering discipline as a synergistic combination of mechanical and electrical engineering, computer science, control and information technology. Foundational concepts in mechatronics are addressed including analog and digital electonics, sensors, actuators, microprocessors, and microprocessor interfacing to electromechanical systems through hands on laboratory exercises.Offered only at UNCA"}, {"summer": "True", "name": "Advanced Mechatronics Design Laboratory", "prerequisites": "Prerequisite: EGM 180", "spring": "True", "number": "360", "fall": "True", "units": " 1", "description": "An introduction to the design and construction of microprocessor-controlled electromechanical systems, this laboratory course builds on fundamental mechatronics concepts.  The course is project and design oriented to provide hands on working knowledge of real time software, real time programming, computer interfacing, mechanical design fabrication and control system design and the integration of these areas.For EGM students only; offered only at UNCA"}, {"summer": "True", "name": "Senior Design Project in Mechatronics Engineering", "prerequisites": "Prerequisite: EGM 360, senior standing", "spring": "True", "number": "482", "fall": "True", "units": " 4", "description": "Applications of engineering and basic sciences to the total design of electro-mechanical systems.  Consideration of the design process including feasibility study, preliminary design detail, cost effectiveness, along with the development and evaluation of a prototype accomplished through design-team activity.  Complete written and oral engineering report required.   For EGM students only; offered only at UNCA."}, {"summer": false, "name": "Senior Design Project in Mechatronics Engineering I", "prerequisites": "Prerequisite:EGM 360", "spring": false, "number": "484", "fall": true, "units": " 3", "description": "In this laboratory course, students will be exposed to the fundamentals of the engineering design process via the construction of a prototype mechatronic system in a team environment."}, {"summer": false, "name": "Senior Design Project in Mechatronics Engineering II", "prerequisites": "Prerequisite:EGM 484", "spring": true, "number": "485", "fall": false, "units": " 1", "description": "In this laboratory course, students will develop and refine oral, written and graphical communication skills as their senior design project is finalized, presented and demonstrated. The course is conducted in a team environment."}]