[{"summer": false, "name": "Introduction to Elementary Education in a Global Society", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "250", "fall": false, "units": " 3", "description": "Introduction to the major conceptual and intellectual foundations of the teaching profession, the sociology and culture of elementary schools and classrooms, and the world of work of elementary teachers. Fieldwork in schools and related settings maybe required in lieu of lecture on occasion. Students are responsible for transportation to and from their school based experiences.Students interested in Elementary Education."}, {"summer": false, "name": "Children's Thinking and Additive Reasoning", "prerequisites": "Prerequisite: ELM 250, Junior standing,  Elementary Education Majors", "spring": false, "number": "310", "fall": true, "units": " 3", "description": "Examination of mathematical reasoning processes in primary grade children and the theory and practice of active teaching strategies designed to motivate and engage children in mathematics learning in grades K-3. Fieldwork in schools and related settings may be required in lieu of lecture on occasion. Students are responsible for transportation to and from their school based experiences."}, {"summer": false, "name": "Teaching Science in the Primary Grades", "prerequisites": "Prerequisite: ELM 250, Junior standing,  Elementary Education Majors", "spring": false, "number": "320", "fall": true, "units": " 3", "description": "Examination of science knowledge and thinking in primary-age children. Development and application of methods for teaching science in the primary grades that leads to active learning of science as a process of inquiry. Fieldwork in schools and related settings may be required in lieu of lecture on occasion. Students are responsible for transportation to and from their school based experiences."}, {"summer": false, "name": "Teaching Reading in Elementary School: K-2", "prerequisites": "Prerequisite: ELM 250, Junior standing,  Elementary Education Majors", "spring": false, "number": "330", "fall": true, "units": " 3", "description": "ELM 330 is designed to prepare preservice teachers to teach reading and to lead to licensure in the elementary grades. Specific topics that relate to the theory and practice of teaching reading for early and emergent readers, including literature and struggling readers, will be examined. Fieldwork in schools and related settings may be required in lieu of lecture in occasion. Students are responsible for transportation to and from their school based experiences."}, {"summer": "True", "name": "Teaching Reading in the Elementary School: 3-5", "prerequisites": "Prerequisite: ELM 330, Junior standing,  Elementary Education Majors", "spring": "True", "number": "335", "fall": "True", "units": " 3", "description": "ELM 335 is designed to prepare preservice teachers to teach reading and to lead to licensure in the elementary grades. Specific topics that relate to the theory and practice of teaching reading for upper elementary grade readers, including information and media literacy and literature, will be examined. Fieldwork in schools and related settings may be required in lieu of lecture on occasion. Students are responsible for transportation to and from their school based experience."}, {"summer": false, "name": "Children Design, Create and Invent", "prerequisites": "Prerequisite: ELM 370, Junior standing,  Elementary Education Majors", "spring": false, "number": "340", "fall": true, "units": " 3", "description": "An active hands-on class where prospective elementary school teachers develop learning activities that children can use to stimulate their imaginations and learn fundamental concepts in science, technology, engineering, and mathematics. Part of a program leading to licensure in Elementary Education."}, {"summer": false, "name": "Assessment of Learning and Behavior", "prerequisites": "Prerequisite: ELM 250, Junior standing,  Elementary Education Majors", "spring": true, "number": "350", "fall": false, "units": " 3", "description": "Application of knowledge of pedagogy and development to develop high-quality strategies for formative and summative assessment. Best practices using developmentally-appropriate assessment strategies including authentic assessment, portfolios and electronic portfolios, real-time feedback, open- and closed-ended formal assessments, and standardized testing. Particular attention to examining the rationale for assessment and the implications of assessment."}, {"summer": false, "name": "Connections Seminar I The Elementary Classroom and School Community", "prerequisites": "Prerequisite: ELM 250, Junior standing,  Elementary Education Majors", "spring": false, "number": "370", "fall": true, "units": " 3", "description": "First of four seminars required for undergraduate elementary education majors. This course introduces preservice teachers to the world of public school classrooms, the tasks of teaching, and to their perspectives regarding a career in teaching. Examines relationships between theory and practice of teaching in mathematics, science, literacy, and assessment. Weekly fieldwork in schools and related settings is required 3 hours a week. Students are responsible for transportation to and from their school based experiences."}, {"summer": false, "name": "Connections Seminar II Cultural Identity, Social Justice and Diverse Learners", "prerequisites": "Prerequisite: ELM 370;Junior standing. Elementary Education majors.", "spring": true, "number": "375", "fall": false, "units": " 3", "description": "This seminar is the second of four seminars required for undergraduate elementary education majors who are pursuing K-6 teacher licensure. The purpose of the course is to help prospective elementary grades teachers develop competencies for increasing student achievement by focusing on multicultural education, teaching to diversity, and understanding the classroom culture. Weekly fieldwork in schools and related settings is required 3 hours a week. Students are responsible for transportation to and from their school based experiences."}, {"summer": false, "name": "Connections Seminar III Instructional Design and Assessment", "prerequisites": "Prerequisite: ELM 375, Senior standing,  Elementary Education Majors", "spring": false, "number": "400", "fall": true, "units": " 3", "description": "This seminar is the third of four semesters required for undergraduate elementary education majors who are pursuing K-6 teacher licensure. Preservice elementary educators will examine research-verified practices in instructional design and assessment that are designed to meet the needs of diverse K-6 learners. Candidates will complete a capstone project that will be taught during their student teaching experience. Weekly fieldwork in schools and related settings is required. Students are responsible for transportation to and from their school based experiences."}, {"summer": false, "name": "Children's Thinking and Multiplicative Reasoning", "prerequisites": "Prerequisite: ELM 310, Junior standing,  Elementary Education Majors", "spring": true, "number": "410", "fall": false, "units": " 3", "description": "This course is designed to prepare preservice teachers to teach math in the intermediate grades and to lead to licensure in the elementary grades. Specific methodologies that relate to the theory and practice of teaching of math will be examined. Fieldwork in schools and related settings may be required in lieu of lecture on occasion. Students are responsible for transportation to and from their school based experiences."}, {"summer": false, "name": "Teaching Science in the Intermediate Grades", "prerequisites": "Prerequisite: ELM 320, Senior standing,  Elementary Education Majors", "spring": true, "number": "420", "fall": false, "units": " 3", "description": "This course is designed to prepare preservice teachers to teach science in intermediate grades and to lead to licensure in the elementary grades. Specific methodologies that relate to the theory and practice of teaching science will be examined. Fieldwork in schools and related settings may be required in lieu of lecture on occasion. Students are responsible for transportation to and from their school based experiences."}, {"summer": false, "name": "Teaching Language Arts in the Elementary School", "prerequisites": "Prerequisite: ELM 335, Senior standing,  Elementary Education Majors", "spring": false, "number": "430", "fall": true, "units": " 3", "description": "This course is designed to prepare preservice teachers to teach language arts and to lead to licensure in the elementary grades. Specific methodologies that relate to the theory and practice of teaching language arts will be examined. Fieldwork in schools and related settings may be required in lieu of lecture on occasion. Students are responsible for transportation to and from their school based experiences."}, {"summer": false, "name": "Teaching Children with Special Needs in the Elementary Classroom", "prerequisites": "Prerequisite: ELM 350, ELM 375, Senior standing,  Elementary Education Majors, Corequisite: ELM 420", "spring": false, "number": "440", "fall": true, "units": " 3", "description": "This course is designed to prepare preservice teachers to teach students with special needs and to lead to licensure in the elementary grades. Specific methodologies that relate to the theory and practice of teaching students with special needs willbe examined. Fieldwork in schools and related settings may be required in lieu of lecture on occasion. Students are responsible for transportation to and from their school based experiences."}, {"summer": false, "name": "The Arts for Elementary Education", "prerequisites": "Prerequisite: ELM 375, Senior standing,  Elementary Education Majors", "spring": false, "number": "450", "fall": true, "units": " 3", "description": "This course is designed to prepare preservice teachers to integrate the arts; visual music, dance and drama, into the content areas. Successful completion of this course leads to licensure in the elementary grades. Specific methodologies that relateto the theory and practice of teaching the arts will be examined."}, {"summer": false, "name": "Social Studies for the Young Learner", "prerequisites": "Prerequisite: ELM 370, Junior standing,  Elementary Education Majors", "spring": false, "number": "460", "fall": true, "units": " 3", "description": "This course is designed to prepare preservice teachers to teach social studies and to lead to licensure in the elementary grades. The course is an examination of curriculum, instruction, and learning in K-6 social studies education. Emphases includedevelopment of the social studies; curricular principles and components; teaching strategies; and learner outcomes. Fieldwork in schools and related settings may be required in lieu of lecture on occasion. Students are responsible for transportationto and from their school based experiences."}, {"summer": false, "name": "Connections Seminar IV Linking Theory and Practice", "prerequisites": "Prerequisite: ELM 400, Elementary Education Majors, Admission to the Professional Semester, Corequisite: ELM 484", "spring": true, "number": "480", "fall": false, "units": " 3", "description": "ELM 480 Connections Seminar IV is designed as the Capstone Course in the Elementary Education Program. Preservice teachers will meet weekly to reflect on the student teaching experience and connect new learning to previous university coursework. In addition, preservice teachers will complete their Integrated INTASC and technology portfolios. Successful completion of student teaching and portfolio requirements will lead to licensure in the elementary grades; K-6."}, {"summer": false, "name": "Student Teaching in Elementary Education", "prerequisites": "Prerequisite: ELM 480, ELM 400, Elementary Education Majors, Admission to the Professional Semester", "spring": true, "number": "484", "fall": false, "units": " 9", "description": "Culminating experience for Elementary Education majors. A minimum of 10 weeks of supervised teaching in an elementary school classroom, demonstrating competent applications of standards-based practices and other required knowledge, skill, and dispositional outcomes. Taken concurrently with ELM 480. Students responsible for transportation to placement site."}, {"summer": false, "name": "Instructional Practice in Schools I", "spring": false, "number": "515", "fall": true, "units": " 1", "description": "Prepares pre-service teachers to develop competencies in assessment, instructional design, and tutoring and leads to initial licensure in the elementary grades. Includes 15-20 hours of fieldwork; transportation to schools is the responsibility of the students."}, {"summer": false, "name": "Instructional Practice in Schools II", "prerequisites": "Corequisite:  ELM 572, ELM 573, ELM 575", "spring": true, "number": "516", "fall": false, "units": " 2", "description": "Prepares pre-service teachers to develop competencies in assessment, instructional design, and teaching in whole class settings and leads to initial licensure in the elementary grades. Includes 30 hours of fieldwork; transportation to the schools is the responsibility of the students."}, {"summer": false, "name": "Methods of Teaching Elementary School Science", "spring": true, "number": "520", "fall": false, "units": " 3", "description": "This course is intended for teachers seeking to expand their knowledge and skills in teaching elementary school science.  The course examines the purposes, scope, sequences, materials, and methodologies for teaching science in elementary schools to a diverse student body.  It develops skill in planning, instructing, and assessing understanding of science content and processes.  It links instruction and assessment and addresses relevant content topics in chemistry, biology, physics, and earth and space science."}, {"summer": "True", "name": "Issues in Elementary School Teaching", "spring": "True", "number": "524", "fall": "True", "units": " 3", "description": "Analysis of contemporary elementary school environments, developmental trends of childhood affecting teaching of elementary age students, nature of professionalism among elementary school teachers including pedagogical skills and subject matter knowledge, and ways to improve teaching effectiveness in elementary classrooms settings."}, {"summer": "True", "name": "Social Studies In the Elementary School", "spring": "True", "number": "530", "fall": "True", "units": " 3", "description": "Advanced professional training in teaching of social studies for middle grades and elementary teachers, including in-depth introduction to research-based teaching strategies, instructional resources and literature of the field."}, {"summer": false, "name": "Targeted Literacy Assessment and Instruction for Elementary School", "spring": true, "number": "533", "fall": false, "units": " 3", "description": "Intended for teachers seeking to expand their knowledge and skills in assessing and teaching elementary reading, particularly to students with reading difficulties. Exploring the purposes, sequences, and materials for identifying students' instructional strengths and learn methods for providing appropriate evidence-based reading instruction. Closely links reading assessment and reading instruction and addresses relevant content topics in elementary reading development, assessment, and instruction."}, {"summer": "True", "name": "Teaching Children's Literature", "spring": "True", "number": "537", "fall": "True", "units": " 3", "description": "Instructions for educators in quality children's literature, specific needs of young reader, genres of children's literature, strategies for instructing children's literature, ways to target reader's interests, and design of literature units."}, {"summer": "True", "name": "Special Problems in Elementary School", "spring": "True", "number": "539", "fall": "True", "units": " 1-6", "description": "In-depth study of topical problems in elementary education selected from areas of current concern to practitioners in education."}, {"summer": "True", "name": "Reading In the Elementary School", "spring": "True", "number": "540", "fall": "True", "units": " 3", "description": "Theoretical foundations of reading instruction and current methods and materials for teaching reading, with emphasis on planning and implementing reading programs for children in kindergarten through grade six."}, {"summer": false, "name": "Number Systems and Operations: K-5 Mathematical Tasks", "spring": false, "number": "555", "fall": true, "units": " 3", "description": "Analysis and construction of effective mathematical tasks in teaching number systems and operations at the K-5 level; attention is also given to the expansion of content knowledge."}, {"summer": false, "name": "Rational Numbers and Operations: K-5 Learning Trajectories", "spring": true, "number": "556", "fall": false, "units": " 3", "description": "Focus on rational number concepts through learning trajectories at the K-5 level; attention also given to problem solving and content knowledge."}, {"summer": true, "name": "Data Analysis and Measurement: K-5 Classroom Interactions", "spring": false, "number": "557", "fall": false, "units": " 3", "description": "Focus on statistical literacy of elementary teachers and the teaching of data analysis and measurement to K-5 students; attention is also given to learning methods which facilitate appropriate classroom interactions."}, {"summer": true, "name": "Algebraic Reasoning: K-5 Discourse and Questioning", "spring": false, "number": "558", "fall": false, "units": " 3", "description": "Focus on the early algebra concepts of functional thinking and generalized arithmetic in relationship to pedagogical practices centered on questioning in the mathematics classroom."}, {"summer": true, "name": "Geometry and Spatial Visualization: K-5 Assessment", "spring": false, "number": "559", "fall": false, "units": " 3", "description": "Formative and summative assessment strategies of students' geometric thinking in elementary grades; Concept development of 2- and 3-dimensional Geometry. Attention also given to diagnosis of student errors."}, {"summer": true, "name": "Mathematical Modeling: K-5 Leadership", "spring": false, "number": "560", "fall": false, "units": " 3", "description": "Generating mathematical representations and making explicit connections between concepts; Pedagogy designed to equip elementary teachers to become mathematics teacher-leaders in school settings; Focus given to topics integrated within mathematical strands."}, {"summer": false, "name": "Language Arts, New Literacies and Media for Initial License", "spring": false, "number": "571", "fall": true, "units": " 3", "description": "Examine research-based processes for writing instruction, effects of and approaches for use of technology on literacy development, and effects of media and new literacies (non-print literacies, e.g. digital, visual, film) on literacy learning and development in elementary schools. Restricted to ELM MAT students."}, {"summer": false, "name": "Methods for Teaching Reading in the Elementary Classroom for Initial License", "spring": true, "number": "572", "fall": false, "units": " 3", "description": "ELM 572 prepares pre-service teachers to teach reading and leads to licensure in the elementary grades.  The course examines specific research-based methodology that relates to the theory and practice of teaching reading for elementary readers.  Restricted to ELM, MAT students."}, {"summer": false, "name": "Methods for Teaching Elementary School Science for Initial License", "spring": true, "number": "573", "fall": false, "units": " 3", "description": "ELM 573 prepares preservice teachers to teach science and leads to licensure in the elementary grades. The course examines specific research verified methodologies that relate to the theory and practice of teaching science to elementary students. Restricted to ELM MAT students."}, {"summer": false, "name": "Methods for Teaching Mathematics in the Elementary Classroom for Initial License", "spring": true, "number": "574", "fall": false, "units": " 3", "description": "Prepares preservice teachers to teach mathematics and leads to licensure in the elementary grades. Examines specific research-based methodologies that relate to the theory and practice of teaching mathematics to elementary students. Limited to students enrolled in MAT Elementary Education program."}, {"summer": false, "name": "Social Studies in the Elementary School for Initial License", "spring": false, "number": "575", "fall": true, "units": " 3", "description": "Designed to prepare pre-service teachers to teach social studies and to lead to licensure in the elementary grades. The course is an examination of curriculum, instruction, and learning in K-6 social studies education, Emphasis include development of the social studies, curricular principles and components, research verified teaching strategies, and learner outcomes. Restricted to ELM MAT students."}, {"summer": true, "name": "Special Problems in Elementary Education", "spring": true, "number": "590", "fall": true, "units": " 1-3", "description": "In-depth study of topical problems in teaching and learning of current and special interest to elementary education practitioners."}, {"summer": true, "name": "Special Problems in Elementary Teaching", "spring": true, "number": "605", "fall": true, "units": " 1-3", "description": "In-depth study of topical problems in teaching selected from areas of current concern to K-6 teachers."}, {"summer": "True", "name": "Practicum in Elementary Education", "spring": "True", "number": "644", "fall": "True", "units": " 1-6", "description": "Supervised practical experiences in schools and area agencies concerned with education of elementary-age students."}, {"summer": "True", "name": "Internship In Elementary Education", "spring": "True", "number": "654", "fall": "True", "units": " 1-6", "description": "Supervised opportunities for advanced professional development in contexts concerned with elementary grades education."}]