[{"summer": "True", "name": "Special Topics in Education: General Studies", "spring": "True", "number": "296", "fall": "True", "units": " 1-3", "description": "Individual or group study of particular areas of education at the freshman and sophomore levels. Specific  topics will vary from semester to semester."}, {"summer": "True", "name": "School and Society", "prerequisites": "Prerequisite: Junior standing.", "spring": "True", "number": "344", "fall": "True", "units": " 3", "description": "The interrelationship between the school and other institutions, values, and patterns of thought in American society."}, {"summer": "True", "name": "Special Topics in Education: General Studies", "prerequisites": "Prerequisite: Junior standing or Senior standing", "spring": "True", "number": "496", "fall": "True", "units": " 1-3", "description": "Individual or group study of special topics in professional education. The topic and mode of study are determined by the faculty member after discussion with the student."}, {"summer": "True", "name": "Education and Social Diversity", "spring": "True", "number": "515", "fall": "True", "units": " 3", "description": "Overview of role of education within a culturally diverse society. Major attention to racial, socioeconomic and regional subpopulations. Issues discussed include subcultural influences on public school performances, equality of educational opportunity, social stratification and mobility, and the impact of schooling on intergroup relations."}, {"summer": "True", "name": "Introduction To Education Law", "spring": "True", "number": "518", "fall": "True", "units": " 3", "description": "Relationship of constitutional, statutory and case law to elementary and secondary public school settings, particularly in areas of students, teachers and liability. Particular emphasis on N.C. and federal law."}, {"summer": "True", "name": "Introduction To Educational Inquiry", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": "True", "number": "532", "fall": "True", "units": " 3", "description": "Basic concepts and methods of educational inquiry. Emphasis on logic underlying various approaches to problem definition and solution and on tools of investigator, as well as on sources and interpretation of research information related to student'sparticular area of study."}, {"summer": "True", "name": "Ethics and Educational Decision Making", "spring": "True", "number": "534", "fall": "True", "units": " 3", "description": "Application of moral theories and methods of moral reasoning to problems and issues involving educational policy and decision making. Character of morality; moral autonomy and leadership; intellectual freedom and public interest; authority and education; punishment and due process; and leadership and rationality."}, {"summer": "True", "name": "Principles of Educational Leadership and Empowerment", "spring": "True", "number": "550", "fall": "True", "units": " 3", "description": "Examines school organization theories and critical domains of leadership (e.g., school vision, culture, management, collaboration, ethics, and environments).  Develops conceptual, managerial and interpersonal leadership skills through analysis of school goals and purpose; organizational design, development and improvement; curricular and instructional leadership; and school-community relationships.  Instructional activities will include lecture, seminar discussion, case and problem-based analysis. Graduate standing required."}, {"summer": "True", "name": "Context and Challenges of School Improvement", "spring": "True", "number": "551", "fall": "True", "units": " 3", "description": "Examination of social, cultural, political and policy environment of schooling with emphasis on NC.  Analysis of major theories of school change and development.  critical examination of opportunities and barriers to strategic change efforts.  Instructional activities will include lecture, sminar discussion, case and problem-based analysis."}, {"summer": "True", "name": "School-Based Planning, Management, and Evaluation in Professional Learning Communities", "spring": "True", "number": "552", "fall": "True", "units": " 3", "description": "Prepares administrators to strategically plan, manage and evaluate core programs and systems for the safe and efficient operation of schools.  Operational domains examined will include information systems, management systems, curriculum, instruction, student behavior and school security systems.  Instructional activities include lecture, sminar discussions, case, situation and problem-based analysis."}, {"summer": "True", "name": "Organizational Management I: Human Resource Management in K-12 Education", "spring": "True", "number": "553", "fall": "True", "units": " 3", "description": "Examination and application of models, theories, and research pertaining to personnel appraisal in education, including recruitment hiring, retention, and dismissal; evaluation models for professional and classified staff; use of effective professional development models to support professional growth and development."}, {"summer": "True", "name": "Organizational Management II: Resource Support and Sustainability in K-12 Education", "prerequisites": "Corequisite: ELP 553", "spring": "True", "number": "554", "fall": "True", "units": " 3", "description": "Theories and practices of funding K-12 education including examination of: political frameworks and policy issues; concepts central to education finance and budgeting; purposes, designs, and uses of school budgets; procedures for generating, analyzing and interpreting issues related to education finance and school budgeting. Construct, manage and analyze school and district-level budgets; address issues of economic efficiency, equity and fiscal adequacy and their fiscal impact on the school community. Understand North Carolina's Uniform Chart of Accounts accounting structure for school budgeting."}, {"summer": "True", "name": "Special Topics", "spring": "True", "number": "595", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Special Problems In Education", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": "True", "number": "620", "fall": "True", "units": " 1-3", "description": "Opportunity for graduate students in education to study problem areas in professional education under direction of member of graduate faculty."}, {"summer": "True", "name": "Practicum In Education Administration", "spring": "True", "number": "641", "fall": "True", "units": " 1-6", "description": "Supervised experience in appropriate educational setting to enable student to gain practice in applying concepts, principles and theories of education administration."}, {"summer": "True", "name": "Internship In Educational Leadership and Program Evaluation", "prerequisites": "Prerequisite: Nine hrs. in grad.-level courses", "spring": "True", "number": "651", "fall": "True", "units": " 1-9", "description": "Utilization of participant-observer role and required participation in selected educational situations with emphasis upon development of observational skills, ability to record relevant observations by means of written journals, skills in analyzing experiences identifying critical incidents and projection of events and consequences. Required development of possible alternative courses of action in various situations, selection of one of alternatives and evaluation of consequences of selected course of action."}, {"summer": "True", "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "685", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "688", "fall": "True", "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": "True", "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "689", "fall": "True", "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": "True", "name": "Master's Research Projects In Educational Leadership and Program Evaluation", "prerequisites": "Prerequisite: ELP 532", "spring": "True", "number": "692", "fall": "True", "units": " 1-3", "description": "A project or problem in research in education for graduate students, supervised by members of graduate faculty. Research chosen on basis of individual students' interests and not to be part of thesis or dissertation research."}, {"summer": "True", "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "693", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "695", "fall": "True", "units": " 1-9", "description": "Thesis research."}, {"summer": "True", "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "696", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "699", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their theses."}, {"summer": "True", "name": "Cases In Educational Administration", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "720", "fall": "True", "units": " 3", "description": "Utilization of case study and case simulation approach to study of school administration. Development and application of administrative concepts to simulated situations and to actual case histories. View of administrative process as a decision-making process. Student expected to make decisions after considering alternative courses of action and after projecting probable consequences."}, {"summer": "True", "name": "Contemporary Educational Thought", "spring": "True", "number": "724", "fall": "True", "units": " 3", "description": "Reading and discussion of 20th-century works in educational philosophy. Consideration of such movements as pragmatism, reconstruction, perennialism and existentialism."}, {"summer": "True", "name": "School Law For the Administrator", "spring": "True", "number": "728", "fall": "True", "units": " 3", "description": "Comprehensive study of constitutional, statutory and case law as related to elementary and secondary school administration. Emphasis on legal issues associated with governance, finance, property, personnel and curriculum."}, {"summer": "True", "name": "Educational Finance", "spring": "True", "number": "729", "fall": "True", "units": " 3", "description": "Historical and sociopolitical contextual analysis of underlying values, methodologies and policies associated with economic and financial planning of K-12 education (e.g., efficiency, equity, and liberty) and the economic and financial mechanisms used to generate, distribute, and expend revenues for educational purposes."}, {"summer": "True", "name": "Policy Research in Education", "spring": "True", "number": "735", "fall": "True", "units": " 3", "description": "This course will draw on both classic and contemporary materials in educational policy research and will primarily focus on the substance of policy research rather than methodology.  It addresses research pertaining to the foundations, implementation and evaluation of policy in all levels and sectors of the educational system.  Major attention will be given to education in the United States, with comparative perspectives included."}, {"summer": "True", "name": "Qualitative Research In Education and Policy Analysis", "spring": "True", "number": "736", "fall": "True", "units": " 3", "description": "Provision of public school personnel and educational policy analysts with research training and experience to address educational research and policy problems using qualitative methods. Qualitative research design and strategies; data collection, management and analysis; interpretation and writing; qualitative evaluation and formation as applied particularly to educational research and policy analysis."}, {"summer": "True", "name": "Advanced Qualitative Applications in School Administration and Policy", "prerequisites": "Prerequisite: ELP 736", "spring": "True", "number": "737", "fall": "True", "units": " 3", "description": "Application of advanced qualitative methods and action research in school administration and policy analysis.  Research proposal development, article preparation, evaluation of qualitative and action research, discussion of theoretical and methodological issues, computer analysis of qualitative data."}, {"summer": "True", "name": "Applied Research Methods In Education", "spring": "True", "number": "742", "fall": "True", "units": " 3", "description": "Through use of simulated educational settings, consideration given to development of research proposals or plans, selection and/or development of appropriate measurement instruments and purposes and functions of various statistical designs and procedures. Preparation and analysis of simulated data using computer-based statistical packages, interpretation of results and production of a research report."}, {"summer": "True", "name": "Politics of P-12 Education", "spring": "True", "number": "751", "fall": "True", "units": " 3", "description": "Analysis of political interactions of individuals and groups in P-12 education, specifically, how politics shapes educational decisions within a federal system of governance.  Topics covered include micropolitics and macropolitical systems at the school, district, municipal, state, and federal levels, as well as political culture, interest groups, advocacy coalitions, and institutions.   Doctoral standing required."}, {"summer": "True", "name": "Theories Framing curriculum Inquiry", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "752", "fall": "True", "units": " 3", "description": "Introduction to different curricula research paradigms and/or epistemologies and the philosophies upon which they are founded within the context of education.  Develop an understanding of the philosophies upon which different research paradigms or epistemologies are found, particularly positivism, realism, neo-realism, interpretivism, phenomenology, hermeneutics, narrative orientations, critical theory, feminism, race-based approaches, lesbian/gay orientations, and postmodernism."}, {"summer": "True", "name": "Data Decision Making for School Administrators", "spring": "True", "number": "753", "fall": "True", "units": " 3", "description": "Understand the purposed and uses of school data for research-based school improvement. Understand different types of assessment needed for school and district-wide improvement. Develop models of administrative decision making incorporating key goals, resources, curriculum alignment, data, assessment, and evaluation. Doctoral student status required."}, {"summer": "True", "name": " Mangement for School Leaders", "spring": "True", "number": "756", "fall": "True", "units": " 3", "description": "Prepares district-level administrators to analyze the changing nature of the superintendency, including major management and leadership responsibilities and leadership approaches.  Operational domains examined include school governance and organizational theory, school boards, school district policy, collaborative leadership, material and human resource management, systemic and sustainable reform, contemporary challenges, and personal practices management.  Doctoral standing required."}, {"summer": "True", "name": "Research in P-12 Administrative Leadership", "spring": "True", "number": "757", "fall": "True", "units": " 3", "description": "Apply theories of administrative leadership to daily practice. Understand, develop, and utilize theory and research in leadership to inform and improve practice. Analysis of macro and micro level forces impacting administrative leadership at the building and district level. Doctoral student status required."}, {"summer": "True", "name": "Evaluation Theory and Practice In Education", "spring": "True", "number": "780", "fall": "True", "units": " 3", "description": "Review of educational program evaluation with emphasis on (1) theory and conceptual models of evaluation, (2) evaluation design, and (3) environmental practical factors influencing design and implementation of evaluation studies."}, {"summer": "True", "name": "Personnel Recruitment, Selection, Development and Appraisal in Education", "spring": "True", "number": "789", "fall": "True", "units": " 3", "description": "Issues, models, theories, research and applications in the evolving field of educational personnel and human resources administration with emphais on recruitment, selection, and development."}, {"summer": "True", "name": "Special Topics", "spring": "True", "number": "795", "fall": "True", "units": " 1-3", "description": "Special Topics in Educational Research and Leadership"}, {"summer": "True", "name": "Special Problems In Education", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": "True", "number": "820", "fall": "True", "units": " 1-3", "description": "Opportunity for graduate students in education to study problem areas in professional education under direction of member of graduate faculty."}, {"summer": "True", "name": "Practicum In Education Administration", "spring": "True", "number": "841", "fall": "True", "units": " 1-6", "description": "Supervised experience in appropriate educational setting to enable student to gain practice in applying concepts, principles and theories of education administration."}, {"summer": "True", "name": "Internship In Educational Leadership and Program Evaluation", "prerequisites": "Prerequisite: Nine hrs. in grad.-level courses", "spring": "True", "number": "851", "fall": "True", "units": " 1-9", "description": "Utilization of participant-observer role and required participation in selected educational situations with emphasis upon development of observational skills, ability to record relevant observations by means of written journals, skills in analyzing experiences identifying critical incidents and projection of events and consequences. Required development of possible alternative courses of action in various situations, selection of one of alternatives and evaluation of consequences of selected course of action."}, {"summer": "True", "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "885", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Doctoral Preliminary Exam", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "890", "fall": "True", "units": " 1-9", "description": "For students who are preparing for and taking written and/or oral preliminary exams."}, {"summer": "True", "name": "Problems Of Research Design In Education", "prerequisites": "Prerequisite: ELP 742", "spring": "True", "number": "891", "fall": "True", "units": " 1-3", "description": "Provision of individualized but structured investigation of alternative problem definitions, research methodologies and statistical analyses for a problem of student's choosing, usually associated with thesis or dissertation. In small groups or individually with instructor, student consideration of research design, measurements and statistical analysis necessary to conduct research."}, {"summer": "True", "name": "Research Projects In Educational Leadership and Program Evaluation", "spring": "True", "number": "892", "fall": "True", "units": " 1-3", "description": "A project or problem in research in education for graduate students, supervised by members of graduate faculty. Research chosen on basis of individual students' interests and not to be part of thesis or dissertation research."}, {"summer": "True", "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "893", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "895", "fall": "True", "units": " 1-9", "description": "Dissertation research."}, {"summer": "True", "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "896", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "899", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hours, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations."}]