[{"summer": "True", "name": "Foundations in Arts Entrepreneurship", "spring": "True", "number": "365", "fall": "True", "units": " 3", "description": "This course will introduce and outline the role, purpose, and perception of \"art\" in various marketplaces and contexts for the emerging arts entrepreneur.  Topics include: issues in marketing aesthetic products, consumer identification through art, models of consumer behavior, art and technology, macro-economic issues that affect the arts industries, arts policy and access."}, {"summer": "True", "name": "Practical Arts Entrepreneurship", "spring": "True", "number": "370", "fall": "True", "units": " 3", "description": "This course will introduce and outline the cultural and economic environment of the arts in the United States.  Topics include: the start-up process of for- and non-profit entities, economic and social impact of art and artists in communities, public and private arts support, non-profit culture and basic grantsmanship, arts policy, creative economy efforts, the role of geography, demand and infrastructure considerations in entrepreneurial decision-making, competition analysis and marketing."}, {"summer": "True", "name": "Understanding the Arts Economies", "prerequisites": "Prerequisite: EMA 370", "spring": "True", "number": "375", "fall": "True", "units": " 3", "description": "This course explores arts and arts-related economies of critical importance to the emerging arts entrepreneur.  Topics include: creative, experimental and hybrid economies, Arts infrastructure in urban and rural areas, arts clusters, patronage, broader economic conditions effecting arts economies, the relationship of \"art\" to segmented technology economies."}, {"summer": "True", "name": "Capstone Experience in Arts Entrepreneurship", "prerequisites": "Prerequisite: EMA 375", "spring": "True", "number": "430", "fall": "True", "units": " 3", "description": "Students analyze arts and arts-related businesses through the use of case studies in addition to executing an entrepreneurial project concerning the arts in a Raleigh community.  This class introduces students to the decision-making skills necessary to sustain arts ventures and focuses on constructing innovative solutions to common problems arts and arts-related entrepreneurs encounter.  Information gained from the prerequisite courses will be put to authentic use in either a non- or for-profit setting.  Transportation and some costs may be required for project work."}]