[{"summer": false, "name": "Introduction to Environmental Sciences", "spring": false, "number": "100", "fall": false, "units": " 3", "description": "Environmental Science majors only, permission of instructor.  Interrelationships between human populations and the natural environment.  Human population trends, agriculture, air and water pollution, biological diversity, forest and land use, energyand mineral resources, and toxic substances.  Consideration of related economic factors, laws, politics, political behavior, and ethical questions."}, {"summer": false, "name": "Introduction to Environmental Regulations", "spring": true, "number": "105", "fall": false, "units": " 1", "description": "ET 105 is a 1 hour lecture/discussion class, required of all environmental technology majors. The course reviews all the major federal and state regulations and laws addressing, water air and soil pollution; solid, toxic and hazardous waste, occupational safety/health and environmental management systems.  For ET majors only."}, {"summer": false, "name": "Introduction to Renewable Energy Technologies and Assessments", "spring": false, "number": "120", "fall": true, "units": " 3", "description": "Overview of the various renewable energy assessment technologies. Students will learn what assessments and measurements can be taken to determine if renewable energy technologies will be effective in a particular location. Topics include biomass and biofuels, geothermal systems, solar thermal systems, photovoltaics, wind energy, and hydroelectric."}, {"summer": false, "name": "Environmental Technology Laboratory I", "spring": false, "number": "201", "fall": true, "units": " 1", "description": "Use of field and laboratory instrumentation for monitoring water quantity and quality.  Management, analysis, interpretation, and oral and written reporting of complex environmental data sets.  Hands-on, real-world experience in water quality monitoring and maintenance.  Required field trips may extend beyond class time."}, {"summer": false, "name": "Environmental Technology Laboratory II", "spring": true, "number": "202", "fall": false, "units": " 1", "description": "Use of field and laboratory instrumentation for monitoring plants, soils, and natural systems.  Management, analysis, interpretation, and oral and written reporting of complex environmental datasets.  Hands-on, real-world experience in plant and soil quality monitoring and maintenance.  Required field trips may extend beyond class time."}, {"summer": "True", "name": "Pollution Prevention", "prerequisites": "Prerequisite: ES 100", "spring": "True", "number": "203", "fall": "True", "units": " 1", "description": "This course studies the prevention of the pollution of air, water, and terrestrial ecosystems.  State of the art technological solutions are discussed.  The social, economic, legal and ethical dimensions of pollution prevention are integrated into the scientific and technological challenges facing developed and developing economies."}, {"summer": false, "name": "Introduction to Spatial Technologies", "spring": true, "number": "252", "fall": false, "units": " 3", "description": "Introduction to types of spatial information technologies and their uses in environmental assessments.  Topics include: map reading, geographic positioning systems, geographic information systems, and remote sensing.  This course will provide a basic overview of these technologies through lectures, and will afford an exposure to their uses through a series of structured laboratory exercises."}, {"summer": false, "name": "Renewable Energy Adoption: Barriers and Incentives", "prerequisites": "Prerequisite: ET 120", "spring": true, "number": "262", "fall": false, "units": " 3", "description": "The understanding of the economic, social, and legal barriers and incentives to renewable energy adoption is an important facet to helping renewable energies reach their potential. This course explores mechanisms that can be used and that have been used successfully in the US and in other parts of the world to remove those barriers and to promote greater use of renewable resources, particularly in rural areas and on agricultural and forested lands."}, {"summer": false, "name": "Environmental Technology Laboratory III", "spring": false, "number": "301", "fall": true, "units": " 1", "description": "Assessment of and response to environmental hazards caused by hazardous materials releases. Regulatory requirements associated with hazardous materials releases. Utilization of chemical protective clothing and respiratory protection. Students passing the class receive Occupational Safety and Health Administration (OSHA) 40-hour Hazardous Waste Operations and Emergency Response (HAZWOPER) certification. Required field trips may extend beyond lab time."}, {"summer": false, "name": "Environmental Technology Laboratory IV", "spring": true, "number": "302", "fall": false, "units": " 1", "description": "Use of field and laboratory instrumentation for monitoring outdoor and indoor air quality.  Management, analysis, interpretation, and oral and written reporting of complex environmental data sets.  Hands-on, real-world experience in air quality monitoring and maintenance.  Required field trips may extend beyond class time."}, {"summer": false, "name": "Laboratory Safety Systems and Management", "spring": false, "number": "303", "fall": true, "units": " 1", "description": "Theory and practice of regulation, management, and auditing of laboratory safety. Laboratory field trips may extend beyond class time."}, {"summer": false, "name": "Environmental Monitoring and Analysis", "prerequisites": "Prerequisites:CH 101 or 100; BIO 181; ET students only", "spring": true, "number": "310", "fall": false, "units": " 3", "description": "Monitoring and analysis of chemical, biological, and radiation impacts to the environment.  Theory of chemical, physical, biological, and ecological monitoring.  Planning and conducting environmental sampling and monitoring programs.  Management, analysis, and quality assurance and control.  Risk assessment in environmental technology.  Laboratory practice and safety."}, {"summer": false, "name": "Fundamentals of Air Pollution", "prerequisites": "Prerequisite: (MA 121, MA 131, or MA 141) and (PY 131 or PY 201 or PY 205 or PY 211)", "spring": true, "number": "320", "fall": false, "units": " 3", "description": "Air pollution sources, and the influence of natural and anthropogenic processes on the atmosphere.  Roles of local, state and federal governments in air pollution control and importance of the Clean Air Act and it amendments."}, {"summer": true, "name": "Environmental Technology Practicum", "spring": false, "number": "330", "fall": false, "units": " 3", "description": "Preparation for practicum, including resume writing, interviewing skills, cover letters, and practicum search techniques and resources.  Professional practice as an environmental technologist.  Written and oral communications of the practicum experience."}, {"summer": false, "name": "Environmental Technology Laboratory V", "spring": false, "number": "401", "fall": true, "units": " 1", "description": "Scientific and legal definitions of brownfield and EPA Superfund sites.  Physical, chemical, and biological methods for remediating contaminated sites.  Impacts of hazardous waste management on public and private sector organizations.  Field trips to public and private brownfield and Superfund remediation sites to examine real-world applications of principles.  Required field trips may extend beyond class time."}, {"summer": false, "name": "Solar Photovoltaic Energy", "spring": false, "number": "402", "fall": true, "units": " 1", "description": "This course is a study and practical guide to solar photovoltaics including the economic and environmental benefits, how solar electricity works and can be used and the basics on installation of solar electric systems. Guest Lectures and field trips are part of the course. Field trip may exceed normal classroom hours."}, {"summer": false, "name": "Toxic Substances and Society", "prerequisites": "Prerequisite: Junior standing.", "spring": true, "number": "410", "fall": false, "units": " 3", "description": "Interdisciplinary evaluation of past, present and future effects of toxic substances in the environment.  Addresses various dimensions of toxic substances; special emphasis on ways to minimize adverse effects in contemporary and future societies."}, {"summer": false, "name": "Adaptive Management and Governance", "prerequisites": "Junior standing or above", "spring": false, "number": "455", "fall": true, "units": " 3", "description": "Some environmental and natural resource problems are more difficult to resolve than others. The purpose of this course is to understand the factors that condition intractable or \"wicked\" environmental and natural resources conflicts. These factors include narrow conceptions of science, rigid bureaucratic structures and narrow policy targets. We also explore some of the alternatives for addressing intractable environmental and natural resource problems- including adaptive management and governance."}, {"summer": "True", "name": "Practice of Environmental Technology", "prerequisites": "Prerequisite: ET 310 or SSC 442; and ET Senior Only", "spring": "True", "number": "460", "fall": "True", "units": " 3", "description": "Preparation and presentation of comprehensive environmental assessments and analyses.  Critical roles of quality control and assurance.  The ISO 14000 environmental management standard of the American National Standards Institute (ANSI).  Preparation for certification as an environmental auditor by ANSI and registration as an Environmental Professional by the National Register of Environmental Professionals.  Optional training and exams for Environmental Auditors Registration Association and American National Standards Institute/Register Accreditation Board Written Examination available."}, {"summer": false, "name": "Environmental Forensics", "prerequisites": "Prerequisite: ET 310 or SSC 442", "spring": false, "number": "470", "fall": true, "units": " 3", "description": "Use of site assessment methodologies and state of the art technologies from analytical chemistry, molecular biology, biogeochemistry, and GIS to solve environmental cases of \"Who done it?\" with regards to soil/sediment, water, and air contamination.Two field trips which may extend beyond class time are required."}, {"summer": false, "name": "Senior Seminar in Environmental Technology", "prerequisites": "Prerequisite: ET Senior Only", "spring": true, "number": "490", "fall": false, "units": " 1", "description": "Weekly departmental and university seminars and group discussions to enrich and broaden student perspectives on the practice and development of environmental technology.  Oral and written reporting of seminars topics."}]