[{"summer": "True", "name": "Art and Society in France", "spring": "True", "number": "216", "fall": "True", "units": " Performing Arts, Global Knowledge", "description": "An overview of the visual arts in France, defined broadly, and their relationship to French society and culture: painting, architecture, photography, cinema, book production, gardens, fashion, food, television, popular culture, and mass media, including the Internet.  The principal themes of the course are how France's cultural heritage is embodied in its rich tradition of visual expression and how artists' visual expressions have either served to represent, glorify, or critique the nation."}, {"summer": false, "name": "Studies in Great Works of Non-Western Literature", "spring": false, "number": "219", "fall": false, "units": " 3", "description": "Readings, in English translation, or non-Western literary masterpieces from the beginnings of literacy in the Middle East, Asia, and Africa to the modern period, including excerpts from texts such as the Upanishads, the Ramayana, the Sundiata, Gilgamesh, A Thousand and One Nights, and the Quran and such authors as Confucius, Oe Kenzaburo, Omar Khayyam, Rumi, and Amos Oz."}, {"summer": true, "name": "Studies in Great Works of Western Literature", "spring": true, "number": "220", "fall": true, "units": " 3", "description": "Readings, in English translation, of Western literary masterpieces, from the beginnings of literacy in the Middle East and Europe towards the present, including such authors as Homer, Sophocles, Virgil, Ovid, Augustine, Danta, Machiavelli, Shakespeare, Cervantes, Moliere, Voltaire, Goethe, Austen, Flaubert, Dickinson, Tolstoy, Kafka, and Woolf.Credit will not be given for both ENG/FL 220 and either ENG/FL 221 or ENG/FL 222."}, {"summer": false, "name": "Literature of the Western World I", "spring": false, "number": "221", "fall": true, "units": " 3", "description": "Readings from English translations of Biblical, Classical, Medieval, and Early Renaissance literature, including works by such authors as Homer, Plato, Virgil, Ovid, St. Paul, St. Augustine, Marie de France, and Dante."}, {"summer": false, "name": "Literature of the Western World II", "spring": true, "number": "222", "fall": false, "units": " 3", "description": "Readings from English translations of Renaissance, Neo-Classical, Romantic, and Early Modern literature, emphasizing the cultures of continental Europe from the Renaissance to 1900, and including such authors as Petrarch, Erasmus, Rabelais, Machiavelli, Shakespeare, Moliere, Voltaire, Rousseau, Goethe, Flaubert, Tolstoy."}, {"summer": false, "name": "Contemporary World Literature I", "prerequisites": "Prerequisite: ENG 112", "spring": false, "number": "223", "fall": true, "units": " 3", "description": "Twentieth-century literature of some of the following cultures:  Russian, Eastern European, Western European, Latin American, Canadian, Australian."}, {"summer": false, "name": "Contemporary World Literature II", "prerequisites": "Prerequisite: ENG 112", "spring": true, "number": "224", "fall": false, "units": " 3", "description": "Twentieth-century literature of some of the following cultures:  Asian, Arabian, African, Caribbean, Native-American."}, {"summer": false, "name": "Literature of the Holocaust", "spring": true, "number": "246", "fall": false, "units": " 3", "description": "Fictional and nonfictional versions of the Holocaust, focusing on themes of survival, justice, theology, and the limits of human endurance."}, {"summer": true, "name": "Special Topics in Foreign Languages and/or Literatures", "spring": true, "number": "295", "fall": true, "units": " 1-3", "description": "A special projects course on topics to be determined as needed in the departmental program."}, {"summer": true, "name": "Independent Study in Foreign Language or Literature", "spring": true, "number": "298", "fall": true, "units": " 1-6", "description": "Individualized study in a foreign language or literature. Topic, mode of study and credit hours to be determined in consultation with the faculty member supervising work."}, {"summer": false, "name": "Major World Author", "spring": true, "number": "392", "fall": true, "units": " 3", "description": "Intensive study in English, of the writings of one (or two) author(s) from outside the English and American traditions.  Sample subjects: Homer, Virgil and Ovid, Lady Murasaki, Marie de France and Christine de Pizan, Dante, Cervantes, Goethe, Balzacand Flaubert, Kafka, Proust, Lessing and Gordimer, Borges and Marquez, Neruda, Achebe, Soyinka, Calvino, Walcott and Naipaul.  Topics will vary from semester to semester.May be repeated for credit with new topic."}, {"summer": false, "name": "Studies in Literary Genre", "spring": true, "number": "393", "fall": true, "units": " 3", "description": "Concentrated treatment of one literary genre, such as the epic, the lyric, the drama, satire, romance, autobiography, the essay, the novel, or the short story.  Treatment of materials from several national or ethnic cultures and several periods.  All readings in English.  Course may be taken three times for credit.Course may be taken 3 times in different genres."}, {"summer": false, "name": "Studies in World Literature", "prerequisites": "Prerequisite: ENG 111 and 112 or 113", "spring": true, "number": "394", "fall": true, "units": " 3", "description": "Study of a subject in world literature: for example, African literature, Asian literature, Hispanic literature, East European literature, Comedy, the Epic, the Lyric, Autobiography, the Faust legend, or Metamorphosis.  Subjects vary according to availability of faculty.  Readings in English translation."}, {"summer": "True", "name": "Study Abroad Programs", "spring": "True", "number": "395", "fall": "True", "units": " 1-3", "description": "Specific category of courses involving language and/or culture taught in foreign countries through the Department Study Abroad Program."}, {"summer": false, "name": "Modernism", "spring": false, "number": "406", "fall": true, "units": " 3", "description": "International Modernist movement in literature, from its nineteenth-century origins to its culmination in the early twentieth century.  Definitions of modernity, as embodied in a variety of genres.  Placement of Modernist texts within a variety of cultures that produced them."}, {"summer": false, "name": "Postmodernism", "spring": true, "number": "407", "fall": false, "units": " 3", "description": "Literary expressions of Postmodernism, from its origins in the Modernist movement through its culmination in the later decades of the twentieth century.  Definitions of post modernity, as embodied in a variety of genres.  Placement of Postmodernist texts within a variety of cultures that have produced them."}, {"summer": false, "name": "Linguistics for ESL Professionals", "prerequisites": "Prerequisite: Admission to ESL teacher licensure candidacy, Corequisite: NC teacher licensure in any area", "spring": false, "number": "424", "fall": true, "units": " 3", "description": "Study of the diachronic nature of language and the phonological, morphological, syntactic, and semantic features of English in relation to other world language groups.  Application of linguistic principles to the ESL classroom.  Analysis of English speech and writing patterns of non-native speakers.  Examination of the ways children, adolescents, and adults learn a second language."}, {"summer": false, "name": "Methods and Materials in Teaching English as a Second Language", "prerequisites": "Prerequisite: Admission to Teacher Education Candidacy or admission to ESL Licensure Program", "spring": true, "number": "425", "fall": false, "units": " 3", "description": "Methodologies and current approaches to teaching English as a Second Language.  Techniques and strategies for teaching reading, writing, listening, speaking and culture.  Selection, adaptation, and creation of instructional materials for various levels of proficiency and teaching situations. Evaluation and assessment of written and oral language proficiency through standardized and non-standardized assessment tools."}, {"summer": false, "name": "Perspectives on English as a New Language", "prerequisites": "Prerequisite: Admission to ESL Teacher Licensure, Corequisite: NC teaching license in any area", "spring": false, "number": "439", "fall": true, "units": " 3", "description": "Examination of the complexity of multiculturalism in American society and the challenges faced by immigrant families in adapting to U.S. institutions.  Emphasis on understanding historical, legal, cultural and pedagogical issues with respect to learning English as a new language (ENL)."}, {"summer": true, "name": "Internship in Teaching English as a Second Language", "prerequisites": "Prerequisite: Admission to ESL Licensure Program, Corequisite: Teacher Licensure in any primary area", "spring": false, "number": "440", "fall": false, "units": " 3", "description": "Skills and techniques required in teaching ESL in a public school setting.  15 hours of classroom observation and 30 hours in direct instruction.  Demonstration of competencies essential for teaching ESL."}, {"summer": "True", "name": "Special Topics in Foreign Languages and Literatures", "spring": "True", "number": "495", "fall": "True", "units": " 3", "description": "A concentrated study of a special period, author or genre to be determined as needed in the departmental program."}, {"summer": false, "name": "Senior Seminar in World Literature", "prerequisites": "Prerequisite: Junior standing or Senior standing", "spring": true, "number": "497", "fall": false, "units": " 3", "description": "Rotating topics in world literature, including treatment of materials from more than one culture and including consideration of the subject's theoretical or methodological framework.  Readings in English (original languages encouraged but not required)."}, {"summer": true, "name": "Independent Study in Foreign Language or Literature", "spring": true, "number": "498", "fall": true, "units": " 1-6", "description": "Individualized study of a foreign language or literature. Topic, mode of study, and credit hours to be determined in consultation with the faculty member supervising work."}, {"summer": true, "name": " Practice", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "505", "fall": true, "units": " 3", "description": "An exploration of theory and practice issues related to foreign language teaching.  Inquiry into proficiency-oriented instruction, innovative methodological approaches, the National Standards and learning scenarios, integrating culture, options for testing and assessment, content-based instruction, the role of grammar in second language acquisition, teaching foreign language students with learning disabilities, and Foreign Language in the Elementary School (FLES) in North Carolina.  Students will examine case studies related to these topics and engage in a classroom action research project."}, {"summer": true, "name": "Instructional Technology in Foreign Language Education: Addressing the National", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "506", "fall": false, "units": " 3", "description": "Hands-on experience in appropriately selecting and applying a number of instructional technologies to foreign language teaching and learning in relation to the current National Standards.  Analysis and use of effective technology tools including hardware, software, and courseware. Emphasis will be on the application of Technology-Enhanced Language Learning (TELL) as it integrates the National Standards' goals of Communication, Cultures, Connections, Comparisons, and Communities."}, {"summer": false, "name": "College Teaching of Foreign Languages", "prerequisites": "Prerequisite: Graduate status", "spring": false, "number": "507", "fall": true, "units": " 3", "description": "Principles of second language acquisition and foreign language pedagogy.  Examination of problematic concepts in teaching Spanish and French.  Thorough treatment of instructional technology appropriate to foreign language teaching and learning.  Regular observation of practicing instructors and micro-teaching in college-level Spanish or French classes.  Credit not given for both FL 507 and either FL/ECI 505 or FL/ECI 506.  Course taught in English.  Required for new FLL Teaching Assistants."}, {"summer": false, "name": "Seminar In World Literature", "spring": true, "number": "539", "fall": false, "units": " 3", "description": "Rotating topics in world literature, including treatment of the subject's theoretical or methodological framework. Possible subjects:  colonialism and literature; orality and literature; the Renaissance; the Enlightenment; translation; comparison ofNorth and South American literatures; African literary traditions; post-modernism and gender. Readings in English (original languages encouraged but not required)."}, {"summer": false, "name": "History Of Literary Criticism", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": false, "number": "540", "fall": true, "units": " 3", "description": "Survey of the history of literary criticism from Antiquity to early Modern period. Introduction to major theoretical definitions of literature and modes of practical criticism. Close study of Aristotle's Poetics, Sidney's Apology for Poetry, Pope's Essay on Criticism, Coleridge's Biographia Literaria, Eliot's essays and other landmark works in development of literary criticism."}, {"summer": false, "name": "Literary and Cultural Theory", "spring": false, "number": "541", "fall": true, "units": " 3", "description": "A survey of literary theory in the 20th century from New Criticism to postmodernism. Examines the virtues and pitfalls of these approaches to the study of culture and literature. A course on issues, concepts, theorists and the sociohistorical and political context in which the theorists are writing. Taught in English.  No formal pre-requisites. However, students who have not had advanced literature will be disadvantaged."}]