[{"summer": false, "name": "Beginning Arabic 101", "spring": false, "number": "101", "fall": true, "units": " 3", "description": "Beginning Arabic is for students who have had no prior experience with the language.  It is the first in a series of courses which develop reading and writing skills in Modern Standard Arabic with active speaking and listening skills in both formal Arabic and the Egyptian dialect.  Authentic materials from the Arabic media will be used in addition to text-related video and audio materials.  An introduction to Arab culture will be integrated throughout the semester.This course is designed for true beginners who have had no previous experience with the Arabic language, either written or spoken.  Credit will be allowed for either FLA 101 or FLA 111, but nor for both."}, {"summer": false, "name": "Beginning Arabic 102", "prerequisites": "Prerequisite: FLA 101 or 111", "spring": true, "number": "102", "fall": false, "units": " 3", "description": "This course is the second in a series which develops reading and writing skills in Modern Standard Arabic with active speaking and listening skills in both formal Arabic and the Egyptian dialect. Authentic materials from the Arabic media will be used in addition to text-related video and audio materials.  An introduction to Arab culture will be integrated throughout the semester.Credit will be allowed for either FLA 102 or FLA 112, but not for both."}, {"summer": true, "name": "Beginning Arabic 101 Conversation", "prerequisites": "Corequisite: FLA 101", "spring": false, "number": "103", "fall": true, "units": " 1", "description": "Supplements conversational practice for FLA 101 to help students develop oral proficiency at the beginning level.  Students will practice using their speaking skills in a variety of individual and group activities to build competency in basic social situations"}, {"summer": true, "name": "Beginning Arabic 102 Conversation", "prerequisites": "Prerequisite:FLA 103; Corequisite: FLA 102", "spring": true, "number": "104", "fall": false, "units": " 1", "description": "Supplements conversational practice for FLA 102 to help students develop oral proficiency at the advanced beginning level.  Students will practice using their speaking skills in a variety of individual and group activities to build competency in basic social situations."}, {"summer": false, "name": "Intermediate Arabic I", "prerequisites": "Prerequisite: FLA 102 or FLA 112", "spring": false, "number": "201", "fall": true, "units": " 3", "description": "Intermediate Arabic I is the third in a series of courses which develop reading and writing skills in Modern Standard Arabic with active speaking and listening skills in both formal Arabic and the Egyptian dialect. An increased emphasis is placed onthe acquisition of vocabulary and grammatical tools necessary to undertake more in-depth readings and discussions of news articles from the Arab media. Authentic materials from the Arab media will be used in addition to text-related video and audio materials."}, {"summer": "True", "name": "Intermediate Arabic II", "prerequisites": "Prerequisite: FLA 201", "spring": "True", "number": "202", "fall": "True", "units": " 3", "description": "Intermediate Arabic II is the fourth in a series of courses which develop reading and writing skills in Modern Standard Arabic with active speaking and listening skills in both formal Arabic and the Egyptian dialect. A continued emphasis is placed on the acquisition of vocabulary and grammatical tools necessary to undertake more in-depth readings and discussions of news articles from the Arab media. Authentic materials from the Arab media will be used in addition to text-related video and audiomaterials."}, {"summer": false, "name": "Advanced Intermediate Arabic I", "spring": false, "number": "301", "fall": true, "units": " 3", "description": "Advanced Intermediate Arabic I is the fifth in a series of courses which develop whole language skills in Modern Standard Arabic with active speaking and listening skills in the Egyptian dialect.  Upon completion of this course the student will havethe tools necessary to understand and produce all the basic structures of Modern Standard Arabic.   Arabic film and media will be used in class. The student will also be introduced to selected short stories from modern Arabic literature."}, {"summer": true, "name": "Media Arabic", "prerequisites": "Prerequisite:FLA 202", "spring": false, "number": "330", "fall": true, "units": " 3", "description": "An introduction to the language of print and Internet news media of the Arab world, using authentic materials from Arabic newspapers, Internet news sites, and magazines.  This course provides students with the tools necessary to build a core media vocabulary base, comprehend front page news stories, read critically, and detect bias, in selected news content, and develop listening skills necessary for understanding oral news reports."}]