[{"summer": "True", "name": "Introduction to Academic Writing", "spring": "True", "number": "100", "fall": "True", "units": " 4", "description": "For non-native speakers of English.  Intensive introduction to critical writing and reading in academic contexts.  Exploration of writing processes and academic literacy skills: interpreting assignments; comprehending, analyzing, and evaluating college-level texts; inventing, drafting, and revising; seeking, providing, and responding to constructive feedback; collaborating effectively under varied learning models.  Extensive writing practice and individualized coaching.  Attention to grammar and conventions of standard written English.  Intended as preparation for FLE 101.Only for non-native speakers of English. Requires C- or better.  Credit for FLE 100 is not allowed if student has prior credit for FLE 101"}, {"summer": "True", "name": "Academic Writing and Research", "prerequisites": "Prerequisite: Grade of C- or better in FLE 100 or placement via ESL testing guidelines.", "spring": "True", "number": "101", "fall": "True", "units": " 4", "description": "For non-native speakers of English intensive instruction in academic writing and research.  Basic principles of rhetoric and strategies for academic inquiry and argument.  Instruction and practice in critical reading, including the generative and responsible use of print and electronic sources for academic research, adapted for non-native speakers.  Exploration of literate practices across a range of academic domains, laying the foundation for further writing development in college.  Continued attention to grammar and conventions of standard written English.  Satisfies freshman English requirements. Successful completion of  FLE 101 requires a C- or better. Credit for FLE 101 is not allowed if the student has already fulfilled the first-year writing requirement."}, {"summer": "True", "name": "Oral Communication in English for International Students", "spring": "True", "number": "201", "fall": "True", "units": " 3", "description": "Oral communication in English; active and interactive speaking skills, listening comprehension and reading.  Specific tasks in spoken English such as communicating information, making inquiries, requests and complaints.  Individual and group work inthe form of oral reports, role play, presentations, etc.  Listening to lectures and note taking skills."}, {"summer": "True", "name": "American English Pronunciation for International Students", "spring": "True", "number": "400", "fall": "True", "units": " 3", "description": "Intensive pronunciation practice for non-native speakers of English.  Emphasis on improved intelligibility through practice on English rhythm, stress and intonation.  Individual and class work on vowel and consonant difficulties."}, {"summer": "True", "name": "Advanced Oral Communication in English for International Students", "spring": "True", "number": "401", "fall": "True", "units": " 3", "description": "Oral communication in English; pronunciation skills, reading, aural comprehension and oral skills; communication strategies and cross-cultural communication; individual and group activities such as presenting information, teaching a class, fielding questions and leading a discussion."}, {"summer": "True", "name": "Advanced Written Communication in English for International Students", "spring": "True", "number": "402", "fall": "True", "units": " 3", "description": "Written communication skills for graduate students; integrated writing tasks focusing on writing, reading, grammar and comprehension, specifically geared to the needs of research students and teaching assistants.  Reading, critical analysis and synthesis of written material such as journal articles, research reports, etc."}]