[{"summer": "True", "name": "Elementary French I", "spring": "True", "number": "101", "fall": "True", "units": " 3", "description": "First in a four-course sequence to develop language skills. Oral and written practice in classroom and language laboratory. Readings in French culture and civilization."}, {"summer": "True", "name": "Elementary French II", "prerequisites": "Prerequisite: FLF 101", "spring": "True", "number": "102", "fall": "True", "units": " 3", "description": "Continuation of FLF 101 with intensive practice in spoken French. Readings in French culture and civilization."}, {"summer": "True", "name": "Accelerated Elementary French", "prerequisites": "Prerequisite: Placement into this course determined by The Department of Foreign Languages and Literatures Placement Test: http://sasw.chass.ncsu.edu/fl/place.htm", "spring": "True", "number": "110", "fall": "True", "units": " 3", "description": "Content of FLF 101 and 102, at an accelerated pace, for students with previous study of French (1-2 years in high school) who placed into the course based on results of the NC State French Placement Test.  Includes a refresher of 101 material beforecovering 102 material.  Development of skills in listening, speaking, reading, writing and understanding Francophone cultures.  Significant amount of work outside of class.  Fulfills the FL 102 requirement."}, {"summer": "True", "name": "Intermediate French I", "prerequisites": "Prerequisite: FLF 102 or FLF 110", "spring": "True", "number": "201", "fall": "True", "units": " 3", "description": "Third of four consecutive courses to develop skills of speaking, listening, reading and writing. Readings and discussions of French culture, civilization and literature."}, {"summer": "True", "name": "Intermediate French II", "prerequisites": "Prerequisite: FLF 201", "spring": "True", "number": "202", "fall": "True", "units": " 3", "description": "Last of four sequential language courses. Increased emphasis on reading and writing. Readings in the literature, culture, and civilization of France and the Francophone world."}, {"summer": "True", "name": "French: Language, Culture, and Technology", "prerequisites": "Prerequisite: FLF 102 and FLF 110", "spring": "True", "number": "212", "fall": "True", "units": " 3", "description": "A study of the language structures and vocabulary necessary for an intermediate level of communication in French together with cultural and technological issues of our global society, in the context of the French-speaking world and the European Union. Students are responsible for providing their own transportation for required field trip. Fulfills the FLF 201 requirement."}, {"summer": "True", "name": "Survey of French Literature from the Middle Ages through the Enlightenment", "prerequisites": "Prerequisite: An advanced language skills course (FLF 308, 310, 315) or FLF 202 with permission of instructor", "spring": "True", "number": "301", "fall": "True", "units": " 3", "description": "Reading and discussion of representative works with attention to literary analysis as well as to historical and cultural background."}, {"summer": "True", "name": "Survey of French Literature from Romanticism to the Contemporary Period", "prerequisites": "Prerequisite: An advanced language skills course (FLF 308, 310, 315) or FLF 202 with Consent of Instructor", "spring": "True", "number": "302", "fall": "True", "units": " 3", "description": "Reading and discussion of representative works with attention to literary analysis as well as to historical and cultural background."}, {"summer": "True", "name": "French Business Communication", "prerequisites": "Prerequisite: FLF 202", "spring": "True", "number": "306", "fall": "True", "units": " 3", "description": "Study of major forms of written and oral business communication used in the French-speaking world.  Extensive work with current, culturally authentic materials.  Emphasis on development of practical communicative skills, with special attention to cross-cultural comparisons of French and American business practices and modes of communication."}, {"summer": "True", "name": "Business French", "prerequisites": "Prerequisite: FLF 202", "spring": "True", "number": "307", "fall": "True", "units": " 3", "description": "Business French vocabulary and concepts with emphasis on cultural differences and their importance in the new global village business world."}, {"summer": "True", "name": "Advanced Conversation: Contemporary French Cultures", "prerequisites": "Prerequisite: FLF 202", "spring": "True", "number": "308", "fall": "True", "units": " 3", "description": "Conversation and reading emphasizing idiomatic and practical usage with attention to contemporary civilization and cultures of the French speaking world.  Emphasis on social structures, political features, events, world views and modes of communication."}, {"summer": "True", "name": "French Phonetics and Pronunciation", "prerequisites": "Prerequisite: FLF 202", "spring": "True", "number": "309", "fall": "True", "units": " 3", "description": "A study of the oral production of standard French with the aim of improving pronunciation, fluency and skill in communication. Extensive oral practice through conversation and phonetics."}, {"summer": "True", "name": "Advanced Written Communication", "prerequisites": "Prerequisite: FLF 202", "spring": "True", "number": "310", "fall": "True", "units": " 3", "description": "An in-depth study of French written communication at the advanced level, including the more advanced aspects of the French grammar with extensive writing practice serving a variety of practical communicative needs."}, {"summer": "True", "name": "French Civilization and Culture", "prerequisites": "Prerequisite: FLF 202", "spring": "True", "number": "315", "fall": "True", "units": " 3", "description": "French civilization and culture from its origins to the modern period.  Reading and discussion of the social, cultural, economic and political structures of France, including its geography, history, music, art and national consciousness."}, {"summer": "True", "name": "The Heritage of French Cinema", "prerequisites": "Prerequisite: 3 hrs. in French at 300 level", "spring": "True", "number": "318", "fall": "True", "units": " Performing Arts, Global Knowledge", "description": "Survey of the major contributions of French cinema from its origins to the present.  Attention to film as an artistic medium and to the cinematic representation of French history and culture.  Reading, discussion, and viewing of films including Un Chien Andalou, La Passion de Jeanne d'Arc, Le Retour de Martin Guerre, La Marseillaise, Les 400 Coups, and Diva."}, {"summer": "True", "name": "French Cultures and contexts", "prerequisites": "Prerequisite: FLF 202", "spring": "True", "number": "321", "fall": "True", "units": " 3", "description": "An approach to important periods in the history of French culture through the reading of texts by several important writers.  Films, slides, painting, music, and the Internet will be included to put the readings in a cultural context."}, {"summer": "True", "name": "Independent Study in French", "spring": "True", "number": "398", "fall": "True", "units": " 1-3", "description": "Individualized study in French language, culture, or literature. Topic, mode of study, and credit hours to be determined in consultation with faculty member supervising work. Course may be taken a maximum  of two times provided the topic is sufficiently different."}, {"summer": "True", "name": "French For Graduate Students", "spring": "True", "number": "401", "fall": "True", "units": " 3", "description": "Basic French grammar, with special attention to characteristics of formal expository style, and illustrative readings. Study of extracts from scholarly publications in students' areas of research. Prepares students to take the graduate foreign language certification exam."}, {"summer": "True", "name": "Approaches to French Translation", "prerequisites": "Prerequisite: at least two French (FLF) 300 level courses", "spring": "True", "number": "411", "fall": "True", "units": " 3", "description": "Intensive practice of translating to and from French a variety of texts selected from the areas of business, law, technology and science, as well as literature and the arts. Focus on Documentation, Research and Translation techniques and ethics."}, {"summer": "True", "name": "Studies in French Prose", "prerequisites": "Prerequisite: 3 hrs in French at 300 level with 3 hrs in literature", "spring": "True", "number": "414", "fall": "True", "units": " 3", "description": "Major developments in the French essay, letter, novel and other prose forms from the Renaissance to 1900.  Readings from such authors as Montaigne, Sevigne, Lafayette, Rousseau, Sand, Balzac, Stendhal, Flaubert."}, {"summer": "True", "name": "Literature, Cinema and Culture of the Francophone World", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "425", "fall": "True", "units": " 3", "description": "A study of a number of literary texts and films from across the spectrum of the Francophone world - West Africa, the Maghreb, and the Caribbean.  Through these texts and films we will study the diversity of the French colonial empire as well as the different historical, political and cultural effects of colonialism and postcolonialism.  Films, videos, internet sites will be used.Course taught in French."}, {"summer": "True", "name": "Seminar in French Studies", "prerequisites": "Prerequisite: Junior standing and 6 hrs in French literature", "spring": "True", "number": "492", "fall": "True", "units": " 3", "description": "A small-group study of a topic in literature resulting in either a substantial essay or series of essays by each student. Topics vary each semester."}, {"summer": "True", "name": "Variety in Language: French", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "502", "fall": "True", "units": " 3", "description": "Structure and evolution of the French language.  A study of language variety in the French-speaking world.  Attention to the historical evolution of the language through time, and an analysis of the phonological, morphological and syntactic featuresof modern French.  Use of the World Wide Web will enable students to access material from many parts of the Globe.Course taught in French."}, {"summer": "True", "name": "Issues in the Acquisition of L1 and L2 French", "spring": "True", "number": "503", "fall": "True", "units": " 3", "description": "Explores French first language (L1) and second language (L2) acquisition while addressing the theoretical and practical issues.  Topics include: learner language, developmental sequences, cognitive processes, learner strategies, learner internal andexternal factors, and implications of acquisition research for pedagogical practice.  Relevant to current and prospective teachers of L2 French."}, {"summer": "True", "name": "Approaches to French Translation", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "511", "fall": "True", "units": " 3", "description": " 511."}, {"summer": "True", "name": "Art and Society in France", "spring": "True", "number": "516", "fall": "True", "units": " 3", "description": "An overview of the visual arts in France, defined broadly, and their relationship to French society and culture: painting, architecture, photography, cinema, book production, gardens, fashion, cuisine, television, popular culture, and mass media will be studied.Course taught in French."}, {"summer": "True", "name": "French Cultures and Contexts", "prerequisites": "Prerequisite: Graduate status required for FLF 521", "spring": "True", "number": "521", "fall": "True", "units": " 3", "description": "Study of important periods in the history of French culture through the reading of key literary texts.  Films, slides, painting, music, and the Internet will be included to put the readings in a cultural context.  Topics vary.  Students cannot get credit for both 421/521."}, {"summer": "True", "name": "Literature, Cinema and Culture of the Francophone World", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "525", "fall": "True", "units": " 3", "description": "A study of a number of literary texts and films from across the spectrum of the Francophone world - West Africa, the Maghreb, and the Caribbean.  Through these texts and films we will study the diversity of the French colonial empire as well as the different historical, political and cultural effects of colonialism and postcolonialism.  Films, videos, internet sites will be used.Course taught in French."}, {"summer": "True", "name": "Seminar in French Studies", "prerequisites": "Prerequisite: At least one 400-level French class; Graduate standing", "spring": "True", "number": "592", "fall": "True", "units": " 3", "description": "Seminar on literary, linguistic, or cultural topic in French studies. Research paper and oral presentation required. Conducted entirely in French. Rotating topics.Credit not allowed for both 492 and 592."}, {"summer": "True", "name": "Special Topics in French", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "595", "fall": "True", "units": " 3", "description": "In depth exploration of specialized topics in French literature, culture or language. Also used to test and develop new courses.Course taught in French"}, {"summer": "True", "name": "Independent Study in French", "spring": "True", "number": "630", "fall": "True", "units": " 1-3", "description": "Individualized study in French language or literature at the graduate level. Topic and mode of study to be determined in consultation with the faculty member supervising work."}, {"summer": "True", "name": "Special Project in French", "prerequisites": "Prerequisite: Student must be in final semester of his or her program.", "spring": "True", "number": "675", "fall": "True", "units": " 3", "description": "Individual project in French language or literature at the graduate level. Topic and mode of study to be determined in consultation with student's project advisory committee within the parameters of specific options."}, {"summer": "True", "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "688", "fall": "True", "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": "True", "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "689", "fall": "True", "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc. Students may register for this course a maximum of one semester."}]