[{"summer": true, "name": "Elementary German I", "spring": true, "number": "101", "fall": true, "units": " 3", "description": "The first in a four-course sequence to develop the language skills of listening, speaking, reading, and writing.  Emphasis on the acquisition of everyday German and cultural awareness.  Active class participation, practice in the language lab and computer lab, and written assignments."}, {"summer": true, "name": "Elementary German II", "prerequisites": "Prerequisite: FLG 101", "spring": true, "number": "102", "fall": true, "units": " 3", "description": "Second in a four-course sequence to develop the language skills of listening, speaking, reading, and writing.  Emphasis on the acquisition of everyday German and cultural awareness.  Active class participation, practice in the language lab and computer lab, and written assignments."}, {"summer": true, "name": "Intermediate German I", "prerequisites": "Prerequisite: FLG 102", "spring": true, "number": "201", "fall": true, "units": " 3", "description": "The third of four consecutive courses in German. Intensive conversational practice to develop proficiency in speaking and listening, advanced reading and writing skills by learning complex grammatical structures and through the use of authentic texts.  Acquisition of cultural knowledge about the German-speaking countries."}, {"summer": false, "name": "Intermediate German II", "prerequisites": "Prerequisite: FLG 201", "spring": true, "number": "202", "fall": true, "units": " 3", "description": "Last of four consecutive courses in German. Continued conversational practice to develop proficiency in speaking and listening.  Development of advanced writing skills by refining grammatical structures and style through assignments, and of advancedreading skills through the use of cultural and literary texts from the German-speaking countries."}, {"summer": false, "name": "German Language, Culture, Science, and Technology", "prerequisites": "Prerequisite: FLG 201", "spring": true, "number": "212", "fall": false, "units": " 3", "description": "Discussion of German, Austrian and Swiss scientific discoveries and technological inventions as well as their impact on global society, such as aspirin, x-rays, printing technology, diesel engine, computer, microchip, television, mp3 format, genetics, and environmental technologies.  Also a fourth semester German course, with intensive practice to develop proficiency in intermediate speaking and listening, reading and writing, using materials from scientific and technological disciplines."}, {"summer": "True", "name": "Advanced German", "prerequisites": "Prerequisite: FLG 202 or a score of 688 on the NC State placement test.", "spring": "True", "number": "301", "fall": "True", "units": " 3", "description": "Review and consolidation of aspects of German grammar and development of writing skills. Listening and speaking practice through group activities and oral reports. Class discussions on topics from the cultures of Germany, Austria, and Switzerland, such as film, history, and the fine arts. FLG 301 and 302 can be taken in random order."}, {"summer": "True", "name": "German Oral and Written Expression", "prerequisites": "Prerequisite: FLG 202 or a score of 688 on the NC State placement test.", "spring": "True", "number": "302", "fall": "True", "units": " 3", "description": "Review and practice of spoken and written German using authentic texts and materials from contemporary Germany (short stories, films, and online media). Review of German grammar through conversation, writing, and vocabulary building exercises. Oral reports by students. FLG 301 and 302 can be taken in random order."}, {"summer": false, "name": "Business German", "prerequisites": "Prerequisite: FLG 202", "spring": false, "number": "307", "fall": true, "units": " 3", "description": "Business German vocabulary and terminology. Readings and discussions on current business topics.  Special consideration to intercultural communication relative to international business operations."}, {"summer": false, "name": "Introduction to German Translation", "prerequisites": "Prerequisite: FLG 202", "spring": false, "number": "311", "fall": true, "units": " 3", "description": "Introduction to theory, methods, and techniques in translation applied to materials of various fields and professions.  Emphasis on written translation."}, {"summer": false, "name": "Germanic Civilization and Culture", "prerequisites": "Prerequisite: FLG 202", "spring": false, "number": "315", "fall": false, "units": " 3", "description": "Culture and civilization of the German-speaking countries. Analysis of the social, economic and political structures of Germany, Austria, and Switzerland. Lectures, reports, conversation. Taught in German."}, {"summer": "True", "name": "New German Cinema", "prerequisites": "Prerequisite: FLG 202", "spring": "True", "number": "318", "fall": "True", "units": " Performing Arts, Global Knowledge", "description": "Survey of the major contributions to the \"New German Cinema\" (1970's to 1990's).  Attention to film as an artistic medium and to the cinematic representation of German history and culture.  Reading, discussion, and viewing of films including films by Schloendorff (Die Blechtrommel), Fassbinder (Die Ehe der Maria Braun), von Trotta (Rosa Luxemburg), Herzog (Stroszek), and Wenders (Der Himmel ueber Berlin)."}, {"summer": false, "name": "Introduction to German Literature", "prerequisites": "Prerequisite: FLG 202", "spring": false, "number": "320", "fall": true, "units": " 3", "description": "An introduction to reading and analyzing German, Austrian, and Swiss literary texts in their cultural and historical contexts.  Discussion of various genres (short story, novel, drama, poetry) formal aspects, literary periods, and a variety of critical approaches.  Lectures and much discussion.  Oral and written assignments, exam."}, {"summer": false, "name": "Twentieth Century German Literature", "prerequisites": "Prerequisite: FLG 202", "spring": false, "number": "323", "fall": false, "units": " 3", "description": "Twentieth century literature from German-speaking countries. Readings of Mann, Kafka, Rilke, Hesse, Durrenmatt, Frisch, Grass, and a variety of poets."}, {"summer": false, "name": "German Lyric Poetry", "prerequisites": "Prerequisite: FLG 202", "spring": true, "number": "325", "fall": false, "units": " 3", "description": "A historical and interpretative study of the German lyric from the fifteenth into the twentieth century with special attention to the poet's choice of theme, the ways in which that theme is treated, and the relevance of the poem to the human experience."}, {"summer": "True", "name": "German Studies Topics", "prerequisites": "Prerequisite: FLG 202", "spring": "True", "number": "390", "fall": "True", "units": " 3", "description": "Presentation of material not available in regular course offerings, or offering of new courses on a trial basis.  Course may be offered through videoconferencing with other UNC campuses as an offering of the German Studies Consortium.  Content determined by faculty member in consultation with the department's German section coordinator.  May be repeated."}, {"summer": true, "name": "Independent Study in German", "prerequisites": "Prerequisite: FLG 202", "spring": true, "number": "398", "fall": true, "units": " 1-6", "description": "Individualized study in German language, culture, or literature.  Topic, mode of study, and credit hours to be determined in consultation with the faculty member supervising work.  Departmental approval required."}, {"summer": false, "name": "German For Graduate Students", "spring": false, "number": "401", "fall": true, "units": " 3", "description": "Basic German grammar, with special attention to characteristics of formal expository style, and illustrative readings. Study of extracts from scholarly publications in students' areas of research. Prepares students to take the graduate foreign language certification exam."}, {"summer": "True", "name": "Business German II", "prerequisites": "Prerequisite: FLG 307", "spring": "True", "number": "407", "fall": "True", "units": " 3", "description": "Second course in the two-course series on Business German.  Topics cover project planning, international marketing, trade fair presentation, financial issues, work place issues, logistics, including all forms of oral and written communication in these areas.  Brief lectures, much discussion, oral presentations, written assignments, exam.  Course can be used as preparation for certification in the internationally recognized \"Zertifikat Deutsch fur den Beruf\" (certificate \"German for Professionals\").  Certification is voluntary, for a fee, and separate from the course."}, {"summer": false, "name": "Current Issues in German-Language Media", "prerequisites": "Prerequisite: Two courses at the FLG 300 level", "spring": false, "number": "420", "fall": true, "units": " 3", "description": "Using the internet and a textbook, the course will be constructed from current topics circulated in the German, Austrian and Swiss media, e.g. newspaper websites, radio programs and TV news in streaming video format. Overview of the different news genres, the German-language media scape, and major political, economic, social and cultural issues in the German-speaking countries. Discussion, oral presentations, written assignments."}, {"summer": false, "name": "Cultural Artifacts in the German-Speaking Countries", "prerequisites": "Prerequisite: One FLG 300-level course and one from this list: FLG 300, 315, 316, 318, 323, 390.", "spring": false, "number": "430", "fall": true, "units": " 3", "description": "Focuse on major cultural achievements in Germany, Austria and Switzerland, including literature, film, art, and music.  Topics will vary.  Examples are: \"Kafka and Modernism\", \"German/Austrian/Swiss Literature and Film-Adaptations\", \"German-LanguageOpera\", \"German Art and Society in the 20th Century\", or \"The Faust Theme in Literature, Art, and Music\"."}, {"summer": false, "name": "Green Germany: Nature and Environment in German Speaking Cultures", "prerequisites": "Prerequisite: 3 Hours of 300-Level German", "spring": true, "number": "440", "fall": false, "units": " 3", "description": "Survey of the long \"Green\" tradition in German-speaking cultures as reflected in the arts, in literature, and in scientific discoveries that have made Germany, Austria, and Switzerland leaders in development of alternative environmental technologies. Discussion in German of issues such as Romantic nature poetry, industrialization, Nazi attitudes towards nature, deforestation, the Green Party, air and water pollution, waste management, energy production, climate change, transportation systems, green architecture, sustainability, and the latest environmental technologies. Practice and assessment through class debates, group work, writing tasks, student presentations, and a portfolio."}, {"summer": false, "name": "Senior Seminar in German Studies", "prerequisites": "Prerequisite: Two 300 level FLG courses on literature or culture or film", "spring": true, "number": "492", "fall": false, "units": " 3", "description": "Capstone seminar in German literature or culture.  Student presentations and either a substantial essay or a series of essays.  Topics vary each semester."}, {"summer": "True", "name": "Internship in Germany, Austria, or German-Speaking Switzerland", "prerequisites": "Prerequisite: Two courses at the FLG 300 level", "spring": "True", "number": "499", "fall": "True", "units": " 1-6", "description": "Professional internship in a company or organization in Germany, Austria, or German-speaking Switzerland, with German as the main language of daily operations.  Contract between the student, department, and company or organization about content, scope, and requirements.  1-6 credits for an approved internship.  Essay describing and evaluating the internship experience in the conext of student's professional development.  Students are responsible for their own travel and living expenses.  Departmental approval required."}]