[{"summer": "True", "name": "Elementary Hindi-Urdu I", "prerequisites": "Corequisite: FLN 103", "spring": "True", "number": "101", "fall": "True", "units": " 3", "description": "Introduction to standard Hindi-Urdu.  Emphasis on speaking and listening, and on reading and writing in the Hindi writing system (Devanagari).  Readings in South Asian culture and civilization. Offered jointly in teleconferencing format with HIND 101 at the University of North Carolina-Chapel Hill"}, {"summer": "True", "name": "Elementary Hindi-Urdu II", "prerequisites": "Prerequisite: FLN 101, Corequisite: FLN 104", "spring": "True", "number": "102", "fall": "True", "units": " 3", "description": "Continuation of FLN 101.  Emphasis on oral communication and reading and writing in the Hindi writing system (Devanagari).  Further readings in South Asian culture and civilization.  Offered jointly in teleconferencing format with HIND 102 at the University of North Carolina-Chapel Hill."}, {"summer": "True", "name": "Elementary Hindi-Urdu I Conversation", "prerequisites": "Corequisite: FLN 101", "spring": "True", "number": "103", "fall": "True", "units": " 1", "description": "Required conversational practice for FLN 101.  Special attention to individual pronunciation and intonation.  Introduction of formal and informal speech.  Use of audiovisual materials."}, {"summer": "True", "name": "Elementary Hindi-Urdu II Conversation", "prerequisites": "Prerequisite: FLN 101, Corequisite: FLN 102", "spring": "True", "number": "104", "fall": "True", "units": " 1", "description": "Required conversational practice for FLN 102.  Extensive use of speaking skills in variety of situations.  Attention to supplemental non-verbal communication.  Use of audiovisual materials."}, {"summer": "True", "name": "Intermediate Hindi-Urdu I", "prerequisites": "Prerequisite: FLN 102, Corequisite: FLN 203", "spring": "True", "number": "201", "fall": "True", "units": " 3", "description": "Continuation of basic language skills.  Introduction of Urdu writing system (Nastaliq) through Hindi writing system (Devanagari).  Introduction to grammatical divergence of Hindi and Urdu.  Readings in South Asian culture and civilization.  Offered jointly in teleconferencing format with HIND 103 at the University of North Carolina-Chapel Hill."}, {"summer": "True", "name": "Intermediate Hindi-Urdu II", "prerequisites": "Prerequisite: FLN 201, Corequisite: FLN 204", "spring": "True", "number": "202", "fall": "True", "units": " 3", "description": "Continuation of FLN 201.  Further practice of both Urdu (Nastiliq) and Hindi (Devanagari) writing systems.  Further distinction of spoken and literary Urdu and Hindi.  Further readings in South Asian culture and civilization.  Offered jointly in teleconferencing format with HIND 103 at the University of North Carolina-Chapel Hill."}, {"summer": "True", "name": "Intermediate Hindi-Urdu I Conversation", "prerequisites": "Prerequisite: FLN 102, Corequisite: FLN 201", "spring": "True", "number": "203", "fall": "True", "units": " 1", "description": "Required conversational practice for FLN 201.  Advancement of speaking skills through role playing, interviews, debates.  Further Hindi and Urdu non-verbal communication.  Use of audiovisual materials, including responses to commercial television and movies."}, {"summer": "True", "name": "Intermediate Hindi-Urdu II Conversation", "prerequisites": "Prerequisite: FLN 201, Corequisite: FLN 202", "spring": "True", "number": "204", "fall": "True", "units": " 1", "description": "Required conversational practice for FLN 202.  Refinement of speaking skills through role playing, interviews, debates.  Further Hindi and Urdu non-verbal communication.  Use of audiovisual materials, including responses to commercial television andmovies."}, {"summer": "True", "name": " Urdu Fiction", "prerequisites": "Prerequisite: FLN 202", "spring": "True", "number": "301", "fall": "True", "units": " 3", "description": "Introduces advanced Hindi-Urdu students to the prose fiction of major Hindi and Urdu literary figures including Munshi Premchand, Saadat Hasa Manto and others. Texts will be provided in both Hindi and Urdu scripts and/or English translation as available."}, {"summer": "True", "name": " Urdu Poetry", "prerequisites": "Prerequisite: FLN 301", "spring": "True", "number": "302", "fall": "True", "units": " 3", "description": "Introduces advanced Hindi-Urdu students to representative works of 19th and 20th century Hindi and Urdu poets and poetic forms. Texts will be provided in both Hindi and Urdu scripts and/or English translation as available."}, {"summer": "True", "name": "Hindi Literature and South Asian Cultural Contexts", "spring": "True", "number": "401", "fall": "True", "units": " 3", "description": "Selected topics in Hindi literature and/or South Asian literature in Hindi, such as drama in modern South Asia, the twentieth-century novel, literature and the nation, narratives of pain and resistance, gender and social reform. Readings and discussion in Hindi, with emphasis on the examination of formal literary characteristics and the interconnections of texts and relevant South Asian cultural contexts. Topics will be rotated so that students can take this course for credit up to three times."}]