[{"summer": false, "name": "Elementary Russian I", "spring": false, "number": "101", "fall": true, "units": " 3", "description": "First in a four-course sequence to develop language skills in Russian. Oral and written practice in the classroom and language laboratory and attention to Russian cultural heritage."}, {"summer": false, "name": "Elementary Russian II", "prerequisites": "Prerequisite: FLR 101", "spring": true, "number": "102", "fall": false, "units": " 3", "description": "Emphasis on acquisition of basic oral skills, with complementary reading and writing exercises and attention to Russian cultural heritage."}, {"summer": false, "name": "Intermediate Russian I", "prerequisites": "Prerequisite: FLR 102", "spring": false, "number": "201", "fall": true, "units": " 3", "description": "Basic Russian language skills continued.  More emphasis given to writing and essential conversational practice.  Intermediate level readings in Russian literature and culture.  Class and laboratory practice; written assignments."}, {"summer": false, "name": "Intermediate Russian II", "prerequisites": "Prerequisite: FLR 201", "spring": true, "number": "202", "fall": false, "units": " 3", "description": "Advanced aspects of Russian syntax through study of text.  Continued attention to conversational practice and vocabulary building."}, {"summer": false, "name": "Russian Literature in Translation: The Nineteenth Century", "spring": true, "number": "303", "fall": false, "units": " 3", "description": "A study of selected plays, short stories and novels of the great Russian writers of the nineteenth century: Pushkin, Lermontov, Gogol, Goncharov, Turgenev, Dostoevsky, Saltykov-Shchedrin, Leskov, Tolstoy and Chekhov. Examinations of peculiarly Russian as well as the universal aspects of this literature. All readings, lectures and discussions in English."}, {"summer": false, "name": "Russian Literature in Translation: The Twentieth Century", "spring": false, "number": "304", "fall": false, "units": " 3", "description": "A study of selected poems, plays, short stories and novels by major Russian writers of the twentieth century, such as Chekhov, Gorky, Blok, Mayakovsky, Esenin, Zamyatin, Olesha, Bulgakov, Babel, Pilnyak, Pasternak, Solzhenitsyn, Evtushenko, and Voznesensky. All readings, lectures and discussions in English."}, {"summer": false, "name": "Russian Cinema and Society", "spring": true, "number": "318", "fall": false, "units": " 3", "description": "Russian culture and society through cinema. A study of selected films representative of major social-political, ideological, and artistic developments. Weekly film screenings. No knowledge of Russian required."}]