[{"summer": "True", "name": "Elementary Spanish I", "spring": "True", "number": "101", "fall": "True", "units": " 3", "description": "For students with little or no background or previous study of Spanish or those who place into course via Spanish placement exam.  Development of communicative abilities within an integrated skill approach (speaking, listening, reading, writing).  Introduction to the cultures of the Spanish-speaking world.  Includes written and oral assignments of language structures and vocabulary.  Conducted entirely in Spanish.  Closed to native speakers of Spanish."}, {"summer": "True", "name": "Elementary Spanish II", "prerequisites": "Prerequisite: FLS 101", "spring": "True", "number": "102", "fall": "True", "units": " 3", "description": "Continuation of FLS 101.  Development of communicative abilities within an integrated skills approach (speaking, listening, reading, writing).  Introduction to the cultures of the Spanish-speaking world.  Includes written and oral assignments of language structures and vocabulary.  Conducted entirely in Spanish.  Closed to native speakers of Spanish."}, {"summer": "True", "name": "Intensive Elementary Spanish", "spring": "True", "number": "105", "fall": "True", "units": " 6", "description": "An intensive course equivalent to FLS 101 plus FLS 102.  Development of communicative abilities within an integrated skills approach (speaking, listening, reading, writing).  Introduction to the cultures of the Spanish-speaking world.  Includes written and oral assignments of language structures and vocabulary.  Conducted entirely in Spanish.  Closed to native speakers of Spanish."}, {"summer": "True", "name": "Accelerated Elementary Spanish", "prerequisites": "Prerequisite: A score of 14-24 on the Spanish placement exam is required for matriculation in this course", "spring": "True", "number": "110", "fall": "True", "units": " 3", "description": "Contents of FLS 101 and FLS 102 at an accelerated pace, for students placed into the course based on results of the Spanish placement test.  Development of communicative abilities within an integrated skills approach (speaking, listening, reading, writing).  Introduction to the cultures of the Spanish-speaking world.  Includes extensive written and oral assignments of language structures and vocabulary.  Conducted entirely in Spanish.  Closed to native speakers of Spanish."}, {"summer": "True", "name": "Intermediate Spanish I", "prerequisites": "Prerequisite: FLS 102,105 or 110", "spring": "True", "number": "201", "fall": "True", "units": " 3", "description": "Continued development of communicative abilities for students with previous study of elementary level Spanish.  Integrated skills approach (speaking, listening, reading, writing).  Students will learn to function in everyday situations, expressing opinions and doubts, and narrating and describing in present, past, and future time, and will explore cultural issues through literary and other types of readings.  Includes written and oral assignments of language structures and vocabulary.  Conducted entirely in Spanish.  Closed to native speakers of Spanish."}, {"summer": "True", "name": "Intermediate Spanish II", "prerequisites": "Prerequisite: FLS 201", "spring": "True", "number": "202", "fall": "True", "units": " 3", "description": "Development of communicative abilities at the intermediate level of the American Council on the Teaching of Foreign Language proficiency scale, with an integrated skills approach (reading, writing, speaking, listening) and additional emphasis on knowledge and competence in the cultures of the Spanish-speaking world.  Includes written and oral assignments of language structures and vocabulary.  Conducted entirely in Spanish.  Closed to native speakers of Spanish."}, {"summer": "True", "name": "Accelerated Intermediate Spanish", "prerequisites": "Prerequisite: A score of 25-30 on the Spanish placement exam is required for matriculation in this course", "spring": "True", "number": "210", "fall": "True", "units": " 3", "description": "Content of FLS 102 and FLS 201 at an accelerated pace, for students placed into the course based on results of the Spanish placement test, or those with significant knowledge/experience with another Romance language.  Substantial amount of work outside of class.  Development of a balanced foundation in listening, speaking, reading, and writing Spanish, and understanding Hispanic cultures."}, {"summer": "True", "name": "Spanish: Language, Technology, Culture", "prerequisites": "Prerequisite: FLS 102, FLS 110, or FLS 105", "spring": "True", "number": "212", "fall": "True", "units": " 3", "description": "A study of the language structures and vocabulary necessary for an intermediate level of communication in Spanish together with cultural and technical issues of our global society in the context of the Spanish-speaking world. Fulfills the FLS 201 requirement."}, {"summer": "True", "name": "Intermediate Special Topics in Spanish", "prerequisites": "Prerequisite: FLS 201", "spring": "True", "number": "295", "fall": "True", "units": " 3", "description": "Special Topics in language and cultures of the Spanish speaking world for students at the intermediate (200) level. Includes courses taught in Spanish study abroad programs. Course may be taken up to three times."}, {"summer": "True", "name": "Spanish Oral and Written Expression I", "prerequisites": "Prerequisite: FLS 202", "spring": "True", "number": "331", "fall": "True", "units": " 3", "description": "Development of speaking and writing skills at the Intermediate Mid to Intermediate High levels of the American Council on the Teaching of Foreign Languages proficiency scale, as well as listening/viewing and reading skills.  Focus on sentence and paragraph-length discourse, narration and description in present, past, and future time frames within a variety of topics and contexts, and communication skills such as circumlocution.  Course readings, video and discussion content center upon culturalaspects of the Spanish speaking world."}, {"summer": "True", "name": "Spanish Oral and Written Expression II", "prerequisites": "Prerequisite: FLS 331", "spring": "True", "number": "332", "fall": "True", "units": " 3", "description": "Development of speaking and writing skills at the Intermediate High levels of the American Council on the Teaching of Foreign Languages proficiency scale, as well as listening/viewing and reading skills.  Focus on paragraph-length discourse, narration and detailed description in present, past, and future time frames within a variety of topics and contexts, and communication skills such as circumlocution.  Course readings, video and discussion content center upon cultural aspects of the Spanish speaking world."}, {"summer": "True", "name": "The Sounds of Spanish", "prerequisites": "Prerequisite: FLS 202", "spring": "True", "number": "333", "fall": "True", "units": " 3", "description": "A study of the pronunciation and phonological system of Spanish, with the goals of improving student pronunciation and analyzing native Spanish pronunciation.  Extensive practice in phonetic transcription and pronunciation, as well as phonetic/phonological dialect variation."}, {"summer": "True", "name": "Spanish for Native and Heritage Speakers", "prerequisites": "Native or heritage speaker of Spanish with Advanced or Superior proficiency on the ACTFL Oral Proficiency Scale", "spring": "True", "number": "335", "fall": "True", "units": " 3", "description": "This course is designed to meet the needs of native and heritage speakers of Spanish whose linguistic level is above that of our 200-level courses.  Development of oral and writing skills at the Advanced-Mid through Superior levels of the American Council on the Teaching of Foreign Languages proficiency scale."}, {"summer": "True", "name": "Spanish for Business", "prerequisites": "Prerequisite: FLS 331", "spring": "True", "number": "336", "fall": "True", "units": " 3", "description": "Business Spanish vocabulary and terminology. Emphasis on everyday spoken and written Spanish. Readings and discussions of business topics. Cross-cultural considerations relative to international business operations."}, {"summer": "True", "name": "Spanish for Tourism in the Hispanic World", "prerequisites": "Prerequisite: FLS 202", "spring": "True", "number": "337", "fall": "True", "units": " 3", "description": "Exploration of the tourism industry in the Spanish speaking world from cultural-historical, geographic, and linguistic perspectives.  Course can lead to Tourism Certificate in Spanish from the Chamber of Commerce and Industry of Spain."}, {"summer": "True", "name": "Introduction to Hispanic Literatures and Cultures", "prerequisites": "Prerequisite: FLS 331, Corequisite: FLS 332", "spring": "True", "number": "340", "fall": "True", "units": " 3", "description": "Exploration of what literature is; what it means to read literature; and why one might be interested in analyzing literature.  Introduction to literary terminology, as well as literary genres and movements in the Spanish language.  Examination of social-cultural-historical contexts of Spain and Latin America, particularly matters of race, class, gender, and political ideas as they relate to literatures of the Spanish speaking world.  Interpretation and analysis of literary texts, cultural institutions, and objects of national, mass, and popular cultures."}, {"summer": "True", "name": "Literature and Culture of Spain I", "prerequisites": "Prerequisite: FLS 332; Corequisite: 340", "spring": "True", "number": "341", "fall": "True", "units": " 3", "description": "Survey of literary and cultural contexts of medieval and early modern Spain (12th to 17th centuries).  Examination of literary genres in connection with concurrent cultural and historical events.  Exploration of literature as a reflection of the experiences and events meaningful to Spanish society during this time period.  Emphasis on the ways in which literature and other cultural artifacts give voice to value systems, traditions, and beliefs."}, {"summer": "True", "name": "Literature and Culture of Spain II", "prerequisites": "Prerequisite: FLS 332; Corequisite: 340", "spring": "True", "number": "342", "fall": "True", "units": " 3", "description": "Survey of literary and cultural contexts of 18th and 19th century Spain.  Examination of literary genres in connection with concurrent cultural and historical events.  Exploration of literature as a reflection of the experiences and events meaningful to Spanish society during this time period.  Emphasis on the ways in which literature and other cultural artifacts give voice to value systems, traditions, and beliefs."}, {"summer": "True", "name": "Literature and Culture of Spain III", "prerequisites": "Prerequisite: FLS 332; Corequisite: 340", "spring": "True", "number": "343", "fall": "True", "units": " 3", "description": "Survey of literary and cultural contexts of 20th and 21st century Spain.  Examination of literary genres in connection with concurrent cultural and historical events.  Exploration of literature as a reflection of the experiences and events meaningful to Spanish society during this time period.  Emphasis on the ways in which literature and other cultural artifacts give voice to value systems, traditions, and beliefs."}, {"summer": "True", "name": "Literature and Culture of Latin America I", "prerequisites": "Prerequisite: FLS 332; Corequisite: 340", "spring": "True", "number": "351", "fall": "True", "units": " 3", "description": "Survey of literary and cultural contexts of Latin America from the pre-conquest, colonial and early-independence periods (15th to mid 19th centuries).  Examination of literary genres in connection with concurrent cultural and historical events.  Exploration of literature as a reflection of the experiences and events meaningful to Latin American society during this time period.  Emphasis on the ways in which literature and other cultural artifacts give voice to value systems, traditions, and beliefs."}, {"summer": "True", "name": "Literature and Culture of Latin America II", "prerequisites": "Prerequisite: FLS 332; Corequisite: 340", "spring": "True", "number": "352", "fall": "True", "units": " 3", "description": "Survey of literary and cultural contexts of Latin America from the Mid 19th to the Mid 20th centuries.  Examination of literary genres in connection with concurrent cultural and historical events.  Exploration of literature as a reflection of the experiences and events meaningful to Latin American society during this time period.  Emphasis on the ways in which literature and other cultural artifacts give voice to value systems, traditions, and beliefs."}, {"summer": "True", "name": "Literature and Culture of Latin America III", "prerequisites": "Prerequisite: FLS 332; Corequisite: 340", "spring": "True", "number": "353", "fall": "True", "units": " 3", "description": "Survey of literary and cultural contexts of Latin America since 1960.  Examination of literary genres in connection with concurrent cultural and historical events.  Exploration of literature as a reflection of the experiences and events meaningful to Latin American society during this time period.  Emphasis on the ways in which literature and other cultural artifacts give voice to value systems, traditions, and beliefs."}, {"summer": "True", "name": "Hispanic Cinema", "prerequisites": "Prerequisite: FLS 331 and Corequisite FLS 332", "spring": "True", "number": "360", "fall": "True", "units": " Performing Arts, Global Knowledge", "description": "Survey of the major contributions of Hispanic cinema from its origins to the present.  Analysis of film as an artistic medium and as the cinematic representation of Hispanic histories and cultures.  Reading, discussions, and viewing of films by representative directors."}, {"summer": "True", "name": "Special Topics in Spanish", "prerequisites": "Prerequisite: FLS 202", "spring": "True", "number": "395", "fall": "True", "units": " 3", "description": "Special Topics in language and cultures of the Spanish speaking world for students at the 300 level. Includes courses taught in Spanish study abroad programs. Course may be taken up to three times."}, {"summer": "True", "name": "Intensive Spanish Oral Proficiency Workshop", "prerequisites": "Prerequisite: 12 Hours of 300-level Spanish", "spring": "True", "number": "399", "fall": "True", "units": " 1", "description": "Extensive conversation centered upon the communicative functions of the intermediate high to advanced levels of the American Council on the Teaching of Foreign Languages (ACTFL) Oral Proficiency Scale.  Assignments will include listening/viewing and speaking tasks to support in class activities.  Designed to help Spanish majors to achieve the intermediate high oral proficiency level required for graduation.  This is a 5-week course.  Departmental permission is required."}, {"summer": "True", "name": "Methods and Techniques in Spanish Translation and Interpretation", "prerequisites": "Prerequisite: 12 credits of 300 level Spanish", "spring": "True", "number": "400", "fall": "True", "units": " 3", "description": "Study and practical application of theory, methods and techniques of translation based on materials relevant to various fields and professions."}, {"summer": "True", "name": "Spanish For Graduate Students", "spring": "True", "number": "401", "fall": "True", "units": " 3", "description": "Basic Spanish grammar, with special attention to characteristics of formal expository style, and illustrative readings. Study of extracts from scholarly publications in students' areas of research. Prepares students to take the graduate foreign language certification exam."}, {"summer": "True", "name": "Introduction to Spanish Linguistics", "prerequisites": "Prerequisite: 12 credits of 300 level Spanish", "spring": "True", "number": "402", "fall": "True", "units": " 3", "description": "Introduction to fundamental terminology and concepts in the study of linguistics.  Overview of the Spanish phonetics and phonology, morphology, syntax, semantics, pragmatics, sociolinguistics and historical linguistics."}, {"summer": "True", "name": "Spanish-English Comparative Grammar", "prerequisites": "Prerequisite: 12 credits of 300 level Spanish", "spring": "True", "number": "405", "fall": "True", "units": " 3", "description": "Analysis of the linguistic and grammatical structure (phonology, morphology, syntax, and discourse) of English and Spanish in order to develop a deeper understanding of how both linguistic systems function in similar and different ways."}, {"summer": "True", "name": "Topics in the Culture of Spain", "prerequisites": "Prerequisite: 12 credits of 300-level Spanish", "spring": "True", "number": "411", "fall": "True", "units": " 3", "description": "Exploration of particular themes related to the culture of Spain, with culture broadly defined as history, social and political aspects of society, as well as human and artistic expression including use of language, literary production, performance,print, and electronic media.  Themes in this course expand upon those introduced in the 300 level of the Spanish curriculum.  Class discussion and assignments require greater depth and sophistication than introduction to literature and culture courses of the 300 level."}, {"summer": "True", "name": "Topics in the Culture of Latin America and the Caribbean", "prerequisites": "Prerequisite: 12 credits of 300-level Spanish", "spring": "True", "number": "412", "fall": "True", "units": " 3", "description": "Exploration of particular themes related to the culture of Latin America and the Caribbean, with culture broadly defined as history, social and political aspects of society, as well as human and artistic expression including use of language, literary production, performance, print, and electronic media.  Themes in this course expand upon those introduced in the 300 level of the Spanish curriculum.  Class discussion and assignments require greater depth and sophistication than introduction to literature and culture courses of the 300 level."}, {"summer": "True", "name": "Spain and the Americas in Transatlantic Perspective", "prerequisites": "Prerequisite: 12 credits of 300-level Spanish", "spring": "True", "number": "413", "fall": "True", "units": " 3", "description": "Exploration of key moments of communication, exchange and conflict between the different parts of the Spanish speaking world, from the point of contact between imperial Spain and the indigenous civilizations of the \"New World\".  Examination of the commonalities and distinctions of the quest for independence, modernity and democracy.  Analysis of immigration across national frontiers in the present day Hispanic World and greater American continent."}, {"summer": "True", "name": "Seminar in Hispanic Studies", "prerequisites": "Prerequisite: 12 credits of 300 level Spanish", "spring": "True", "number": "492", "fall": "True", "units": " 3", "description": "Advanced seminar on a specific area of Hispanic studies (topics vary), leading to a major term paper and/or a series of essays by the student."}, {"summer": "True", "name": "Advanced Special Topics in Spanish", "prerequisites": "Prerequisite: 12 credits of 300-level Spanish", "spring": "True", "number": "495", "fall": "True", "units": " 3", "description": "Advanced special topics in language and cultures of the Spanish speaking world for students at the 400 level. Includes courses taught in Spanish study abroad programs. Course may be taken up to three times."}, {"summer": "True", "name": "Linguistic Structure of Spanish", "prerequisites": "Prerequisite: FLS 208 or 308; FLS 310 or 311", "spring": "True", "number": "502", "fall": "True", "units": " 3", "description": "Introduction to fundamental terminology and concepts in the study of linguistics.  Overview of the Spanish sound system (phonology), principle of word formation such as derivation and inflection (morphology), structure and grammatical relations of phrases and sentences (syntax), as well as the relationship between linguistic levels."}, {"summer": "True", "name": "Spanish Applied Linguistics", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "503", "fall": "True", "units": " 3", "description": "Overview of prominent theoretical perspectives in the acquisition of Spanish as a second language.  Application of theory to the learning and teaching of Spanish language.  Analysis of issues in the acquisition of Spanish phonology, morphosyntax, semantics and pragmatics."}, {"summer": "True", "name": "Spanish Language Change and Variation", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "504", "fall": "True", "units": " 3", "description": "Overview of phonological and morphosyntactic change from Latin to modern Spanish.  Linguisitic exploration of social and geographic dimensions Spanish language variation.  Examination of issues of Spanish/English contact in the United States, including bilingualism and bilingual education."}, {"summer": "True", "name": "Spanish Phonetics and Phonology", "spring": "True", "number": "509", "fall": "True", "units": " 3", "description": "A theoretical introduction to the phonetics and phonological system of Spanish.  Topics covered include articulatory phonetics, narrow and broad transcription, and the analysis of linguistic data with the goal of understanding the underlying system of Spanish sounds.  Current topics in Spanish phonology are included.  Must hold graduate standing or gain permission of instructor."}, {"summer": "True", "name": "Spanish Dialectology", "prerequisites": "Prerequisite: FLS 502 Lingustic Structure of Spanish or permission of instructor.", "spring": "True", "number": "510", "fall": "True", "units": " 3", "description": "Overview of geographic linguistic variation in the Spanish-speaking world.  Data from phonetics/phonology and morpho-syntax will form the basis of study.  Topics include: the development of dialect differences, dialects and languages of the Iberian peninsula, and Spanish usage in Latin America.  Spanish as a world language in Africa and Asia, as well as indigenous influences on Spanish, are also covered.  Must hold graduate standing or gain permission of instructor."}, {"summer": "True", "name": "Spanish Sociolinguistics", "prerequisites": "Prerequisite: FLS 502 (Linguistic Structure of Spanish)", "spring": "True", "number": "511", "fall": "True", "units": " 3", "description": "Overview of synchronic linguistic variation in the Spanish-speaking world.  The social stratification of language in Spanish speaking communities according to social class, gender, and age will be explored.  The contribution of these factors to language change among Spanish speakers in the Americas and Spain will also be explored."}, {"summer": "True", "name": "Poetry and Politics in Latin America", "prerequisites": "Prerequisite: FLS 492;Admission into the M.A. Program in Spanish", "spring": "True", "number": "525", "fall": "True", "units": " 3", "description": "This course examines the poetry of Octavio Paz, Cesar Vallejo, and pablo Neruda from the 1930s to the 1950s and covers the aesthetic and political debates regarding realism, surrealism and socialist realism in Europe and Latin America.  The focus ison the relationship between literary form and politics.  Course is offered in Spanish."}, {"summer": "True", "name": "Cultures, discourses and practices in early modern Spain", "spring": "True", "number": "526", "fall": "True", "units": " 3", "description": "Overview of early modern Spanish short fiction, theatre, and the reflection of these genres in the everyday practices and cultural discourse of Imperial Spain. Taught in Spanish. Graduate status or permission of instructor."}, {"summer": "True", "name": "Don Quixote", "spring": "True", "number": "528", "fall": "True", "units": " 3", "description": "This course studies the historical and political contexts of Cervante's writing, his place in Renaissance culture, and the role of Don Quixote in the formation of the modern novel.  Taught in Spanish.  Graduate status or permission of the instructor."}, {"summer": "True", "name": "The Cultural Production of Spanish Democracy", "spring": "True", "number": "530", "fall": "True", "units": " 3", "description": "Challenges, contradictions, accomplishments, and shortcomings in the political, social, economic, cultural, and literary dimensions of Spain in the last quarter of the 20th century.  Treatment of literary texts, historical and journalistic documents, critical and theoretical essays, as well as fiction and non-fiction films, music, and other products of popular and mass culture since 1975.  Particular attention to significant cultural events such as the 1992 Barcelona Olympics, and the celebration of the 500th anniversary of the \"Discovery\" of America.  Must hold graduate standing."}, {"summer": "True", "name": "Graduate Seminar in Hispanic Studies", "prerequisites": "Prerequisite: Graduate standing in Hispanic Studies;M.A. students in Hispanic Studies", "spring": "True", "number": "592", "fall": "True", "units": " 3", "description": "A concentrated study of genres, periods or other special topics in Hispanic Studies to be determined as needed in the departmental program. Rotating topics on literature and/or culture; may be taken more than once for credit."}, {"summer": "True", "name": "Special Topics in Spanish", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "595", "fall": "True", "units": " 3", "description": "In depth exploration of specialized topics in Spanish literature, culture or language. Also used to test and develop new courses.Course taught in Spanish."}, {"summer": "True", "name": "Independent Study in Spanish", "spring": "True", "number": "630", "fall": "True", "units": " 1-3", "description": "Individualized study in Spanish language or literature at the graduate level. Topic and mode of study to be determined in consultation with the faculty member supervising work."}, {"summer": "True", "name": "Special Project in Spanish", "prerequisites": "Prerequisite: Student must be in final semester of his or her program", "spring": "True", "number": "675", "fall": "True", "units": " 3", "description": "Individual project in Spanish language or literature at the graduate level. Topic and mode of study to be determined in consultation with student's project advisory committee within the parameters of specific options."}, {"summer": "True", "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "688", "fall": "True", "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": "True", "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "689", "fall": "True", "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc. Students may register for this course a maximum of one semester."}, {"summer": "True", "name": "Special Topic in Hispanic Studies", "spring": "True", "number": "790", "fall": "True", "units": " 3", "description": "In depth exploration of specialized topics in Spanish literature, culture or language. Also used to test and develop new courses. May be taken more than once for credit. Graduate Standing."}, {"summer": "True", "name": "Seminar in Hispanic Studies", "spring": "True", "number": "792", "fall": "True", "units": " 3", "description": "A concentrated study of genres, periods or other special topics in Hispanic Studies to be determined as needed in the departmental program. Rotating topics on literature and/or culture; may be taken more than once for credit. Graduate Standing."}, {"summer": "True", "name": "Studies in Golden Age Literature and Culture", "spring": "True", "number": "793", "fall": "True", "units": " 3", "description": "Explores how sixteenth-and-seventeenth century Spanish literature and historiography reflect on the emergence of Spain as a politically unified nation. Focus on foundation discourses, the voice of excluded minorities, and the historical events that threatened this unity. Topics include: nation and narration, culture authority, state propaganda, Moriscos, women, the advent capitalism, and rebellion of the Moors of Granada. May be repeated for credit. (Maximum of 6 hours.) Graduate Standing."}, {"summer": "True", "name": "Studies in 19th Century Spanish Literature and Culture", "spring": "True", "number": "795", "fall": "True", "units": " 3", "description": "Examines the commonalities and distinctions of the quest for independence, modernity and democracy in Latin America and Spain in the 19th century. May be repeated for credit. (Maximum of 6 hours.) Graduate Standing."}, {"summer": "True", "name": "Studies in 20th and 21st Century Spanish Literature and Culture", "spring": "True", "number": "796", "fall": "True", "units": " 3", "description": " 21st centuries) Peninsular Spanish literature and culture. Literary and/or cinematic texts are studies in their socio-historical context and in relation to issues of class, gender, ethnicity, and political ideology. Course requires graduate standing. May be repeated for credit. (Maximum of 6 hours.) Graduate Standing."}, {"summer": "True", "name": "Studies in Colonial Latin American Literature and Culture", "spring": "True", "number": "797", "fall": "True", "units": " 3", "description": "Exploration of the role of literature, material artifacts and public display that reinforce culture heritage and national identity from the colonial period through 19th century Latin America. May be repeated for credit. (Maximum of 6 hours.) Graduate Standing."}, {"summer": "True", "name": "Studies in 20th and 21st Century Latin American Literature and Culture", "spring": "True", "number": "798", "fall": "True", "units": " 3", "description": "Analysis of the major literature, films, and/or literary movements in their historical context in Laitn America in the Twentieth and Twent-First Centuries. May be repeated for credit. (Maimum of 6 hours.) Graduate Standing."}, {"summer": "True", "name": "Seminar in Literature and Culture of One Latin American Country", "spring": "True", "number": "799", "fall": "True", "units": " 3", "description": "Analysis of the most representative literature and culture in one Latin American country in a given historical period. May be repeated for credit. (Maximum of 6 hours.) Graduate Standing."}]