[{"summer": "True", "name": "Feed Manufacturing Technology", "prerequisites": "Prerequisite: ANS(NTR,PO) 415 or ANS 230 or ANS 225", "spring": "True", "number": "425", "fall": "True", "units": " 3", "description": "Feed mill management, feed ingredient purchasing, inventory, storage, and quality evaluation, computerized feed formulation, feeding programs for poultry and swine, feed mill design, equipment, maintenance, operation, safety, state and federal regulations pertaining to feed manufacture."}, {"summer": "True", "name": "Feed Mill Operations and Leadership", "prerequisites": "Prerequisite: PO(ANS) 425", "spring": "True", "number": "460", "fall": "True", "units": " 2", "description": "Principles and current practices of modern feed mill operations.  Topics include managing employees, team building, safety, budgets, regulations, and key performance indicators."}, {"summer": "True", "name": " Formulation", "prerequisites": "Prerequisite: PO(ANS) 425", "spring": "True", "number": "480", "fall": "True", "units": " 2", "description": "Introduction to the principles of ingredient and feed quality assurance and how to develop a comprehensive quality assurance program.  The course will include the development of approved suppliers, ingredient specifications, feed manufacturing procedures, and formulation based on dynamic ingredient matrices."}, {"summer": "True", "name": "Feed Science Seminar", "spring": "True", "number": "490", "fall": "True", "units": " 1", "description": "Exploration of topics related with current and future potential to influence the feed industry.  Guest lectures from feed industry leaders and university representatives will include: vertically integrated and commercial feed production, current research topics, government regulations, trade organizations, and quality assurance."}, {"summer": "True", "name": "Feed Mill Learning Experience", "prerequisites": "Prerequisite: PO(ANS) 425", "spring": "True", "number": "494", "fall": "True", "units": " 1", "description": "Hands-on laboratory teaching students how to safely operate feed mill equipment and manufacture feed using a computer system."}, {"summer": "True", "name": "Advanced Feed Science and Technology", "prerequisites": "Prerequisite: PO/ANS/NTR 415 or ANS 230 or related feed industry experience", "spring": "True", "number": "525", "fall": "True", "units": " 3", "description": "Feed mill management, equipment, maintenance, operation, safety, and regulations pertaining to feed manufacturing. Feed ingredient purchasing, inventory, storage, quality evaluation, and computerized feed formulation. Advanced NTR525 topics include more detailed aspects of feed science and technology, feed mill design and process flow, operations management, feed quality assurance, regulations, and computer applications. The Distance Education section will have independent study assignments in place of lab experience. Credit will not be given for both PO/ANS 425 and NTR 525."}, {"summer": "True", "name": "Feed and Ingrdient Quality Assurance", "prerequisites": "Prerequisite: NTR(FM) 525", "spring": "True", "number": "580", "fall": "True", "units": " 3", "description": "The course will teach students the principles of feed and ingredient quality assurance and how to develop a comprehensive quality assurance program. The course will include the development of an approved supplier list, ingredient specifications, feed manufacturing quality assurance procedures, and risk based feed safety programs."}, {"summer": "True", "name": "Advanced Feed Mill Practicum", "prerequisites": "Prerequisite: NTR(FM) 525", "spring": "True", "number": "594", "fall": "True", "units": " 1", "description": "This course will teach students the principles of operating a modern feed mill. Students will receive ingredients, grind grain, manufacture feed, and perform quality checks on finished feed products. Students will complete safety, quality assurance, and feed processing training units as part of their training."}, {"summer": "True", "name": "Advanced Feed Formulation", "prerequisites": "Prerequisite: NTR(FM) 525", "spring": "True", "number": "790", "fall": "True", "units": " 3", "description": "Principles of feed and ingredient quality assurance and how to develop a comprehensive quality assurance program. The course will include the development of an approved supplier list, ingredient specifications, feed manufacturing quality assurance procedures, and risk based feed safety programs."}]