[{"summer": false, "name": "Professional Development I: Critical Thinking in Natural Resources", "spring": true, "number": "150", "fall": true, "units": " 1", "description": "Techniques of critical thinking applied to a broad range of natural resource and forestry issues."}, {"summer": false, "name": "Forest System Mapping and Mensuration I", "spring": false, "number": "172", "fall": true, "units": " 2", "description": "Concepts and application of basic forest and land resource measurement techniques used in forestry and related fields.  Measuring distances and areas; orienteering; basic air photo and topographic map interpretation; introduction to GPS; measuring tree characteristics; introduction to forest sampling.  Application of spreadsheets and word processing to analyze and summarize resource characteristics.  Field trip required."}, {"summer": false, "name": "Wood Anatomy and Properties", "spring": false, "number": "202", "fall": true, "units": " 3", "description": "Formation, anatomy and properties of wood. Structural features of softwoods and hardwoods and the relationships among anatomy, physiology, physical and mechanical properties. Variability, naturally occurring defects, and wood deterioration are discussed and related to wood utilization. Techniques on hand lens and microscopic identification of wood."}, {"summer": true, "name": "Silviculture", "prerequisites": "Prerequisite: Summer camp eligibility", "spring": false, "number": "204", "fall": false, "units": " 2", "description": "Silvical characteristics and growth requirements of forest trees; dynamics of stand growth, species-site relationships, site productivity, forest pest interactions, hydrology and nutrient cycling in  forest ecosystems; emphasis on understanding and applying ecological principles to the production of multiple benefits at the forest community level."}, {"summer": false, "name": "Urban and Community Forestry", "spring": false, "number": "220", "fall": true, "units": " 3", "description": "Introduction to the interdisciplinary study of urban forestry and greenspaces. Study of urban forest history, distribution and ownership patterns, urban ecology and ecosystems, benefits and uses of urban forests, vegetation establishment and maintenance, urban planning and policy, community interactions, urban forestry implementation."}, {"summer": true, "name": "Conservation of Natural Resources", "spring": true, "number": "221", "fall": true, "units": " 3", "description": "This course examines the importance of natural resources and their role in the progress of human civilization. Physical, biological and ecological principles are described that underlie sustainability of natural resources, particularly as these relate to the consequence of human impacts as resources are used to meet societal needs. The course emphasizes renewable natural resources, the importance of habitat, and a broadly-international context. The course has an optimistic perspective that life on Earth can and will be better in the future if we learn and practice good resource management today."}, {"summer": false, "name": "Forest History, Technology and Society", "spring": true, "number": "248", "fall": false, "units": " 3", "description": "Examining forest resource use and issues throughout history.  Tracing developments and concepts that created the context for today's issues concerning global forest resources.  Examining how wood resource availability shaped civilization's development, and examining consequences on forest resources of civilization's scientific, social, and technological progress."}, {"summer": false, "name": "Professional Development II: Communications in Natural Resources", "spring": true, "number": "250", "fall": false, "units": " 1", "description": "Development of written and oral communication skills for forestry and natural resources management. Discussion topics include interactive communication, writing to a target audience, common pitfalls in technical writing, various kinds of technical writing, poster and oral presentations, reviewing and revising writing, and responding to questions in a professional manner."}, {"summer": false, "name": "Introduction to Forest Science", "prerequisites": "R: Not open to Forest Management Majors (15FOMND,15FORMTBS, 15FGM)", "spring": true, "number": "252", "fall": false, "units": " 3", "description": "Integration of biological principles into studies of tree growth, reproduction, establishment, survival, and disturbance. Discussions of regional silviculture and of effects of humans on forest ecosystems. Instruction in forest sampling and tree identification. Many laboratories meet outdoors.Not open to Forest Management majors."}, {"summer": false, "name": "Forest Ecology", "spring": true, "number": "260", "fall": false, "units": " 3", "description": "Introduction to forest ecosystems, their structure, and the processes that regulate them including: radiation, temperature, water, and biogeochemistry; productivity; plant populations; structure and function of forest communities; succession; wind and fire; and human influences."}, {"summer": true, "name": "Forest Communities", "prerequisites": "Prerequisite: FOR 339 or PB 220 or PB 403", "spring": false, "number": "261", "fall": false, "units": " 2", "description": "Study of the species composition, distribution, site requirements, and succession of the principal forest communities of southeastern North America.  Identification of important member plant species.  Field trips to typical examples."}, {"summer": true, "name": "Forest Wildlife", "prerequisites": "Prerequisite: Summer camp eligibility", "spring": false, "number": "264", "fall": false, "units": " 1", "description": "Diversity of fauna that inhabits forest communities in the Piedmont of North Carolina.  Inventory terrestrial and aquatic habitats and identify various vertebrate and invertebrate species.  Insect collection initiated.  The life histories of representative species presented."}, {"summer": true, "name": "Fire Management", "prerequisites": "Prerequisite: Summer camp eligibility", "spring": false, "number": "265", "fall": false, "units": " 1", "description": "Effects of wildfire and prescribed fire on forest ecosystem components and processes; fire behavior and the ecosystem and meterologic factors that affect it; silvicultural uses of fire; organization, equipment, and tactics for wildfire suppression; fire suppression exercises on the North Carolina Division of Forest Resources' Forest Fire Simulator."}, {"summer": true, "name": "Forest System Mapping and Mensuration II", "prerequisites": "Prerequisite: FOR 172", "spring": false, "number": "273", "fall": false, "units": " 3", "description": "Procedures and Instruments for measuring various tree and stand characteristics.  Determination of stem volume and taper.  Planning and implementation of forest resource samples to provide population estimates using fixed-radius and variable-radius sampling.  Detailed coverage of land measurements and mapping of boundary surveys.  Use of aerial photography, topographic maps, and GPS to aid in resource assessment.  Incorporation of inventory data into a GIS.  Basic statistical concepts applied to resource measurements.  Taught off-campus at Hill Forest."}, {"summer": true, "name": "Independent Study in Forestry", "spring": true, "number": "291", "fall": true, "units": " 1-6", "description": "Detailed investigation of forestry topics of interest to undergraduates under faculty direction on a tutorial basis.  Credit and content determined by faculty member in consultation with Undergraduate Program Director or Department Head."}, {"summer": true, "name": "Special Topics in Forestry", "spring": true, "number": "295", "fall": true, "units": " 1-6", "description": "Study of forestry topics not covered in existing courses at the introductory level.  Development of a new course on a trial basis."}, {"summer": false, "name": "Silvics and Forest Tree Physiology", "prerequisites": "Prerequisite: CH 101 and (CH 201/202 or PY 211)", "spring": false, "number": "303", "fall": true, "units": " 3", "description": "Ecological and physiological processes influencing establishment, growth, and development of forest stands with particular emphasis on forest types of Southeastern United States; influence of resource availability on forest stand productivity; physical and biochemical processes associated with tree function, including water relations, mineral nutrition, transport and translocation, photosynthesis, respiration; internal and environmental factors regulating tree growth and development."}, {"summer": false, "name": "Theory of Silviculture", "prerequisites": "Prerequisite: FOR 260", "spring": true, "number": "304", "fall": false, "units": " 4", "description": "Ecological processes affecting the establishment and growth of forest stands with particular emphasis on forest types of the Southeastern United States. Forest stand productivity, how productivity is influenced by site, stand, climatic factors, and the application of site specific prescriptions to establish and manipulate the composition, growth, and health of forest stands."}, {"summer": false, "name": "Forest Pathology", "prerequisites": "Prerequisite: PB 200", "spring": true, "number": "318", "fall": false, "units": " 3", "description": "Major diseases of forest trees and deterioration of wood products emphasizing principles of plant pathology; diagnosis; nature, physiology, ecology, and dissemination of disease-causing agents; mechanisms of pathogenesis; epidemiology and environmental influences; principles and practices of control."}, {"summer": false, "name": "Forest Economics", "prerequisites": "Prerequisite: ARE 201 or EC 205 or EC 201", "spring": false, "number": "319", "fall": true, "units": " 3", "description": "Economic approaches for evaluating the production and costs of forest management, timber harvesting activities, and nontimber forest products.  Estimating the financial returns of long-term investments in timber or other forest resources, including discounted cash flow analysis and capital budgeting techniques.  Property taxes and income tax treatment of timber and their effects on investment returns.  Demand estimation and timber supply analyses."}, {"summer": false, "name": "North Carolina Forests", "spring": false, "number": "330", "fall": true, "units": " 3", "description": "An introduction and overview of forests in North Carolina with emphasis on the importance of forests in the 21st century. Topics include: history and distribution of forests, soils-sit relationships, forestry practices, non-conventional management objectives.  Two required Saturday field trips."}, {"summer": false, "name": "Operations Research Applications in Natural Resources", "spring": false, "number": "334", "fall": true, "units": " 1", "description": "Introduction to the application and use of management science in forestry and natural resources.  The course will introduce decision and information theory and mathematical programming techniques including linear, non-linear and integer programming concepts.  The emphasis is on problem formulation and solution using computer programs.  Half semester course."}, {"summer": false, "name": "Dendrology", "spring": false, "number": "339", "fall": true, "units": " 4", "description": "Identification and elementary silvics of woody plants of eastern North America with studies of their classification, characteristics, and habitats.  Consideration of trees from northern and western North America and the Caribbean region.  Field identification with trips to forest communities."}, {"summer": false, "name": "Professional Development III: Ethical Dilemmas in Natural Resource Management", "prerequisites": "Prerequisite: Junior standing.", "spring": true, "number": "350", "fall": false, "units": " 1", "description": "Study of ethical issues confronting natural resource management professionals, including: biodiversity conservation, private property rights, traditional religion and ecological values, community rights, environmental racism, hunting and animal rights, business ethics, and the purpose and content of professional codes of ethics."}, {"summer": false, "name": "Air Photo Interpretation and Photogrammetry", "prerequisites": "Prerequisite: MA 114 or MA 121or MA 131 or MA 141", "spring": false, "number": "353", "fall": true, "units": " 3", "description": "Theory, principles, and techniques of utilizing air photos for inventory and management of  renewable resources, photogrammetric and engineering applications, hydrologic and terrain analysis, and land use/cover mapping. Introduction to remote sensing and use of color infrared, thermal, Skylab, and Lands at imagery in resource mapping."}, {"summer": false, "name": "Forest Measurement, Modeling, and Inventory", "prerequisites": "Prerequisite: FOR 273", "spring": false, "number": "374", "fall": true, "units": " 3", "description": "Mathematical functions required for quantifying the yield of timber and non-timber products.  Procedures for planning, conducting, and analyzing forest inventories.  Use of mathematical models to estimate growth and yield of forest stands and non-timber products for management decisions."}, {"summer": false, "name": "Forest Entomology", "prerequisites": "Prerequisite: Junior standing.", "spring": true, "number": "402", "fall": false, "units": " 3", "description": "Fundamentals of morphology, classification, biology, ecology and control of insects attacking trees, with emphasis on silvicultural practices."}, {"summer": false, "name": "Forest Wildlife Management", "prerequisites": "Prerequisite: Junior standing", "spring": false, "number": "404", "fall": true, "units": " 3", "description": "Relationships between forest and wildlife management and the effects of silvicultural systems on wildlife. Species-habitat requirements, forest wildlife management techniques, and forest-wildlife policies and economics."}, {"summer": false, "name": "Forest Management", "prerequisites": "Prerequisite: FOR 304, FOR 319, FOR 374", "spring": false, "number": "405", "fall": true, "units": " 4", "description": "Fundamental principles and analytical techniques necessary in the planning, management and optimization of forest operations. Formulation of objectives and constraints, yield forecasting, forest regulation, procurement and marketing, inventory methods, and management plan preparation. Written and oral reporting."}, {"summer": false, "name": "Forest Inventory, Analysis and Planning", "prerequisites": "Prerequisite: FOR 405, FOR 460", "spring": true, "number": "406", "fall": false, "units": " 4", "description": "Independent project in designing and implementing a multi-resource survey; analyze stand conditions; forecast growth, yield and revenue of timber and forest products; use linear programming to prepare a long-term management plan subject to economic,social, and ecological constraints; assess economic and environmental impacts of potential actions; and report results orally and in writing."}, {"summer": false, "name": "Forest Tree Genetics and Biology", "prerequisites": "Prerequisite: Junior standing", "spring": true, "number": "411", "fall": false, "units": " 3", "description": "Genetics as it is applied in forest management for both conifers and hardwoods.  The variation, evolution and genetics of forest trees.  Methods for selection, breeding, seed production, and vegetative propagation.  Exotics, wood properties, and tree improvement as a forest management tool."}, {"summer": false, "name": "World Forestry", "spring": true, "number": "414", "fall": false, "units": " 3", "description": "Management of global forest resources; distribution and trends in forest cover; role of forests in economic development; international production and trade of forest products; current policy issues, including tropical deforestation, certification, and carbon sequestration; social forestry and non-timber forest products; international institutions and aid for conservation and development; identification and evaluation of sources of current information on global forestry issues."}, {"summer": false, "name": "World Forestry Study Tour", "prerequisites": "Corequisite: FOR 414", "spring": true, "number": "415", "fall": false, "units": " 1", "description": "Field trip to Mexico and/or Central America for seven days over spring break.  Examine tropical forestry issues through field visits to timber concessions, plantations, nurseries, wood products firms, protected areas, and agroforestry projects; meetings with representatives of forest research institutes, government agencies, timber industry, cooperatives, and environmental organizations; and interaction with local people.  Fee for field trip determined annually.Offered during spring break, as aone week field trip to Mexico and/or Central America."}, {"summer": false, "name": "Watershed and Wetlands Hydrology", "prerequisites": "Prerequisite: SSC 200, BO 360", "spring": false, "number": "420", "fall": true, "units": " 4", "description": "Principles of hydrologic science; classification and assessment of watersheds and stream networks; hydrologic, erosion, and water quality processes in natural and managed watersheds; wetlands hydrology; hydrologic measurements and data analysis; applications of hydrology and water quality management for forest agriculture, and urban ecosystems; watershed restoration.  Emphasis field study of watersheds and hydrologic measurements.  Two weekend field trips are required. Credit will not be given for both FOR(NR)420 and FOR(NR)520."}, {"summer": false, "name": "Consulting Forestry", "prerequisites": "Prerequisite: Senior standing in Forest Management", "spring": false, "number": "422", "fall": true, "units": " 3", "description": "Forest land acquisition and ownership: ownership, appraisal, legal considerations, financial management and planning. Producing forest resources: timber, wildlife, recreation, farm products, water, minerals, specialty products, and development. Marketing forest resources: timber, recreation, farm leases, minerals, specialty products, and developed property. Forest resources consulting: forms of organization, pricing of services, consultant client relationships (Law of Agency), professional ethics and continuing education."}, {"summer": false, "name": "Introduction to Fisheries Sciences Laboratory", "prerequisites": "Corequisite: FW/BIO 420", "spring": true, "number": "423", "fall": false, "units": " 1", "description": "General anatomy and identification of common freshwater, estuarine and marine fish, functional morphology, age and growth analyses, fish health and diets.  Computer analyses of bioenergetic and population dynamics."}, {"summer": false, "name": "Forest Operations and Analysis", "prerequisites": "Prerequisite: MA 114, MA 121, ST 311 and FOR 319", "spring": true, "number": "434", "fall": false, "units": " 3", "description": "Management science and operational techniques in forestry.  Logging road layout and construction, and machine systems: harvesting machine optimization and selection.  Harvesting, production and forest planning.  Decision and inventory theory, and other techniques for solving problems typically encountered in forest operations management.  Required overnight weekend field trip."}, {"summer": false, "name": "Professional Development IV: Leadership", "prerequisites": "Prerequisite: Junior standing.", "spring": true, "number": "450", "fall": false, "units": " 1", "description": "Concepts and applications of leadership principles with emphasis on leadership challenges and opportunities for professionals in natural resources management.  Assessment and development of leadership skills."}, {"summer": false, "name": "Special Topics in Forestry and Related Natural Resources", "spring": true, "number": "491", "fall": true, "units": " 1-4", "description": "Independent (or group) study or research of a forestry or related natural resources topic with a faculty supervisor of the student's choice. Also courses offered on a trial basis."}, {"summer": false, "name": "Dendrology", "prerequisites": "Prerequisite: PB 200", "spring": false, "number": "501", "fall": true, "units": " 3", "description": "Identification and natural history of eastern woody species with studies of their taxonomic classification, physical characteristics, and typical habits.  Laboratories stress sight recognition and use of identification keys and trips to natural forest communities."}, {"summer": false, "name": "Forest Measurements", "spring": false, "number": "502", "fall": true, "units": " 1", "description": "One-third semester mini-course.  Forest measurements covering principles, terminology, and practical field applications.  Land area measurement, units of timber measure (cubic feet, cords, weight, board feet), estimating volume of standing trees, sampling techniques for forest inventory (strips, plots, points), measures of site quality and stand density, methods for projecting future timber volumes."}, {"summer": false, "name": "Tree Physiology", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "503", "fall": true, "units": " 1", "description": "One-third semester mini-course.  Fundamental principles of physiological processes in forest trees affecting tree and stand growth and development in natural forests and managed plantations.  Concepts of whole plant physiological processes includingphotosynthesis, respiration, water relations, nutrition, periodic growth, sexual and vegetative reproduction, and seedling quality with forestry examples of each process."}, {"summer": false, "name": "Forest Management", "spring": false, "number": "505", "fall": true, "units": " 4", "description": "Fundamental principles and analytical techniques necessary in planning, management and optimization of forest operations.  Formulation of objectives and constraints, yield forecasting, forest regulation, procurement and marketing, inventory methods,and management plan preparation.  Written and oral reporting.Credit not allowed for both FOR 505 and FOR 405"}, {"summer": false, "name": "Silviculture Mini Course", "spring": true, "number": "507", "fall": false, "units": " 1", "description": "One-third semester mini-course.  A condensed version of silviculture.  Ecological processed affecting establishment and growth of forest stands with particular emphasis on forest types of southeastern United States.  Forest stand productivity, how productivity influenced by site, stand, climatic factors, and application of site specific prescriptions to establish and manipulate composition, growth, and health of forest stands."}, {"summer": false, "name": "Forest Resource Policy", "spring": true, "number": "509", "fall": false, "units": " 1", "description": "One-third semester mini-course.  Principles of forest policies and processes.  Political processes, institutional and interest group participation, forestry laws and programs, current issues, and policy analyses."}, {"summer": false, "name": "Introduction to GPS", "spring": true, "number": "510", "fall": true, "units": " 1", "description": "One-third semester mini-course. Introduction to collection and use of mapping grade global positioning satellite systems data.  Includes review of cartographic properties, mission planning, hands-on collection of GPS points, lines, and areas, differential correction, editing, and exporting GPS files to a GIS."}, {"summer": false, "name": "Silviculture for Intensively Managed Plantations", "prerequisites": "Prerequisite: FOR 507", "spring": false, "number": "513", "fall": true, "units": " 3", "description": "This course provides an up-to-date understanding of the ecological and physiological bases of forest stand productivity and a silvicultural systems framework to use this knowledge for making site specific prescriptions that are cost effective and environmentally sustainable."}, {"summer": false, "name": "Forest Economics", "prerequisites": "Prerequisite: Basic course in economics", "spring": true, "number": "519", "fall": false, "units": " 3", "description": "Economics applied to problems in forest management, including timber demand and supply models, optimal rotation length, benefit-cost analysis of forestry projects, impacts of forest taxation and consideration of non-market forest goods and services."}, {"summer": false, "name": "Watershed and Wetlands Hydrology", "prerequisites": "Prerequisite: SSC 200, BO 360", "spring": false, "number": "520", "fall": true, "units": " 4", "description": "Principles of hydrologic science; classification and assessment of watersheds and stream networks; hydrologic, erosion, and water quality processes in natural and managed watersheds; wetlands hydrology; hydrologic measurements and data analysis; applications of hydrology and water quality management for forest, agriculture, and urban ecosystems; watershed restoration.  Field study of watersheds and hydrologic measurements.  Two weekend field trips required. Credit for both FOR(NR) 420 and FOR(NR) 520 is not allowed."}, {"summer": false, "name": "Consulting Forestry", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "522", "fall": true, "units": " 3", "description": "Forest land acquisition and ownership:  ownership, appraisal, legal considerations, financial management and planning.  Producing forest resources:  timber, wildlife, recreation, farm products, water, minerals, specialty products, and development.  Marketing forest resources:  timber, recreation, farm leases, minerals, specialty products, and developed property.  Forest resources consulting:  forms of organization, pricing of services, consultant client relationships (Law of Agency), professional ethics and continuing education.  To receive graduate credit, a student must write a term paper on a topic mutually agreed upon with the instructor.Credit for both FOR 422 and FOR 522 is not allowed."}, {"summer": false, "name": "Forest Operations and Analysis", "spring": true, "number": "534", "fall": false, "units": " 3", "description": "Management science and operational techniques in forestry.  Road layout, construction, and machine systems: harvesting machine optimization and selection.  Harvesting, production and forest planning.  Linear programming, queuing, decision and inventory theory, and other techniques for solving problems typically encountered in forest operations management.  Credit not allowed for both FOR 534 and FOR 434."}, {"summer": false, "name": "Advanced Dendrology", "prerequisites": "Prerequisite: BO 403 or FOR 339", "spring": true, "number": "540", "fall": false, "units": " 3", "description": "Identification and life histories of native and naturalized woody plants. Use of taxonomic manuals and literature. Identification of problematic groups. Concentration on North America, with discussion of other continents. Overnight field trips to natural forest communities."}, {"summer": false, "name": "Principles of Spatial Analysis", "spring": false, "number": "554", "fall": true, "units": " 3", "description": "Principles and techniques for utilizing spatial information in natural resource inventory and analysis.  Interpretation of conventional aerial photographs, principles of photogrammetry, sources of spatial data layers, and introductions to non-photographic remote sensing and digital photogrammetry."}, {"summer": true, "name": "Forest Communities of the Southeastern Coastal Plain", "prerequisites": "Prerequisite: FOR 212, FOR 501", "spring": false, "number": "561", "fall": false, "units": " 1", "description": "Species composition, distribution, site requirements, and succession of principal forest communities of southeastern Coastal Plain.  Identification of important member plant species.  Overnight field trips to typical examples."}, {"summer": true, "name": "Forest Communities of the Southern Appalachians", "prerequisites": "Prerequisite: FOR 212, FOR 501", "spring": false, "number": "562", "fall": false, "units": " 1", "description": "Species composition, distribution, site requirements, and succession of principal forest communities of southern Appalachians.  Identification of important member plant species.  Overnight field trips to typical examples."}, {"summer": false, "name": "Advanced Terrestrial Ecosystem Ecology", "spring": true, "number": "575", "fall": false, "units": " 3", "description": "Views organisms and physical environment as integrated system. Outlines processes governing assimilation and cycling of energy, carbons, nutrients, and water. Evaluates ecosystem responses to intensive management, global climate change, air pollution, biofuels production, fragmentation, large-scale land use change. Illustrates application of ecosystem science approach to important regional and global questions through scaling of empirical, ecosystem-level data, ongoing research. Provides experience in hypothesis testing and experimental design, data analysis and interpretation, proposal development, and publication for research professionals. Graduate Standing."}, {"summer": false, "name": "Tropical Forestry", "prerequisites": "Prerequisite: Senior standing", "spring": false, "number": "583", "fall": true, "units": " 3", "description": "Principles of tropical ecology, dendrology and agroforestry. Primary emphasis on establishment and management of tropical plantations with lesser emphasis on natural stands.  Operation and management of tropical nurseries."}, {"summer": true, "name": "Special Topics", "spring": true, "number": "595", "fall": true, "units": " 1-6", "description": "Individual students or groups of students, under direction of a faculty member, may explore topics of special interest not covered by existing courses. Format may consist of readings and independent study, problems or research not related to thesis.Also used to develop and test new 500-level courses."}, {"summer": true, "name": "Graduate Seminar", "prerequisites": "Prerequisite: FOR 420, ST 512", "spring": true, "number": "601", "fall": true, "units": " 1", "description": "Weekly seminar in which students registered for course present the results of research and special projects. Invitation to all graduate students and faculty in department to attend and join discussion."}, {"summer": false, "name": "Research Methods in Forestry and Environmental Resources", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "603", "fall": false, "units": " 1", "description": "Philosophy and objectives of scientific research and steps in the research process. Basic and applied research, inductive and deductive reasoning and need for hypothesis development and testing as a basis for scientific research. Special emphasis on preparation of study plans, graduate theses, published articles and technical presentations."}, {"summer": true, "name": "Special Topics In Forestry", "spring": true, "number": "610", "fall": true, "units": " 1-3", "description": "Individual students or groups of students, under direction of a faculty member, may explore topics of special interest not covered by existing courses. Format may consist of readings and independent study, problems or research not related to thesis.Also used to develop and test new 500-level courses.Credits Arranged."}, {"summer": true, "name": "Field Practicum in Tropical Forestry", "spring": false, "number": "680", "fall": false, "units": " 2", "description": "Principles of tropical forest protection and management through case studies.  Participants will travel to a tropical region outside the United States for two weeks of intensive field studies.  Topics: balancing economic growth with environmental protection, industrial forestry, protection forestry, projects and organizations, policy issues."}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "685", "fall": true, "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "688", "fall": true, "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "689", "fall": true, "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": true, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "690", "fall": true, "units": " 1-6", "description": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam."}, {"summer": true, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "693", "fall": true, "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": true, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "695", "fall": true, "units": " 1-9", "description": "Thesis research."}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "696", "fall": false, "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": true, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "699", "fall": true, "units": " 1-3", "description": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their theses."}, {"summer": false, "name": "Advanced Topics In Silviculture", "prerequisites": "Prerequisite: FOR 304", "spring": false, "number": "713", "fall": true, "units": " 3", "description": "Critical examination of selected silvicultural topics, with special emphasis on concepts and phenomena distinguishing forests from other biotic communities and silviculture from other fields of applied biology. Emphasis on intensive silviculture in United States and selected international locations. A required written research proposal."}, {"summer": false, "name": "Forest Genetics", "prerequisites": "P:GN 311", "spring": true, "number": "725", "fall": false, "units": " 3", "description": "Application of genetic principles to silviculture, management and wood utilization. Emphasis on variation in wild populations, the bases for selection of desirable qualities and fundamentals of controlled breeding."}, {"summer": false, "name": "Advanced Topics In Quantitative Genetics", "prerequisites": "Prerequisite: GN(FOR) 725, GN(ST) 770 or GN(ANS) 713", "spring": false, "number": "726", "fall": true, "units": " 3", "description": "Advanced topics in statistics and population genetics pertinent to current research problems in genetics with special applications to forestry. Basic statistical and genetic theory reviewed as bases for intensive study of selection theory and experimental and mating design evaluation. Study of genetics of natural populations for evolutionary interest as well as for their implications to breeding theory."}, {"summer": false, "name": "Tree Improvement Research Techniques", "prerequisites": "Prerequisite: FOR 411 or GN 411", "spring": true, "number": "727", "fall": false, "units": " 3", "description": "Research methods involved in forest tree breeding and genetics programs. Emphasis on laboratory, greenhouse and field research techniques. Stress also on summary and presentation of research results."}, {"summer": false, "name": "Quantitative Forest Genetics Methods", "prerequisites": "Prerequisite: GN 703, ST 701", "spring": false, "number": "728", "fall": true, "units": " 3", "description": "Applications of basic quantitative genetic methods in forest tree breeding and genetic research.  Principles and procedures for partitioning experimental variance, estimating genetic parameters from different mating and test designs.  Predicting breeding value and gain and developing breeding strategies."}, {"summer": false, "name": "Advanced Forest Management Planning", "prerequisites": "Prerequisite: FOR 405 or FOR 434 or OR 501, Corequisite: FOR 772", "spring": true, "number": "734", "fall": false, "units": " 3", "description": "History, principles, structures and use of modern forest management planning and decision-making techniques.  Emphasis on optimization procedures and public forest management."}, {"summer": false, "name": "Ecological Restoration", "prerequisites": "Prerequisite: BO 360, SSC 200, Corequisite: BO 565", "spring": true, "number": "750", "fall": false, "units": " 3", "description": "Historical bases and philosophical examination of concepts of ecosystem restoration.  Mechanics of restoring soils, hydrology, plant community composition and structure, and landscape levels ecosystem functions.  Quantitative evaluations of restoration success."}, {"summer": false, "name": "Environmental Remote Sensing", "prerequisites": "Prerequisite: FOR 353", "spring": false, "number": "753", "fall": true, "units": " 3", "description": "Principles and applications of remote sensing technology to earth resources and environmental studies.  Electromagnetic energy, data acquisition platforms, sensors and scanners, processing of digital remotely sensed data, error analysis and accuracyassessments, and integration of remotely sensed data with other data types used in natural resource management."}, {"summer": false, "name": "The Practice Of Environmental Impact Assessment", "spring": false, "number": "784", "fall": true, "units": " 4", "description": "Impact assessment principles, practices and their evolution.  Lectures and field practicums concerning problems addressed by environmental assessment practitioners.  Practical implications of current regulatory requirements, especially concerning endangered species and wetlands, as they affect environmental practitioners' performance.  Required reports combine varied technical tasks and documentation for regulatory process review."}, {"summer": false, "name": "Advanced Special Topics in Forestry", "spring": true, "number": "795", "fall": true, "units": " 1-3", "description": "Individual students or groups of students, under direction of a faculty member, may explore topics of special interest not covered by existing courses. Format may consist of readings and independent study, problems or research not related to thesis.Also used to develop and test new 700-level courses."}, {"summer": true, "name": "Seminar", "spring": true, "number": "801", "fall": true, "units": " 1", "description": "Weekly seminar in which students registered for course present the results of research and special projects. Invitation to all graduate students and faculty in department to attend and join discussion."}, {"summer": false, "name": "Research Methods in Forestry and Environmental Resources", "prerequisites": "Prerequisite: Grad. standing", "spring": true, "number": "803", "fall": false, "units": " 1", "description": "Philosophy and objectives of scientific research and steps in the research process. Basic and applied research, inductive and deductive reasoning and need for hypothesis development and testing as a basis for scientific research. Special emphasis onpreparation of study plans, graduate theses, published articles and technical presentations."}, {"summer": true, "name": "Special Topics In Forestry", "spring": true, "number": "810", "fall": true, "units": " 1-3", "description": "Individual students or groups of students, under direction of a faculty member, may explore topics of special interest not covered by existing courses. Format may consist of readings and independent study, problems or research not related to thesis.Also used to develop and test new 800-level courses."}, {"summer": false, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "885", "fall": true, "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": false, "name": "Doctoral Preliminary Exam", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "890", "fall": true, "units": " 1-9", "description": "For students who are preparing for and taking written and/or oral preliminary exams."}, {"summer": false, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "893", "fall": true, "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": false, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "895", "fall": true, "units": " 1-9", "description": "Dissertation research."}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "896", "fall": false, "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": false, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "899", "fall": true, "units": " 1-3", "description": "For students who have completed all credit hour, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations."}]