[{"summer": false, "name": "Introduction to Food Science", "spring": true, "number": "201", "fall": true, "units": " 3", "description": "Science and practice of providing a wholesome, nutritious, economical and readily available supply of basic and processed foodstuffs.  Chemical nature of foods, nutritional requirements, health-related dietary considerations, microorganisms, foodborne illnesses, preservation and processing, food additives, food labeling, food safety and the consumer."}, {"summer": false, "name": "Principles of Food and Bioprocess Engineering", "prerequisites": "Prerequisite: PY 211", "spring": true, "number": "231", "fall": false, "units": " 4", "description": "Engineering concepts and their applications to the food and bioprocessing industries. Mass and energy balances and principles related to fluid flow, heat transfer, refrigeration and freezing, psychrometrics, and selected unit operations found in these industries."}, {"summer": false, "name": "Careers in Food and Bioprocessing Sciences", "spring": false, "number": "290", "fall": true, "units": " 1", "description": "Careers and opportunities related to food and bioprocessing industries and regulatory agencies. Development of professional enhancement skills. Resume preparation, interviewing techniques, leadership development, oral and written communication, and team building.  Benefits of undergraduate research, internships, and graduate education."}, {"summer": true, "name": "Special Topics in Food Science", "spring": true, "number": "295", "fall": true, "units": " 1-4", "description": "Offerings of new or experimental courses in Food Science at the early undergraduate level."}, {"summer": true, "name": "Introduction to Human Nutrition", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "301", "fall": true, "units": " 3", "description": "Functions, dietary sources and deficiencies of essential nutrients in humans; a balanced diet; role of nutrients in heart disease, cancer, hypertension, osteoporosis; weight control and eating disorders; vegetarianism; food safety; dietary supplements; government regulation of food supply; food quackery. Food science majors may use as a free elective only"}, {"summer": false, "name": "Muscle Foods and Eggs", "prerequisites": "Prerequisite: ZO 160, BIO 181 or BIO 183", "spring": false, "number": "322", "fall": true, "units": " 3", "description": "Processing and preserving fresh poultry, red meats, seafood, and eggs.  Ante- and post-mortem events as they affect quality, yield, and compositional characteristics of muscle foods.  Principles and procedures involved in the production of processedmeat items."}, {"summer": false, "name": "Milk and Dairy Products", "prerequisites": "Prerequisite: BIO 181 or 183, CH 101", "spring": true, "number": "324", "fall": true, "units": " 3", "description": "Introduction to the manufacture of dairy products.  Dairy processing procedures from the farm, through the dairy plant, and to the consumer are studied.  The course consists of 15 learning modules, three exams, and a project."}, {"summer": false, "name": "Science of Food Preparation", "prerequisites": "Prerequisite: FS 201 and CH 101", "spring": true, "number": "330", "fall": false, "units": " 3", "description": "Basic elements of culinary practices are taught in conjunction with the scientific basis for how flavor, texture, and appearance of foods are created or maintained during food preparation."}, {"summer": false, "name": "Introduction to HACCP", "spring": true, "number": "350", "fall": true, "units": " 3", "description": "Introductory course on the Hazard Analysis and Critical Control Points System (HACCP) which is designed to decrease hazards in foods.  An International HACCP Alliance approved curriculum which covers prerequisite programs.  A step by step approach for developing and implementing a HACCP plan for USDA regulated food processing plants. Offered only as a world wide web course through the Office of Instructional Telecommunications."}, {"summer": false, "name": "Sanitation Standard Operating Procedures in Food Safety Control", "spring": true, "number": "351", "fall": true, "units": " 3", "description": "This course is one of a series of six courses that are part of North Carolina State University's Food Safety Certification program. \"Sanitation Standard Operating Procedures (SSOP's) in Food Safety Control\" addresses current federal regulatory requirements for seafood, meat, and poultry processing operations.  The course also addresses the international dimensions of sanitary standards in import/export of food. The course is designed to provide the student with the background necessary to develop, implement and maintain a sanitation plan based on sanitation standard operating procedures (SSOP's)."}, {"summer": false, "name": "Introduction to Microbiological Food Safety Hazards", "spring": true, "number": "352", "fall": true, "units": " 3", "description": "For non-science students. The course is designed to provide an introduction to the more prominent microbial foodborne safety hazards and their control. Lessons are provided on specific pathogens, their pathogenesis and transmission and the scientific basis for specific control options. In addition, the course provides up-to-date information on current \"hot-topics\" in food microbiology, including food safety regulations and emerging food safety issues.Course is offered to non-science majors. Students may not receive credit for both FS 352 and FS 405."}, {"summer": false, "name": "Good Manufacturing Practices", "spring": true, "number": "353", "fall": true, "units": " 3", "description": "Food Safety sanitation in the United States is primarily regulated by FDA under their \"Good Manufacturing Practices (GMP).\" This course will introduce the student to the GMP and consider how and why they were developed. Students will become familiarwith the issues of compliance and consider the regulations in light of international laws and current practices. The student should have some familiarity with food processing and safety."}, {"summer": false, "name": "Food Sanitation", "prerequisites": "Prerequisite: FS/ANS/PO 350 or equivalent HACCP industry experience", "spring": true, "number": "354", "fall": true, "units": " 3", "description": "Discussion of hygienic practices, requirements for sanitation programs, and modern sanitation practices in food processing facilities. At the end of this course, students will have the knowledge to develop and maintain a sanitation program."}, {"summer": true, "name": "Advanced Nutrition and Metabolism", "prerequisites": "Prerequisite: (NTR 301 or NTR 415) and (CH 221 or CH 220)", "spring": false, "number": "401", "fall": true, "units": " 3", "description": "Credit will not be awarded for both NTR (FS) 401 and NTR (FS) 501."}, {"summer": false, "name": "Chemistry of Food and Bioprocessed Materials", "prerequisites": "Prerequisite: CH 220 or 221", "spring": false, "number": "402", "fall": true, "units": " 4", "description": "The course focuses on the properties of biological molecules (e.g., proteins, enzymes lipids, carbohydrates and pigments) found in foods and pharmaceuticals. Basic elements of molecules, such as structure and reactive groups, are presented in regard to how they affect the properties of foods and pharmaceuticals. Reactions such as Maillard browning and lipid oxidation are discussed regarding mechanisms, products and controlling processes. Laboratory experiments emphasize basic concepts discussed in lecture and provide a practical working knowledge of select analytical equipment."}, {"summer": false, "name": " Bioprocessing Science", "prerequisites": "Prerequisite: FS 402", "spring": true, "number": "403", "fall": false, "units": " 4", "description": "Principles, methods and techniques for quantitative physical and chemical analyses of food, nutraceutical, and pharmaceutical products. Results of analyses evaluated in terms of quality standards and governing regulations."}, {"summer": false, "name": "Food Microbiology", "prerequisites": "Prerequisite: MB 351", "spring": false, "number": "405", "fall": true, "units": " 3", "description": "Microorganisms of importance in foods and their metabolic activities.  Source of microbial contamination during food production, processing and storage. Microbial spoilage; foods as vectors of human pathogens. Physical and chemical destruction of microorganisms in foods and the kinetics involved. Conversions of raw foods by microorganisms into food products. Microbiological standards for regulatory and trade purposes. Credit will not be given for both FS/MB 405 and  FS/MB 505."}, {"summer": false, "name": "Food Microbiology Lab", "prerequisites": "Prerequisite: MB 351 and Corequisite: FS 405 or FS 505", "spring": false, "number": "406", "fall": true, "units": " 1", "description": "Laboratory experience to complement FS/MB 405.  Skills in detecting and quantitating microorganisms and their toxins in foods.  Application of colony and direct microscopic counts, most probable numbers, enzyme immunoassays, nucleic acid probes and computer modeling are used to understand the numbers and types of microorganisms or microbial end products in foods.  Laboratory safety and oral and written reports are emphasized."}, {"summer": false, "name": "Risk Analysis and Hazard Analysis in Food Safety", "prerequisites": "Prerequisite: FS/ANS/PS 350 or equivalent HACCP industry experience", "spring": true, "number": "407", "fall": true, "units": " 3", "description": "In-depth focus on the application of the first HACCP principle, Hazard Analysis, on the identification of food safety hazards, as well as the emerging importance of risk assessment. Distance Education Only."}, {"summer": false, "name": "Quality Control in Food and Bioprocessing", "prerequisites": "Prerequisite: FS 402, MB 351", "spring": true, "number": "416", "fall": false, "units": " 3", "description": "Organization and principles of quality control in the food and bioprocessing industries. Regulations and process control to maintain safety and quality. Evaluation of physical, microbiological, chemical, sensory, and stability testing for food and bioprocessed materials. Risk assessment, hazard analysis and critical control point (HACCP), process control, water quality, waste water analysis and reduction. Cleaning and sanitation and compliance inspection."}, {"summer": false, "name": "Food Preservation", "prerequisites": "Prerequisite: FS 231 and FS 405", "spring": false, "number": "421", "fall": true, "units": " 3", "description": "Food preservation methods. Emphasis on thermal, freezing, drying and fermentation processes and corresponding physical, chemical and organoleptic changes to products. Application of preservation schemes to the development of an overall processing operation."}, {"summer": false, "name": "Upstream Biomanufacturing Laboratory", "prerequisites": "Prerequisite: (MB 351 and FS 231) or MB/BEC 420 or CHE/BEC 463", "spring": true, "number": "426", "fall": true, "units": " 2", "description": "This course is an introduction to current food manufacturing practice (CGMP) as applied to the growth of microbial cells in bioreactors. Hands-on experience is obtained in the operation and control of 30 liter bioreactors to study agitation, oxygen transfer, cleaning, sterilization, media preparation and the growth of recombinant E. coli for protein production. Credit will not be awarded in both BBS 426 and BBS/FS 526. This is an eight week course."}, {"summer": "True", "name": "Food Laws and Regulations", "prerequisites": "Prerequisite: Junior standing.", "spring": "True", "number": "453", "fall": "True", "units": " 3", "description": "Federal and state laws and regulations, and case law history affecting food production, processing, packaging, marketing, and distribution of food and food products.  History of food law, enactment of laws and regulations, legal research, and regulatory agencies.Credit will not be given for both FS 453 and FS 553."}, {"summer": false, "name": "Postharvest Physiology", "prerequisites": "Prerequisite: PB 421", "spring": true, "number": "462", "fall": false, "units": " 3", "description": "Preharvest and postharvest factors that affect market quality of horticultural commodities with an emphasis on technologies to preserve postharvest quality and extend storage life of fruits, vegetables and ornamentals."}, {"summer": false, "name": "Problems and Design in Food and Bioprocessing Science", "prerequisites": "Prerequisite: FS 231, FS 402, FS 405 or BAE(BBS) 425", "spring": true, "number": "475", "fall": false, "units": " 3", "description": "Team approach to problem solving and product/process design and development.  Ingredient functionality; formulation, safety, processing, packaging, sensory evaluation, regulatory issues, hazard analysis, critical control points (HACCP), nutritional labeling and other pertinent scientific, technical, marketing and financial aspects.  Oral and written presentations are required."}, {"summer": false, "name": "External Learning Experience", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "492", "fall": true, "units": " 1-6", "description": "A learning experience in agriculture and life sciences within an academic framework that utilizes facilities and resources which are external to the campus. Contact and arrangements with prospective employers must be initiated by the student and approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior to the experience."}, {"summer": false, "name": "Special Problems in Food Science", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "493", "fall": true, "units": " 1-6", "description": "A learning experience in agriculture and life sciences within an academic framework that utilizes campus facilities and resources. Contact and arrangements with prospective employers must be initiated by the student and  approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior to the experience."}, {"summer": true, "name": "Special Topics in Food Science", "spring": true, "number": "495", "fall": true, "units": " 1-3", "description": "Offered as needed to present materials not normally available in regular course offerings or for offering new courses on a trial basis."}, {"summer": false, "name": "Advanced Nutrition and Metabolism", "prerequisites": "Prerequisite:  (NTR 301 or NTR 415 or NTR 500) and (CH 221 or CH 220)", "spring": false, "number": "501", "fall": true, "units": " 3", "description": "Nutritional biochemistry and physiology as it relates to establishment of nutrient requirements and Dietary Reference intakes.  Digestion, absorption, metabolism, storage, and excretion of nutrients and other markers of nutritional adequacy or excess with emphasis on micronutrients.   Functions of nutrients, in bone, muscle, blood, growth and development, and communication.  Credit will not be awarded for both NTR(FS) 401 and NTR(FS) 501."}, {"summer": false, "name": "Chemistry of Food and Bioprocessed Materials", "prerequisites": "Prerequisite: CH 220 or 221", "spring": false, "number": "502", "fall": true, "units": " 4", "description": "The course focuses on the properties of biological molecules (e.g., proteins, enzymes lipids, carbohydrates and pigments) found in foods and pharmaceuticals. Basic elements of molecules, such as structure and reactive groups, are presented in regard to how they affect the properties of foods and pharmaceuticals. Reactions such as Maillard browning and lipid oxidation are discussed regarding mechanisms, products and controlling processes. Laboratory experiments emphasize basic concepts discussed in lecture and provide a practical working knowledge of select analytical equipment."}, {"summer": false, "name": "Food Microbiology", "prerequisites": "Prerequisite: MB 351", "spring": false, "number": "505", "fall": true, "units": " 3", "description": "Microorganisms of importance in foods and their metabolic activities.  Source of microbial contamination during food production, processing and storage. Microbial spoilage; foods as vectors of human pathogens. Physical and chemical destruction of microorganisms in foods and the kinetics involved. Conversions of raw foods by microorganisms into food products. Microbiological standards for regulatory and trade purposes. Credit will not be given for both FS/MB 405 and  FS/MB 505."}, {"summer": false, "name": "Food Microbiology Lab", "prerequisites": "Prerequisite: MB 351 and Corequisite: FS 405 or FS 505", "spring": false, "number": "506", "fall": true, "units": " 1", "description": "Laboratory experience to complement FS/MB 405.  Skills in detecting and quantitating microorganisms and their toxins in foods.  Application of colony and direct microscopic counts, most probable numbers, enzyme immunoassays, nucleic acid probes and computer modeling are used to understand the numbers and types of microorganisms or microbial end products in foods.  Laboratory safety and oral and written reports are emphasized."}, {"summer": false, "name": "Food Lipids: Issues and Controversies", "spring": true, "number": "510", "fall": false, "units": " 3", "description": "Chemical, physical and functional properties of lipids or fats.  Effects of processing technologies on composition, stability and functional properties of lipids in food systems.  Biological and nutritional properties of different classes of lipids. Topical discussions of the role of lipids and lipid-soluble components as biological response modifiers in human and invitro model systems.  Credit will not be given for both NTR/FS 510 and NTR/FS 710."}, {"summer": false, "name": "Pre-Harvest Food Safety", "spring": false, "number": "520", "fall": true, "units": " 3", "description": "Dairy, beef, swine, poultry, and seafood modules: production, government regulation of products, use of antimicrobials in production, and the emergence of resistant human pathogens.  Field fruit and vegetable crops section: hazards in food includingpesticide residues and philosophy and practice of organic farming and public's perception of food and biotechnology."}, {"summer": false, "name": "Food Preservation", "prerequisites": "Corequisite: MB 351", "spring": false, "number": "521", "fall": true, "units": " 3", "description": "Food preservation methods. Emphasis on thermal, freezing, drying and fermentation processes and corresponding physical, chemical and organoleptic changes to products. Application of preservation schemes to the development of an overall processing operation."}, {"summer": false, "name": "Food Packaging", "spring": true, "number": "522", "fall": false, "units": " 3", "description": " Agricultural Engineering Program."}, {"summer": false, "name": "Upstream Biomanufacturing Laboratory", "prerequisites": "Prerequisite: MB 351 and FS 231 or MB/BEC 420", "spring": true, "number": "526", "fall": true, "units": " 2", "description": "This course is an introduction to current food manufacturing practice (CGMP) as applied to the growth of microbial cells in bioreactors. Hands-on experience is obtained in the operation and control of 30 liter bioreactors to study agitation, oxygen transfer, cleaning, sterilization, media preparation and the growth of recombinant E. coli for protein production. Credit will not be awarded in both BBS 426 and BBS/FS 526. This is an eight week course."}, {"summer": false, "name": "Post-Harvest Food Safety", "prerequisites": "Prerequisite: MB 351/352", "spring": false, "number": "530", "fall": true, "units": " 3", "description": "Background on the current issues and developments associated with post-harvest food safety, including biological, chemical, and physical food safety hazards.  Additionally, regulations governing food safety and consumer perceptions."}, {"summer": false, "name": "Food Safety and Public Health", "prerequisites": "Prerequisite: MB 351/352", "spring": true, "number": "540", "fall": false, "units": " 3", "description": "Issues and developments related to the relationship between food safety and public health, including emerging foodborne pathogens; virulence and pathogenicity; foodborne toxins; epidemiological techniques used in the investigation of foodborne disease; rapid detection methods; and quantitative microbial risk assessment in food safety."}, {"summer": false, "name": "Food Industry Study Tour", "spring": true, "number": "550", "fall": false, "units": " 2", "description": "The Food Industry Study Tour is designed to give students a behind the scenes look into the food processing industry. This week-long trip, will allow students to travel throughout the region, touring various meat, dairy, seafood, produce, cereal, snack food, beverage, and candy production facilities. The class trip will run 5-6 days during the week of Spring Break holiday. Enrollment is limited and subject to the permission of the instructor."}, {"summer": "True", "name": "Food Laws and Regulations", "spring": "True", "number": "553", "fall": "True", "units": " 3", "description": "Federal and state laws and regulations and case law history affecting food production, processing, packaging, marketing and distribution of food and food products. History of food law, enactment of laws and regulations, legal research, and regulatory agencies.  Credit for both FS 453 and FS 553 is not allowed."}, {"summer": false, "name": "Lactation, Milk, and Nutrition", "prerequisites": "Prerequisite: ANS 230 or FS/NTR 400; BCH 451 or ZO 421", "spring": true, "number": "554", "fall": false, "units": " 3", "description": "Nutritional properties of milk as a high-quality food with nutritional diversity.  Principles of physiology, biochemistry and cell biology in the mammary gland.  Procedures of milk production and milk collection for milk quality and nutrition.  Human lactation vs. that of domestic animals.  Impacts of biotechnology and food safety on dairy production. Credit will not be given for both ANS 454 and 554."}, {"summer": false, "name": "Exercise Nutrition", "prerequisites": "Prerequisite: NTR 400/500", "spring": true, "number": "555", "fall": false, "units": " 3", "description": "Metabolism of macro- and micronutrients as affected by exercise and physical activity. Effects of dietary patterns, specific foods, dietary supplements and ergogenic aids on sports performance. Reading and discussion of current literature and individual or group projects."}, {"summer": false, "name": "Nutraceuticals and Functional Fooods", "spring": false, "number": "557", "fall": true, "units": " 3", "description": "This course evaluates the weight of evidence from peer-reviewed scientific literature relating food bioactives, whole foods, and diets to disease prevention, athletic performance, and cognitive development/enhancement.  Data are viewed in the context of processing effects, global food and supplement regulations, as well as commercial marketing claims.  Key concepts include dose-response, signal transduction, and the use of advanced technologies such as genomics, proteomics and metabolomics.  Students will work in teams to develop and write a critical review manuscript suitable for publication."}, {"summer": false, "name": "Postharvest Physiology", "prerequisites": "Prerequisite: PB 321", "spring": true, "number": "562", "fall": false, "units": " 3", "description": "Pre- and post-harvest factors that affect market quality of horticultural commodities with an emphasis on technologies to preserve quality and extend storage life of crops."}, {"summer": false, "name": "Sensory Analysis of Foods", "prerequisites": "Prerequisite: Statistics 511", "spring": true, "number": "567", "fall": false, "units": " 3", "description": "Techniques of sensory analysis and data interpretation, a crucial aspect of food science research and marketing both at the academic and industrial levels. Fundamental and applied aspects of sensory analysis of foods, including human senses, descriptive analysis, scaling, consumer testing and sensory-instrumental relationships."}, {"summer": false, "name": "Professional Development and Ethics in Food Safety", "prerequisites": "Prerequisite: FSA 520 or FSA 530 or FS 540", "spring": true, "number": "580", "fall": false, "units": " 1", "description": "Professional development and thics related to food safety.  Foof safety communications to lay-audiences and the media; the ethical frontier between science/policy and science/profit.  Planned student and faculty presentations as well as guest lectures on current topical issues."}, {"summer": true, "name": "Special Problems In Food Science", "prerequisites": "Prerequisite: Graduate standing or Senior standing", "spring": true, "number": "591", "fall": true, "units": " 1-6", "description": "Analysis of scientific, engineering and economic problems of current interest in foods. Problems designed to provide training and experience in research."}, {"summer": "True", "name": "Special Research Projects in Food Science", "spring": "True", "number": "592", "fall": "True", "units": " 1-3"}, {"summer": true, "name": "Special Problems In Food Science", "prerequisites": "Prerequisite: Graduate standing or Senior standing", "spring": true, "number": "620", "fall": true, "units": " 1-6", "description": "Analysis of scientific, engineering and economic problems of current interest in foods. Problems designed to provide training and experience in research."}, {"summer": true, "name": "Special Research Problems In Food Science", "spring": true, "number": "623", "fall": true, "units": " 1-3", "description": "Directed research in a specialized phase of food science designed to provide experience in research methodology and philosophy."}, {"summer": false, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "685", "fall": true, "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "688", "fall": true, "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "689", "fall": true, "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": false, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "690", "fall": true, "units": " 1-6", "description": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam."}, {"summer": false, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "693", "fall": true, "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": false, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "695", "fall": true, "units": " 1-9", "description": "Thesis research."}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "696", "fall": false, "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": false, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "699", "fall": true, "units": " 1-3", "description": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their theses."}, {"summer": false, "name": "Vitamin Metabolism", "prerequisites": "Prerequisite: ANS(NTR,PO) 415 and BCH 453", "spring": false, "number": "706", "fall": true, "units": " 2", "description": "Structures, chemical and physical properties, functions, deficiency symptoms, distribution, absorption, transport, metabolism, storage, excretion and toxicity of vitamins in humans and domestic animals. Nutritional significance of essential fatty acids and metabolism of prostaglandins, prostacyclins and leucotrienes."}, {"summer": false, "name": "Fermentation Microbiology", "prerequisites": "Prerequisite: BCH 451, MB 351", "spring": true, "number": "725", "fall": false, "units": " 3", "description": "Fermentation bioprocessing and characteristics, function and ecology of responsible microorganisms.  Fermentative activities, growth responses and culture interactions related to metabolism, physiology and genetics of lactic acid bacteria and selected yeasts and molds. Current developments in starter culture technology and genetics; application to food and industrial fermentations."}, {"summer": false, "name": "Human Nutrition", "prerequisites": "Prerequisite: FS 400 or NTR 415 or 419; BCH 451", "spring": true, "number": "730", "fall": false, "units": " 3", "description": "Biochemical and physiological bases of nutrition. Human nutrient requirements, assessment of nutritional status, clinical and subclinical disorders resulting from nutrient deficiencies or inadequacies."}, {"summer": false, "name": "Thermal Processing of Foods", "prerequisites": "Prerequisite: FS 231", "spring": true, "number": "741", "fall": false, "units": " 3", "description": "Fluid flow, heat transfer, food preservation, kinetics of chemical, microbiological, and enzymatic reactions, decimal reduction time, pasteurization, sterilization, cook value, process lethality, canning of foods, thermal process evaluation, qualityconsiderations, optimization, shelf-life studies, thermal processing equipment, hot-fill, extended shelf-life products, heat exchanger design, pumps, sanitation, aseptic processing, minimal processing, NFPA bulletins, alternative processing technologies, regulatory issues, HACCP."}, {"summer": false, "name": "Food Ingredient Technology In Product Development", "prerequisites": "Prerequisite: FS 402, FS 405, FS 421", "spring": true, "number": "751", "fall": false, "units": " 4", "description": "Chemistry and functional properties of major food ingredient materials. Legal and regulatory restrictions, as well as consumer biases, in existence with respect to selection of ingredients, package materials, processes and labeling statements.  Necessary skills and techniques for efficiently and successfully conducting food product development projects in a competitive corporate setting."}, {"summer": false, "name": "Polymer and Colloidal Properties of Foods", "prerequisites": "Prerequisite: CH 221, CH 223, FS 402", "spring": true, "number": "765", "fall": false, "units": " 3", "description": "Theoretical and practical elements of applying principles from polymer and colloidal chemistry to foods.  Major focus on proteins and polysaccharides in sols, foams, emulsions and gels."}, {"summer": false, "name": "Seminar In Food Science", "spring": true, "number": "780", "fall": true, "units": " 1", "description": "Preparation and presentation of scientific papers, progress reports and research and special topics of interest in foods."}, {"summer": false, "name": "Food Rheology", "prerequisites": "Prerequisite: FS 331 or MAE 314", "spring": false, "number": "785", "fall": true, "units": " 3", "description": "Principles and methods for measuring rheological properties. Theories of elastic, viscous, viscoelastic and viscoplastic behavior and relationships to food texture and commodity damage during harvest, handling and processing. Influence of time, composition and processing."}, {"summer": true, "name": "Special Problems in Food Science", "spring": true, "number": "791", "fall": true, "units": " 1-3", "description": "Directed research in a specialized phase of food science designed to provide experience in research methodology and philosophy.Credits Arranged."}, {"summer": true, "name": "Special Research Projects in Food Science", "spring": true, "number": "792", "fall": true, "units": " 1-3", "description": "Credits Arranged"}, {"summer": true, "name": "Special Problems In Food Science", "prerequisites": "Prerequisite: Graduate standing or Senior standing", "spring": true, "number": "820", "fall": true, "units": " 1-6", "description": "Analysis of scientific, engineering and economic problems of current interest in foods. Problems designed to provide training and experience in research."}, {"summer": true, "name": "Special Research Problems In Food Science", "spring": true, "number": "823", "fall": true, "units": " 1-3", "description": "Directed research in a specialized phase of food science designed to provide experience in research methodology and philosophy."}, {"summer": false, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "885", "fall": true, "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": false, "name": "Doctoral Preliminary Exam", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "890", "fall": true, "units": " 1-9", "description": "For students who are preparing for and taking wirtten and/or oral preliminary exams."}, {"summer": false, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "893", "fall": true, "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": false, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "895", "fall": true, "units": " 1-9", "description": "Dissertation research."}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "896", "fall": false, "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": false, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "899", "fall": true, "units": " 1-3", "description": "For students who have completed all credit hour, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations."}]