[{"summer": "True", "name": "The Textile Industry", "prerequisites": "Prerequisite: TT 105", "spring": "True", "number": "217", "fall": "True", "units": " 3", "description": "Study of the structure and organization of the integrated textile complex and its strategic functions.  Critical stages involved in the manufacture of textile and apparel products.  Fundamental aspects of cost management and finance as related to the integrated Textile Complex.  One Saturday attendance during the semester is required."}, {"summer": "True", "name": "Fashion Product Analysis", "spring": "True", "number": "219", "fall": "True", "units": " 3", "description": "Concepts and practices for the production and evaluation of fashion goods, beginning with selection of fabric and other raw materials and extending through quality analysis of the final product. Provide techniques for production of a variety of garment applications, as well as methods for evaluation."}, {"summer": true, "name": "Principles of Retailing and Supply Chain Management in Textiles", "prerequisites": "Prerequisite: FTM 217", "spring": true, "number": "220", "fall": true, "units": " 3", "description": "Introduction to theories and principles in fashion and textiles retailing and supply chain management including: the framework of textile retailing, textile retail strategies, textile supply chains and investigation of the strategic planning process. Emphasis placed on conducting an environmental scan, identifying and targeting the consumer, analyzing the trade area, site selection and textile product merchandise planning."}, {"summer": "True", "name": "Computer-Aided Textile Design", "prerequisites": "Prerequisite: DF 101 or ADN 111", "spring": "True", "number": "271", "fall": "True", "units": " 3", "description": "Introduction to the operation of design software for woven, knitted and printed textiles.  Adobe Photoshop, Pointcarre' and Monarch programs will be taught.  Peripheral equipment essential to the design process will be included.  Field trips to areatextile design centers. Credit not allowed for students enrolled in TT curriculum with the exception of the dual degree in the Bachelor of Art and Design and BS in Textile Technology."}, {"summer": "True", "name": "Introduction to Textile Brand Management and Marketing", "spring": "True", "number": "282", "fall": "True", "units": " 3", "description": "An introduction to the essential elements of brand management and marketing with specific reference to the marketing of textile and apparel goods with the integrated textile complex (from fiber to retail). The course covers both the principles and practice of marketing, in general, and provides an introduction of major concepts of brand management and marketing with a focus on branding activities used in by major textile and apparel firms within the integrated textile supply chain."}, {"summer": false, "name": " New Product Development in Textiles", "prerequisites": "Prerequisite: Junior standing", "spring": true, "number": "310", "fall": true, "units": " 3", "description": "Academic dimensions of the entrepreneurship body of knowledge. Integration of new product development (NPD) process and entrepreneurship in textiles. Critical thinking skills for the textile entrepreneurial mindset. Teams exercise entrepreneurial skills to develop innovative textile products. Write a business plan to take the textile product to market. Multidisciplinary and experiential learning environment is cultivated through in-class activities and online collaboration."}, {"summer": "True", "name": "Fashion Product Design", "prerequisites": "Prerequisite: FTM 217 and FTM 219", "spring": "True", "number": "315", "fall": "True", "units": " 3", "description": "Concepts and practices for the design and development of fashion apparel items, beginning with selection of fabric and other raw materials and extending through flat pattern development, pattern engineering, and generation of final garments.  Provide techniques for development of styled patterns, which address issues of body measurements, body shape, comfort and fit."}, {"summer": "True", "name": "Computer-Aided-Design for Apparel", "prerequisites": "Prerequisite: FTD 215 or Corequisite: FTM 315", "spring": "True", "number": "317", "fall": "True", "units": " 3", "description": " other sewn products.  Euphoria and/or Artworks visual design programs, Gerber Accumark or Lectra pattern design programs, and other programs used by the industry to create, market and/or visualize products will be taught.  Peripheral equipment essential to the design process will be included."}, {"summer": "True", "name": "Fashion Development Processes", "prerequisites": "Prerequisite: FTM 317", "spring": "True", "number": "318", "fall": "True", "units": " 3", "description": "The principles of apparel manufacturing including computerization of the design; marker making and production areas; spreading and cutting technology; apparel assembly systems; production systems evaluations; fusing and pressing; production capacity; and quality evaluations."}, {"summer": false, "name": "Retail Merchandising in Fashion and Textiles", "prerequisites": "Prerequisite: FTM 220", "spring": false, "number": "320", "fall": true, "units": " 3", "description": "An in-depth study of textile product merchandising and its functions, focusing on a comprehensive approach to textile product merchandising that links manufacturing and retailing to the consumer through the merchandising process. Textile merchandising as a process is studied in newly restructured consumer-centric businesses and textile product strategy needed for employees to function successfully in today's global, integrated world of merchandising."}, {"summer": "True", "name": "Dress, Style, Change", "spring": "True", "number": "352", "fall": "True", "units": " 3", "description": "Interdisciplinary course focusing on historical and cultural principles of style as related to dress and fashion. Examination of fashion and stylistic trends in cycles of dress."}, {"summer": false, "name": "Management and Control of Textile and Apparel Systems", "prerequisites": "Prerequisite: FTM 217; Corequisite: TT 221", "spring": true, "number": "380", "fall": true, "units": " 3", "description": "Management approaches, practices and basic economic considerations in the development, production and distribution of industrial and consumer textile and apparel products."}, {"summer": "True", "name": "Intermediate Textile Brand Management and Marketing", "prerequisites": "Prerequisite: FTM 282 and (EC 201 or ARE 201)", "spring": "True", "number": "382", "fall": "True", "units": " 3", "description": "This course builds on the introduction of the basic concepts introduced in TAM 282 by providing an in-depth examination of the major theories and concepts associated with brand management and brand marketing. Included is the identification and analysis of major strategic tools used for brand management and marketing activities by firms across the integrated textile complex. Students will be assigned practical application projects that require utilization of academic knowledge with industry application."}, {"summer": "True", "name": "Visual Merchandising Principles and Management", "prerequisites": "Prerequisite: Junior standing or higher, FTM 217, Corequisite: FTM 382", "spring": "True", "number": "384", "fall": "True", "units": " 3", "description": "Study and application of techniques in the effective display of merchandise, from fiber to finished product.  The focus of the course placed on the integration of textile and apparel product characteristics, target market characteristics and the latest merchandising technology and concepts."}, {"summer": "True", "name": "Fashion and the Consumer", "prerequisites": "Prerequisite: FTM 217, FTM 282", "spring": "True", "number": "385", "fall": "True", "units": " 3", "description": "This course focuses on consumer decision process for textile products, including the study of environmental, individual, psychological and marketing influences on behavior of consumers in the textile consumption process. Further examination will include influences on the process, including fashion theories, the mass media, demographics and psychographics, and societal trends. Current development and research in the textile consumer decision process are reviewed."}, {"summer": false, "name": " Promotions", "prerequisites": "Prerequisite: FTM 382", "spring": true, "number": "387", "fall": true, "units": " 3", "description": "Examines the utilization of textile brand marketing communication and promotion tools to build, maintain or expand a brand's value in the textile complex marketplace. Includes examination of principles and theories for Integrated Brand Marketing (IBMC) and how these strategies and tactics are used within the textile complex advance brand positioning. Knowledge of IBMC will be demonstrated via case studies, examination and textile industry-related application projects. FTM Majors Only"}, {"summer": "True", "name": "Major Fashion Designers", "spring": "True", "number": "400", "fall": "True", "units": " Performing Arts", "description": "Study of fashion designers from the early 1800s to the present. Emphasis will be placed on historical and cultural events that may have influenced the work of fashion designers during the time and trends that have emerged. Of specific interest will be major historical and current fashion designers that have had an international influence on US fashion merchandise. An additional focus of the course will be on the career path of major fashion designers. A study of haute couture and pret-a-porter will be conducted to provide insight into special management issues."}, {"summer": "True", "name": "Fashion Product Development", "prerequisites": "Prerequisite: FTM 318", "spring": "True", "number": "415", "fall": "True", "units": " 3", "description": "Fashion product development for specific target markets. Line production using various methods of generating patterns for mass-produced apparel with emphasis on \"flat pattern\" design techniques. Relationship of body configuration to pattern shape, specifications to garment size and fit, standards for judging fit, distinctions between ease and style fullness, and design analysis procedures are included."}, {"summer": "True", "name": "The Fashion Industry", "prerequisites": "Prerequisite: Senior standing", "spring": "True", "number": "416", "fall": "True", "units": " 3", "description": "Planning and sourcing of fashion apparel products to meet the needs of the consumer. Emphasis is placed on the role of the merchandiser and merchandising function together with the measures of performance required by the fashion businesses. The interactions of the merchandiser with the functions of marketing, design, development and sourcing during pre-production are studied with respect to successful sourcing. Sourcing is studied from the requirements of compliance, product quality, cost, and manufacturing capability."}, {"summer": false, "name": "Retail Buying in Fashion and Textiles", "prerequisites": "Prerequisite: FTM 320", "spring": true, "number": "420", "fall": false, "units": " 3", "description": "Overview and analysis of the components of buying and selling products at he retail level. Management of profit factors to improve performance in textile merchandising driven organizations. Analysis of the practices, procedures and systems that track textile merchandising decisions and aid in meeting profit goals. The course consists of an integrated framework that applies merchandising theory and mathematical processes to textile retail problems."}, {"summer": "True", "name": "Quality Management and Control In Textile Manufacturing", "prerequisites": "Prerequisite: TT 221, TT 252, TT 331, and ST 361 or BUS 350", "spring": "True", "number": "431", "fall": "True", "units": " 3", "description": "Principles of quality and process management and control in textile/apparel manufacturing with emphases in quality management systems, quality costs, statistical control chart procedures, process capability, acceptance sampling, and optimal process and product design and improvement methods."}, {"summer": false, "name": "Textile Market Research", "prerequisites": "Prerequisite: FTM 382 and ST 361", "spring": true, "number": "460", "fall": true, "units": " 3", "description": "Data from textile and apparel industry firms are utilized to explore the role of marketing research in managerial decision-making within the textile and apparel industry, and allow students to develop basic skills in the market research process (problem identification to final reporting). Topics included are problem formulation, research design, data collection (instruments and sampling), and data analysis techniques (qualitative and quantitative)."}, {"summer": "True", "name": "Operations Management Decisions for Textiles", "prerequisites": "Prerequisite: TT/FTM 380 and ACC 210 and [(MA 131 and MA 132) or MA 141] and (ST 311 or ST 361 or BUS 350 or ST 370)", "spring": "True", "number": "480", "fall": "True", "units": " 3", "description": "Quantitative techniques for decision making and management in the textile complex. Applications include vendor selection, plant location, retail inventory management, forcasting demand, project management, and logistics planning. Techniques covered include simulation, PERT/CPM, mathematical modeling."}, {"summer": "True", "name": "Product Costing in the Textile and Apparel Industry", "spring": "True", "number": "481", "fall": "True", "units": " 3", "description": "Capstone course covering cost issues in yarn manufacturing, fabric formation, finishing, apparel production and retail operations.  Traditional and activity-based costing systems will be addressed.  Relevance of costing to managerial decisions as well as cost reduction strategies will be emphasized."}, {"summer": "True", "name": "Advanced Textile Brand Management and Marketing", "prerequisites": "Prerequisite: FTM 382", "spring": "True", "number": "482", "fall": "True", "units": " 3", "description": "An applied textile marketing course that integrates textile product development, brand management, and global marketing. This course provides an overview of the global textile and apparel industries, their distribution channels and markets---with positioning the US textile, apparel, and retail industries in the global competitive environment. The course includes diverse textile end uses, including apparel, nonwovens, home textiles, transportation textiles and medical textiles. Development and implementation strategies of launching textile products in the global marketplace are analyzed."}, {"summer": "True", "name": " Sourcing", "prerequisites": "Prerequisite: FTM 282 and EC 201 or ARE 201 or EC 205", "spring": "True", "number": "483", "fall": "True", "units": " 3", "description": "This course provides students with an understanding and appreciation of the global textile and apparel market. Included is the explanation and guidance in understanding the uniqueness of textile and apparel regulations in global trade. Students willlearn global sourcing strategies and the identification and analysis of major strategic decisions used in global sourcing, as impacted by global trade dynamics. Students will be assigned practical application projects that require utilization of academic knowledge with industry application."}, {"summer": "True", "name": "Management Decision Making for the Textile Firm", "prerequisites": "Prerequisite: FTM 380 and EC 201 or ARE 201 or EC 205", "spring": "True", "number": "484", "fall": "True", "units": " 3", "description": "Economic, institutional and environmental settings within which management decisions are made, including in-depth analyses of specific issues and problem areas affecting the textile industry. Special emphasis on strategic management and topics of current interest and significance."}, {"summer": false, "name": "Textile Computer Integrated Enterprise", "prerequisites": "Prerequisite: TT/FTM 380", "spring": false, "number": "485", "fall": true, "units": " 3", "description": "Survey of information technology in textile and apparel industries. Topics discussed include: computer aided design (CAD); computer aided manufacturing (CAM); computer aided engineering (CAE); material handling systems; automation and robotics; logistics and warehousing systems; retail product tracking, and Internet resources."}, {"summer": false, "name": "Supply Chain Management in the Textile Industry", "prerequisites": "Prerequisite: TT/FTM 380", "spring": true, "number": "486", "fall": false, "units": " 3", "description": "Study of the operations necessary to produce and distribute a product, starting with the procurement of the raw material used in making the goods and ending with the delivery of the finished product. Topics covered include approaches to solving problems in manufacturing, sourcing, transportation logistics, and retail operations within the Integrated Textile Complex. Credit cannot be given for both TAM486 and MT386."}, {"summer": "True", "name": "Textile and Apparel Labor Management", "prerequisites": "Prerequisite: Senior standing", "spring": "True", "number": "487", "fall": "True", "units": " 3", "description": "Labor management problems. Emphasis directed toward role of production supervision in textile  and apparel plants. Study of NLRB decisions and court opinions involving textile and apparel corporations."}, {"summer": "True", "name": "Development Projects in Textile and Apparel Management", "prerequisites": "Prerequisite: Junior standing and 2.75 GPA", "spring": "True", "number": "490", "fall": "True", "units": " 1-3", "description": "Directed research in Textile and Apparel Management through experimental, theoretical and literature studies in textile and apparel-related problems. Courses may be taken twice provided projects are different subject matter."}, {"summer": "True", "name": "Special Topics in Textile and Apparel Management", "prerequisites": "Prerequisite: Senior standing", "spring": "True", "number": "491", "fall": "True", "units": " 1-4", "description": "Special topics related to textile and apparel management."}, {"summer": "True", "name": "International Industrial Internship in Textile Management", "prerequisites": "Prerequisite: At least FL 202 for internships in non-English speaking countries, Minimum GPA 2.5, Junior standing", "spring": "True", "number": "494", "fall": "True", "units": " 3", "description": "Professional level work experience in textile management abroad, relating academic training, international textile management and technology to industrial practice under professional guidance.  Grading based on written report and oral presentation."}, {"summer": false, "name": "Senior Fashion Collection Studio", "prerequisites": "Prerequisite: FTM 318", "spring": true, "number": "497", "fall": false, "units": " 6", "description": "Advanced fashion product design. Design and production of a \"collection\" using various methods of generating patterns for garments, such as flat pattern, draping, and CAD techniques. Relationships of body configuration and fabrication to garment design. Emphasis on ideation, creativity, communication, theme development, fit, quality, and exhibition of a fashion collection. Work culminates in a Fashion show or Static exhibition format."}, {"summer": "True", "name": "Textile Senior Project", "prerequisites": "Prerequisite: Senior standing", "spring": "True", "number": "499", "fall": "True", "units": " 4", "description": "This is a project based course to be taken in the last semester of the Senior year.  In this capstone course the students work in cross-functional teams to research and solve applied problems in textile related fields.  The results of the projects will be presented formally at the end of the semester. Course should be taken in the last semester of the Senior year.  It cannot be substituted by other project courses."}]