[{"summer": "True", "name": " Youth Development", "spring": "True", "number": "500", "fall": "True", "units": " 3", "description": " youth development, students will work with a faculty member or organizations to design a Masters capstone study project that aligns with their professional goals. Faculty supervision required."}, {"summer": "True", "name": " Youth Development", "spring": "True", "number": "501", "fall": "True", "units": " 3", "description": "This course will critically compare and evaluate the primary developmental theories and their usefulness in predicting behavior, cognition, and social-emotional growth.  The course is designed to prepare practitioners for educational service deliver to examine how theories guide practice in child and youth development."}, {"summer": "True", "name": "Theories in Family Sciences", "spring": "True", "number": "502", "fall": "True", "units": " 3", "description": "This course will critically compare and evaluate the major human development theories and their application to family life and youth development and examine the usefulness of theory in describing, explaining, predicting, or changing behavior."}, {"summer": "True", "name": "Family Relationships Over the Life Course", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "523", "fall": "True", "units": " 3", "description": "Applications of theories and research about interpersonal relationships and family dynamics to issues facing families over the life course, emphasizing the interplay of social, developmental and health factors in affecting change, continuity and well-being."}, {"summer": "True", "name": "Gerontology in Family Life Education", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "524", "fall": "True", "units": " 3", "description": "The course will examine the social context of aging, the lived experience of aging as reported by older persons, and the interaction of individuals and families with social institutions and community systems of care, including the \"aging network\"."}, {"summer": "True", "name": "Effective Management of Family Resources", "prerequisites": "Prerequisite: Graduate student status or any PBS student.", "spring": "True", "number": "531", "fall": "True", "units": " 3", "description": " organizational management, stress management); human and social capital (education, skill building, health, employability, relationships); physical capital (transportation, real estate, and housing); financial management (credit and debt, budgeting, retirement issues, bankruptcy)."}, {"summer": "True", "name": "Complex Family Issues", "prerequisites": "Prerequisite: Graduate standing or instructor consent", "spring": "True", "number": "533", "fall": "True", "units": " 3", "description": " single parenting; gang memberships, suicidal ideation, sexuality/teen pregnancy; and rape and other acts of violence.  The course will include a discussion of evidence-based prevention and treatment options for referring clients, and a debate of the role of educators in this process."}, {"summer": "True", "name": " Well-being", "spring": "True", "number": "535", "fall": "True", "units": " 3", "description": "Students must have completed a Bachelor's of Science."}, {"summer": "True", "name": "Environmental Influences on the Family", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "540", "fall": "True", "units": " 3", "description": "The course will include an examination of social, economic, and behavioral housing theory, historical and current housing policy and its relationship to the housing, neighborhoods and community development and an investigation of diverse populations and their housing/neighborhood concerns."}, {"summer": "True", "name": "Applied Concepts in Parenting and Family Life Education", "spring": "True", "number": "543", "fall": "True", "units": " 3", "description": "Theoretical and empirical literature in lifespan, family life, and parent education will be explored along with implications for issues affecting families including content, delivery, and evaluation of parent education programs. Offered either face-to-face or in person via Distance Education."}, {"summer": "True", "name": "Family and Youth Professionals as Leaders", "spring": "True", "number": "550", "fall": "True", "units": " 3", "description": "This course examines the application of classic and contemporary theories and models of leadership to the work of community-based organizations.  Students will examine leadership from diverse perspectives; then analyze the strengths and weaknesses of leadership theories and models when applied to organizational development of community-based systems."}, {"summer": "True", "name": " Family Settings", "spring": "True", "number": "552", "fall": "True", "units": " 3", "description": "Historical and contemporary foundations of program development and evaluation in non-formal, community-based family life and youth development settings are examined including theory, research, and three holistic  program development constructs: 1) planning; 2) design and implementation; 3) impact evaluation and accountability."}, {"summer": "True", "name": "Applied Concepts in Child and Youth Development", "spring": "True", "number": "553", "fall": "True", "units": " 3", "description": " practice."}, {"summer": "True", "name": " Youth Settings", "spring": "True", "number": "554", "fall": "True", "units": " 3", "description": "To prepare educators (formal and non-formal) to better establish, lead and manage collaborations and partnerships in family settings and those that support holistic community-based youth development organizational systems.  Specific foci include: types and levels of partnerships; environmental scanning and socio-organizational linkage contextual factors affecting community collaborations; leadership factors affecting community collaborations; and human, financial and programmatic management in collaborations.  Some on-campus meetings are required."}, {"summer": "True", "name": "Organizational Systems in Youth and Family Settings", "spring": "True", "number": "556", "fall": "True", "units": " 3", "description": "Preparation for current and future community family and youth development professionals leading and managing community-based organizations. Course includes: fundamentals of management and leadership; institutional and organizational structures; administrative and strategic planning; working with advisory and governing groups; marketing and program delivery systems; information management systems; and human resource, financial, facilities and risk management systems."}, {"summer": "True", "name": "Volunteerism in Youth and Family Settings", "spring": "True", "number": "557", "fall": "True", "units": " 3", "description": "Preparation for current and future community-based youth and family professionals to better manage volunteers in local program service delivery.  Specific foci include: volunteerism as a social phenomenon; volunteer resource management; new forms of volunteerism; and future trends in volunteerism. Restricted to graduate and post-baccalaureate students only."}, {"summer": "True", "name": "Contemporary Issues in Volunteer Resource Management", "spring": "True", "number": "558", "fall": "True", "units": " 3", "description": "In-depth examination of current and emerging issues and trends impacting volunteer involvement in community-based youth and family organizations to prepare current and future youth and family professionals to manage volunteers in local program delivery; examining contemporary research related to trends and issues, and evaluating historical and current social phenomena so as to understand their impact upon volunteer involvement and consider future challenges for volunteer administrators.  Restricted to graduate and post-baccalaureate students only."}, {"summer": "True", "name": "Administration and Supervision of Youth and Family Programs", "spring": "True", "number": "559", "fall": "True", "units": " 3", "description": "Fundamental concepts and theories of administration and management as applied to family life and youth development organizational contexts with emphasis given to organizing and managing human resources and including business operations, planning, decision-making, organizing, staffing, communicating, motivating, leading, and controlling."}, {"summer": "True", "name": "Contemporary Issues in Community Youth Development", "spring": "True", "number": "585", "fall": "True", "units": " 3", "description": "Students will explore social, cultural, political, and/or organizational underpinnings of youth issues as focused in (1) issues facing community-based youth serving organizations themselves (e.g., mission, structure, funding, staffing, impact and accountability, and politics, etc); and (2) issues facing the youth audiences served by the organizations  (e.g., healthy lifestyles/obesity/substance abuse, sexuality, youth-against-youth violence, career exploration and workforce development, civic engagement, academic success and school drop-out, etc.)."}, {"summer": "True", "name": "Special Problems Family Life and Youth Development", "spring": "True", "number": "590", "fall": "True", "units": " 1-6", "description": "Special Problems Family Life and Youth Development"}, {"summer": "True", "name": " Youth Development", "spring": "True", "number": "630", "fall": "True", "units": " 3", "description": "Students engaged in independently designed study guided by specific objectives constructed under the supervision of a faculty member."}, {"summer": "True", "name": "Thesis Research", "spring": "True", "number": "695", "fall": "True", "units": " 3-6", "description": "Thesis Research"}]