[{"summer": "True", "name": "Foundations of Graphics", "spring": "True", "number": "120", "fall": "True", "units": " Performing Arts", "description": "Introductory course providing orientation to language of graphics for students majoring in any field.  Designed to help develop ability to use CAD within the context of a concurrent design process to understand how everyday objects are designed, analyzed and created.  Emphasis placed on decision-making processes involved with creating geometry and development of modeling strategies that incorporate intentions of designer."}, {"summer": false, "name": "Architectural Graphic Communications", "prerequisites": "Prerequisite: GC 120 or TDE 220", "spring": true, "number": "250", "fall": true, "units": " 3", "description": "Architectural Graphic Communications is an advanced graphic course designed to expand on the concepts covered in the introductory courses (GC 120, GC 210, GC 211).  The emphasis is on strengthening architectural sketching and CAD drawing skills and showing how specific construction processes and materials selected for an architectural design affect commercial and residential production architectural drawings.  Topics include perspectice drawing, shadow projection, texturization, rendered plans,elevations and other related topics."}, {"summer": false, "name": "3D Spatial Relations", "prerequisites": "Prerequisite: GC 101 or GC 120 or GC/IE 210", "spring": false, "number": "320", "fall": true, "units": " 3", "description": "Analysis and solution of three-dimensional space problems utilizing graphic principles of orthogonal projection techniques. Application of studies of lines; surfaces; solids; surface intersections; surface development; vectors; and civil, mechanical, and geographical structures."}, {"summer": false, "name": "Basic Technical Animation", "prerequisites": "Prerequisite: GC 120 or TDE 220", "spring": false, "number": "330", "fall": true, "units": " 3", "description": "Create technical animations to communicate scientific and technical information to a variety of audiences and environments.  Includes performing basic skills in image processing including cropping, transformations, color manipulation and color enhancement.  Students will apply basic concepts of constructing 3-D objects, spaces, and environments.  Create technical animations which apply environmental attributes including surface study, texture, color, lighting models, photo-realism, and raytracing."}, {"summer": false, "name": "Concepts of Website Development", "spring": true, "number": "340", "fall": false, "units": " 3", "description": "An introduction to the essential elements of web site development for students in Technology Education and Graphic Communications.  Content focuses on planning and executing web site for educational effectiveness, user interfaces, site testing, and maintenance.  Course provides instruction in software appropriate for creating a website."}, {"summer": false, "name": "Applied CAD/D and Geometric Controls", "prerequisites": "Prerequisite: GC 120", "spring": true, "number": "350", "fall": true, "units": " 3", "description": "Techniques for producing mid-level computer models of individual parts and assemblies of parts.  Application of conventional tolerancing and geometric tolerancing and dimensioning.  Investigation of design for manufacture and CAD/CAM (Computer-AidedDesign/Computer-Aided Manufacture) processes.  Conventions and standards for technical drawing documentation."}, {"summer": true, "name": "Concepts of Desktop Publishing", "spring": true, "number": "410", "fall": true, "units": " 3", "description": "Provides an introduction to the concepts of electronic document production and explores the software packages involved in producing documents for print and electronic media.  Structured for public school teachers and lay people.  The course introduces basic standards and concepts of page layout."}, {"summer": false, "name": "Visual Thinking", "prerequisites": "Prerequisite: Engineering or technical student", "spring": true, "number": "420", "fall": true, "units": " 3", "description": "Develop visual thinking skills through a series of exercises using various visual media. Integrates and stresses drawing and construction activities essential to visual thinking. Emphasis on direct observation (seeing), mental imagery and sketching that is based upon three-dimensional space. Develops students' visual and drawing skills and provides for their application toward solving open-ended spatial problems. Intended for the scientific and technically oriented student."}, {"summer": false, "name": "Advanced Graphics Usage with CAD", "prerequisites": "Prerequisite: GC 350", "spring": true, "number": "450", "fall": false, "units": " 3", "description": "Advanced applications of 3-dimensional solid modeling tools in technical and engineering environments.  Theory and application of manufacturing databases developed with 3-D modeling tools.  Development and management of 3-D geometry using modeling software.  Emphasis on application of 3-D modeling technology."}, {"summer": true, "name": "Special Topics in Graphic Communications", "spring": true, "number": "496", "fall": true, "units": " 1-4", "description": "Topical study in areas of current interest and need to students and/or needs of curricula served by Graphic Communications."}, {"summer": true, "name": "Independent Study in Graphic Communications", "prerequisites": "Prerequisite: GC 120 or TDE 220", "spring": true, "number": "498", "fall": true, "units": " 1-4", "description": "Independent study in areas of current interests and needs of students in the field of Graphic Communications and the visual sciences."}]