[{"summer": "True", "name": "Introduction to Geographic Information Systems", "spring": "True", "number": "410", "fall": "True", "units": " 3", "description": "Overview of the operations and functions of computerized spatial display and map analysis processes (Geographic Information Systems), production of effective computer-generated maps and spatial displays, concepts for spatial modeling.  Extensive independent learning and computer experiences including on-line virtual laboratory sessions.  Credit will not be given for both GIS 410 and GIS 510."}, {"summer": "True", "name": "Introduction to Geographic Information Science", "spring": "True", "number": "510", "fall": "True", "units": " 3", "description": "An overview of operations and functions of geographic information systems (GIS). Students develop expertise in spatial reasoning, problem definition, and skilled application of GIS software through lectures, readings, and extensive hands on experiences. All course materials are delivered through the Internet. Credit will not be given for both GIS 510 and GIS 410."}, {"summer": false, "name": "Introduction to Environmental Remote Sensing", "spring": true, "number": "512", "fall": true, "units": " 3", "description": "Principles and hands-on techniques for processing and analyzing remotely sensed data for natural resource applications. Topics include review of the electromagnetic spectrum, pre-processing (georectification, enhancements and transformations), processing (visual interpretation, indices, supervised and unsupervised classification) and post-processing (masking, change analysis and accuracy assessment) of digital image data. This course will provide students with fundamental concepts and skills needed to pursue further studies in digital processing of remotely sensed data."}, {"summer": "True", "name": "Computer Cartography", "prerequisites": "P: NR/PRT 462 or GIS 510", "spring": "True", "number": "515", "fall": "True", "units": " 2", "description": "Principles of cartographic design and how to apply them to produce high-quality geographic information system (GIS) based maps. Successful students will acquire an understanding of map design and experience applying it with GIS software. Students produce project maps in both print and web media."}, {"summer": "True", "name": "Advanced Geospatial Analytics", "prerequisites": "Prerequisite: GIS 510 or PA 541 or SSC 440", "spring": "True", "number": "520", "fall": "True", "units": " 3", "description": "Focus is on advanced geospatial analysis and technologies.  Students enhance geoprocessing skills and understanding of the analysis capabilities of geospatial technology, learn to integrate and analyze spatial data in various formats, and explore methods for displaying geographic data analysis results in decision support and modeling systems.  All course materials are delivered through the Internet and student activity can be accomplished with student owned computers."}, {"summer": "True", "name": "Surface Water Hydrology with GIS", "prerequisites": "Prerequisite: GIS 510 or PA 541 or SSC 440", "spring": "True", "number": "521", "fall": "True", "units": " 3", "description": "The application of geographic information systems (GIS) to surface water modeling including stream and watershed delineations, regulatory wetlands jurisdiction determinations, and flood mapping. In addition students will develop spatial computation methods to support hydrological analysis in land use planning, landscape management, and engineering assessments."}, {"summer": "True", "name": "Principles of Geospatial Information Science", "prerequisites": "Prerequisite: GIS 510 or PA 541 or SSC 440", "spring": "True", "number": "530", "fall": "True", "units": " 3", "description": "This course is a study of theoretical underpinnings of geospatial information science including spatial data concepts, analysis, and modeling. Topics include projections, georeferencing, spatial representations, generalization, conflation, spatial topologies, and an introduction to remote sensing and image processing."}, {"summer": "True", "name": "Geospatial Programming Fundamentals", "prerequisites": "Prerequisite: GIS 510 or PA 541 or SSC 440", "spring": "True", "number": "540", "fall": "True", "units": " 3", "description": "This course provides fundamental skills for geospatial programming. Topics include calling geographic processing tools, batch processing, performing file i/o in an external computing language and building, graphical user interfaces and displays. To support these tasks, students learn basic programming concepts, such as pseudocode, flow-control, code re-use, and debugging. In the final project, students streamline GIS work-flow and customize GIS user interfaces. Familiarity with GIS software is required, but no prior programming experience is expected."}, {"summer": "True", "name": "Geospatial Data Structures and Web Services", "prerequisites": "Prerequisite: GIS 540", "spring": "True", "number": "550", "fall": "True", "units": " 3", "description": "This course examines the spatial database models and structures used in geospatial information science and technology as well as the design and implementation of web and related mobile computing geospatial tools and systems. Students develop, evaluate, and deploy multiple spatial data models and web services that include connections to external data sources and systems."}, {"summer": "True", "name": "Geospatial Modeling and Analysis", "spring": "True", "number": "582", "fall": "True", "units": " 3", "description": "The course explains digital representation and analysis of geospatial phenomena and provides foundations in methods and algorithms  used in GIS analysis and modeling. Special focus is on terrain modeling, geomorphometry, watershed analysis and introductory GIS-based modeling of landscape process (water, sediment). This course includes analysis from lidar data, 3D visualization, and principles of open source GIS. Introductory level knowledge of GIS or surveying/ geomatics principles is required."}, {"summer": "True", "name": "Geospatial Information Science Master's Project", "prerequisites": "Prerequisite: GIS 550", "spring": "True", "number": "590", "fall": "True", "units": " 3", "description": "This is the culminating course for The Master of Geospatial Information Science and Technology degree. Students develop a professional portfolio highlighting the understanding and skills they have developed throughout the degree program. Featured in the portfolio will be a complex geospatial analysis project containing interoperable spatial and non-spatial data, web services, and customized user interfaces and work flows."}, {"summer": "True", "name": "Special Topics in Geospatial Information Science", "spring": "True", "number": "595", "fall": "True", "units": " 1-6", "description": "Special Topics in Geospatial Information Science"}, {"summer": "True", "name": "Seminar in Geospatial Information Science", "spring": "True", "number": "601", "fall": "True", "units": " 1", "description": "Seminar in Geospatial Information Science"}, {"summer": "True", "name": "Special Topics in Geospatial Information Science", "spring": "True", "number": "610", "fall": "True", "units": " 1-6", "description": "Special Topics in Geospatial Information Science"}]