[{"summer": true, "name": "Genetics in Human Affairs", "spring": true, "number": "301", "fall": true, "units": " 3", "description": "Appreciation and understanding of genetics in everyday life. Genetic perspective on normal human development, birth defects, birth control, cancer, organ transplants, intelligence, mental illness, and radiation and chemical exposure and issues raised by applications of recently developed genetic techniques such as in vitro fertilization, genetic engineering and prenatal monitoring."}, {"summer": false, "name": "Principles of Genetics", "prerequisites": "Prerequisite: BIO 183 or ZO 160", "spring": false, "number": "311", "fall": false, "units": " 4", "description": "Basic concepts and principles of prokaryotic and eukaryotic genetics. Mendelian inheritance, polygenic inheritance, linkage and mapping, chromosome aberrations, population genetics, evolution, DNA structure and replication, gene expression, mutation, gene regulation, extranuclear inheritance, bacterial and viral genetics, and recombinant DNA technology."}, {"summer": false, "name": "Elementary Genetics Laboratory", "prerequisites": "Corequisite: GN 311", "spring": true, "number": "312", "fall": true, "units": " 1", "description": "Genetic experiments and demonstrations using a variety of bacterial, plant and animal organisms. Mendelian inheritance, linkage analysis, population genetics, cytogenetics, biochemical genetics, DNA isolation, electrophoresis, and Southern blotting."}, {"summer": false, "name": "Molecular Genetics", "prerequisites": "Prerequisite: C- or better in GN 311", "spring": true, "number": "421", "fall": true, "units": " 3", "description": "Biological macromolecules and their interactions.  Chromatin and chromosome structure.  Bacteria, viruses, plants, animals and fungi as genetic systems.  Transcription, RNA processing, genetic code, translation, DNA replication and the cell cycle.  RFLP mapping.  DNA and forensics.  Molecular genetics of disease.  Genetic transformation and cloning of plants and animals.  Recombinant DNA methodology. Students cannot receive credit for both GN 413 and GN 513"}, {"summer": false, "name": "Population, Quantitative and Evolutionary Genetics", "prerequisites": "Prerequisite: GN 311 and (MA 131 or MA 141)", "spring": true, "number": "423", "fall": false, "units": " 3", "description": "This course is an introduction to population, quantitative and evolutionary genetics. This course will acquaint students with basic population genetics models.  The course will cover genetic variation; measures of genetic variation; basic and advanced topics of selection; ecological genetics; inbreeding; genetic drift and effective population size; mutation; neutral theory and coalescence; gene flow and population structure; linkage disequilibrium and recombination; quantitative genetics; heritability;' quantitative trait loci; molecular population genetics and evolution."}, {"summer": false, "name": "Advanced Genetics Laboratory", "prerequisites": "Prerequisite: GN 312; Corequisite:  GN 421", "spring": true, "number": "425", "fall": false, "units": " 2", "description": "This is a challenging advanced genetics laboratory designed to provide research and communication training and in-depth understanding of modern genetics through hands-on activities.  Students will participate in a semester-long supervised research project in contemporary genetics using a model genetic organism and state-of-the-art techniques.  The project will be directly related to research in the coordinating faculty member's laboratory.  The project will require literature review, hypothesis development, experimental design and execution, data analysis and presentation of results in written and oral form."}, {"summer": false, "name": "Introductory Bioinformatics", "prerequisites": "Prerequisite:GN 311 and MA 131 with grades of C- or better", "spring": true, "number": "427", "fall": true, "units": " 3", "description": "This course is an introduction to bioinformatics for genetic and biological sciences.  The course will provide a foundation in biological computing that includes command line interfaces, reformatting data, creating and editing graphics, automating analyses and database access, and scripting in biological programming languages used for bioinformatics such as Python, Perl, and R. Laptop required."}, {"summer": false, "name": "Genes and Development", "prerequisites": "Prerequisite: C- or better in GN 421", "spring": true, "number": "434", "fall": false, "units": " 3", "description": "Genes and genetic pathways that control development in animals; overview of early, pivotal experiments in embryology and genetics; use of molecular biology, genomics and bioinformatics to study genes and development; concentration on four model systems; presentation and discussion of major issues in developmental biology."}, {"summer": false, "name": "Human and Biomedical Genetics", "prerequisites": "Prerequisite: C- or better in GN 421", "spring": false, "number": "441", "fall": true, "units": " 3", "description": "This course is an in depth study of human and biomedical genetics and the role of genetics in human health and disease.  The course will aquaint students with contemporary knowledge of genetics in disease causation and susceptibility, the use of model organisms to inform human biology and contemporary topics in human genetics research like epigenetics, therapeutic cloning, gene therapy, role of genetics in response to drugs and predictive medicine.  Credit cannot be given for both 441 and 541."}, {"summer": "True", "name": "Genome Science", "prerequisites": "Prerequisite: C- or better in GN 423", "spring": "True", "number": "451", "fall": "True", "units": " 3", "description": "Complementation of modern genomics approaches with classical and molecular genetics; goals of major genome projects in animals, plants, humans, and microorganisms; genomic science opportunities at NCSU and in the Research Triangle; presentation and discussion of current literature; and preparation for careers in genomics-related fields."}, {"summer": false, "name": "Advanced Bioinformatics", "prerequisites": "Prerequisite:GN 427 and ST 311 with grades of C- or better", "spring": true, "number": "461", "fall": false, "units": " 3", "description": "This course provides in-depth experience in applying bioinformatic computing techniques to experimental data with a focus on the genetic and biological sciences.  The course will provide experience in genome sequence analysis and assembly, extracting, manipulating and visualizing genetic and molecular data, analysis of macromolecular sequences, and generating and visualizing phylogenetic date.  Laptop required."}, {"summer": false, "name": "Genetics Colloquium", "prerequisites": "Prerequisite: GN 421", "spring": true, "number": "490", "fall": false, "units": " 1", "description": "This course will involve critical study of research in genetics.  Students will evaluate primary research publication on prepared topics assigned by instructor, with emphasis on review of recent and current research."}, {"summer": false, "name": "External Learning Experience", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "492", "fall": true, "units": " 1-6", "description": "A learning experience in agriculture and life sciences within an academic framework that utilizes facilities and resources which are external to the campus.  Contact and arrangements with prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior to the experience."}, {"summer": false, "name": "Special Problems in Genetics", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "493", "fall": true, "units": " 1-6", "description": "A learning experience in agriculture and  life sciences within an academic framework that utilizes campus facilities and resources. Arrangements must be initiated by student and approved by a faculty adviser and the departmental teaching coordinator."}, {"summer": true, "name": "Special Topics in Genetics", "spring": true, "number": "495", "fall": true, "units": " 1-3", "description": "Offered as needed to present materials not normally available in regular course offerings or for offering of new courses on a trial basis."}, {"summer": false, "name": "Advanced Genetics", "prerequisites": "Prerequisite: GN 311", "spring": true, "number": "513", "fall": true, "units": " 3", "description": "Biological macromolescules and their interactions.  Chromatin and chromosome structure.  Bacteria, viruses, plants, animals and fungi as genetic systems.  Transcription, RNA processing, genetic code, translation, DNA replication and cell cycle.  RFLP mapping.  DNA and forensics. Genetic transformation and cloning of plants and animals.  Recombinant DNA methodology. Credit for both GN 413 and GN 513 is not allowed."}, {"summer": false, "name": "Molecular Genetics", "prerequisites": "P:GN 311", "spring": true, "number": "521", "fall": true, "units": " 3", "description": "Biological macromolescules and their interactions.  Chromatin and chromosome structure.  Bacteria, viruses, plants, animals and fungi as genetic systems.  Transcription, RNA processing, genetic code, translation, DNA replication and cell cycle.  RFLP mapping.  DNA and forensics. Genetic transformation and cloning of plants and animals.  Recombinant DNA methodology. Credit for both GN 413 and GN 513 is not allowed."}, {"summer": false, "name": "Insect Neurogenomics", "spring": true, "number": "527", "fall": false, "units": " 3", "description": "Sensory processing systems in the insect brain (visual, olfactory, gustatory, and mechanosensory), learning and memory and circadian rhythm.  Each process will be considered at the behavioral, anatomical, neural, and genetic level.  Examples will bedrawn from multiple insect species, using recent studies.  Techniques: quantitative real-time PCR, microarrays, mapping quantitative trait loci, Drosophila transgenics, RNAi, imaging neuronal activity, etc.  For Graduate students with background in molecular biology techniques."}, {"summer": false, "name": "Human and Biomedical Genetics", "spring": false, "number": "541", "fall": true, "units": " 3", "description": "This course is an in depth study of human and biomedical genetics and the role of genetics in human health and disease.  The course will aquaint students with contemporary knowledge of genetics in disease causation and susceptibility, the use of model organisms to inform human biology and contemporary topics in human genetics research like epigenetics, therapeutic cloning, gene therapy, role of genetics in response to drugs and predictive medicine.  Credit cannot be given for both 441 and 541."}, {"summer": false, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "685", "fall": true, "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "688", "fall": true, "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "689", "fall": true, "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": false, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "690", "fall": true, "units": " 1-6", "description": "For students in non-thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam."}, {"summer": false, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's Student", "spring": true, "number": "693", "fall": true, "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": false, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's Student", "spring": true, "number": "695", "fall": true, "units": " 1-9", "description": "Thesis Research"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "696", "fall": false, "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": false, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's Student", "spring": true, "number": "699", "fall": true, "units": " 1-3", "description": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis."}, {"summer": false, "name": "Molecular Genetics", "prerequisites": "P:GN 311", "spring": false, "number": "701", "fall": true, "units": " 3", "description": "A discussion of the structure and function of genetic material at a molecular level.  Consideration of both prokaryotic and eukaryotic systems.  The aim to describe genetics in terms of chemical principles."}, {"summer": false, "name": "Cellular and Developmental Genetics", "prerequisites": "Prerequisite: GN 701", "spring": true, "number": "702", "fall": false, "units": " 3", "description": "Regulation of genes involved in cellular function, differentiation and development in eukaryotes.  Presentation of biological systems and model organisms used to study genetic control of cellular and developmental processes."}, {"summer": false, "name": "Population and Quantitative Genetics", "prerequisites": "Prerequisite: GN 311 and ST 512", "spring": true, "number": "703", "fall": false, "units": " 3", "description": "Mutation and origin of genetic variation.  Measuring genetic variation in natural populations.  Gene and genotype frequencies.  Hardy-Weinberg equilibrium.  Values, means, genetic and environmental variance, heritability of quantitative traits.  Random genetic drift and inbreeding.  Natural and artifical selection.  Theory and tests of models of maintenance of genetic variation.  Molecular evolution of genes and proteins.  Genome evolution."}, {"summer": false, "name": "Genetics of Animal Improvement", "prerequisites": "Prerequisite: GN 311, ST 512", "spring": true, "number": "708", "fall": false, "units": " 3", "description": "Emphasis on the utilization of basic principles of population and quantitative genetics in animal improvement. Factors affecting genic and genotypic frequencies and methods of estimating genetic and nongenetic variance, heritabilities and breeding values. The roles of mating systems and selection procedures in producing superior genetic populations."}, {"summer": false, "name": "Quantitative Genetics and Breeding", "spring": false, "number": "713", "fall": true, "units": " 3", "description": "Quantitative and population genetic theory of breeding problems; partitioning of genetic variance, maternal effects, genotype by environment interaction and genetic correlation; selection indexes; design and analysis of selection experiments; marker-assisted selection."}, {"summer": false, "name": "Molecular Biology In Plant Breeding", "prerequisites": "Prerequisite: CS(GN,HS) 741, GN 701", "spring": true, "number": "720", "fall": false, "units": " 3", "description": "Theory and principles of molecular biology applied to plant breeding. Experimental approaches to induce genetic change, cytoplasmic recombination, haploid utilization and potentials of molecular techniques for solving breeding problems."}, {"summer": false, "name": "Genetic Data Analysis", "prerequisites": "Prerequisite: ST 430 and GN 311", "spring": true, "number": "721", "fall": false, "units": " 3", "description": "Analysis of discrete data, illustrated with genetic data on morphological characters allozymes, restriction fragment length polymorphisms and DNA sequences. Maximum likelihood estimation, including iterative procedures. Numerical resampling. Development of statistical techniques for characterizing genetic disequilibrium and diversity. Measures of population structure and genetic distance. Construction of phylogenetic trees. Finding alignments and similarities between DNA sequences. Locating genes with markers."}, {"summer": false, "name": "Forest Genetics", "prerequisites": "Prerequisite: GN 311", "spring": true, "number": "725", "fall": false, "units": " 3", "description": "Application of genetic principles to silviculture, management and wood utilization. Emphasis on variation in wild populations, the bases for selection of desirable qualities and fundamentals of controlled breeding."}, {"summer": false, "name": "Fungal Genetics and Physiology", "prerequisites": "Prerequisite: BCH 451, BO 775, GN 311 or PP 501", "spring": true, "number": "730", "fall": false, "units": " 3", "description": "Basic concepts of genetics and physiology of fungi, with emphasis on saprophytic and plant pathogenic mycelial fungi. Current literature on evolution, cell structure, growth and development, gene expression, metabolism, sexual and asexual reproduction and incompatibility systems. Laboratory exercises on mutant isolation, sexual and parasexual analysis, genetic transformation, and RFLP and isozyme analysis."}, {"summer": false, "name": "Functional Genomics", "prerequisites": "Prerequisite: GN 701", "spring": true, "number": "735", "fall": false, "units": " 3", "description": "Methodology of experimental genomics; genome sequencing, gene expression arrays, genomic screens, proteomics.  Aims and achievements of microbial, plant, animal, human genome projects.  Applications of genomics including parasitology, breeding, functional genomics, evolutionary genetics.  Interface with bioinformatics, data technology."}, {"summer": false, "name": "Evolutionary Genetics", "prerequisites": "Prerequisite: GN 703", "spring": false, "number": "740", "fall": true, "units": " 3", "description": "Genetic basis of evolution.  Molecular evolution, molecular population genetics, evolutionary genetics of quantitative characters and the genetics of speciation.  Critical reading of original research publications and student seminars."}, {"summer": false, "name": "Quantitative Genetics In Plant Breeding", "prerequisites": "Prerequisite: CS(GN, HS) 741, ST 512, course in quantitative genetics recommended", "spring": true, "number": "745", "fall": false, "units": " 1", "description": "Theory and principles of plant quantitative genetics.  Experimental approaches of relationships between type and source of genetic variability, concepts of inbreeding, estimations of genetic variance and selection theory."}, {"summer": false, "name": "Breeding Methods", "prerequisites": "Prerequisite: CS (GN, HS) 741, ST 512", "spring": true, "number": "746", "fall": false, "units": " 2", "description": "Theory and principles of plant breeding methodology including population improvement, selection procedures, genotypic evaluation, cultivar development and breeding strategies."}, {"summer": false, "name": "Developmental Genetics", "prerequisites": "Prerequisite: GN 701, GN 702", "spring": true, "number": "750", "fall": false, "units": " 3", "description": "Action and regulation of genes and gene-products in development and differentiation. Examples from microorganisms, plants and animals. Emphasis on molecular and biochemical aspects of mechanisms controlling gene expression in eukaryotic cell differentiation."}, {"summer": false, "name": "Population Genetics", "prerequisites": "Prerequisite: GN 703", "spring": true, "number": "755", "fall": false, "units": " 3", "description": "Theoretical population genetics and its relationship to natural and experimental populations. Single locus and multilocus systems, history of a gene in a population, diffusion approximations, suitability of models to natural and experimental populations."}, {"summer": false, "name": "Computational Molecular Evolution", "prerequisites": "Prerequisite: GN 311 and ST 511", "spring": false, "number": "756", "fall": true, "units": " 3", "description": "Phylogenetic analyses of nucleotide and protein sequence data.  Sequence alignment, phylogeny reconstruction and relevant computer software.  Prediction of protein secondary structure, database searching, bioinformatics and related topics.  Project required."}, {"summer": false, "name": "Statistics for Molecular Quantitative Genetics", "prerequisites": "Prerequisite: ST 512 and GN 703 or ST 721", "spring": false, "number": "757", "fall": true, "units": " 3", "description": "Genetic mapping data.  Linkage map reconstruction, quantitative genetical models.  Statistical methods and computer programs for mapping quantitative trait loci and estimating genetic architecture of quantitative traits."}, {"summer": false, "name": "Prokaryotic Molecular Genetics", "prerequisites": "Prerequisite: BCH 451 or GN 311", "spring": true, "number": "758", "fall": false, "units": " 3", "description": "Structure and function in prokaryotic molecular genetics, with emphasis on mutations and mutagenic pathways, transcriptional and translational regulation, RNA processing, DNA replication and recombination and characterization of recombinant DNA molecules. Applications of genetic and recombinant DNA techniques to microbial processes, including strain construction and enhancement of gene expression."}, {"summer": false, "name": "Advanced Molecular Biology Of the Cell", "prerequisites": "Prerequisite: BCH 703 and 705", "spring": true, "number": "761", "fall": false, "units": " 3", "description": "An advanced treatment involving integrated approaches to biological problems at the molecular level, encompassing biochemistry, cell biology and molecular genetics.  Broad, multidisciplinary approaches to solving research problems in biology and thecritical study of primary scientific literature, the development of a research proposal, oral presentations and class discussions."}, {"summer": false, "name": "Nucleic Acids: Structure and Function", "prerequisites": "Prerequisite: BCH 701 and 703", "spring": true, "number": "768", "fall": false, "units": " 3", "description": "An advanced treatment involving integrated approaches to biological problems at the molecular level, encompassing biochemistry, cell biology and molecular genetics.  Broad, multidisciplinary approaches to solving research problems in biology and thecritical study of primary scientific literature, the development of a research proposal, oral presentations and class discussions."}, {"summer": false, "name": "Seminar", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "801", "fall": true, "units": " 1", "description": "Informal group discussion of prepared topics assigned by instructor."}, {"summer": false, "name": "Colloquium in Genetics", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "809", "fall": true, "units": " 2", "description": "Informal group discussion of prepared topics assigned by instructor."}, {"summer": false, "name": "Special Topics in Genetics", "spring": true, "number": "810", "fall": true, "units": " 1-4", "description": "Critical study of selected areas and special topics of current interest in genetics and related fields."}, {"summer": false, "name": "Special Problems", "prerequisites": "Prerequisite: Advanced Graduate standing", "spring": true, "number": "820", "fall": true, "units": " 1-3", "description": "Special topics designed for additional experience and research training."}, {"summer": false, "name": "Professionalism and Ethics", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "850", "fall": true, "units": " 1", "description": "The course is designed to give students background in professionalism, scientific ethics and responsible conduct of science.  Topics include the role of the scientist in society, ethical theory, data acquisition and ownership, scientific midconduct,authorship, peer review, conflicts of interest and commitment, intellectual property, ethics of teaching and mentoring, ethical treatment of animal and human subjects, ethics of genetics research, job hunting and interviewing."}, {"summer": false, "name": "Plant Breeding Laboratory", "prerequisites": "Prerequisite: CS(GN,HS)741", "spring": true, "number": "860", "fall": false, "units": " 1", "description": "Visitation of plant breeding projects in the Depts. of CS and HS at NC State, along with commercial seed companies. Discussion and viewing of breeding objectives, methods and equipment and teaching and practice of hybridization methods."}, {"summer": false, "name": "Plant Breeding Laboratory", "prerequisites": "Prerequisite: CS(GN,HS)741", "spring": false, "number": "861", "fall": true, "units": " 1", "description": "Visitation of plant breeding projects in the Depts. of CS and HS at NC State, along with commercial seed companies. Discussion and viewing of breeding objectives, methods and equipment and teaching and practice of hybridization methods."}, {"summer": false, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "885", "fall": true, "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": false, "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "890", "fall": true, "units": " 1-9", "description": "For students who are preparing for and taking written and/or oral preliminary exams."}, {"summer": false, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "893", "fall": true, "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": false, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "895", "fall": true, "units": " 1-9", "description": "Dissertation Research"}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "896", "fall": false, "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": false, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "899", "fall": true, "units": " 1-3", "description": "For students who have completed all credit hour requirements, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations."}]