[{"summer": "True", "name": "Western Civilization Since 1400", "spring": "True", "number": "205", "fall": "True", "units": " 3", "description": "A survey of Western Civilization from the Renaissance to the present."}, {"summer": "True", "name": "Ancient World to 180 A.D", "spring": "True", "number": "207", "fall": "True", "units": " 3", "description": "The ancient cultures of the Middle East, Greece and Rome, including Mesopotamian, Egyptian, Hebrew, Phoenician, Greek and Roman societies and cultures."}, {"summer": "True", "name": "The Middle Ages", "spring": "True", "number": "208", "fall": "True", "units": " 3", "description": "Medieval civilization as it emerged from the declining Roman Empire through its apogee in the 13th century. The transition from the classical to the medieval world, the impact of the Germanic influx, the Islamic influence, the Crusades, and the political, economic, and social institutions of the High Middle Ages."}, {"summer": "True", "name": "Europe, Renaissance to Waterloo, 1300-1815", "spring": "True", "number": "209", "fall": "True", "units": " 3", "description": "Transition from the medieval to modern Europe; decline of medieval institutions, Renaissance, Reformation and Counter-Reformation, rise of Absolutism, English 17th-century revolution, French Revolution and Napoleonic era."}, {"summer": "True", "name": "Modern Europe 1815-Present", "spring": "True", "number": "210", "fall": "True", "units": " 3", "description": "Survey of the history of European societies and political systems from 1815 to the present."}, {"summer": "True", "name": "Latin America to 1826", "spring": "True", "number": "215", "fall": "True", "units": " 3", "description": "The origins and  development of social, political, economic and religious institutions from pre-conquest times to the achievement of independence. The ancient American cultures; Spain and Portugal before 1492; conquest and settlement, Spanish rule in theory and practice, economic life, the Church, land and labor; the African contribution; the Portuguese in Brazil; the independence movements."}, {"summer": "True", "name": "Latin America Since 1826", "spring": "True", "number": "216", "fall": "True", "units": " 3", "description": "Social, political, economic, and intellectual life in the 19th and 20th centuries in Central and South America. The social structure of the new nations; 19th century liberalism; the force of tradition; relations with Europe and the United States; economic change; caudillo rule; 20th century upheavals; revolutions; political conflict."}, {"summer": "True", "name": "British History to 1688", "spring": "True", "number": "221", "fall": "True", "units": " 3", "description": "History of the British peoples from earliest times to the Glorious Revolution. Social, political, constitutional developments; relationship between history and literature; synthesis of British cultures."}, {"summer": "True", "name": "History of British Cultures and Societies From 1688", "spring": "True", "number": "222", "fall": "True", "units": " 3", "description": "British people from Glorious Revolution to the present. Social, political, constitutional development; history and literature; growth and decline of British empire; spread of British culture."}, {"summer": "True", "name": "The World from 1200 to 1750", "spring": "True", "number": "232", "fall": "True", "units": " 3", "description": "Introductory survey of three major civilizations before 1750, associated with Islam, with Christianity, and with China. The course examines the ways that people structure community identities, from the local to the civilization; the importance of interregional connections, established particularly through trade; and the ongoing impact of these connections on community identities."}, {"summer": "True", "name": "The World Since 1750", "spring": "True", "number": "233", "fall": "True", "units": " 3", "description": "This course surveys the making of the world from 1750 to the present. Topics include: the Industrial Revolution, the development of the Nation-States, the rise of European, American and Japanese Empires, WWI, inter-war reconfigurations of colonial empires, anti-colonial nationalist movements, the Great Depression, the Cold War, struggles for political and economic independence among newly independent nations, the US-dominated neo-liberal order from the 1980s to the present, and contemporary global conflicts over ethnicity, religion, resources, disease, and the environment."}, {"summer": "True", "name": "Introduction to Visual Culture", "spring": "True", "number": "240", "fall": "True", "units": " 3", "description": "Introduction to the role of visual cultural production in the nineteenth and twentieth centuries in expressing and shaping both individual and collective identities. Case studies of imperialism, gender, and war draw from different regional histories and utilize a variety of visual genres - such as photography, popular posters, painting, advertising, and film stills - to study how visual culture can be used as evidence to understand the past, using the approaches of the disciplines of History and Art History."}, {"summer": "True", "name": "Early American History", "spring": "True", "number": "251", "fall": "True", "units": " 3", "description": "Themes in early American history: colonial clash and mix of culture; generation of an American consciousness; federalism and democracy in national politics; expansion and immigration; racial and sectional division."}, {"summer": "True", "name": "Modern American History", "spring": "True", "number": "252", "fall": "True", "units": " 3", "description": "Themes in modern American history: impact of war on American foreign and domestic policy; the repercussions of industrialization and economic modernization; continuity and change in American institutions and values; problem solving in pluralistic society."}, {"summer": "True", "name": "Asian Civilizations to 1800", "spring": "True", "number": "263", "fall": "True", "units": " 3", "description": "Introductory survey of the great civilizations of Asia; particular attention to India, China and Japan. Emphasis on comparative study of Asian religions, political systems, art, and literature."}, {"summer": "True", "name": "Modern Asia: 1800 to Present", "spring": "True", "number": "264", "fall": "True", "units": " 3", "description": "Introductory survey of 19th and 20th century Asia, with attention to Japan, Southeast Asia, India and China. Emphasis on cultural and political crises of the 19th century and revolutionary transformations of the 20th century."}, {"summer": "True", "name": "Modern Middle East", "spring": "True", "number": "270", "fall": "True", "units": " 3", "description": "Social and political change in the Middle East in the nineteenth and twentieth centuries.  Decline of the Ottoman empire, the rise of nationalism, the waxing and waning of European imperialism in the region, and the creation of modern states and societies and their ideological and economic underpinnings."}, {"summer": "True", "name": "Introduction to History of South and East Africa", "spring": "True", "number": "275", "fall": "True", "units": " 3", "description": "The African kingdoms (Lunda, Buganda, and Zulu); the European encroachment; the origins of colonialism and the character of colonial societies and economies, South African apartheid; African protest, nationalism and independence."}, {"summer": "True", "name": "Introduction to History of West Africa", "spring": "True", "number": "276", "fall": "True", "units": " 3", "description": "The history of Western Africa. Forest civilizations and the slave trade, trade and the expansion of Islam, colonialism in West Africa; African nationalism and the achievement of independence; and postcolonial West Africa."}, {"summer": "True", "name": "Special Topics in History", "spring": "True", "number": "298", "fall": "True", "units": " 1-3", "description": "Presentation of material normally not available in regular history course offerings, or offering of new introductory courses on a trial basis.  Students cannot receive credit for multiple sections of HI 298 unless the topics are different."}, {"summer": "True", "name": "Sophomore Seminar in History", "prerequisites": "Prerequisite: Sophomore standing, History Majors", "spring": "True", "number": "300", "fall": "True", "units": " 3", "description": "Introduction to the process of researching and writing history. Techniques for locating and interpreting primary sources.  The craft of historical writing. Analysis and criticism of the varieties of history.  Basic computer literacy: basic computingterms, electronic mail, online searching of the NCSU Libraries, use of the Internet, and word processing."}, {"summer": "True", "name": "Religion in American History", "prerequisites": "Prerequisite: 3 hours of History or Sophomore standing", "spring": "True", "number": "320", "fall": "True", "units": " 3", "description": "Representative people, movements and thought in the major religions within the context of American society and culture."}, {"summer": "True", "name": "Ancient and Medieval Science", "prerequisites": "Prerequisite: 3 hours of History or Sophomore standing", "spring": "True", "number": "321", "fall": "True", "units": " 3", "description": "Selected topics in the history of pre-modern science are studied for both their intrinsic interest and to gain perspective on the  nature of modern science. Examples are taken from pre-history, Mesopotamia, Egypt, Greece, Rome, Islam, and the medieval Christian West, with the possibility of comparisons to other cultures."}, {"summer": "True", "name": "Rise of Modern Science", "prerequisites": "Prerequisite: 3 hours of History or Sophomore standing", "spring": "True", "number": "322", "fall": "True", "units": " 3", "description": "Science in the Renaissance and Scientific Revolution of the 16th and 17th centuries. Newtonian science. Mechanics and the chemical revolution in the 18th century. Scientific synthesis in the 19th century: physics, chemistry, geology, and biology. 20th century revolutions in physics. Attention is paid both to scientific ideas and to the cultural and institutional contexts of science."}, {"summer": "True", "name": "The World at War", "prerequisites": "Prerequisite: 3 hours of History", "spring": "True", "number": "335", "fall": "True", "units": " 3", "description": "Comparative history of the experience of war over time and place.  Topics include the interactions between war and society; effects on combatants and non-combatants, especially women and children; and the role of technology."}, {"summer": "True", "name": "Technology in History", "prerequisites": "Prerequisite: 3 hours of History or Sophomore standing", "spring": "True", "number": "341", "fall": "True", "units": " 3", "description": "The role of technology in society from earliest times to the present. Major achievements in technology and an examination of the nature of invention, innovation and adaptation of technologies and their impact on Western Civilization."}, {"summer": "True", "name": "American Military History", "prerequisites": "Prerequisite: 3 hours of History or Sophomore standing", "spring": "True", "number": "350", "fall": "True", "units": " 3", "description": "American military experience and its relationship to other historical developments.  Use of military force in terms of strategy and tactics and as an element in the nation's diplomatic, political, social, economic and intellectual life."}, {"summer": "True", "name": "U.S. Naval History", "prerequisites": "Prerequisite: 3 hours of History or Sophomore standing", "spring": "True", "number": "351", "fall": "True", "units": " 3", "description": "The role of the U.S. Navy in American history. Sea power, national defense and foreign policy. The impact of technology on naval warfare and the historical evolution of missions of the U.S. Navy."}, {"summer": "True", "name": "History of North Carolina", "prerequisites": "Prerequisite: 3 hours of History or Sophomore standing", "spring": "True", "number": "364", "fall": "True", "units": " 3", "description": "History of North Carolina from early European exploration to the present.  Features of North Carolina society which made this state similar to and different from other southern states and the nation as a whole."}, {"summer": "True", "name": "The American West", "prerequisites": "Prerequisite: 3 hours of History or Sophomore standing", "spring": "True", "number": "365", "fall": "True", "units": " 3", "description": "A history of the American Frontier with emphasis on the trans-Mississippi West. Cycles of exploration, conquest, and exploitation of this region. Influence of the frontier in the development of the United States."}, {"summer": "True", "name": "Native American History", "spring": "True", "number": "366", "fall": "True", "units": " 3", "description": "An introductory interpretation of the varied historical experiences of many nations native to North America from the first migrations of peoples into the continent until the present, including the variety and diversity of Indian cultures and experiences; native resistance to colonialism, expansion, and U.S. federal policies; and the survival and  continuity of native cultures and peoples through more than four centuries of contact, conquest, and change.  \t\t"}, {"summer": "True", "name": "Modern Egypt", "prerequisites": "Prerequisite: 3 hours of History or Sophomore standing", "spring": "True", "number": "370", "fall": "True", "units": " 3", "description": "Political history of Modern Egypt, 1805-present. The general framework traces events from the foundation of the modern state under Muhammad 'Ali to the current period of Hosni Mubarak. The focus will be on understanding the creation of modern Egypt by looking at examples of various cultural productions (film, architecture, music, and literature) over the course of the past two centuries."}, {"summer": "True", "name": "Modern Japan, 1850 to Present", "prerequisites": "Prerequisite: 3 hours of History or Sophomore standing", "spring": "True", "number": "371", "fall": "True", "units": " 3", "description": "Survey of Japan's emergence as a modern nation and world power. Topics include nation-state formation; modernization and its dislocations; democratization and authoritarianism; imperialism, international politics, and war; postwar reforms; changing gender relations; popular culture; and social problems."}, {"summer": "True", "name": "African-American History Through the Civil War, 1619-1865", "prerequisites": "Prerequisite: 3 hours of History or Sophomore standing", "spring": "True", "number": "372", "fall": "True", "units": " 3", "description": "African background and continuity of the particular role, experience and influence of African Americans in the United States through the Civil War."}, {"summer": "True", "name": "African-American History Since 1865", "prerequisites": "Prerequisite: 3 hours of History or Sophomore standing", "spring": "True", "number": "373", "fall": "True", "units": " 3", "description": "The  history of African-Americans from the Reconstruction era through the Civil Rights movement of the 1950s and 1960s to the present."}, {"summer": "True", "name": "Visual Culture of Modern South Asia", "prerequisites": "Prerequisite: 3 hours of History or Art Studies or Sophomore Standing", "spring": "True", "number": "374", "fall": "True", "units": " 3", "description": "History of visual-cultural production in expressing and shaping socio-political configurations in the South Asian subcontinent. Treats visual evidence over 300 years to understand the integrative relationship and flow of cultural production across elite patronage and popular values through common themes and stories. Changing state formations and power relationships-- from the Mughal empire and its successor states through British imperial control and after independence-- are studied as contexts for the visual culture that emerges and changes across these time periods. Knowledge gained from HI 263 [Asian Civilizations to 1800] or HI 264 [Modern Asia] is helpful but not required."}, {"summer": "True", "name": "History of Nonprofits, Philanthropy, and Social Change", "prerequisites": "Prerequisite: 3 hours of History or Sophomore standing", "spring": "True", "number": "380", "fall": "True", "units": " 3", "description": "Historical development of nonprofits and philanthropy in the United States from the colonial period to the present--including origins of charity and philanthropy as concepts for social change and social justice, rise of benevolent societies, creation of philanthropic foundations and advocacy organizations, and relationships between modern nonprofits, the state, and the private sector."}, {"summer": "True", "name": "History: Study Abroad", "prerequisites": "Prerequisite: 3 hours of History or Sophomore standing", "spring": "True", "number": "395", "fall": "True", "units": " 1-3", "description": "Topical History courses taught in NCSU Study Abroad programs.  (Current listings available in Study Abroad Office, CHASS Dean's Office and History Department)."}, {"summer": "True", "name": "Civilization of the Ancient Near East", "prerequisites": "Prerequisite: 3 hours of History", "spring": "True", "number": "400", "fall": "True", "units": " 3", "description": "The civilization of Mesopotamia and Egypt from earliest times to the fall of Babylon in 539 B.C. Credit for both HI 400 and HI 500 is not allowed"}, {"summer": "True", "name": "Early Christianity to the Time of Eusebius", "prerequisites": "Prerequisite: One of: REL 312, REL 317, or HI 207", "spring": "True", "number": "402", "fall": "True", "units": " 3", "description": "Growth and diffusion of early Christianity from the end of the first century up to the time of Eusebius and the conversion of Constantine (early fourth century); Christianity in its Greco-Roman environment; Roman policy towards Christianity; heterodox Christian movements; anti-heretical writings; orthodox institutions of authority."}, {"summer": "True", "name": "Ancient Greek Civilization", "prerequisites": "Prerequisite: 3 hours of History", "spring": "True", "number": "403", "fall": "True", "units": " 3", "description": "The history of the Hellenes from the Minoan civilization through Alexander's legacy, with readings in Herodotus and Thucydides."}, {"summer": "True", "name": "Rome to 337 A.D.", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "404", "fall": "True", "units": " 3", "description": "The development of ancient Rome from its origins in Italy, through the rise as an Empire embracing the entire Mediterranean World and Western Europe, to Constantine, Christianity and the foundation of Constantinople. Examines critically the political achievement of a people who rose from an obscure Italian city to a world empire, with emphasis on the analysis of primary sources. Credit will not be given for both HI 404 and HI 504"}, {"summer": "True", "name": "History and Archaeology of the Roman Empire", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "405", "fall": "True", "units": " 3", "description": "Analysis of Rome's rule over the Mediterranean World in the first four centuries A.D. through the use of literary and archaelologic sources. Special emphasis on imperial army and frontier security. Credit will not be given for both H1 405 and H1 505"}, {"summer": "True", "name": "From Roman Empire to Middle Ages", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "406", "fall": "True", "units": " 3", "description": "Late Antiquity and the early Middle Ages. The transition from classical civilization to the basis of modern civilizations; the fall of Rome, the Germanic kingdoms, Byzantium, the establishment of Christianity, the birth and growth of Islam. Credit will not be given for both HI 406 and HI 506"}, {"summer": "True", "name": "Islamic History to 1798", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "407", "fall": "True", "units": " 3", "description": "Credit will not be given for both HI 407 and HI 507. The history of the Islamic Near East to 1798. Topics include the East Mediterranean before Islam, Muhammad and the development of Islam, sources of Muslim civilization, Islamic law, science, philosophy, art and architecture, Islam in Spain, India, Asia and Africa, the Crusades, the Ottomans, Islam and Europe."}, {"summer": "True", "name": "Islam in the Modern World", "prerequisites": "Prerequisite: 3 hours of History or Religious Studies", "spring": "True", "number": "408", "fall": "True", "units": " 3", "description": "Evolution of modern Islam from 17th century to the present.  Primary emphasis on North Africa, the Middle East and South Asia.  Pre-modern Islamicate empires, reform and revival.  Historical origins of current issues in the Islamic world."}, {"summer": "True", "name": "The High Middle Ages", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "409", "fall": "True", "units": " 3", "description": "Medieval culture from 10th through 13th centuries: revival of the Roman Empire, monastic and papal reform, rise of universities, evolution of representative bodies, the Gothic style, troubadour and goliardic poetry, scholasticism, and revival of Roman law. Credit will not be given for both HI 409 and HI 509"}, {"summer": "True", "name": "Italian Renaissance", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "410", "fall": "True", "units": " 3", "description": "Renaissance humanism, an educational ideal and an awareness of man as the sole creator in the historical world, is examined in its relationship to the Italian republics and princedoms of the 14th through the 16th century. Credit will not be given for both HI 410 and HI 510"}, {"summer": "True", "name": "The Protestant and Catholic Reformation of the 16th Century", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "411", "fall": "True", "units": " 3", "description": "The conditions and criticisms which led to reform and the nature of the institutional and theological changes affected by the various churches and sects. Special attention to Luther and Calvin. Credit will not be given for both HI 411 and HI 511"}, {"summer": "True", "name": "The Sexes and Society in Early-Modern Europe", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "412", "fall": "True", "units": " 3", "description": "Examination of changes in gender relations; ideas about the sexes, femininity, and masculinity; the roles of women and men in political, religious, economic, scientific, and family life in Europe between the late Middle Ages and the French Revolution. Credit for HI 412 and HI 512 is not allowed."}, {"summer": "True", "name": "France in the Old Regime", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "414", "fall": "True", "units": " 3", "description": "France from the sixteenth century to the Revolution, development of renaissance and absolutist state, social and economic change, religious reform and Enlightenment, origins and beginnings of the revolution. Credit will not be given for both HI 414 and HI 514"}, {"summer": "True", "name": "The French Revolution", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "415", "fall": "True", "units": " 3", "description": "Broadly based analysis of France's first revolutionary era; the enlightenment and its impact, the causes and character of the Revolution in France; impact of these events in France and Europe. Credit will not be given for both HI 415 and HI 515"}, {"summer": "True", "name": "Fascist Italy and Nazi Germany", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "418", "fall": "True", "units": " 3", "description": "Fascism as a theoretical concept, rise of fascism in Italy and Germany, seizure of power by Mussolini and Hitler, organization of the economy, churches, military, women, youth, and culture under the dictatorships. Students will not receive credit for both HI 418 and HI 518"}, {"summer": "True", "name": "Modern European Imperialism", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "419", "fall": "True", "units": " 3", "description": "Historical background of European overseas expansion; its impact on the economics, politics and culture of both Europe and the colonized world; the significance of imperialism and anti-colonial nationalism in shaping the modern world. Credit will not be given for both HI 419 and HI 519"}, {"summer": "True", "name": "European Diplomatic History", "prerequisites": "Prerequisite: 3 hours of History", "spring": "True", "number": "420", "fall": "True", "units": " 3", "description": "Survey of major events in European international relations, including the Congress of Vienna in 1815, the unification of Germany, World War I and II, the origins of the Cold War, European unification, and the crisis of the Soviet bloc. Credit will not be given both for HI 420 and HI 520"}, {"summer": "True", "name": "European Intellectual History: The Eighteenth Century", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "421", "fall": "True", "units": " 3", "description": "Historical examination of some of the major figures of the European Enlightenment, beginning with Locke and ending with Kant. Credit will not be given for both HI 421 and HI 521"}, {"summer": "True", "name": "European Intellectual History: The 19th Century", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "422", "fall": "True", "units": " 3", "description": "Historical examination of some of the major figures of European thought during the 19th century, beginning with the enthusiasm of the period of the French Revolution and ending with the disillusionment of the fin de siecle. Credit will not be given for both HI 422 and HI 522"}, {"summer": "True", "name": "Women in European Enlightenment", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "423", "fall": "True", "units": " 3", "description": "Historical examination of construction of female 'nature', resources available to women writers and intellectuals, and constraints on womens' education, writing and publication during the Enlightenment period. Credit will not be given for both HI 423 and HI 523."}, {"summer": "True", "name": "Tudor and Stuart England", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "425", "fall": "True", "units": " 3", "description": "British history from the Reformation through the Civil War. Emphasis on key developments in social, political and economic life: The development of a new concept of kingship, the growing independence of Parliament, the search for religious uniformity and the changing status of the aristocracy and gentry. Credit will not be given for both HI 425 and HI 525"}, {"summer": "True", "name": "20th Century Britain", "prerequisites": "Prerequisite: 3 hours of History", "spring": "True", "number": "429", "fall": "True", "units": " 3", "description": "British political, social and economic history since 1914, with reference to the effects of two world wars, the growth of the Welfare State, Britain's decline as a power, and its search for a new role in the world. Credit will not be given for both HI 429 and HI 529."}, {"summer": "True", "name": "Modern France", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "430", "fall": "True", "units": " 3", "description": "French history from the downfall of Napoleon I to the present, with a short introductory survey of the Old Regime and the French Revolution.  Cultural, social and economic developments and political trends. Credit will not be given for both HI 430 and HI 530"}, {"summer": "True", "name": "History of Germany Since 1871", "prerequisites": "Prerequisite: 3 hours of History", "spring": "True", "number": "432", "fall": "True", "units": " 3", "description": "German history from the unification of 1871 to the present, concentrating  on problems of nationalism and political and social reform. Credit will not be given for both HI 432 and HI 532"}, {"summer": "True", "name": "Europe Since 1945", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "435", "fall": "True", "units": " 3", "description": "Survey of European politics, society, and culture from 1945 to the present day focusing equally on Eastern and Western Europe.  Begins with the Cold War division of the continent and gives special attention to the years immediately following the end of the Second World War, to the revolts of 1968, to the fall of Communism in 1989-1991, and to the Wars of Yugoslav Succession, 1991-1999."}, {"summer": "True", "name": "The Russian Empire to 1917", "prerequisites": "Prerequisite: 3 hours of History", "spring": "True", "number": "438", "fall": "True", "units": " 3", "description": "Russian Empire to the Revolution of 1917. Kiev Rus and the Mongol conquest, serfdom, territorial expansion, cultural insularity of the Great Russian state in Moscow, Westernization, reform, and great power status in 18th and 19th centuries, peoples of the multi-national empire, cultural, educated society, and revolutionary opposition, industrialization, rapid urbanization, war, and revolution. Credit will not be given for both HI 438 and HI 538."}, {"summer": "True", "name": "History of the Soviet Union And After", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "439", "fall": "True", "units": " 3", "description": "Soviet state and society from the 1917 Revolution, including the post-Soviet situation.  Political disarray and resistance to the Bolshevik regime, 1917-21; industrialization, urbanization, and application of coercive techniques of rule; popular reconciliation with Party state and great power status during World War II and after; fate of non-Russian nationalities; de-stalinization, stagnation, and the failed attempt at Party renewal after 1985. Credit will not be given both for HI 439 and HI 539"}, {"summer": "True", "name": "American Environmental History", "prerequisites": "Prerequisite: 3 hours of History", "spring": "True", "number": "440", "fall": "True", "units": " 3", "description": "Interactions between humans and their environments in America; environmental focus on themes in American history such as colonial settlement, industrialization, progressivism, the New Deal, the 1960s. Credit will not be given for both HI 440 and HI 540."}, {"summer": "True", "name": "Colonial and Revolutionary U.S", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "441", "fall": "True", "units": " 3", "description": "Origins of the English colonies in America to the American Revolution.  European background to colonization, merging of different cultures, effects of mercantile doctrine, causes of revolution. Credit will not be given for both HI 441 and HI 541"}, {"summer": "True", "name": "Creating the Constitution : Origins and Development", "prerequisites": "Prerequisite: 3 hours of History", "spring": "True", "number": "442", "fall": "True", "units": " 3", "description": "Analysis of state and federal constitutions developed in the United States after 1776.  Theories behind a federal constitution; the Philadelphia Convention of 1787; the ratification debate; and the bill of rights. Credit will not be given for both HI 442 and HI 542."}, {"summer": "True", "name": "U.S. Constitutional History to 1883", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "443", "fall": "True", "units": " 3", "description": "This course examines the origins and development of the U. S. Constitution from the Articles of Confederation to 1883. The course specifically looks at the federal Convention of 1787, the national bank debate and early constitutional interpretation;the constitution and its interaction with politics, economics, and society; the powers of Congress-taxation, contracts, commerce and war. The course also examines sovereignty, slavery and civil rights. It ends with an analysis of the Civil War Amendments and the transformation in American constitutionalism. Credit for both HI 443 and HI 543 is not allowed"}, {"summer": "True", "name": "U.S. Constitutional History Since 1870", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "444", "fall": "True", "units": " 3", "description": "Examines the transformation of American Constitutional thought after the Civil War; the triumph of nationalism and the evolution of a new federal theory; the rise and fall of federal protections of civil rights in the late 19th-century and the CivilRights Revolution in the 20th century. Explores key concepts as civil liberties, judicial activism and judicial restraint; procedural and substantive due process, liberty of contracts and entrepreneurial liberty, Japanese internment, privacy, women and gender issues; explores free speech, religious freedom, civil liberties. Credit for both HI 444 and HI 544 is not allowed."}, {"summer": "True", "name": "Early American Frontier", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "445", "fall": "True", "units": " 3", "description": "Examines the social, political, and cultural development of the eastern American frontiers between the early seventeenth and mid-nineteenth centuries.  Addresses the relationships between settlers and environments, settlers and Native Americans.  Explores the structure and life of pioneer families, the development of new institutions, the role of governments in regulating settlements, and the evolution of the \"frontier myth.\" Credit cannot be given for both HI 445 and HI 545."}, {"summer": "True", "name": "Civil War and Reconstruction", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "446", "fall": "True", "units": " 3", "description": "Examination of sectional polarization of the 1850's, impact of the war on both northern and southern societies, and trauma of reconstructing the Union. Credit will not be given for both HI 446 and HI 546"}, {"summer": "True", "name": "History of American Women to 1900", "prerequisites": "Prerequisite: 3 hours of History", "spring": "True", "number": "447", "fall": "True", "units": " 3", "description": "The historical experience of women in America from the colonial period to 1890.  Women's work, education, legal and political status, religious experience, and sex roles:  age, class, race, sexual preference, and region as significant variables in women's experience. Credit will not be given for both HI (WGS) 447 and HI (WGS) 547."}, {"summer": "True", "name": "American Women in the Twentieth Century", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "448", "fall": "True", "units": " 3", "description": "Women's historical experience in America, 1890-1990.  Changes in women's work, education, legal and political status, and sex roles, age, class, race, sexual preference and region as significant variables in women's experience.Credit will not be given for both HI (WGS) 448 and HI (WGS) 548."}, {"summer": "True", "name": "U.S. Labor to 1900", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "449", "fall": "True", "units": " 3", "description": "History of work, workers, and working-class organizations and politics in colonial and nineteenth-century America. Credit will not be given for both HI 449 and HI 549"}, {"summer": "True", "name": "U.S. Labor Since 1900", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "450", "fall": "True", "units": " 3", "description": "History of work, workers, and working-class organizations and politics in twentieth-century America. Credit will not be given for both HI 450 and HI 550"}, {"summer": "True", "name": "The Vietnam War", "prerequisites": "Prerequisite: 3 hours of History", "spring": "True", "number": "451", "fall": "True", "units": " 3", "description": "Analysis of U.S. involvement in Vietnam, including an introduction to Vietnamese history, why the United States intervened in Vietnam, the various forms U.S. intervention took, which Americans went to Vietnam and what they expected there, the consequences of U.S. involvement for Americans and Vietnamese, the effort to end American participation in the war, and the war's legacy. Credit for both HI 451 and HI 551 is not allowed"}, {"summer": "True", "name": "Recent America", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "452", "fall": "True", "units": " 3", "description": "Examination of contemporary opinions and historical interpretations of major problems in American life since 1939, including World War II, its social and economic consequences; Korea and the Cold War, big business and labor; civil rights and feminist movements; countercultures, Vietnam and Watergate. Credit will not be given both for HI 452 and HI 552"}, {"summer": "True", "name": "United States-Latin American Relations Since 1823", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "453", "fall": "True", "units": " 3", "description": "Analysis of periods, issues, and events in U.S.-Latin American relations since 1823: Monroe Doctrine, Manifest Destiny, Mexican and Spanish-American Wars, Dollar Diplomacy, Good Neighbor Policy, anti-Communist crusade since 1945, Alliance for Progress, U.S. responses to revolution. Historical perspective on contemporary inter-American problems on drugs, environment, debt crisis, and human rights abuses. Credit will not be given both for HI 453 and HI 553"}, {"summer": "True", "name": "History of U.S. Foreign Relations, 1900-Present", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "454", "fall": "True", "units": " 3", "description": "America's emergence as a world power; American diplomatic history since 1900; the expansion of American economic and cultural relations; the evolution of the American foreign policy bureaucracy; and the historical forces and personalities that have shaped American relations with other nations. Credit for both HI 454 and HI 554 will not be allowed"}, {"summer": "True", "name": "History of the Civil Rights Movement", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "455", "fall": "True", "units": " 3", "description": "The black revolution; stages and leaders of the movement; successes and failures in the fight for desegregation, the vote, and economic opportunity; impact of Civil Rights movement on the United States. Credit will not be given both for HI (AFS) 455 and HI 555"}, {"summer": "True", "name": "Early American Thought", "prerequisites": "Prerequisite: 3 hours of History", "spring": "True", "number": "456", "fall": "True", "units": " 3", "description": "American intellectual history to 1865.  Influence of reformation, enlightenment, scientific revolution, capitalism and romanticism on social and political order. Credit will not be given for both HI 456 and HI 556"}, {"summer": "True", "name": "Twentieth-Century U.S. Intellectual History", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "457", "fall": "True", "units": " 3", "description": "American intellectuals and their views on 20th-century topics such as politics,  culture, race and gender in historical context. Credit for both HI 457 and HI 557 is not allowed"}, {"summer": "True", "name": "Modern American Historical Biography", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "458", "fall": "True", "units": " 3", "description": "Credit will not be given for both HI 458 and HI 558. American history in the 20th century through the medium of historical biography. Credit will not be given for both HI 458 and HI 558"}, {"summer": "True", "name": "The Early American Republic", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "459", "fall": "True", "units": " 3", "description": "Examines the social, political, and cultural development of the Early  Republic, the period in American history roughly from the Revolutionary War through the Administration of John Quincy Adams.  Employs the life of Thomas Jefferson-the quintessential American, as the foundation for delving into the historical problems, interpreting primary sources, and analyzing secondary sources.  encourages graduate students to analyze the ways in which historiographic debates complicate our understanding of the Early American Republic. Credit will not be given for both HI 459 and HI 559."}, {"summer": "True", "name": "Civilization of the Old South", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "461", "fall": "True", "units": " 3", "description": "The distinctive features of the Old South as part of the regional development of United States history. Consideration of colonial factors in the making of the South, development of the plantation system and slavery, Southern social order, intellectual and cultural life, economic development, and rise of Southern nationalism. Credit will not be given for both HI 461 and HI 561"}, {"summer": "True", "name": "Social History of the New South", "prerequisites": "Prerequisite: 3 hours of History", "spring": "True", "number": "462", "fall": "True", "units": " 3", "description": "Analysis of the change and continuity in the American South from the end of the Civil War through the present. Credit will not be awarded both for HI 462 and HI 562"}, {"summer": "True", "name": "Oil and Crisis in the Gulf", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "465", "fall": "True", "units": " 3", "description": "Historical roots and development of the Persian Gulf region from the late nineteenth century until the present with an emphasis on the social, economic, cultural and political transformations following the discovery of oil, and subsequent events such as the Arab Oil embargo of 1973, the Iranian Revolution, the Iran-Iraq war, and the two Gulf wars."}, {"summer": "True", "name": "History of the Palestinian-Israeli Conflict", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "466", "fall": "True", "units": " 3", "description": "Historical roots and development of the Palestinian-Israeli conflict from the late nineteenth century until the present through the study of the history and historiography of Zionism, Palestinian nationalism, creation of the state of Israel, establishment of settlements, conflicts and peace negotiations, as well as a study of the impact of this conflict on both Israeli and Palestinian societies, economies and cultures."}, {"summer": "True", "name": "Modern Mexico", "prerequisites": "Prerequisite: 3 hours of History", "spring": "True", "number": "467", "fall": "True", "units": " 3", "description": "Major developments in Mexican national life since 1821. The 19th century: the era of Santa Anna, the war with the United States, the Reform, the French intervention, and the dictatorship of Profirio Diaz. The 1910 Revolution and the resulting transformation of Mexico's political, social and economic institutions. Reading knowledge of Spanish helpful but not required."}, {"summer": "True", "name": "Latin American Revolutions in the Twentieth Century", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "469", "fall": "True", "units": " 3", "description": "Comparative analysis of causes, participants, process, and outcome of revolutions in Mexico, Bolivia, Cuba, and Central America. Credit for both HI 469 and HI 569 will not be given"}, {"summer": "True", "name": "Seminar: Teaching World History", "prerequisites": "Prerequisite: 3 hours of History", "spring": "True", "number": "470", "fall": "True", "units": " 3", "description": "Introduction to historiography and themes of world history; designed for, but not restricted to, LTH students planning to teach world history."}, {"summer": "True", "name": "Revolutionary China", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "471", "fall": "True", "units": " 3", "description": "China 1900 to present. Examination of political, cultural, and socio-economic revolutionary phases of China's 20th-century transformation from traditional empire to communism. Particular attention to post-1949 problems of nation-building. Credit will not be given for both HI 471 and HI 571"}, {"summer": "True", "name": "Japan's Empire in Asia, 1868-1945", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "473", "fall": "True", "units": " 3", "description": "An advanced survey of Japanese relations with Asia in the nineteenth and twentieth centuries.  Structures and ideologies of imperialism and colonialism; modernization, nationalism and social change; migration and mobility; resistance and collaboration; and legacies of empire. Credit will not be given for both HI 473 and HI 573"}, {"summer": "True", "name": "Modern India", "prerequisites": "Prerequisite: 3 hours of History", "spring": "True", "number": "474", "fall": "True", "units": " 3", "description": "The history of the Indian sub-continent, from the 16th century to the present. Focus on political, economic and cultural change under the Mughal Empire and the British Raj; the problems of independent India, Pakistan and Bangladesh."}, {"summer": "True", "name": "History of the Republic of South Africa", "prerequisites": "Prerequisite: 3 hours of History", "spring": "True", "number": "475", "fall": "True", "units": " 3", "description": "Evolution of the Republic of South Africa's society, with emphasis on the interaction of diverse peoples and cultures. Particular attention is given to the period since 1870.  Credit will not be given for both HI (AFS) 475 and HI 575."}, {"summer": "True", "name": "Leadership in Modern Africa", "prerequisites": "Prerequisite: 3 hours of History", "spring": "True", "number": "476", "fall": "True", "units": " 3", "description": "Recent sub-Saharan African political history (excluding South Africa).  Overview of concepts, vocabulary, historical trends. Detailed examination of specific African countries as case studies, such as Ghana, Nigeria, Zimbabwe, Tanzania. Credit will not be given for both HI (AFS) 476 and HI 576."}, {"summer": "True", "name": "Women in the Middle East", "prerequisites": "Prerequisite: 3 hours of History", "spring": "True", "number": "477", "fall": "True", "units": " 3", "description": "The varied forces influencing lives of women in Middle East from beginning of Islam to present."}, {"summer": "True", "name": "Islam and Christianity in Sub-Saharan Africa", "prerequisites": "Prerequisite: 3 hours of History", "spring": "True", "number": "478", "fall": "True", "units": " 3", "description": "Expansion and interaction of Islam and Christianity in sub-Saharan Africa in the nineteenth and twentieth centuries, and their influence and impact on the economy, politics, and society.  Topics include missionary activity, resistance to imperial authority, the role of the churches, and the influence of religion on leadership, education, nationalism, and post-colonialism. Credit will not be given for both HI 478 and HI 578."}, {"summer": "True", "name": "Africa (sub-Saharan) in the Twentieth Century", "prerequisites": "Prerequisite: 3 hours of History", "spring": "True", "number": "479", "fall": "True", "units": " 3", "description": "Developments in sub-Saharan Africa during the colonial period, from the end of the nineteenth century to the advent of decolonization in the early 1960s.  Interplay of political, social, economic and cultural factors in the experiences of African peoples during this period. Credit will not be given for both HI (AFS) 479 and HI 579"}, {"summer": "True", "name": "Scientific Revolution: 1300-1700", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "480", "fall": "True", "units": " 3", "description": "Factors behind dramatic scientific changes of the seventeenth century. Role of mathematics and experiment. Interaction of the new science with trends in philosophy, religion, alchemy, magic, medicine, and with institutional, educational, political, economic and technological factors. Credit will not be given for both HI 480 and HI 580."}, {"summer": "True", "name": "History of the Life Sciences", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "481", "fall": "True", "units": " 3", "description": "The major ideas, methods, institutions, and individuals that have contributed to the biological sciences from Renaissance to modern times.  The connections between the life sciences and other aspects of culture, including the physical sciences, religious belief, medical practice, and agriculture. Credit will not be given for both HI 481 and HI 581"}, {"summer": "True", "name": "Darwinism in Science and Society", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "482", "fall": "True", "units": " 3", "description": "Scientific development of Darwinism and its reception by the scientific community and the general public.  Social impact of theories of evolution as reflected in Social Darwinism, eugenics, sociobiology, and relationship of sciences to ethics and religion. Credit will not be given both for HI 482 and HI 582"}, {"summer": "True", "name": "Science and Religion in European History", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "483", "fall": "True", "units": " 3", "description": "The historical conflict between science and religion; crisis of religion; science as a new cultural authority; political and institutional landscape of science and religion in Europe. Credit will not be given for both HI 483 and HI 583"}, {"summer": "True", "name": "Science in European Culture", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": "True", "number": "484", "fall": "True", "units": " 3", "description": "Relationship between science and culture in European history; evaluation of 'two cultures' thesis; scientific instruments, universal expos, science and literature. Credit will not be given for both HI 484 and HI 584"}, {"summer": "True", "name": "History of American Technology", "prerequisites": "Prerequisite: 3 hours of History", "spring": "True", "number": "485", "fall": "True", "units": " 3", "description": "Technology in American history: the ideological, social, economic, and institutional contexts of technological change from the 1760's to the present. Impacts of new technological systems. Credit will not be given for both HI 485 and HI 585."}, {"summer": "True", "name": "Seminar in History", "prerequisites": "Prerequisite: 3 hours of History, Junior standing", "spring": "True", "number": "491", "fall": "True", "units": " 3", "description": "Detailed investigation of selected topics in history. Consult Department of History for specific topics."}, {"summer": "True", "name": "Honors Research in History I", "prerequisites": "Prerequisite: Senior in History Honors Program", "spring": "True", "number": "495", "fall": "True", "units": " 2", "description": "Preparation of the honors thesis. Topics and procedures to be determined by the student and the supervising faculty member."}, {"summer": "True", "name": "Honors Research in History II", "prerequisites": "Prerequisite: HI 495, Senior in History Honors Program", "spring": "True", "number": "496", "fall": "True", "units": " 4", "description": "Completion of the honors thesis. Topics and procedures to be determined by the student and the supervising faculty member."}, {"summer": "True", "name": "Independent Study in History", "prerequisites": "Prerequisite: 3 hours of History", "spring": "True", "number": "498", "fall": "True", "units": " 1-6", "description": "Extensive readings on predetermined topics focused around a central theme. Permission of the department is required."}, {"summer": "True", "name": "Civilizations of the Ancient Near East", "spring": "True", "number": "500", "fall": "True", "units": " 3", "description": "The civilizations of Mesopotamia and Egypt from earliest times to fall of Babylon in 539 B.C. Credit for both HI 400 and HI 500 is not allowed"}, {"summer": "True", "name": "Rome To 337 A.D.", "spring": "True", "number": "504", "fall": "True", "units": " 3", "description": "Development of ancient Rome from its origins in Italy, through its rise as an Empire embracing entire Mediterranean World and Western Europe, to Constantine, Christianity and the foundation of Constantinople. Critical examination of political achievement of a people who rose from an obscure Italian city to a world empire, with emphasis on analysis of primary courses. Credit for both HI 404 and HI 504 is not allowed"}, {"summer": "True", "name": "History and Archaeology Of the Roman Empire", "spring": "True", "number": "505", "fall": "True", "units": " 3", "description": "Analysis of Rome's unparalleled rule over the entire Mediterranean World in first four centuries A. D. through use of literary and archaeological sources. Special emphasis on imperial army and frontier security. Credit for both HI 405 and HI 505 is not allowed"}, {"summer": "True", "name": "From Roman Empire To Middle Ages", "spring": "True", "number": "506", "fall": "True", "units": " 3", "description": "Late Antiquity and the early Middle Ages. The transition from classical civilization to basis of modern civilizations: the Fall of Rome, the Germanic kingdoms, Byzantium, establishment of Christianity, birth and growth of Islam. Credit for both HI 406 and HI 506 is not allowed"}, {"summer": "True", "name": "Islamic History To 1798", "spring": "True", "number": "507", "fall": "True", "units": " 3", "description": "History of Islamic Near East to 1798.  The East Mediterranean before Islam, Muhammad and the development of Islam, sources of Muslim civilization; Islamic law, science, philosophy, art and architecture; Islam in Spain, India, Asia and Africa, the Crusades, the Ottomans; Islam and Europe. Credit for both HI(REL) 407 and HI 507 is not allowed"}, {"summer": "True", "name": "The High Middle Ages", "spring": "True", "number": "509", "fall": "True", "units": " 3", "description": "Medieval culture 936-1250: revival of the Roman Empire, monastic and papal reform, rise of universities, evolution of representative bodies, the Gothic style, troubadour and goliardic poetry, scholasticism and revival of Roman law. Credit for both HI 409 and HI 509 is not allowed"}, {"summer": "True", "name": "The Protestant and Catholic Reformation Of the 16TH Century", "spring": "True", "number": "511", "fall": "True", "units": " 3", "description": "Conditions and criticisms which led to reform and the nature of institutional, theological and social changes effected by various churches and sects. Special attention to Luther and Calvin. Credit for both HI 411 and HI 511 is not allowed"}, {"summer": "True", "name": "The Sexes and Society in Early-Modern Europe", "spring": "True", "number": "512", "fall": "True", "units": " 3", "description": "Examination of both changes in gender relations; ideas about the sexes, femininity, and masculinity; the roles of women and men in political, religious, economic, scientific, and family life in Europe between the late Middle Ages and the French Revolution.  Credit for both HI 512 and 412 is not allowed."}, {"summer": "True", "name": "France In the Old Regime", "spring": "True", "number": "514", "fall": "True", "units": " 3", "description": "France from sixteenth century to the Revolution, development of renaissance and absolutist state, social and economic change, religious reform and Enlightenment, origins and beginnings of the Revolution. Credit for both HI 414 and HI 514 is not allowed"}, {"summer": "True", "name": "Revolutionary Europe", "spring": "True", "number": "515", "fall": "True", "units": " 3", "description": "A broadly based analysis of France's first revolutionary era. The Enlightenment and its impact, causes and character of the Revolution in France and impact of these events in France and Europe. Credit for both HI 415 and HI 515 is not allowed"}, {"summer": "True", "name": "Fascist Italy and Nazi Germany", "prerequisites": "Prerequisite: 6 hours of Advanced History", "spring": "True", "number": "518", "fall": "True", "units": " 3", "description": "Fascism as a theoretical concept, rise of fascism in Italy and Germany, seizure of power by Mussolini and Hitler, organization of economy, churches, military, women, youth and culture under dictatorships. Students will not receive credit for both HI418 and HI 518"}, {"summer": "True", "name": "Modern European Imperialism", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "519", "fall": "True", "units": " 3", "description": "Historical background of European expression; its impact on the economics, politics and culture of both Europe and the colonized world; the significance of imperialism and anti-colonial nationalism in shaping the modern world. Credit for both HI 419and HI 519 is not allowed"}, {"summer": "True", "name": "European Diplomatic History", "prerequisites": "Prerequisite: 6 hours of Advanced History", "spring": "True", "number": "520", "fall": "True", "units": " 3", "description": "Survey of major issues and events in European international relations, including Congress of Vienna in 1815, unification of Germany, World War I and II, origins of Cold War, European unification, and crisis of Soviet bloc. Credit for both HI 420 andHI 520 is not allowed"}, {"summer": "True", "name": "European Intellectual History: The Eighteenth Century", "spring": "True", "number": "521", "fall": "True", "units": " 3", "description": "Historical examination of some of major figures of the European Enlightenment, beginning with Locke and ending with Kant. Credit for both HI 421 and HI 521 is not allowed"}, {"summer": "True", "name": "European Intellectual History: The 19TH Century", "spring": "True", "number": "522", "fall": "True", "units": " 3", "description": "Historical examination of some of major figures of European thought during 19th century, beginning with enthusiasm of the period of the French Revolution and ending with the disillusionment of the fin de siecle. Credit for both HI 422 and HI 522 is not allowed"}, {"summer": "True", "name": "Women in European Enlightenment", "spring": "True", "number": "523", "fall": "True", "units": " 3", "description": "Historical examination of construction of female \"nature\", resources available to women writers and intellectuals, and constraints on women's education, writing and publication during the Enlightenment period. Credit will not be given for both HI 423 and HI 523."}, {"summer": "True", "name": "Tudor and Stuart England", "spring": "True", "number": "525", "fall": "True", "units": " 3", "description": "British history from the Reformation to the Civil War. Primary emphasis on certain key developments in social, political and economic life, such as development of a new concept of kingship, the growing independence of Parliament, the search for religious uniformity and changing status of aristocracy and gentry. Credit for both HI 425 and HI 525 is not allowed"}, {"summer": "True", "name": "Modern France", "spring": "True", "number": "530", "fall": "True", "units": " 3", "description": "French history from the downfall of Napoleon I to the present, with a short introductory survey of the Old Regime and the French Revolution. Cultural, social and economic developments and political trends. Credit for both HI 430 and HI 530 is not allowed"}, {"summer": "True", "name": "History Of Germany Since 1871", "prerequisites": "Prerequisite: 6 hours of Advanced History", "spring": "True", "number": "532", "fall": "True", "units": " 3", "description": "German history from the unification of 1871 to the present, concentrating  on problems of nationalism and political and social reform. Credit for both HI 432 and HI 532 is not allowed"}, {"summer": "True", "name": "Theory and Practice of Oral History", "spring": "True", "number": "533", "fall": "True", "units": " 3", "description": "Explores the practice of oral history.  Examines historical works drawn primarily from oral sources.  Teaches students to design and implement oral history projects based on independent research."}, {"summer": "True", "name": "History and Digital Media", "spring": "True", "number": "534", "fall": "True", "units": " 3", "description": "Introduces students to the theory and practice of digital history. Students will examine theoretical scholarship on digital practices in history, exploring issues of capacity, accessibility, interactivity, and hypertextuality. Students will critique examples of digital history including digital archives, exhibits, scholarships, and teaching resources, and then apply conceptual knowledge in the creation of their own digital history projects. Graduate standing or PBS status."}, {"summer": "True", "name": "The Russian Empire To 1917", "spring": "True", "number": "538", "fall": "True", "units": " 3", "description": "History of the Russian Empire to the Revolution of 1917. Kiev Rus and the Mongol conquest; serfdom, territorial expansion and cultural insularity of Great Russian state in Moscow; Westernization, reform and great power status in 18th and 19th centuries; peoples of multinational empire; culture, educated society and revolutionary opposition; industrialization, rapid urbanization, war and revolution. Credit for both HI 438 and HI 538 is not allowed"}, {"summer": "True", "name": "History Of the Soviet Union and After", "spring": "True", "number": "539", "fall": "True", "units": " 3", "description": "History of the Soviet state and society from the 1917 Revolution, including post-Soviet situation. Political disarray and resistance to the Bolshevik regime, 1917-21; industrialization, urbanization and application of coercive techniques of rule; popular reconciliation with Party state and great power status during World War II and after; fate of non-Russian nationalities; de-Stalinization, stagnation and failed attempt at Party renewal after 1985. Credit for both HI 439 and HI 539 is not allowed"}, {"summer": "True", "name": "American Environmental History", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "540", "fall": "True", "units": " 3", "description": "Interaction between humans and their environments in America; environmental focus on themes in American history such as colonial settlements, industrialization, progressivism, the new Deal, the 1960s. Credit will not be given for both HI 440 and HI 540."}, {"summer": "True", "name": "Colonial and Revolutionary U.S.", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "541", "fall": "True", "units": " 3", "description": "Origins of English colonies in America to the American Revolution.  European background to colonization, merging of different cultures, effects of mercantile doctrine, causes of revolution. Credit for both HI 441 and HI 541 is not allowed.  Credit for both HI 441 and HI 541 is not allowed."}, {"summer": "True", "name": "Creating the Constitution: Origins and Development", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "542", "fall": "True", "units": " 3", "description": "Analysis of state and federal constitutions developed in the United States after 1776.  Theories behind a federal constitution; the Philadelphia Convention of 1787; the ratification debate; and the bill or rights. Credit will not be given for both HI 442 and HI 542"}, {"summer": "True", "name": "U.S. Constitutional History to 1883", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "543", "fall": "True", "units": " 3", "description": "Examines the origins and development of the United States Constitution from the Articles of Confederation to 1883. Analyzes the Federalist-Antifederalist debates; evaluates the constitution and its interaction with politics, economics, and society. Studies the powers of Congress-taxation, contracts, commerce, war, and First Amendment issues. Explores sovereignty, civil rights, and the new federalism after the Civil War. Assesses the meaning of procedural and substantive due process, and the state action theory. Appraises the transformation in American constitutionalism during Reconstruction. students may not earn credit for both HI 443 and HI 543"}, {"summer": "True", "name": "US Constitutional History Since 1870", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "544", "fall": "True", "units": " 3", "description": "Examines the transformation of American constitutional thought after the Civil War; the triumph of nationalism and the evolution of a new federal theory; the rise and fall of federal protections of civil rights. Explores key concepts such as civil liberties, judicial activism and judicial restraint; analyzes procedural and substantive due process, liberty of contracts and entrepreneurial liberty; evaluates Japanese internment, privacy, gender equality, free speech, religious freedom, civil liberties. credit not given for both HI 444 and 544"}, {"summer": "True", "name": "Early American Frontier", "spring": "True", "number": "545", "fall": "True", "units": " 3", "description": "Examines the social, political, and cultural development of the eastern American frontiers between the early seventeenth and mid-nineteenth centuries.  Addresses the relationships between settlers and environments, settlers and Native Americans.  Explores the structure and life of pioneer families, the development of new institutions, the role of governments in regulating settlements, and the evolution of the \"frontier myth\".  Graduate standing or permission of instructor.  Credit cannot be given for both HI 445 and HI 545."}, {"summer": "True", "name": "Civil War and Reconstruction", "spring": "True", "number": "546", "fall": "True", "units": " 3", "description": "Examination of sectional polarization of the 1850s, the impact of the war on both northern and southern societies and trauma of reconstructing the Union. Credit for both HI 446 and HI 546 is not allowed"}, {"summer": "True", "name": "History Of American Women To 1900", "prerequisites": "Prerequisite: 6 hours of Advanced History", "spring": "True", "number": "547", "fall": "True", "units": " 3", "description": "Historical experience of women in America from colonial period to 1890. Women's work, education, legal and political status, religious experience and sex roles: age, class, race, sexual preference and region as significant variables in women's experience.Credit for both HI (WGS) 447 and HI  (WGS) 547 is not allowed"}, {"summer": "True", "name": "American Women In the Twentieth Century", "spring": "True", "number": "548", "fall": "True", "units": " 3", "description": "Women's historical experience in America, 1890-1990.  Changes in women's work, education, legal and political status, and sex roles; age, class, race, sexual preference and region as significant variables in women's experience.  Credit for both HI (WGS) 448 and  HI (WGS) 548 is not allowed."}, {"summer": "True", "name": "U. S. Labor To 1900", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "549", "fall": "True", "units": " 3", "description": "The history of work, workers, and working-class organizations and politics in colonial and nineteenth-century America. Credit for both HI 449 and HI 549 is not allowed"}, {"summer": "True", "name": "U. S. Labor Since 1900", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "550", "fall": "True", "units": " 3", "description": "History of work, workers, and working-class organizations and politics in twentieth-century America. Credit for both HI 450 and HI 550 is not allowed"}, {"summer": "True", "name": "The Vietnam War", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "551", "fall": "True", "units": " 3", "description": "Analysis of U.S. involvement in Vietnam, including an introduction to Vietnamese history, why the United States intervened in Vietnam, the various forms U.S. intervention took, which Americans went to Vietnam and what they experienced there, the consequences of U.S. involvement for Americans and Vietnamese, the effort to end American participation in the war, and the war's legacy. Credit for both HI 451 and HI 551 is not allowed"}, {"summer": "True", "name": "Recent America", "spring": "True", "number": "552", "fall": "True", "units": " 3", "description": "Examination of contemporary opinions and \"historial\" interpretations of major problems in American life since 1939 including World War II, its social and economic consequences; Korea and the Cold War; big business and labor; civil rights and feminist movements; countercultures, Vietnam and Watergate. Credit for both HI 452 and HI 552 is not allowed"}, {"summer": "True", "name": "U. S.-Latin American Relations Since 1823", "spring": "True", "number": "553", "fall": "True", "units": " 3", "description": "Analysis of periods, issues and events in U.S.-Latin American relations since 1823, Monroe Doctrine, Manifest Destiny, Mexican and Spanish-American Wars, Dollar Diplomacy, Good Neighbor Policy, anti-Communist crusade since 1945, Alliance for Progress, U. S. responses to revolution. Historical perspective on contemporary inter-American problems--drugs, environment, debt crisis, human rights abuses. Credit for both HI 453 and HI 553 is not allowed"}, {"summer": "True", "name": "History Of U. S. Foreign Relations, 1900-Present", "spring": "True", "number": "554", "fall": "True", "units": " 3", "description": "American diplomatic history since 1900; the expansion of American economic and cultural relations; the evolution of the American foreign policy bureaucracy; and the historical forces and personalities that shaped American relations with other nations. Credit for both HI 454 and HI 554 is not allowed"}, {"summer": "True", "name": "History Of the Civil Rights Movement", "prerequisites": "Prerequisite: 6 hours of Advanced History, Junior standing", "spring": "True", "number": "555", "fall": "True", "units": " 3", "description": "The \"black revolution;\" stages and leaders of the movement; successes and failures in fight for desegregation, the vote and economic opportunity; impact of Civil Rights movement on the United States. Credit for both HI (AFS) 455 and HI 555 is not allowed"}, {"summer": "True", "name": "Early American Thought", "prerequisites": "Prerequisite: 3 hours of History", "spring": "True", "number": "556", "fall": "True", "units": " 3", "description": "American intellectual history to 1865. Influence of Reformation, enlightenment, scientific revolution, capitalism and romanticism on social and political order. Credit for both HI 456 and HI 556 is not allowed"}, {"summer": "True", "name": "Twentieth-Century U. S. Intellectual History", "spring": "True", "number": "557", "fall": "True", "units": " 3", "description": "American intellectuals and their views on 20th-century topics such as politics, culture, race and gender in historical context. Credit for both HI 457 and HI 557 is not allowed"}, {"summer": "True", "name": "Modern American Historical Biography", "spring": "True", "number": "558", "fall": "True", "units": " 3", "description": "American history in the 20th century through medium of historical biography. Credit for both HI 458 and HI 558 is not allowed"}, {"summer": "True", "name": "The Early American Republic", "spring": "True", "number": "559", "fall": "True", "units": " 3", "description": "Examines the social, political, and cultural development of the Early Republic, the period in American history roughly from the Revolutionary War through the administration of John Quincy Adams.  Employs the life of Thomas Jefferson-the quintessential American-as the foundation for delving into historical problems, interpreting primary sources, and analyzing secondary sources.  Encourages graduate students to analyze the ways in which historiographic debates complicate our understanding of the Eearly American Republic.  Graduate standing or permission of instructor. Credit cannot be given for both HI 459 and HI 559."}, {"summer": "True", "name": "Civilization Of the Old South", "spring": "True", "number": "561", "fall": "True", "units": " 3", "description": "Distinctive features of the Old South as part of the regional development of the U. S. Colonial factors in the making  of the South, development of the plantation system and slavery, Southern social order, intellectual and cultural life, economic development and rise of Southern nationalism. Credit for both HI 461 and HI 561 is not allowed"}, {"summer": "True", "name": "Social History Of the New South", "prerequisites": "Prerequisite: 6 hours of Advanced History", "spring": "True", "number": "562", "fall": "True", "units": " 3", "description": "Analysis of change and continuity in American South from end of Civil War through present. Credit for both HI 462 and HI 562 is not allowed."}, {"summer": "True", "name": "History and Memory", "spring": "True", "number": "563", "fall": "True", "units": " 3", "description": "Explores how \"collective memory\" develops.  Examines how memory is represented through public speeches, civic celebrations, monuments and memorials, and other forms of popular and political culture.  Analyzes what is recalled, what is forgotten, and who decides.  Asks why memory is made public.  For graduate students."}, {"summer": "True", "name": "Readings in Native American History", "spring": "True", "number": "566", "fall": "True", "units": " 3", "description": "Readings in the varied historical experiences of nations native to North America from the first migrations of peoples into the continent until the present, including the variety and diversity of native cultures and experiences; native resistance to colonialism, expansion, and U.S. federal policies; and the survival and continuity of native cultures and peoples through more than four centuries of contact, conquest, and change."}, {"summer": "True", "name": "Latin American Revolutions In the Twentieth Century", "spring": "True", "number": "569", "fall": "True", "units": " 3", "description": "Comparative analysis of causes, participants, process and outcome of revolutions in Mexico, Bolivia, Cuba and Central America. Credit for both HI 469 and HI 569 is not allowed"}, {"summer": "True", "name": "Revolutionary China", "spring": "True", "number": "571", "fall": "True", "units": " 3", "description": "China 1900 to present. Examination of political, cultural and socio-economics revolutionary phases of China's 20th-century trans-formation from traditional empire to communism.  Particular attention to post-1949 problems of nation building. Credit for both HI 471 and HI 571 is not allowed"}, {"summer": "True", "name": "The Rise of Modern Japan, 1850-Present", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "572", "fall": "True", "units": " 3", "description": "Japan's emergence as a modern nation and world power.  Topics include nation-state formation; modernization and its dislocations; democratization and authoritarianism; imperialism, international politics, and war; postwar reforms; changing gender relations; popular culture; and social problems. Credit will not be given for both HI 472 and HI 572"}, {"summer": "True", "name": "Japan's Empire in Asia, 1868-1945", "prerequisites": "Prerequisite: 6 hours of advanced history", "spring": "True", "number": "573", "fall": "True", "units": " 3", "description": "Advanced survey of Japanese relations with Asia in the nineteenth and twentieth centuries.  Structures and ideologies of imperialism and colonialism; modernization, nationalism, and social change; migration and mobility; resistance and collaboration; and legacies of empire."}, {"summer": "True", "name": "History Of the Republic Of South Africa", "prerequisites": "Prerequisite: 6 hours of Advanced History", "spring": "True", "number": "575", "fall": "True", "units": " 3", "description": "Evolution of Republic of South Africa's society, with emphasis on interaction of diverse peoples and cultures. Particular attention given to period since 1870. Credit for both HI 475 and HI 575 is not allowed"}, {"summer": "True", "name": "Leadership In Modern Africa", "spring": "True", "number": "576", "fall": "True", "units": " 3", "description": "Conditions under which 20th century African leaders have obtained and exercised power. Case studies of prominent leaders,  both radicals, reactionaries, democrats and tyrants, such as Nkrumah, Kenyatta, Nyerere, Amin, Cabral, Vorster and Senghor. Credit for both HI (AFS) 476 and HI 576 is not allowed"}, {"summer": "True", "name": "Islam and Christianity in Sub-Saharan Africa since the 19th Century", "spring": "True", "number": "578", "fall": "True", "units": " 3", "description": "Expansion and interaction of Islam and Christianity in sub-Saharan Africa in the nineteenth and twentieth centuries, and their influence and impact on the economy, politics, and society.  Topics include missionary activity, resistance to imperial authority, the role of the churches, and the influence of religion on leadership, education, nationalism, and post-colonialism. Credit will not be given for both HI 478 and HI 578; graduate standing for HI 578."}, {"summer": "True", "name": "African (sub-Saharan) in the Twentieth Century", "prerequisites": "Prerequisite: 6 hours of Advanced History", "spring": "True", "number": "579", "fall": "True", "units": " 3", "description": "Developments in sub-Saharan Africa during colonial period, from end of 19th century to advent of decolonization in early 1960s.  Interplay of political, social, economic and cultural factors in experiences of African peoples during this period. Students will not receive credit for both HI (AFS) 479 and HI  579"}, {"summer": "True", "name": "Scientific Revolution: 1300-1700", "spring": "True", "number": "580", "fall": "True", "units": " 3", "description": "Factors behind dramatic scientific changes of the seventeenth century. Role of mathematics and experiment. Interaction of new science with trends in philosophy, religion, alchemy, magic, medicine and with institutional educational, political, economic and technological factors.Credit for both HI 480 and HI 580 is not allowed"}, {"summer": "True", "name": "History Of Life Sciences", "spring": "True", "number": "581", "fall": "True", "units": " 3", "description": "Major ideas, methods, institutions and individuals contributing to biological sciences from the Renaissance to modern times. Connections between life sciences and other aspects of culture, including physical sciences, religious belief, medical practice and agriculture. Credit for both HI 481 and HI 581 is not allowed"}, {"summer": "True", "name": "Darwinism In Science and Society", "prerequisites": "Prerequisite: 6 hours of Advanced History", "spring": "True", "number": "582", "fall": "True", "units": " 3", "description": "Scientific development of Darwinism and its reception by the scientific community and the general public.  Social impact of theories of evolution as reflected in Social Darwinism, eugenics, sociobiology, and relationship of sciences to ethics and religion. Credit for both HI 482 and HI 582 is not allowed"}, {"summer": "True", "name": "Science and Religion in European History", "prerequisites": "Prerequisite: 6 hours of Advanced History", "spring": "True", "number": "583", "fall": "True", "units": " 3", "description": "The historical conflict between science and religion; crisis of religon; science as a new cultural authority; political and institutional landscape of science and religion in Europe. Credit will not be given for both HI 483 and HI 583"}, {"summer": "True", "name": "Science in European Culture", "prerequisites": "Prerequisite: 6 hours of Advanced History", "spring": "True", "number": "584", "fall": "True", "units": " 3", "description": "Relationship between science and culture in European history, evaluation of \"two cultures\" thesis.  Scientific instruments, universal expositions, science and literature. Credit will not be given for both HI 484 and HI 584"}, {"summer": "True", "name": "History of American Technology", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "585", "fall": "True", "units": " 3", "description": "Technology in American history:  the ideological, social, economic, and institutional contexts of technological change from the 1760s to the present.  Impacts of new technological systems. Credit for both HI 485 and HI 585 is not allowed"}, {"summer": "True", "name": "Conservation of Archival and Library Materials", "spring": "True", "number": "588", "fall": "True", "units": " 3", "description": "Introduction to archival materials. Examination of and practice in storage and care of paper and books, prints, engravings and maps. Films, transparencies, negatives, magnetic tapes and phonorecords. Emphasis on preventive conservation. Completion of HI 587 or Permission of Director of Public History required."}, {"summer": "True", "name": "Interpretation in Historic Sites and Parks", "prerequisites": "Prerequisite: Graduate standing and Permission of Director of Public History Program", "spring": "True", "number": "589", "fall": "True", "units": " 3", "description": "Methodologies of interpreting history at historic sites and parks; training in interpretive tools linking historiography and research methodology with real places for presentation to the public; considerations of practical application.  Five day trips required.  Permission of Director of Public History required."}, {"summer": "True", "name": "Documentary Editing", "prerequisites": "Prerequisite: HI 596", "spring": "True", "number": "590", "fall": "True", "units": " 3", "description": "Introduction to field of documentary editing and historical publication.  Development of historical editing and rules of literal, expanded and modern editorial method.  Special documentary/papers projects."}, {"summer": "True", "name": "Museum Studies", "spring": "True", "number": "591", "fall": "True", "units": " 3", "description": "Organization and operation of museums as historical agencies.  Role of museums in historical research and education. Permission of Director of Public History required."}, {"summer": false, "name": "Evaluating the Historic Environment", "spring": true, "number": "592", "fall": false, "units": " 3", "description": "Methods and theories of researching, analyzing, documenting, and evaluating the historic built environment. Includes architectural survey field methods, documentation techniques, archival research, approaches to evaluating historic significance, and theories of preservation. Graduate standing"}, {"summer": "True", "name": "Material Culture", "spring": "True", "number": "593", "fall": "True", "units": " 3", "description": "Current theories of material culture analysis and their application to history museums. Completion of HI 592 or Permission of Director of Public History required."}, {"summer": "True", "name": "Cultural Heritage", "spring": "True", "number": "594", "fall": "True", "units": " 3", "description": "Use of the past and its cultures in reinforcing identities. Global development of heritage preservation, cultural resource management, and heritage tourism. Role of heritage professionals in identification, study, assessment, preservation, interpretation, management, and promotion of historic and cultural resources. Law and regulations that protect and preserve cultural resources."}, {"summer": "True", "name": "Introduction To Public History", "spring": "True", "number": "596", "fall": "True", "units": " 3", "description": "Introduction to applications of history to public life and to conservation and presentation of historical materials, with particular attention to conservation problems generated by modern technology. Archives, records management, historical editing,museology, historic preservation, historic sites and computer applications. Graduate Standing in History."}, {"summer": "True", "name": "Historiography and Historical Method", "spring": "True", "number": "597", "fall": "True", "units": " 3", "description": "Major steps in development of historical investigation; analysis of elements of historical research; discussion of methodology and archival materials used by contemporary scholarly historian."}, {"summer": "True", "name": "Historical Writing", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": "True", "number": "598", "fall": "True", "units": " 3", "description": "Critical studies in the methods and practice of contemporary historical writing."}, {"summer": "True", "name": "Independent Study", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": "True", "number": "599", "fall": "True", "units": " 1-6", "description": "Individualized study conducted under supervision of graduate faculty. Course of study, assigned readings, course projects or papers, and methods of evaluating work to be detailed in writing and approved by department head."}, {"summer": "True", "name": "Internship In Public History", "spring": "True", "number": "642", "fall": "True", "units": " 1-6", "description": "Supervised internship experience in public history. Permission of Director of Public History required."}, {"summer": "True", "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "685", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "688", "fall": "True", "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": "True", "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "689", "fall": "True", "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": "True", "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "693", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "695", "fall": "True", "units": " 1-9", "description": "Thesis Research"}, {"summer": "True", "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "696", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "699", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis. Credits Arranged"}, {"summer": "True", "name": "Summer Dissert Res", "spring": "True", "number": "896", "fall": "True", "units": " 1"}]