[{"summer": false, "name": "Honors Colloquium I", "prerequisites": "Prerequisite: HON student", "spring": false, "number": "101", "fall": true, "units": " 1", "description": "Introduction to Honors at NC State University for University Honors Program students.  Development of Honors Plan of Study and discussion of issues of concern in higher education and relationship between education, personal development, and community involvement. Require permission of the University Honors Program"}, {"summer": false, "name": "Honors Colloquium II", "prerequisites": "Prerequisite: HON 101, UHP student", "spring": true, "number": "102", "fall": false, "units": " 1", "description": "Introduction to Honors at NC State University for University Honors Program students.  Development of plan for honors research project and proposal for study abroad experience.  Further reflection on purpose of higher education in addressing the issues and opportunities of our time. Require permission of the University Honors Program"}, {"summer": "True", "name": "Inquiry, Discovery, and the Arts", "prerequisites": "Prerequisite: HON student", "spring": "True", "number": "201", "fall": "True", "units": " Performing Arts", "description": "A study of works of art that treat the theme of inquiry and discovery-its risks, its creativeness, its ambiguities and complexities, and its moral dilemmas.  Selected works from several media-theatre, music, visual arts, and film.  Analysis of each work in terms of its historical context and internal structure as well as its treatment of the nature of inquiry and discovery."}, {"summer": false, "name": "Inquiry, Discovery, and Literature", "prerequisites": "Prerequisite: HON student", "spring": true, "number": "202", "fall": true, "units": " 3", "description": "A study of works of literature that treats the themes of inquiry and discovery--its risks, its creativeness, its ambiguities and complexities, and its moral dilemmas--through selected works from literature and other media, including theater, music, visual arts, and film. Analysis of each work in terms of its historical context and internal structure as well as its treatment of the nature of inquiry and discovery."}, {"summer": false, "name": "Honors Special Topics - History", "prerequisites": "Prerequisite: HON student", "spring": true, "number": "290", "fall": true, "units": " 3", "description": "Seminar for University Honors Program students, repeatable if content varies, meeting GER requirements in History, interdisciplinary in character and often team-taught."}, {"summer": false, "name": "Honors Special Topics-Mathematics", "prerequisites": "Prerequisite: HON student", "spring": true, "number": "291", "fall": true, "units": " 3", "description": "Seminar for University Honors Program students, repeatable if content varies, meeting GER requirements in mathematics, interdisciplinary in character and often team-taught."}, {"summer": false, "name": "Honors Special Topics-Natural Sciences", "prerequisites": "Prerequisite: HON student", "spring": true, "number": "292", "fall": true, "units": " 3", "description": "Seminar for University Honors Program students, repeatable if content varies, meeting GER requirements in the natural sciences, interdisciplinary in character and often team-taught."}, {"summer": false, "name": "Honors Special Topics-Literature", "prerequisites": "Prerequisite: HON student", "spring": true, "number": "293", "fall": true, "units": " 3", "description": "Seminar for University Honors Program students, repeatable if content varies, meeting GER requirements in history or literature, interdisciplinary in character, and often team-taught."}, {"summer": false, "name": "Honors Special Topics-Philosophy or Religion", "prerequisites": "Prerequisite: HON student", "spring": true, "number": "294", "fall": true, "units": " 3", "description": "Seminar for University Honors Program students, repeatable if content varies, meeting GER requirements in philosophy, religion, or arts, interdisciplinary in character, and often team-taught."}, {"summer": false, "name": "Honors Special Topics-Social Science", "prerequisites": "Prerequisite: HON student", "spring": true, "number": "295", "fall": true, "units": " 3", "description": "Seminar for University Honors Program students, repeatable if content varies, meeting GER requirements in the social sciences, interdisciplinary in character, and often team-taught."}, {"summer": false, "name": " Perspective", "prerequisites": "Prerequisite: HON student", "spring": true, "number": "296", "fall": true, "units": " 3", "description": "Seminar for University Honors Program students, repeatable if content varies, meeting GER requirements in Science, Technology and Society (humanistic perspective) interdisciplinary in character and often team-taught."}, {"summer": false, "name": "Honors Special Topics-Science, Technology, Society-Natural Sciences", "prerequisites": "Prerequisite: HON student", "spring": true, "number": "297", "fall": true, "units": " 3", "description": "Seminar for University Honors Program students, repeatable if content varies, meeting GER requirements in Science, Technology and Society (natural science perspective) interdisciplinary in character and often team-taught."}, {"summer": true, "name": "Honors Research/Independent Study", "spring": true, "number": "298", "fall": true, "units": " 1-3", "description": "Research/independent Study for University Honors Program students.  Repeatable if content differs.  Research or independent study under supervision of faculty members.  Project approval by the Honors Program Advisory Committee necessary prior to registration. Permission of the University Honors Program required"}, {"summer": "True", "name": "Honors Special Topics - Visual and Performing Arts", "prerequisites": "Prerequisite: HON student", "spring": "True", "number": "299", "fall": "True", "units": " Performing Arts", "description": "Seminar for University Honors Program students, repeatable if content varies, meeting GER requirements in Visual and Performing Arts, interdisciplinary in character and often team-taught."}, {"summer": false, "name": "The Creative Process in Science: Realities, Comparisons, and Culture Perceptions", "spring": true, "number": "310", "fall": true, "units": " 3", "description": "What is creativity in the context of the sciences? How does the creative process in science differ from and how is it similar to the creative process in other fields? This interdisciplinary perspectives course helps students to develop an understanding of scientific creativity through readings in history and philosophy of science, in the psychology of creativity, in original scientific papers, in biography and in memoirs. Student will analyze representations of scientific creativity in films and literature, conduct interviews with scientists, artists, musicians, and humanists, and analyze the social and institutional context of creativity."}, {"summer": false, "name": "Music and the Science of Sound", "spring": false, "number": "321", "fall": true, "units": " 3", "description": "This course investigates music using the science of sound, from the earliest experiments on vibrating strings to digital recording and MP3s, and the parallel development of music and scientific thought in western cultures.  Concepts will be explained in simple mathematical and non-mathematical terms and developed in an historical perspective.  Students will build instruments based upon what they have learned in the course.  This course is suitable for both science and non-science students.  University Honors Program student or permission of the UHP."}, {"summer": false, "name": "Time Travel", "prerequisites": "Prerequisite: HON student", "spring": true, "number": "341", "fall": false, "units": " 3", "description": "A study of contemporary metaphysics organized around the topic of time travel.  David Lewis, perhaps the foremost contemporary metaphysician, argues that time travel is possible.  His argument is based on ingenious positions about three central topics of metaphysics, personal-identity, causation, and free will.  Students will consider each of these topics in some detail, always with an eye to their implications for time travel."}, {"summer": false, "name": "Issues in Contemporary Religion", "prerequisites": "Prerequisite: HON student", "spring": true, "number": "342", "fall": false, "units": " 3", "description": "An examination of major issues in contemporary religious thought, with particular attention to how theologians have reshaped traditional theological concepts in response to 20th-21st century challenges.  After considering the academic study of religion and addressing the methodological issues of the nature of religious language and the task of theology, the course will examine the impact of recent historical and cultural developments on the formulation of theological proposals and the role religion plays in shaping societal attitudes and mores."}, {"summer": false, "name": "Philosophical Ethics", "spring": false, "number": "343", "fall": true, "units": " 3", "description": "An introduction to some of the main concepts and theories in the field of ethics.  This course explores answers to the most basic questions of ethics:  How can we tell right from wrong and good from bad?  What is it to be a good person?  What does \"making the world a better place\" amount to?  The course will examine how philosophers have answered these questions in the past and consider how their answers might be relevant to contemporary ethical dilemmas.  University Honor Program Students or permission of UHP."}, {"summer": false, "name": "Kantian Ethics", "spring": true, "number": "344", "fall": true, "units": " 3", "description": "In this course students will be introduced to foundations of morality by exploring one of the most significant moral theories in the history of philosophy, Kantian ethics.  The course will focus on Kant's ideas about morality and discuss his proof of the fundamental principles of ethics.  Students will be introduced to some of the enduring moral questions, such as What ought I to do?  What can I hope?  Are there universal moral principles and whether I ought to follow them?  They will learn a variety of approaches to ethical issues and their reflection in social and political reality."}, {"summer": false, "name": "On the Human", "spring": true, "number": "345", "fall": true, "units": " 3", "description": "Students in this seminar course actively explore human singularity: the properties, if any, that distinguish persons from animals and machines.  Do we have souls?  To what extent can we give physical explanations of our thoughts and actions?  What, if anything, do scientific experiments tell us about our differences from chimps and artificial intelligences?  What are the ethical implications of new biotechnologies? Should we be allowed to use genetic and neural engineering to change human nature?  Students read articles, watch videos, stimulate class discussions with prepared questions, write short essays and a final paper, and participate in a 60-minute team presentation."}, {"summer": false, "name": "Ethics and Gender", "spring": true, "number": "346", "fall": true, "units": " 3", "description": "This course is concerned with contemporary work in ethics and gender that speaks both to the status of women and issues surrounding sexual orietnation. The core readings will be Martha Nussbaum's Sex and Social Justice, Sam Harris' The Moral Landscape: How Science Can Determine Human Values, and an essay by Cheshire Calhoun from her book, Feminism, the Family and the Politics of the CLoset. All of the major Western, secular, philosophical ethical theories and perspectives will be considered. The course will begin with some background in older ethical theories and traditions in order to better understand the contemporary literature. This class is restricted to students in the University Honors Program. Other students may enroll with permission of the UHP."}, {"summer": false, "name": "American Ideals in Global Perspective", "spring": false, "number": "351", "fall": true, "units": " 3", "description": "This course will examine core American ideals, how they evolved, what differentiates them from competing ideologies, and the extent to which they are transferable to countries with very different cultures, histories, and levels of economic development.  It will also critically enquire about the extent to which the United States has been achieving its ideals and how successful it has been in promoting these values globally."}, {"summer": false, "name": "Eco-Realism: Human Nature, Politics, and Ecological Constraints", "spring": false, "number": "361", "fall": false, "units": " 3", "description": "Global Environmental issues reveal the reciprocal relationship between human activity and the environment.  The course approaches environmental issues from a \"realist\" perspective, focusing on the function of the earth as humans' life support systemand the impact of political and economic organization as well as technology on this system.  The examination of basic ecological principles and a discussion of the understanding of \"human nature\" in classic, modern and contemporary science prepare students for conducting their own case studies.  University Honors Program student or permission of the UHP."}, {"summer": false, "name": "Information Technology, Society, and Academic Research", "spring": false, "number": "362", "fall": false, "units": " 3", "description": "Developments in information technology have a dramatic impact on how we conduct research and on society itself, affecting economics, politics, and the lives of individuals and communities.  This course explores the relationship between information technology and society, probing complex issues such as information overload, the digital divide, information ethics, indeterminate authority, and the open access movement.  As we explore specific information technologies, students will also have the opportunity to develop greater expertise in locating, evaluating and using information.  University Honors Program student or permission of the UHP."}, {"summer": false, "name": "Environmental Science and Technology", "spring": true, "number": "371", "fall": false, "units": " 3", "description": "This seminar explores deeply advanced topics in contemporary environmental science and considers and evaluates the potential solutions to the challenges they pose.  The seminar is based on readings from multiple perspectives of these real-world challenges with an emphasis on those occurring in North Carolina.  The seminar is interdisciplinary, so political, economic, and ethical aspects are addressed.  University Honors Program student or permission of UHP."}, {"summer": "True", "name": "Music and Social Life", "spring": "True", "number": "391", "fall": "True", "units": " Performing Arts", "description": "At NC State and in the Triangle people are actively engaged in music-making, dancing, devotional practices, and a multitude of other kinds of artful performance.  Students in this class think about the relationship between music and other aspects ofsocial life by doing field research to answer questions about creativity, listening, performance, and the ways music and dance shape social life, values, and ideas about difference.  Students consider modes of research about music and learn techniques for doing ethnographic research.  Must be a University Honors Program student or have permission of the UHP."}, {"summer": false, "name": "Honors Cooperative Education", "prerequisites": "Prerequisite: Two semester full time in University Honors Program", "spring": true, "number": "395", "fall": true, "units": " 3", "description": "Experimental work in government or industry for Honors Program students with two semesters completed in Honors.  Typically students work 40 hrs/week with salary.  Work supervisor, faculty adviser and Honors Program Director must sign HON 395 Honors Cooperative Ed contract.  NC State cooperative Education requires paper work; student must pay fee rate for a 0-5 credit hour course.  No other courses permitted along with HON 395.  Student report of the independent project is required."}, {"summer": true, "name": "Honors Extension and Engagement", "prerequisites": "Prerequisite: One semester good standing in University Honors Program", "spring": true, "number": "397", "fall": true, "units": " 1-6", "description": "Opportunity for significant hands-on involvement in extension and engagement research/project as mentored by NC County Extension employees often in cooperation with community employers/executives, local and government officials, and county citizens. Approved plan of work required with significant independent research/project including a reflective journal, a final paper and presentation at the NC State Undergraduate Research Symposium or a venue appropriate to the discipline.  Students must provide their own transportation."}, {"summer": true, "name": "Honors Special Topics", "prerequisites": "Prerequisite: HON student", "spring": true, "number": "398", "fall": true, "units": " 1-6", "description": "A seminar or other learning experience within an academic framework that may be on- or off-campus. Enables the development of new HON courses outside the GER list."}, {"summer": false, "name": "Honors Capstone Seminar", "prerequisites": "Prerequisite: HON student", "spring": true, "number": "496", "fall": true, "units": " 3", "description": "Honors Seminars open to Juniors and Seniors in all disciplinary Honors Programs, and others with permission of the University Honors Program.  Repeatable if content differs.  A series of seminars with differing subjects, interdisciplinary in character and sometimes team-taught, allowing advanced students to explore topics from a multidisciplinary perspective and to apply their knowledge to issues and problems in the present world. Permission of the University Honors Program"}, {"summer": true, "name": "Honors Research/Creative Project 1", "prerequisites": "Prerequisite: One semester in good standing in University Honors Program, UHP student", "spring": true, "number": "498", "fall": true, "units": " 3", "description": "Opportunity for hands-on faculty mentored research/creative project.  Course may be stand-alone project completed in one semester/summer, or serve as part of a two semester project that is completed at the end of Honors Research/Creative Project 2 (HON 499).  Approved plan of work required with significant independent research/creative project culminating with final paper and presentation at the NC State Undergraduate Research Symposium or other venues appropriate to the discipline.  Research within or outside the student's discipline may fulfill experience."}, {"summer": true, "name": "Honors Research/Creative Project 2", "prerequisites": "Prerequisite: One semester in good standing in University Honors Program, UHP student", "spring": true, "number": "499", "fall": true, "units": " 3", "description": "Opportunity for hands-on faculty mentored research/creative project.  Course serves as final part of a two-semester project that began with Honors Research/Creative Project 1 (HON 498)or approved disciplinary research experience.  Approved plan of work required with significant independent research/creative project culminating with final paper and presentation at the NC State Undergraduate Research Symposium or other venues appropriate to the discipline.  Research within or outside the student's discipline may fulfill experience."}]