[{"summer": false, "name": "Basic Industrial Design Studio I", "prerequisites": "Prerequisite: D104 and D105; Corequisite: ID 215, ID 255, and ID 318", "spring": false, "number": "201", "fall": true, "units": " 6", "description": "Introduction to the theories, methods, and language of industrial design; elementary problems in form and function; transitional implications of hand-crafted and mass-produced objects, in various materials. Industrial Design majors, department approved minor, and department approved elective (\"swing\") studio for all other College of Design majors."}, {"summer": false, "name": "Basic Industrial Design Studio II", "prerequisites": "Prerequisite: ID 201, ID 215, ID 255, ID 318;  Corequisite: ID 315, ID 418", "spring": true, "number": "202", "fall": false, "units": " 6", "description": "Introduction to the fundamentals of product development and design with emphasis on analytical and intuitive approaches to problem solving, technical skills, manufacturing and structural considerations in design of simple products/systems."}, {"summer": false, "name": "Introduction to digital Techniques", "prerequisites": "Prerequisite: D 104, D 105", "spring": false, "number": "215", "fall": true, "units": " 3", "description": "Introduction to the computer as a design tool for generating and manipulation of two-dimensional raster and vector imagery; techniques in two-dimensional concept rendering; desktop publishing applications for design and production of presentation documentation; and visual editors for creating and managing web sites. Industrial design majors, department approved minor, and department approved elective for all other college of design majors."}, {"summer": false, "name": "Contemporary Manufacturing Processes I", "prerequisites": "Prerequisite: D 104, D 105", "spring": false, "number": "255", "fall": true, "units": " 3", "description": "Introduction to mass production processes and their influences on design. Wood, paper and metal manufacturing processes utilized in quantity production. Emphasis on materials comparison and process selection in relation to product function, form, safety, human factors and manufacturability. Field trips required. Industrial Design majors, department approved minor, and department approved elective for all other College of Design majors."}, {"summer": false, "name": "Contemporary Manufacturing Processes II", "prerequisites": "Prerequisite: ID 255", "spring": true, "number": "256", "fall": false, "units": " 3", "description": "Second course in mass production processes and their influences on design. Emphasis on material search and process selection in relation to form, function, human factors, finishes, and joining methods. Plastics and rubber and their specific manufacturing processes utilized in mass production. Industrial Design Majors and Department approved Elective for all other College of Design Majors."}, {"summer": false, "name": "Professional Practice in Industrial Design", "spring": true, "number": "262", "fall": false, "units": " 3", "description": "Issues and situations encountered in a design practice. Topics include patents, trademarks, contracts, basic marketing skills within corporations and in free-lance design."}, {"summer": true, "name": "Special Topics in Industrial Design", "spring": true, "number": "292", "fall": true, "units": " 1-3", "description": "Topics of current interest in Industrial Design. Normally used to develop new courses."}, {"summer": false, "name": "Intermediate Industrial Design Digital Studio Series", "prerequisites": "Prerequisite: ID 202, ID 255, ID 315, ID 418; Corequisite: ID 415 (Fall), ID 445 (Spring).", "spring": true, "number": "300", "fall": true, "units": " 6", "description": "Individual and team-oriented design experiences that expand upon and combine intellectual and manual skills required for the practice of industrial design.  Emphasis on identifying and solving design problems through manipulation of design theory, application of human factors, product safety awareness, universal design principles, ecological/environmental concerns, appropriate combination of materials and manufacturing techniques, and presentation of concepts.  Extensive integration of computertechnology, including 3-D digital modeling, rapid prototyping, interactive virtual product visualization, and world wide web-based presentation."}, {"summer": false, "name": "Digital Product Modeling", "prerequisites": "Prequisite: ID 215", "spring": true, "number": "315", "fall": false, "units": " 3", "description": "Progression of digital experiences that expand upon and combine the intellectual and conceptual skills required for 3-dimensional design visualization.  Emphasis on solving design problems through development and manipulation of 3- dimensional form within the virtual environment."}, {"summer": false, "name": "Ideation I", "prerequisites": "Prerequisite: D 104, D 105", "spring": false, "number": "318", "fall": true, "units": " 3", "description": "The ideation process of conceiving, developing and recording ideas two-dimensionally. These techniques defined and practiced as an extension of understanding the human idea motor process."}, {"summer": true, "name": "Advanced Industrial Design Studio Series", "prerequisites": "Prerequisite: ID 255, ID 300, ID 315, ID 418, ID 445", "spring": true, "number": "400", "fall": true, "units": " 6", "description": "A series of advanced studio experiences that expands upon and combines  intellectual and manual skills required for the practice of industrial design. Emphasis on identifying and solving design problems through manipulation of design theory, application of human factors, product safety awareness, appropriate combination of materials and manufacturing  techniques, and presentation of concepts."}, {"summer": false, "name": "Advanced Digital Product Modeling", "prerequisites": "Prerequisite: ID 315", "spring": false, "number": "415", "fall": true, "units": " 3", "description": "Advanced concepts for planning and executing efficient workflow practices for manufacturable product surfaces.  Emphasis on theory and application of three-dimensional surface modeling tools, accurate development of wire frame geometry, rapid prototyping and animation techniques.  Introduction of animations to aid with dynamic visual analysis of digital product design concepts."}, {"summer": false, "name": "Ideation II", "prerequisites": "Prerequisite: ID 318", "spring": true, "number": "418", "fall": false, "units": " 3", "description": "This is an advanced course which expands the ideation process with greater emphasis directed toward the creative development and recording of conceptual design phase."}, {"summer": false, "name": "Human-Centered Design", "prerequisites": "Junior standing or above", "spring": true, "number": "445", "fall": false, "units": " 3", "description": "Introduction to the spectrum of human physical and cognitive capabilities as they relate to user interaction with designed products and environments. Industrial Design Majors and Department approved Elective for all other College of Design Majors with Junior or Graduate standing in Major."}, {"summer": true, "name": "Industrial Design International Studio", "prerequisites": "Prerequisite: Junior standing in Major, Approval of Study Abroad Office", "spring": true, "number": "490", "fall": true, "units": " 6", "description": "Define industrial design problems and develop design solutions in an international setting.  Studio projects related to design, culture, and traditional and contemporary limited and mass produced products.  Focus on artifact making through directed studies. Industrial Design Majors, and Department approved Elective (\"swing\") Studio for all other College of Design Majors with Junior or Graduate standing in Major."}, {"summer": true, "name": "Special Topics in Industrial Design", "prerequisites": "Junior standing or above", "spring": true, "number": "492", "fall": true, "units": " 1-3", "description": "Topics of current interest in Industrial Design. Normally used to develop new courses. Industrial Design Majors, and Department approved Elective for all other College of Design Majors with Junior or Graduate standing in Major."}, {"summer": true, "name": "Internship in Industrial Design", "prerequisites": "Prerequisite: Junior standing, 3.0 GPA or better", "spring": true, "number": "494", "fall": true, "units": " 1-6", "description": "Supervised field experience in product design offices, galleries, museums and other related organizations. Maximum of 6 credit hours"}, {"summer": true, "name": "Independent Study in Industrial Design", "prerequisites": "Prerequisite: Junior standing in Industrial Design and 3.0 GPA or better.", "spring": true, "number": "495", "fall": true, "units": " 1-3", "description": "Special projects in industrial design developed under the direction of a faculty member on a tutorial basis. Maximum 6 credit hours - May be repeated"}, {"summer": false, "name": "Advanced Industrial Design (Series)", "prerequisites": "Prerequisite: Portfolio review", "spring": true, "number": "500", "fall": true, "units": " 6", "description": "Advanced studies in industrial design. Special emphasis given to problem identification, program formulation and application of advanced design methods. All problems of an individual nature leading to a synthesis of previous design experience."}, {"summer": false, "name": "Industrial Design Materials and Processes I", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "511", "fall": false, "units": " 3", "description": "Analysis of paper, wood, metal and manufacturing processes utilized in production of mass-produced products. Advanced studies in mass production processes and their influence on design and development of products. Emphasis on material search and process selection in relation to product safety, cost, function, human factors, form, finishes and joining methods."}, {"summer": false, "name": "Industrial Design Materials and Processes II", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "512", "fall": false, "units": " 3", "description": "Analysis of plastics and rubber and related manufacturing processes utilized in production of mass-produced products. Advanced studies in mass production processes and their influence on design and development of products. Emphasis on material search and process selection in relation to cost, product safety, function, human factors, form, finishes and joining methods."}, {"summer": false, "name": "Industrial Design Project Preparation", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "581", "fall": false, "units": " 3", "description": "A seminar course designed to assist students in preparing groundwork for the final project to be conducted in design studio."}, {"summer": false, "name": "Special Topics In Industrial Design", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "582", "fall": true, "units": " 1-3", "description": "F,S. Topics of current interest to program/option offered by faculty in the School. Subjects offered under this number normally used to test and develop new courses."}, {"summer": true, "name": "Final Project Studio In Industrial Design", "prerequisites": "Prerequisite: ID 581", "spring": false, "number": "588", "fall": false, "units": " 6", "description": "Final project for graduate students supervised by members of their graduate advisory committees."}, {"summer": true, "name": "Independent Study In Industrial Design", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "630", "fall": true, "units": " 1-6", "description": "Special problems in various aspects of industrial design developed under the direction of faculty member on a tutorial basis."}, {"summer": false, "name": "Special Project", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "676", "fall": true, "units": " 1-3", "description": "Seminars on subjects of current interest in industrial design which are presented by persons not part of regular faculty."}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "685", "fall": true, "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "688", "fall": true, "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "689", "fall": true, "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": true, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "690", "fall": true, "units": " 1-6", "description": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam."}]