[{"summer": "True", "name": "Computer-Based Modeling for Engineers", "prerequisites": "Prerequisite: E 115, Corequisite: MA 141", "spring": "True", "number": "110", "fall": "True", "units": " 3", "description": "Introductory course in computer-based modeling and programming using Visual Basic for Applications. Emphasis on algorithm development and engineering problem solving. Methodical development of VBA within applications like Microsoft Excel and Access from specifications; documentation, style; control structures; classes and methods; data types and data abstraction; object-oriented programming and design; graphical user interface design. Projects: design problems from electrical, industrial, textile, and financial systems. Functional relationships will be given and programs will be designed and developed from a list of specifications."}, {"summer": "True", "name": "Manufacturing Engineering Practicum", "prerequisites": "Prerequisite: GC 120", "spring": "True", "number": "216", "fall": "True", "units": " 3", "description": "Hands-on experimentation for students to learn the capabilities and limitations of basic manufacturing processes.  Relationships between product design, quality, manufacturing planning, computer simulation, material handling systems, time and motionstudies, and ergonomics."}, {"summer": "True", "name": "Engineering Economic Analysis", "prerequisites": "Prerequisite: MA 141", "spring": "True", "number": "311", "fall": "True", "units": " 3", "description": "Engineering and managerial decision making. The theory of interest and its uses. Equivalent annual costs, present worth, internal rates of return, and benefit/cost ratios. Accounting depreciation and its tax effects. Economic lot size and similar cost minimization models. Sensitivity analysis. Cost dichotomies: fixed vs. variable, and incremental vs. sunk, use of accounting data. Replacement theory and economic life. Engineering examples."}, {"summer": "True", "name": "Manufacturing Engineering I - Processes", "prerequisites": "Prerequisite: MSE 200; ISE 216; ISE/GC 120", "spring": "True", "number": "316", "fall": "True", "units": " 3", "description": "Analytical study and design of manufacturing engineering with emphasis on mfg. and processes.  Addresses the interaction of design, materials, and processing.  Laboratory instruction and hands-on experience in metrology, machining, process planning,economic justification, and current mfg. methodologies."}, {"summer": "True", "name": "Furniture Product Engineering", "prerequisites": "Prerequisite: GC 120", "spring": "True", "number": "330", "fall": "True", "units": " 3", "description": "Introduction to use and properties of materials and construction methods used in mass production of furniture.  Examines techniques of product engineering and its role in determining product quality and manufacturability.  Emphasis on principles of computer-based product development, specification, and performance evaluation."}, {"summer": "True", "name": "Furniture Manufacturing Processes I", "prerequisites": "Prerequisite: ISE 330", "spring": "True", "number": "331", "fall": "True", "units": " 3", "description": "Furniture manufacturing technology emphasizing mass production equipment capabilities and capacities.  Relationship of product characteristics to machine selection and process planning activities.  Introduction to computer-controlled machining and integrated manufacturing systems."}, {"summer": "True", "name": "Work Analysis and Design", "prerequisites": "Prerequisite: C- or better in ST 371; C or better in ISE 110", "spring": "True", "number": "352", "fall": "True", "units": " 3", "description": "Work methods and production processes to improve operator effectiveness and reduce production costs. Techniques studied include operation analysis, motion study, value engineering, predetermined time systems, time study and line balancing."}, {"summer": "True", "name": "Deterministic Models in Industrial Engineering", "prerequisites": "Prerequisite: (MA 303 or MA 341 or MA 405 )and C or better in ISE 110", "spring": "True", "number": "361", "fall": "True", "units": " 3", "description": "Introduction to mathematical modeling, analysis techniques, and solution procedures applicable to decision-making problems in a deterministic environment. Linear programming models and algorithms and associated computer codes are emphasized."}, {"summer": "True", "name": "Stochastic Models in Industrial Engineering", "prerequisites": "Prerequisite: (MA 303 or MA 341 or MA 405) and C- or better in ST 371 and C or better in ISE 110", "spring": "True", "number": "401", "fall": "True", "units": " 3", "description": "Introduction to mathematical modeling, analysis, and solution procedures applicable to uncertain (stochastic) production systems.  Methodologies covered include probability theory and stochastic processes.  Applications relate to design and analysisof problems, capacity planning, inventory control, waiting lines, and system reliability and maintainability."}, {"summer": "True", "name": "Control of Production and Service Systems", "prerequisites": "Prerequisite: ISE 361; C- or better in ST 371", "spring": "True", "number": "408", "fall": "True", "units": " 3", "description": "Planning and control of production and service systems.  Production organization flow and inventory control methods:  Systems approach."}, {"summer": "True", "name": "Manufacturing Engineering II - Automation", "prerequisites": "Prerequisite: ISE 316", "spring": "True", "number": "416", "fall": "True", "units": " 3", "description": "Integration of design and mfg. through computer aided/automated process planning, concurrent engineering, and rapid prototyping.  Fixed and programmable automation in mfg. and service.  Autonomous mfg. systems such as computer numerical control (CNC), industrial robotics, automated inspection, electronics manufacturing and assembly."}, {"summer": "True", "name": " Systems Engineering", "prerequisites": "Prerequisite: ISE 316 or ISE 331; C or better in ISE 110", "spring": "True", "number": "417", "fall": "True", "units": " 3", "description": "Principles, economic justification, implementation, and performance evaluation of Computer Integrated Mfg. (CIM) systems.  Fundamentals of group technology and cellular mfg. systems.  Automation of information flow supporting the manufacturing operations using transaction processing via database technology.  Real-time control of CIM systems including data acquisition, process control, and programmable logic controllers."}, {"summer": "True", "name": "Furniture Manufacturing Processes II", "prerequisites": "Prerequisite: ISE 331; C or better in ISE 110, Corequisite: ISE 352", "spring": "True", "number": "430", "fall": "True", "units": " 3", "description": "A survey of furniture manufacturing technology. Emphasis is on operations, production rates, and the integration of many types of equipment into a manufacturing system."}, {"summer": "True", "name": "Furniture Manufacturing Facilities Design", "prerequisites": "Prerequisite: ISE 430", "spring": "True", "number": "431", "fall": "True", "units": " 3", "description": "A survey of furniture manufacturing technology. Emphasis is on operations, production rates, and the integration of many types of equipment into a manufacturing system."}, {"summer": "True", "name": "Introduction to Simulation", "prerequisites": "Prerequisite: MA 242, ST 372, C or better in ISE 110", "spring": "True", "number": "441", "fall": "True", "units": " 3", "description": "Discrete-event stochastic simulation for the modeling and analysis of systems.  Programming of simulation models in a simulation language.  Input data analysis, variance reduction techniques, validation and verification, and analysis of simulation output.  Random number generators and random variate generation."}, {"summer": "True", "name": "Quality Design and Control", "prerequisites": "Prerequisite: ST 372", "spring": "True", "number": "443", "fall": "True", "units": " 3", "description": "Statistical methods in quality control. Control charts for variables and attributes. Process capability assessment. Role of experimentation in designing for quality. Total Quality Management. Tools for continuous quality improvement. Quality Function Deployment."}, {"summer": "True", "name": "Ergonomics", "prerequisites": "Prerequisite: CE 214; Corequisite: ISE 352", "spring": "True", "number": "452", "fall": "True", "units": " 3", "description": "Worker - machine environment systems, design and evaluation; applications to consumer products tools, equipment and the workplace.  Consideration of anatomical, physiological and psychological capabilities and limitations as related to systems design and human performance.  Use of anthropometric data in design of display and control systems.  Effects of environmental stress upon  work performance, safety, and health."}, {"summer": "True", "name": "Design of Production, Logistics, and Service Systems", "prerequisites": "Prerequisite: ISE 401", "spring": "True", "number": "453", "fall": "True", "units": " 3", "description": "Principles and practice in design of facilities and logistics networks.  Integration of supply chain design, capacity planning, facility layout, material handling, and storage and warehousing issues into overall production system design.  Emphasis on economic justification of alternative designs and use of computer software to aid design process.  Group projects."}, {"summer": "True", "name": "Project Work in Industrial Engineering", "prerequisites": "Prerequisite: Junior standing.", "spring": "True", "number": "495", "fall": "True", "units": " 1-6", "description": "Special investigations, study or research related to the field of  industrial engineering. In a given semester several students and/or student groups may be working in widely divergent areas under the direction of several members of the faculty."}, {"summer": "True", "name": "Senior Design Project", "prerequisites": "Prerequisite: 3 of the following 5 (ISE 311, ISE 452, ISE 408, ISE 441, ISE 453)", "spring": "True", "number": "498", "fall": "True", "units": " 3", "description": "Individual or group design projects requiring problem definition and analysis, synthesis, specification and presentation of a designed solution. Students work under faculty supervision either on actual industrial engineering problems posed by local industrial, service and governmental organization or on emerging research issues."}, {"summer": "True", "name": "Introduction to Operations Research", "prerequisites": "Prerequisite: MA 421 or ST 421 or ST 371 and ST 372", "spring": "True", "number": "501", "fall": "True", "units": " 3", "description": "OR Approach: modeling, constraints, objective and criterion. Problems of multiple criteria, optimization, model validation and systems design. OR Methodology: mathematical programming; optimum seeking; simulation, gaming; heuristic programming. Examples, OR Applications: theory of inventory; economic ordering under deterministic and stochastic demand. Production smoothing problem; linear and quadratic cost functions. Waiting line problems: single and multiple servers with Poisson input and output. Theory of games for two-person competitive situations. Project management through PERT-CPM."}, {"summer": "True", "name": "Linear Programming", "prerequisites": "Prerequisite: MA 405", "spring": "True", "number": "505", "fall": "True", "units": " 3", "description": "Introduction including: applications to economics and engineering; the simplex and interior-point methods; parametric programming and post-optimality analysis; duality matrix games, linear systems solvability theory and linear systems duality theory; polyhedral sets and cones, including their convexity and separation properties and dual representations; equilibrium prices, Lagrange multipliers, subgradients and sensitivity analysis."}, {"summer": "True", "name": "Applied Engineering Economy", "prerequisites": "Prerequisite: Undergrad. courses in engineering economics and ST", "spring": "True", "number": "510", "fall": "True", "units": " 3", "description": "Engineering economy analysis of alternative projects including tax and inflation aspects, sensitivity analysis, risk assessment, decision criteria. Emphasis on applications."}, {"summer": "True", "name": "Manufacturing Process Engineering", "spring": "True", "number": "515", "fall": "True", "units": " 3", "description": "Manufacturing process engineering, primary, secondary, finishing and assembly processes.  Traditional and non-traditional manufacturing processes, group technology, manufacturing analyses and application of economic analyses. Graduate standing in Engineering."}, {"summer": "True", "name": "Manufacturing Process Engineering", "spring": "True", "number": "515", "fall": "True", "units": " 3", "description": "Manufacturing process engineering, primary, secondary, finishing and assembly processes.  Traditional and non-traditional manufacturing processes, group technology, manufacturing analyses and application of economic analyses. Graduate standing in Engineering."}, {"summer": "True", "name": "Database Applications in Industrial and Systems Engineering", "prerequisites": "Prerequisite: ISE 110", "spring": "True", "number": "519", "fall": "True", "units": " 3", "description": "Rapid application development (RAD) tools to design and implement database-based applications.  This includes: SQL query language, Visual Basic for Applications in database application construction, a standard RAD environment and how to access information in a database, entity/attribute modeling of the database structure, anomalies of database structures that create problems for applications, modeling of application system's functionality, and integrating these tools together to design and implement engineering applications.  Examples from manufacturing and production systems.  Restricted to advanced undergraduates and graduate students."}, {"summer": "True", "name": "Healthcare Systems Performance Improvement I", "prerequisites": "Prerequisite: ST 372, ISE 352, ISE 361, and ISE 441", "spring": "True", "number": "520", "fall": "True", "units": " 3", "description": "Methods used to improve the performance of health care delivery systems with emphasis on patient care cost, access, and quality.  Adaptation of lean and six-sigma to rapid and continuous health care systems improvement through organizational and process transformation.  Fundamentals of scheduling, staffing, and productivity in health systems employing simulation and optimization.  Health care policy and management."}, {"summer": "True", "name": "Healthcare Systems Performance Improvement II", "prerequisites": "Prerequisite: ISE 520", "spring": "True", "number": "521", "fall": "True", "units": " 3", "description": "Continuation of ISE 520 with a concentration on the completion of a healthcare systems process improvement project at the sponsoring health care institution.  Project must employ the tools and techniques of healthcare systems process improvement.  The project is done in conjunction with a diverse and multi-disciplinary team from the healthcare institution.  The student must serve as a facilitator and coach, resulting in a project with measured success.  Success will be determined by the improvement in patient care as quantified in cost, quality, and access."}, {"summer": "True", "name": "Human Factors In Systems Design", "prerequisites": "Prerequisite: IE 452 or PSY 340, Corequisite: ST 507 or 515", "spring": "True", "number": "540", "fall": "True", "units": " 3", "description": "Introduction to problems of the systems development cycle, including human-machine function allocation, military specifications, display-control compatibility, the personnel sub-system concept and maintainability design. Detailed treatment given to people as information processing mechanisms."}, {"summer": "True", "name": "Occupational Safety Engrg", "spring": "True", "number": "541", "fall": "True", "units": " 3", "description": "Occupational accident-injury study; morbidity, mortality; investigation and analysis. Hazard control; energy countermeasure strategies; control technology. Impact biomechanics, trauma and survivability. Risk assessment; systems safety analysis. Product design, manufacturing defects, system failures and human error as causative factors. Safety program development. Near-accident reporting. OSHA compliance; standards. Accident, trauma and forensic case studies from manufacturing, motor carrier andconstruction industries."}, {"summer": "True", "name": "Musculoskeletal Mechanics", "prerequisites": "Prerequisite: BIO 125 or BAE(BIO) 235 or Graduate standing", "spring": "True", "number": "543", "fall": "True", "units": " 3", "description": "Anatomy, physiology and biomechanics of musculoskeletal system including muscle bone, tendon, ligament, cartilage, nerve. Modeling of tissue and joints with special emphasis on spine and upper extremity. Physical, mathematical, optimization and finite element modeling techniques as applied in biomechanics research."}, {"summer": "True", "name": "Occupational Biomechanics", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "544", "fall": "True", "units": " 3", "description": "Anatomical, physiological, and biomechanical bases of physical ergonomics. Strength of biomaterials, human motor capabilities, body mechanics, kinematics and anthropometry. Use of bioinstrumentation, active and passive industrial surveillance techniques and the NIOSH lifting guide. Acute injury and cumulative trauma disorders. Static and dynamic biomechanical modeling. Emphasis on low back, shoulder and hand/wrist biomechanics."}, {"summer": "True", "name": "Management Decision and Control Systems", "prerequisites": "Prerequisite: CSC 423 or BUS 541", "spring": "True", "number": "546", "fall": "True", "units": " 3", "description": "Planning, design, and development and implementation of comprehensive computer-based information systems to support management decisions. Formal information systems principles; information requirements analysis; knowledge acquisition techniques; information modeling. Information resource management for quality operational control and decision support; system evaluation, process improvement and cost effectiveness."}, {"summer": "True", "name": "Modeling and Analysis of Supply Chains", "prerequisites": "Prerequisite: ISE 351 and ST 372", "spring": "True", "number": "553", "fall": "True", "units": " 3", "description": "Basic issues in operating supply chains, using state of the art modeling tools available for their analysis.  Emphasis on using engineering models to develop insights into the behavior of these systems."}, {"summer": "True", "name": "Special Topics In Industrial Engineering", "spring": "True", "number": "589", "fall": "True", "units": " 3", "description": "Special developments in some phase of industrial engineering using traditional course format. Identification of various specific topics and prerequisites for each section from term to term."}, {"summer": "True", "name": "Seminar", "spring": "True", "number": "601", "fall": "True", "units": " 1", "description": "Seminar discussion of industrial engineering problems for graduate students. Case analyses and reports."}, {"summer": "True", "name": "Special Topics in Industrial Engineering", "spring": "True", "number": "610", "fall": "True", "units": " 3", "description": "Special developments in some phase of industrial engineering using traditional course format. Identification of various specific topics and prerequisites for each section from term to term."}, {"summer": "True", "name": "Directed Study in Industrial Engineering", "spring": "True", "number": "637", "fall": "True", "units": " 1-6", "description": "Independent study providing opportunity for individual students to explore topics of special interest under direction of a member of faculty."}, {"summer": "True", "name": "Advanced Directed Study in Industrial Engineering", "spring": "True", "number": "639", "fall": "True", "units": " 1-6", "description": "Independent study providing an opportunity for individual graduate students to explore advanced topics of special interest under the direction of a member of the faculty."}, {"summer": "True", "name": "Research Practicum in Occupational Biomechanics", "spring": "True", "number": "646", "fall": "True", "units": " 3", "description": "Biomechanics research topic development, literature evaluation, experimental design, use of bioinstrumentation, data collection, basic data interpretation, statistical analysis, manuscript preparation."}, {"summer": "True", "name": "Industrial Engineering Projects", "prerequisites": "Prerequisite: MIE candidates", "spring": "True", "number": "677", "fall": "True", "units": " 1-6", "description": "Investigation and written report on assigned problems germane to industrial engineering.  Maximum of six credits to be earned for MIE degree."}, {"summer": "True", "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "685", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "688", "fall": "True", "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": "True", "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "689", "fall": "True", "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": "True", "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "693", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Master's Thesis Research", "spring": "True", "number": "695", "fall": "True", "units": " 1-9", "description": "Thesis research."}, {"summer": "True", "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "696", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "699", "fall": "True", "units": " 1-3", "description": "For student who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their theses."}, {"summer": "True", "name": "Real-Time Control of Automated Manufacturing", "spring": "True", "number": "707", "fall": "True", "units": " 3", "description": "Concepts and application of real-time control of automated manufacturing systems. Development of prototype manufacturing control applications involving introductions to following topics: computer architecture; real-time, multi-tasking operating systems; data modeling; multi-processing systems; local area networks; inter-task communication; and development of multi-tasking control systems. Design development of control system."}, {"summer": "True", "name": "Integer Programming", "prerequisites": "Prerequisite: MA 405, OR (MA,IE) 505, Corequisite: Some familiarity with computers (e.g., CSC 112)", "spring": "True", "number": "708", "fall": "True", "units": " 3", "description": "General integer programming problems and principal methods of solving them. Emphasis on intuitive presentation of ideas underlying various algorithms rather than detailed description of computer codes. Students have some \"hands on\" computing experience that should enable them to adapt ideas presented in course to integer programming problems they may encounter."}, {"summer": "True", "name": "Dynamic Programming", "prerequisites": "Prerequisite: MA 405, ST 421", "spring": "True", "number": "709", "fall": "True", "units": " 3", "description": "Introduction to theory and computational aspects of dynamic programming and its application to sequential decision problems."}, {"summer": "True", "name": "Capital Investment Economic Analysis", "prerequisites": "Prerequisites: ISE 311 and ST 371", "spring": "True", "number": "711", "fall": "True", "units": " 3", "description": "Analysis of economic merits of alternatives including interest and income tax considerations. Risk and sensitivity exploration techniques. Introduction to analytical techniques for multiple objectives or criteria. Use of mathematical programming andcomputers for capital budgeting."}, {"summer": "True", "name": "Bayesian Decision Analysis For Engineers and Managers", "prerequisites": "Prerequisite: ST 371 or ST 421", "spring": "True", "number": "712", "fall": "True", "units": " 3", "description": "The Bayesian approach to decision making, with numerous applications in engineering and business. Expected value maximization, decision trees, Bayes' theorem, value of information, sequential procedures and optimal strategies. Axiomatic utility theory and controversies, utility of money, theoretical and empirical determination of utility functions and relationship to mean-variance analysis. Brief introduction to multi-attribute problems, time streams and group decisions."}, {"summer": "True", "name": "Product Manufacturing Engineering for the Medical Device Industry", "prerequisites": "Prerequisite: ISE 515", "spring": "True", "number": "714", "fall": "True", "units": " 3", "description": "Product development course targeted toward the medical device industry.  Product design and development, concept generation and selection, parametric feature-based CAD, design for manufacturability (DFM) and assembly (DFA), tolerancing, rapid prototyping, tool design, tool fabrication, and medical device fabrication."}, {"summer": "True", "name": "Automated Systems Engineering", "spring": "True", "number": "716", "fall": "True", "units": " 3", "description": "General principles of operation and programming of automated systems.  Automated assembly, automated manufacturing, and inspection systems.  Control of automated manufacturing.  Industrial logic systems and programmable logic controllers.  Computer numerical control, industrial robotics, and computer integrated manufacturing."}, {"summer": "True", "name": "Micro/Nano-Scale Fabrication and Manufacturing", "prerequisites": "Prerequisite: ISE 316 or graduate standing in the college of engineering", "spring": "True", "number": "718", "fall": "True", "units": " 3", "description": "Introduction to physical theory, process design, analysis, and characterization of micro/nano scale fabrication and manufacturing.  The main focus of the course is on the fabrication/manufacturing of important types of microstructures used in micro/nano devices and the techniques and tools used to fabricate and characterize them."}, {"summer": "True", "name": "Production Planning, Scheduling and Inventory Control", "prerequisites": "Prerequisite: OR 501 and ST 511", "spring": "True", "number": "723", "fall": "True", "units": " 3", "description": "An analysis of Production-Inventory systems. Discussion of commonly used planning and scheduling techniques. Introduction to use of math modeling for solution of planning and scheduling problems. Interface with quality control and information systems."}, {"summer": "True", "name": "Theory of Activity Networks", "prerequisites": "Prerequisite: OR 501, OR(IE,MA) 505", "spring": "True", "number": "726", "fall": "True", "units": " 3", "description": "Introduction to graph theory and network theory. In-depth discussion of theory underlying (1) deterministic activity networks (CPM): optimal time-cost trade offs; the problem of scarce resources; (2) probabilistic activity networks (PERT): critical evaluation of underlying assumptions; (3) generalized activity networks (GERT, GAN): applications of signal flow graphs and semi-Markov process to probabilistic branching; relation to the theory of scheduling."}, {"summer": "True", "name": "Multi-Attribute Decision Analysis", "spring": "True", "number": "731", "fall": "True", "units": " 3", "description": "Specification of attributes/criteria/objectives for complex decisions. Determination of alternatives, attribute weights and decision-making process. Graphical and weighted evaluation techniques. Multi-attribute utility, multi-objective/goal programming and analytic hierarchy process methodologies. Computer applications and case studies."}, {"summer": "True", "name": "Engineering Psychology of Human-computer Interaction", "prerequisites": "Prerequisite: IE(PSY) 540 or CSC 554", "spring": "True", "number": "740", "fall": "True", "units": " 3", "description": "Exploration of usability of computer technology. Theory and practice of user-centered design for HCI applications. Course focuses on current usability paradigms and principles, psychology of users, iterative and participatory design processes, system requirements specification, prototyping, user support systems, usability evaluation and engineering, interface design guidelines and standards. Application domains include, universal design, virtual reality, and scientific data visualization."}, {"summer": "True", "name": "Systems Safety Engineering", "spring": "True", "number": "741", "fall": "True", "units": " 3", "description": "Systems safety engineering. Course familiarizes students with techniques for identifying and recognizing potential safety hazards and the concept of risk assessment. Preliminary Hazard Analysis, Failure Modes and Effects Analysis, System and Subsystem Hazard Analysis, Fault Tree Analysis, Process Safety Management (29CFR1910.119) are explored together with applications to hazard analysis and control. Industrial situations and case studies are employed to illustrate usefulness of various system safety techniques."}, {"summer": "True", "name": "Environmental Stress, Physiology and Performance", "spring": "True", "number": "742", "fall": "True", "units": " 3", "description": "Human skilled performance as affected by environmental stressors, including noise, vibration, heat, cold, accelerator, pressure altitude, toxic agents and illumination. Physiological effects of stressors and their relationship to health, performanceand, ultimately, to safety. Impact biomechanics and crash survival. Human survival in adverse environments. Combined stressor effects, physiological arousal, fatigue and performance decrement."}, {"summer": "True", "name": "Ergonomic Performance Assessment", "prerequisites": "Prerequisite: PSY 200, ST 507 and 508", "spring": "True", "number": "743", "fall": "True", "units": " 3", "description": "Fundamentals of ergonomic performance measurement used to assess the effects of environment and system design on human performance. Treatment of topics such as workload measurement, measurement of complex performance, simulator studies, measurement of change, task taxonomies, criterion task sets and statistical methods of task analysis. Problems of laboratory and field research, measurement of change and generalizability of findings."}, {"summer": "True", "name": "Human Information Processing", "prerequisites": "Prerequisite: PSY 200, ST 507 and 508", "spring": "True", "number": "744", "fall": "True", "units": " 3", "description": "Fundamentals of human information processing basic to skilled operator performance and the design of displays, controls and complex systems. Treatment of topics such as channel capacity, working memory, long-term memory, decision making, attention and process monitoring. Problems of display and control design and evaluation, evaluation of textual material, and human-computer interaction."}, {"summer": "True", "name": "Human Performance Modeling", "prerequisites": "Prerequisite: ST 507 or 515 or equivalent; IE (PSY) 540, CSC 554 or IE (PSY) 744", "spring": "True", "number": "745", "fall": "True", "units": " 3", "description": "Advanced aspects of human performance research.  Qualitative models of human information processing.  Characteristics and role of memory in decision making and response execution.  Sensory channel parameters, attention allocation, time-sharing of tasks. Situation awareness and workload responses in complext tasks.  Limitations of human factors experimentation.  Factors in human multiple task performance.  Cognitive task analysis and computational cognitave modeling/simulation of user behavior in specific applications."}, {"summer": "True", "name": "Reliability Engineering", "prerequisites": "Prerequisite: ST 511", "spring": "True", "number": "747", "fall": "True", "units": " 3", "description": "Introduction to basic concepts of reliability engineering. Application of probability and statistics to estimate reliability of industrial systems; development of reliability measures; analysis of static and dynamic reliability models; development and analysis of fault trees; analysis of Markovian and non-Markovian models; and optimization of reliability models."}, {"summer": "True", "name": "Quality Engineering", "prerequisites": "Prerequisite: OR 501, ST 511", "spring": "True", "number": "748", "fall": "True", "units": " 3", "description": "Introduction to basic concepts of quality engineering. Statistical process control (SPC) methods, acceptance sampling techniques, concept of parameter design and statistical as well as analytical techniques for its implementation, tolerance analysisand design, components of cost of poor quality and an introduction to quality management."}, {"summer": "True", "name": "Concurrent Engineering", "spring": "True", "number": "750", "fall": "True", "units": " 3", "description": "Approaches to concurrent engineering, concurrent engineering of printed wiring boards, design for testability, design for assembly, process selection, interface to feature-based computer-aided design systems, concurrent engineering of metal parts, concurrent engineering performance measurement, concurrent engineering and computer-integrated manufacturing."}, {"summer": "True", "name": "Logistics Engineering", "prerequisites": "Prerequisite: ISE 453", "spring": "True", "number": "754", "fall": "True", "units": " 3", "description": "Elements of logistics networks.  Supply chain design: facility location and allocation; great-circle distances; geocoding.  Multi-echelon production and inventory systems; sourcing decision systems. Vehicle routing: exact, approximation, and heuristic procedures; traveling salesman problem; basic vehicle routing problem and extensions; backhauling; mixed-mode transportation system design."}, {"summer": "True", "name": "Applied Stochastic Models in Industrial Engineering", "prerequisites": "Prerequisite: MA 303, ST 371", "spring": "True", "number": "760", "fall": "True", "units": " 3", "description": "Formulation and analysis of stochastic models with particular emphasis on applications in industrial engineering; univariate, multivariate and conditional probability distributions; unconditional and conditional expectations; elements of stochastic processes; moment-generating functions; concepts of stochastic convergence; limit theorems; homogeneous, nonhomogeneous and compound Poisson processes; basic renewal theory; transient and steady-state properties of Markov processes in discrete and continuous time."}, {"summer": "True", "name": "Queues and Stochastic Service Systems", "prerequisites": "Prerequisite: MA 421", "spring": "True", "number": "761", "fall": "True", "units": " 3", "description": "Introduction of general concepts of stochastic processes. Poisson processes, Markov processes and renewal theory. Usage of these in analysis of queues, from with a completely memoryless queue to one with general parameters. Applications to many engineering problems."}, {"summer": "True", "name": "Computer Simulation Techniques", "prerequisites": "Prerequisite: ST 512 and a scientific programming language", "spring": "True", "number": "762", "fall": "True", "units": " 3", "description": "Basic discrete event simulation methodology: random number generators, simulation designs, validation, analysis of simulation output. Applications to various areas of scientific modeling. Simulation language such as SLAM and GPSS. Computer assignments and projects."}, {"summer": "True", "name": "Network Flows", "spring": "True", "number": "766", "fall": "True", "units": " 3", "description": "Study of problems of flows in networks. These problems include the determination of shortest chain, maximal flow and minimal cost flow in networks. Relationship between network flows and linear programming developed as well as problems with nonlinear cost functions, multi-commodity flows and problem of network synthesis."}, {"summer": "True", "name": "Upper Extremity Biomechanics", "spring": "True", "number": "767", "fall": "True", "units": " 3", "description": "Gross and functional anatomy of upper extremity; properties of tendons and synovial fluid; epidemiology; disorders of shoulder, elbow, wrist, hands, fingers; biomechanical modeling; personal factors affecting cumulative trauma disorder (CTD) risk, diagnosis and treatment of upper extremity CTDs; wrist splints; workplace ergonomics to alleviate upper extremity CTDs."}, {"summer": "True", "name": "Spine Biomechanics", "spring": "True", "number": "768", "fall": "True", "units": " 3", "description": "Gross and fine anatomy of spine, mechanism of pain, epidemiology, in vitro testing, psychophysical studies, spine stability models, bioinstrumentation: intradiscal pressure, intra-abdominal pressure and electromyography. Biomechanics of lifting and twisting, effects of vibration, effects of posture/lifting style, lifting belts, physical models, optimization models, mathematical models, muscle models, finite element models, current trends in medical management and rehabilitation, chiropractic."}, {"summer": "True", "name": "Stochastic Simulation Design and Analysis", "prerequisites": "Prerequisite: (CSC,ECE,IE,OR) 762 and ST 516", "spring": "True", "number": "772", "fall": "True", "units": " 3", "description": "Advanced topics in stochastic system simulation, including random variate generation, output estimation for stationary and non-stationary models, performance optimization techniques, variance reduction approaches. Student application of these techniques to actual simulations. A current topic research paper required."}, {"summer": "True", "name": "Advanced Special Topics In Industrial Engineering", "spring": "True", "number": "789", "fall": "True", "units": " 3", "description": "Advanced topics in some phase of industrial engineering using traditional course format. Identification of various specific topics and prerequisites for each section from term to term."}, {"summer": "True", "name": "Advanced Special Topics System Optimization", "spring": "True", "number": "790", "fall": "True", "units": " 1-3", "description": "Advanced topics in some phase of system optimization using traditional course format.  Identification of various specific topics and prerequisites for each section from term to term."}, {"summer": "True", "name": "Advanced Special Topics in Manufacturing", "spring": "True", "number": "791", "fall": "True", "units": " 1-3", "description": "Advanced topics in some phase of manufacturing systems using traditional course format.  Identification of various specific topics and prerequistes for each section from term to term."}, {"summer": "True", "name": "Advanced Special Topics in Production", "spring": "True", "number": "793", "fall": "True", "units": " 1-3", "description": "Advanced topics in some phase of production systems using traditional course format.  Identification of various specific topics and prerequisites for each section from term to term."}, {"summer": "True", "name": "Advanced Problems in Ergonomics", "spring": "True", "number": "794", "fall": "True", "units": " 3", "description": "Exploration in depth of a problem area of contemporary interest involving man-machine-environment interface. Class discussion and analysis of research and theory, with special focus on human factors aspects of systems design and operation."}, {"summer": "True", "name": "Research Practicum in Occupational Biomechanics", "spring": "True", "number": "796", "fall": "True", "units": " 3", "description": "Biomechanics research topic development, literature evaluation, experimental design, use of bioinstrumentation, data collection, basic data interpretation, statistical analysis, manuscript preparation."}, {"summer": "True", "name": "Seminar", "spring": "True", "number": "801", "fall": "True", "units": " 1", "description": "Seminar discussion of industrial engineering problems for graduate students. Case analyses and reports."}, {"summer": "True", "name": "Area Seminar In Ergonomics", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": "True", "number": "802", "fall": "True", "units": " 1", "description": "Introduction to ergonomics as an area of study; historical aspects; contemporary issues; ethical questions; overview of campus research, facilities and courses in the area; consideration of information sources, financial support for research proposals and employment opportunities."}, {"summer": "True", "name": "Seminar In Product Safety and Liability", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "803", "fall": "True", "units": " 1", "description": "Consumer product safety, laws and standards. Products liability, negligence, due care, strict liability and foreseeability. Product defects, design flaws and liabilities, hazard control, ergonomics design, warnings and labels. Product safety programs for manufacturers; management guidelines. Litigation process, forensic investigation and expert witnessing. Accident case studies."}, {"summer": "True", "name": "Seminar In Applied Ergonomics", "spring": "True", "number": "804", "fall": "True", "units": " 1", "description": "Discussion of contemporary issues involving ergonomic approaches to design of work, products and systems. Survey of current ergonomics research and methodologies and their application to areas of faculty and student interest, such as: industrial ergonomics, occupational safety, manufacturing, transportation, computer systems and process control."}, {"summer": "True", "name": "Special Topics in Mathematical Programming", "prerequisites": "Prerequisite: IE(MA,OR) 505", "spring": "True", "number": "812", "fall": "True", "units": " 1-3", "description": "Study of special advanced topics in area of mathematical programming. Discussion of new techniques and current research in this area. The faculty responsible for this course select areas to be covered during semester according to their preference and interest. This course not necessarily taught by an individual faculty member but can, on occasion, be joint effort of several faculty members from this university as well as visiting faculty from other institutions. To date, a course of Theory of Networks and another on Integer Programming offered under the umbrella of this course.  Anticipation that these two topics will be repeated in future together with other topics."}, {"summer": "True", "name": "Advanced Special Topics in Industrial Engineering", "spring": "True", "number": "815", "fall": "True", "units": " 1-3", "description": "Advanced topics in some phase of industrial engineering.  Identification of various specific topics and prerequisites for each section from term to term."}, {"summer": "True", "name": "Advanced Special Topics Sys Opt", "spring": "True", "number": "816", "fall": "True", "units": " 1-3", "description": "Advanced topics in some phase of system optimization.  Identification of various specific topics and prerequisite for each section from term to term."}, {"summer": "True", "name": "Advanced Special Topics Manufacturing", "spring": "True", "number": "817", "fall": "True", "units": " 1-3", "description": "Advanced topics in some phase of manufacturing systems.  Identification of various specific topics and prerequisites for each section from term to term."}, {"summer": "True", "name": "Advanced Special Topics Production", "spring": "True", "number": "818", "fall": "True", "units": " 1-3", "description": "Advanced topics in some phase of production systems.  Identification of various specific topics and prerequisites for each section from term to term."}, {"summer": "True", "name": "Directed Study in Industrial Engineering", "spring": "True", "number": "837", "fall": "True", "units": " 1-6", "description": "Independent study providing opportunity for individual students to explore topics of special interest under direction of a member of faculty."}, {"summer": "True", "name": "Advanced Directed Study in Industrial Engineering", "spring": "True", "number": "839", "fall": "True", "units": " 1-6", "description": "Independent study providing an opportunity for individual graduate students to explore advanced topics of special interest under the direction of a member of the faculty."}, {"summer": "True", "name": "The Design of Production Systems", "spring": "True", "number": "861", "fall": "True", "units": " 3", "description": "The structure and operation of production planning, scheduling and control systems; emphasis on system structure, capacity planning, master production scheduling, shop loading and supply chain; investigation of current trends."}, {"summer": "True", "name": "Industrial Engineering Projects", "prerequisites": "Prerequisite: MIE candidates", "spring": "True", "number": "877", "fall": "True", "units": " 1-6", "description": "Investigation and written report on assigned problems germane to industrial engineering.  Maximum of six credits to be earned for MIE degree."}, {"summer": "True", "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "885", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "890", "fall": "True", "units": " 1-9", "description": "For students who are preparing for and taking written and/or oral preliminary exams."}, {"summer": "True", "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "893", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "895", "fall": "True", "units": " 1-9", "description": "Dissertation Research"}, {"summer": "True", "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "896", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "899", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hour requirements, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations."}]