[{"summer": "True", "name": "Logic", "spring": "True", "number": "201", "fall": "True", "units": " 3", "description": "Introduction to  methods of deductive inference. Concepts of inconsistency and entailment.  Truth Functional Statement Logic and Quantifier and Predicate Logic. Representation of logically significant form of statements and arguments.  Procedures to discover and notation to write down proofs."}, {"summer": "True", "name": "Symbolic Logic", "prerequisites": "Prerequisite: LOG 201 or MA 225", "spring": "True", "number": "335", "fall": "True", "units": " 3", "description": "Introduction to modern symbolic logic; the concept of proof, mathematical induction, recursion and the relationship between formal and informal theories (examples:  group theory, Peano arithmetic).  The Goedel Theorems and the mathematical study of logic."}, {"summer": "True", "name": " Metamathematics", "prerequisites": "Prerequisite: LOG 335. Credit is not allowed for both LOG 435 and LOG 535.", "spring": "True", "number": "435", "fall": "True", "units": " 3", "description": "Advanced topics in logic and metamathematics: proof procedures, first-order theories, soundness and completeness theorems, recursive functions, the formalization of arithmetic, the Goedel Incompleteness Theorems. Emphasis on mathematical study of logic and mathematics. Students cannot receive credit for both LOG 435 and LOG 535"}, {"summer": "True", "name": "Model Theoretic Semantics", "prerequisites": "One of the following courses: MA/LOG 335, LOG 435, MA 403, MA 407, MA 408, MA 410, MA/CSC 416, MA 421, MA 425, MA 426, CSC 333, CSC 411, CSC 417. Credit is not allowed for both LOG 437 and LOG 537.", "spring": "True", "number": "437", "fall": "True", "units": " 3", "description": "This course is an introduction to the fundamental concepts and methods of model-theoretic semantics and its applications in logic, foundations of mathematics, philosophy, and computer science.  Credit will not be given for both LOG 437 and LOG 537."}, {"summer": "True", "name": "Special Topics in Logic", "prerequisites": "Prerequisite: One of the following: (MA/LOG 335, LOG 435, LOG 437, MA 403, MA 407, MA 408, MA 410, MA/CSC 416, MA 421, MA 425, MA 426, CSC 333, CSC 411, or CSC 417)", "spring": "True", "number": "498", "fall": "True", "units": " 1-6", "description": "Detailed investigation of selected topics in logic.  Topics determined in consultation with head of the department. Course may be used for individualized study.  Students cannot receive credit for both LOG 498 and LOG 598 unless the topic is different."}, {"summer": "True", "name": "Advanced Logic and Metamathematics", "prerequisites": " 435", "spring": "True", "number": "535", "fall": "True", "units": " 3", "description": "No one may receive credit for both LOG 435 and LOG 535.                   Advanced topics in logic and metamathematics: proof procedures, first-order theories, soundness and completeness theorems, recursive functions, the formalization of arithmetic, the Goedel Incompleteness Theorems. Emphasis on mathematical study of logic and mathematics. Successful completion of mathematics or computer science courses that emphasize proofs, particularly at the 400 level as evidence of requisite"}, {"summer": "True", "name": "Model Theoretic Semantics", "prerequisites": "Prerequisite: Graduate standing and one of the following courses: MA/LOG 335, LOG 435, one MA or CSC course at the 400-level or above. Credit is not allowed for both LOG 537 and LOG 437.", "spring": "True", "number": "537", "fall": "True", "units": " 3", "description": "This course is an introduction to the fundamental concepts and methods of model-theoretic semantics and its applications in logic, foundations of mathematics, philosophy, and computer science. No can receive credit for both LOG 437 and LOG 537."}, {"summer": "True", "name": "Special Topics in Logic", "spring": "True", "number": "598", "fall": "True", "units": " 1-6", "description": "Detailed investigation of selected topics in logic.  Topics determined in consultation with head of the department. Course may be used for individualized study.  Students cannot receive credit for both LOG 498 and LOG 598 unless the topic is different."}]