[{"summer": false, "name": "Introduction to Public Leadership", "spring": false, "number": "200", "fall": true, "units": " 3", "description": "This introductory course is designed for students who are interested in exploring public sector leadership.  It starts with acquainting how to conduct adequate academic research for studying leadership.  Covering fundamental concepts and assumptions of leadership, it will focus on necessary skills and approaches for good public and non-profit sector leadership.  The course will also address contemporary e-government practices and the role of information technology in the public sector."}, {"summer": false, "name": "The Humanitarian Response to Conflict", "spring": false, "number": "201", "fall": true, "units": " 3", "description": "LPS 201 offers up an introduction to the ideals and paradoxes of humanitarian intervention, with a special emphasis on military responses to humanitarian crises.  This course explores the history, animating ideals and contemporary paradoxes of humanitarian action and related military interventions.  Throughout history and ever increasingly in the present, there is an intersection between military and humanitarian operations in conflict zones."}, {"summer": false, "name": "Essentials of Fundraising for Leaders in Public and Non-Profit Institutions", "spring": false, "number": "202", "fall": true, "units": " 3", "description": "The course covers the basics of fundraising for public and non-profit agencies which include the agencies history, board development, event planning, and the motivation of the giver.  In addition, the students will learn the elements of grant proposals related to public sector agencies.  The work will include case studies, weekly lectures, discussion assignments, final exam and a special event planning proposal."}, {"summer": false, "name": "Leadership in Nation Building", "spring": true, "number": "205", "fall": true, "units": " 3", "description": "Origin and evolution of the state, nation, and nation-state.  Ideology and key ideologues of nationalism.  Challenges to the state and nationalism in the era of globalization.  Causes and consequences of state failure.  Political and economic strategies for state-and nation-building: the costs and benefits of competing approaches.  Nation-building as a component of U.S. foreign policy.  The use of military in nation-building projects.  The leadership dilemmas in state-and nation-building: possible cases include Somalia, Bosnia, Iraq, Afghanistan, Russia, and the EU."}, {"summer": false, "name": "Advanced Military Leadership Theory", "spring": false, "number": "400", "fall": true, "units": " 3", "description": "Advanced Military Leadership Theory (AMLT) is a challenging course that will study, practice, and apply the fundamentals of leadership, values and ethics, personal development, decision-making, influencing and motivating others and team tactics in problem solving and mission accomplishment.  Especially military officers enrolled in the LPS program will gain immediate benefit from the leadership self-assessments and new leadership strategies."}, {"summer": false, "name": " Nonprofit Sectors Captsone", "prerequisites": "Prerequisite: LPS Majors need to have passed LPS 200", "spring": true, "number": "425", "fall": false, "units": " 3", "description": "Only LPS major students must complete LPS 200 Introduction to Public Leadership course prior to enrolling in LPS 425."}, {"summer": true, "name": "Undergraduate Internship in Leadership in the Public Sector", "prerequisites": "Prerequisite: LPS 200", "spring": true, "number": "490", "fall": true, "units": " 1-3", "description": "Students can earn 1-3 credits for completing internships in the public sector or non-profit agencies.  Emphasis is placed on gaining work experience needed to explore and plan careers in the public and non-profit sector.  Students must prepare an internship proposal.  Students must provide own transportation for internship.  Intern liability insurance is required."}]