[{"summer": "True", "name": "Engineering Statics", "prerequisites": "Prerequisite: Cumulative GPA 2.5 or higher and a grade of C- or better in both MA 241 and PY 205", "spring": "True", "number": "206", "fall": "True", "units": " 3", "description": "Basic concepts of forces in equilibrium. Distributed forces, frictional forces. Inertial properties. Application to machines, structures, and systems. Credit is not allowed for both MAE 206 and CE 214."}, {"summer": "True", "name": "Engineering Dynamics", "prerequisites": "Prerequisite: 2.5 GPA or higher, MA 242, C- or better in MAE 206 or CE 214", "spring": "True", "number": "208", "fall": "True", "units": " 3", "description": "Kinematics and kinetics of particles in rectangular, cylindrical, and curvilinear coordinate systems; energy and momentum methods for particles; kinetics of systems of particles; kinematics and kinetics of rigid bodies in two and three dimensions; motion relative to rotating coordinate systems."}, {"summer": "True", "name": "Aerospace Vehicle Performance", "prerequisites": "Prerequisite: Cumulative GPA 2.5 or higher and a grade of C- or better in both MA 241 and PY 205", "spring": "True", "number": "261", "fall": "True", "units": " 3", "description": "Introduction to the problem of performance analysis in aerospace engineering.  Aircraft performance in gliding, climbing, level, and turning flight. Calculation of vehicle take-off and landing distance, range and endurance.  Elementary performance design problems."}, {"summer": "True", "name": "Engineering Thermodynamics I", "prerequisites": "Prerequisite: MA 242, PY 208 or 202", "spring": "True", "number": "301", "fall": "True", "units": " 3", "description": "Introduction to the concept of energy and the laws governing the transfers and transformations of energy. Emphasis on thermodynamic properties and the First and Second Law analysis of systems and control volumes. Integration of these concepts into the analysis of basic power cycles is introduced."}, {"summer": "True", "name": "Engineering Thermodynamics II", "prerequisites": "Prerequisite: CSC 112 or CSC 114, C- or better in MAE 301", "spring": "True", "number": "302", "fall": "True", "units": " 3", "description": "Continuation of Engineering Thermodynamics I with emphasis on the analysis of power and refrigeration cycles and the application of basic principles to engineering problems with systems involving mixtures of ideal gases, psychrometrics, nonideal gases, chemical reactions, combustion, chemical equilibrium cycle analysis, and one-dimensional compressible flow."}, {"summer": "True", "name": "Mechanical Engineering Laboratory I", "prerequisites": "Prerequisite: C- or better in MAE 208 or CE 215", "spring": "True", "number": "305", "fall": "True", "units": " 1", "description": "Theory and practice of measurement and experimental data collection. Laboratory evaluation and demonstration of components of the generalized measurement system and their effects on the final result. Applications of basic methods of data analysis aswell as basic instrumentation for sensing, conditioning and displaying experimental qualities. (Instruction and practice in technical report writing.)"}, {"summer": "True", "name": "Mechanical Engineering Laboratory II", "prerequisites": "Prerequisite: MAE 305, Corequisite: MAE 310", "spring": "True", "number": "306", "fall": "True", "units": " 1", "description": "Continuation of MAE 305 into specific types of measurements. Students evaluate and compare different types of  instrumentation for measuring the same physical quantity on the basis of cost, time required, accuracy, etc. (Oral and written presentation of technical material)."}, {"summer": "True", "name": "Fluid Mechanics", "prerequisites": "Prerequisite: MA 242, (C- or better in MAE 208 or CE 215). Corequisite: (MA 341 or MA 301) and (MAE 301 or MSE 301)", "spring": "True", "number": "308", "fall": "True", "units": " 3", "description": "Development of the basic equations of fluid mechanics in general and specialized form.  Application to a variety of topics including fluid statics; inviscid, incompressible fluid flow; design of Fluid dynamic system."}, {"summer": "True", "name": "Heat Transfer Fundamentals", "prerequisites": "Prerequisite: (MA 341 or MA 301), C- or better in MAE 301. Corequisite: MAE 308", "spring": "True", "number": "310", "fall": "True", "units": " 3", "description": "Analysis of steady state and transient one and multidimensional heat  conduction employing both analytical methods and numerical techniques. Integration of principles and concepts of thermodynamics and fluid mechanics to the development of practicalconvective heat transfer relations relevant to mechanical engineers.  Heat transfer by the mechanism of radiation heat transfer."}, {"summer": "True", "name": "Solid Mechanics", "prerequisites": "Prerequisite: MA 242, C- or better in (MAE 206 or CE 214).  Corequisite: (MSE 200 or MSE 201, or BME 203, or BAE 315)", "spring": "True", "number": "314", "fall": "True", "units": " 3", "description": "Concepts and theories of internal force, stress, strain, and strength of structural element under static loading conditions. Constitutive behavior for linear elastic structures.  Deflection and stress analysis procedures for bars, beams, and shafts.Introduction to matrix analysis of structures."}, {"summer": "True", "name": "Dynamics of Machines", "prerequisites": "Prerequisite: MA 341, C- or better in MAE 208 or CE 215", "spring": "True", "number": "315", "fall": "True", "units": " 3", "description": "Application of dynamics to the analysis and design of machine and mechanical components. Motions resulting from applied loads, and the forces required to produce specified motions. Introduction to mechanical vibration, free and forced response of discrete and continuous systems."}, {"summer": "True", "name": "Strength of Mechanical Components", "prerequisites": "Prerequisite: ME, AE, or NE Majors,  C- or better in MAE 314 or CE 313", "spring": "True", "number": "316", "fall": "True", "units": " 3", "description": "Analysis and design of mechanical components based on deflection, material, static strength and fatigue requirements. Typical components include beams, shafts, pressure vessels and bolted and welded joints.  Classical and modern analysis and design techniques. Computer analysis using the finite element method.  Material and manufacturing considerations in design."}, {"summer": "True", "name": "Aerodynamics I", "prerequisites": "Prerequisite: MAE 261 and (MA 341 or MA 301)", "spring": "True", "number": "355", "fall": "True", "units": " 3", "description": "Fundamentals of perfect fluid theory with applications to incompressible flows over airfoils, wings, and flight vehicle configurations."}, {"summer": "True", "name": "Aerodynamics II", "prerequisites": "Prerequisite: MAE 355, C- or better in MAE 301", "spring": "True", "number": "356", "fall": "True", "units": " 3", "description": "Concepts of thermodynamics, compressible fluid flow, and shock waves with application to computing the aerodynamic characteristics of airfoils, wings and flight configurations at high speed."}, {"summer": "True", "name": "Experimental Aerodynamics I", "prerequisites": "Prerequisite: (MA 341 or MA 301) and C- or better in MAE 261; Corequisite: MAE 355", "spring": "True", "number": "357", "fall": "True", "units": " 1", "description": "Subsonic wind tunnel, instrumentation, data acquisition techniques, technical report preparation.  Experiments involve pressure and force/moment measurements of various aerospace vehicle components with supplemental flow visualization."}, {"summer": "True", "name": "Experimental Aerodynamics II", "prerequisites": "Prerequisite: MAE 357, Corequisite: MAE 356", "spring": "True", "number": "358", "fall": "True", "units": " 1", "description": "Advanced stability and control experiments in the subsonic wind tunnel and external compressible flow experiments in the supersonic wind tunnel."}, {"summer": "True", "name": "Aerospace Structures I", "prerequisites": "Prerequisite: C- or better in MAE 261 and (MAE 314 or CE 313)", "spring": "True", "number": "371", "fall": "True", "units": " 3", "description": "Determination of appropriate analysis techniques for Aerospace Structures. Introduction of governing equations and selected solutions for typical structures.  Use of these concepts in the design of a representative structural component."}, {"summer": "True", "name": "Air Conditioning", "prerequisites": "Prerequisite: MAE 302, MAE 310, MAE 308", "spring": "True", "number": "403", "fall": "True", "units": " 3", "description": "Design of a complete air conditioning system for a building.  Introduction, Design Objectives - Building Description, Review of Psychrometrics and Air Conditioning Processes, Cooling and Heating Load Calculation, Space Air diffusion, Duct Lay-out and Design, Equipment Selection, Pipe Sizing, Life-cycle Cost Analysis."}, {"summer": "True", "name": "Energy Conservation in Industry", "prerequisites": "Prerequisite: MAE 302, MAE 310", "spring": "True", "number": "406", "fall": "True", "units": " 3", "description": "Application of energy conservation principles to a broad range of industrial situations with emphasis on typical equipment encountered as well as the effect of recent environmental regulations.  Topics covered include: steam generators, pollution control, work minimization, heat recovery, steam traps, industrial ventilation, electrical energy management, and economics.  Field trip to conduct tests and evaluate operation at three NCSU steam plants."}, {"summer": "True", "name": "Steam and Gas Turbines", "prerequisites": "Prerequisite: MAE 302; MAE 308 or MAE 355", "spring": "True", "number": "407", "fall": "True", "units": " 3", "description": "Fundamental analysis of the theory and design of turbomachinery flow passages; control and performance of turbomachinery; gas-turbine engine processes."}, {"summer": "True", "name": "Internal Combustion Engine Fundamentals", "prerequisites": "Prerequisite: MAE 302", "spring": "True", "number": "408", "fall": "True", "units": " 3", "description": "Fundamentals common to internal combustion engine cycles of operation. Otto engine: carburetion, combustion, knock, exhaust emissions and engine characteristics. Diesel engine: fuel metering, combustion, knock, and performance. Conventional and alternative fuels used in internal combustion engines."}, {"summer": "True", "name": "Design of Thermal System", "prerequisites": "Prerequisite: MAE 302, MAE 308, MAE 310", "spring": "True", "number": "412", "fall": "True", "units": " 3", "description": "Applications of thermodynamics, fluid mechanics, and heat transfer to thermal systems with an emphasis on system design and optimization.  Design of heat exchangers.  Analysis of engineering economics, including time value of money, present and future worth, payback period, internal rates of return, and cost benefit analysis.  Review of component model for pipes, pumps, fans, compressors, turbines, evaporators, condensers and refrigerators.  Simulation methods for finding the operating point for thermal systems.  Design of thermal systems through methods of optimization."}, {"summer": "True", "name": "Analysis for Mechanical Engineering Design", "prerequisites": "Prerequisite: MAE 315 and (MAE 316 or MAE 371)", "spring": "True", "number": "415", "fall": "True", "units": " 3", "description": "Integration of the physical sciences, mathematics, and engineering to solve real-world design problems.  Emphasis on open-ended problems which contain superfluous information and/or insufficient data. Solution techniques focus on problem definition,reduction to a solvable system, and development of a design response. Formal written communication of results."}, {"summer": "True", "name": "Mechanical Engineering Design", "prerequisites": "Prerequisite: MAE 415", "spring": "True", "number": "416", "fall": "True", "units": " 4", "description": "Teamwork, independent learning and communication skills are emphasized in this capstone course.  Teams of students experience mechanical engineering design through: problem definition, investigation, brainstorming, focus, critical review, design, analysis, prototype construction and testing.  Design for manufacture is encouraged throughout the process by having students build their own prototypes.  Communication skills are developed through reports and presentations."}, {"summer": "True", "name": "Design of Solar Thermal Systems", "prerequisites": "Prerequisite: MAE 302, MAE 310", "spring": "True", "number": "421", "fall": "True", "units": " 3", "description": "Analysis and design of active and passive solar thermal systems for residential and small commercial buildings.  Solar insulation, flat plate collectors, thermal storage, heat exchanges, controls, design, performance calculations, economics.  Site evaluation, shading, suncharts, types of passive systems.  Heating load analysis.  Overview of photovoltaics.  On-site evaluation of NCSU Solar House."}, {"summer": "True", "name": "Principles of Automatic Control", "prerequisites": "Prerequisite: (MA 341 or MA 301) and MAE 315", "spring": "True", "number": "435", "fall": "True", "units": " 3", "description": "Study of linear feedback control systems using  transfer functions. Transient and steady state responses. Stability and dynamic analyses using time response and frequency response techniques. Compensation methods. Classical control theory techniquesfor determination and modification of the dynamic response of a system. Synthesis and design applications to typical mechanical engineering control systems. Introduction to modern control theory."}, {"summer": "True", "name": "Automotive Engineering", "prerequisites": "Prerequisite: MAE 302, MAE 308, MAE 315, MAE 316", "spring": "True", "number": "442", "fall": "True", "units": " 3", "description": "Fundamental aspects of automotive engineering. Examines various automotive systems (engine, brakes, etc.) as well as their interactions in such areas as safety and performance. Current practices and development for the future."}, {"summer": "True", "name": "Aerodynamics of V/STOL Vehicles", "spring": "True", "number": "452", "fall": "True", "units": " 3", "description": "Introduction to the aerodynamics and performance of vertical and short take-off and landing vehicles.  Aerodynamics of propellers and rotors.  High lift devices."}, {"summer": "True", "name": "Introduction to Space Flight", "prerequisites": "Prerequisite: (MA 341 or MA 301), CSC 112, C- or better in PY 205", "spring": "True", "number": "453", "fall": "True", "units": " 3", "description": "Fundamental aspects of space flight including launch vehicle performance and design, spacecraft characteristics, two-body orbital mechanics, earth satellites, interplanetary trajectories, atmospheric entry, and atmospheric heating."}, {"summer": "True", "name": "Boundary Layer Theory", "prerequisites": "Prerequisite: MAE 356", "spring": "True", "number": "455", "fall": "True", "units": " 3", "description": "Introduction to the Navier-Stokes Equations and boundary layer approximations for incompressible flow. Calculation techniques for laminar and turbulent boundary layer parameters which affect lift, drag, and heat transfer on aerospace vehicles. Discussions of compressible flows."}, {"summer": "True", "name": "Computational Methods in Aerodynamics", "prerequisites": "Prerequisite: MAE 356, Corequisite: MAE 455", "spring": "True", "number": "456", "fall": "True", "units": " 3", "description": "Introduction to computational methods for solving exact fluid equations. Emphasis on development of the fundamentals of finite difference methods and their application to viscous and inviscid flows."}, {"summer": "True", "name": " Controls", "prerequisites": "Prerequisite: (MA 341 or MA 301), and  C- or better in (MAE 208 or CE 215)", "spring": "True", "number": "461", "fall": "True", "units": " 3", "description": "Dynamics and linear feedback control of aerospace and mechanical systems. Concepts from linear system theory, kinematics, particle dynamics, first- and second-order systems, system dynamics, vibrations, and computational techniques. Feedback controlby root-locus, Nyquist, Bode plots, servo-mechanisms, gain and phase margin, and compensation. Control system design emphasized."}, {"summer": "True", "name": "Flight Vehicle Stability and Control", "prerequisites": "Prerequisite: (MAE 461 or MAE 435) and C- or better in MAE 261.", "spring": "True", "number": "462", "fall": "True", "units": " 3", "description": "Longitudinal, directional and lateral static stability and control of aerospace vehicles. Lineralized dynamic analysis of the motion of a six degree-of-freedom flight vehicle in response to control inputs and disturbance through use of the transfer function concept. Control of static and dynamic behavior by vehicle design (stability derivatives) and/or flight control systems."}, {"summer": "True", "name": "Experimental Aerodynamics III", "prerequisites": "Prerequisite: MAE 358, Corequisite: MAE 455, MAE 475", "spring": "True", "number": "466", "fall": "True", "units": " 1", "description": "Laboratory experiments in internal compressible flow and boundary layers in conjunction with MAE 455 and MAE 475.  Topics include nozzle flows, constant area duct flows, component/overall performance of a gas turbine, and boundary layer analysis."}, {"summer": "True", "name": "Controls Laboratory", "prerequisites": "Prerequisite: (MAE 306 or C- or better in MAE 261); Corequisite: (MAE 461 or MAE 435)", "spring": "True", "number": "469", "fall": "True", "units": " 1", "description": "Laboratory experiments demonstrate the essential features of classical and modern control theory for single-input and single-output systems."}, {"summer": "True", "name": "Aerospace Structures II", "prerequisites": "Prerequisite: MAE 371", "spring": "True", "number": "472", "fall": "True", "units": " 3", "description": "A continuation of MAE 371; deflection of structures, indeterminate structures, minimum weight design fatigue analysis and use of matrix methods in structural analysis. Selection of materials for aircraft construction based on mechanical, physical, and chemical properties."}, {"summer": "True", "name": "Aerospace Vehicle Structures II Lab", "prerequisites": "Prerequisite: MAE 371, Corequisite: MAE 472", "spring": "True", "number": "473", "fall": "True", "units": " 1", "description": "Demonstration and application of the concepts that have been presented in MAE 371 and MAE 472. Fabrication techniques and the design and construction of a structural component will be emphasized."}, {"summer": "True", "name": "Propulsion", "prerequisites": "Prerequisite: MAE 356, C- or better in MAE 301", "spring": "True", "number": "475", "fall": "True", "units": " 3", "description": "One-dimensional, internal, compressible flow including:  isentropic flow, normal shocks, flow with friction and simple heat addition.  Applications to air-breathing aircraft propulsion systems.  Performance, analysis and design of components and overall performance of air-breathing engines."}, {"summer": "True", "name": "Rocket Propulsion", "prerequisites": "Prerequisite: MAE 356 or MAE 302", "spring": "True", "number": "476", "fall": "True", "units": " 3", "description": "Study of chemical rockets.  This includes nozzle theory, flight performance, thermochemical calculations, and component and system analysis and design."}, {"summer": "True", "name": "Aerospace Vehicle Design I", "prerequisites": "Prerequisite: Senior standing, Aerospace Engineering Majors, MAE 356, 472, 462", "spring": "True", "number": "478", "fall": "True", "units": " 3", "description": "A synthesis of previously acquired theoretical and empirical knowledge and application to the design of practical aerospace vehicle systems."}, {"summer": "True", "name": "Aerospace Vehicle Design II", "prerequisites": "Prerequisite: MAE 478", "spring": "True", "number": "479", "fall": "True", "units": " 4", "description": "Designs are refined and the vehicles constructed and instrumented by the students.  A flight test program is designed and carried out in cooperation with MAE 525 students. A continuation of MAE 478"}, {"summer": "True", "name": "Special Topics in Mechanical and Aerospace Engineering", "spring": "True", "number": "495", "fall": "True", "units": " 1-3", "description": "Offered as needed to present new or special MAE subject matter."}, {"summer": "True", "name": "Undergraduate Project Work in Mechanical and Aerospace Engineering", "prerequisites": "Prerequisite: Completion of all required MAE-300 level courses, Corequisite: MAE 415 or MAE 478", "spring": "True", "number": "496", "fall": "True", "units": " 1-6", "description": "Individual or small group project in engineering, comprising the design of an equipment or system stemming from a mutual student-faculty interest; a substantial final report (project) containing calculations, drawings and specifications must be produced.  Alternatively, individual or small group undergraduate research evolving from a mutual student-faculty interest; a conference or scientific journal paper must be submitted for publication. Departmental approval required"}, {"summer": "True", "name": "Advanced Engineering Thermodynamics", "prerequisites": "Prerequisite: MAE 302; MA 401 or MA 511", "spring": "True", "number": "501", "fall": "True", "units": " 3", "description": "Classical thermodynamics of a general reactive system; conservation of energy and principles of increase of entropy; fundamental relation of thermodynamics; Legendre transformations; phase transitions and critical phenomena; equilibrium and stability criteria in different representation; irreversible thermodynamics. Introduction to statistical thermodynamics."}, {"summer": "True", "name": "Fluid Dynamics Of Combustion I", "prerequisites": "Prerequisite: MAE 301, MAE 355 or MAE 308", "spring": "True", "number": "504", "fall": "True", "units": " 3", "description": "Gas-phase thermochemistry including chemical equilibrium and introductory chemical kinetics. Homogeneous reaction phenomena. Subsonic and supersonic combustion waves in premixed reactants (deflagration and detonation). Effects of turbulence. Introduction to diffusion flame theory."}, {"summer": "True", "name": "Heat Transfer Theory and Applications", "prerequisites": "Prerequisite: MAE 310", "spring": "True", "number": "505", "fall": "True", "units": " 3", "description": "Development of basic equations for steady and transient heat and mass transfer processes. Emphasis on application of basic equations to engineering problems in areas of conduction, convection, mass transfer and thermal radiation."}, {"summer": "True", "name": "Advanced Dynamics with Applications to Aerospace Systems", "prerequisites": "Prerequisite: (MAE 208 or PY 205) and MA 242 and (MA 301 or MA 341)", "spring": "True", "number": "511", "fall": "True", "units": " 3", "description": "Basic topics in advanced dynamics and with applications to aerospace systems.  Rotating coordinate systems, Euler angles, three-dimensional kinematics and kinetics, angular momentum methods and an introduction to analytical mechanics. Examples are concentrated in the area of aerospace vehicles, but the methods learned will be applicable to land-based vehicles and any engineering system undergoing rigid body rotation, e.g. wind turbines, biomechanical systems, machine tools, robotic systems, etc."}, {"summer": "True", "name": "Principles of Structural Vibration", "prerequisites": "Prerequisite: MAE 315", "spring": "True", "number": "513", "fall": "True", "units": " 3", "description": "Principles of structural vibration beginning from single and multi-degree of freedom systems and extending to distributed systems. Forced system response, vibration of strings, bars, shafts and beams and an introduction to approximate methods."}, {"summer": "True", "name": "Noise and Vibration Control", "prerequisites": "Prerequisite: MAE 315", "spring": "True", "number": "514", "fall": "True", "units": " 3", "description": "Discussion of noise and vibration design criteria. Presentation of noise and vibration survey procedures. Discussion of noise and vibration control model. Review of most common equipment noise sources and ways to achieve adequate control. Topics include room acoustics, acoustics of walls, enclosures, vibration isolation and use of scale models."}, {"summer": "True", "name": "Acoustic Radiation I", "prerequisites": "Prerequisite: MA 301 and MAE 308 or MAE 356", "spring": "True", "number": "518", "fall": "True", "units": " 3", "description": "Introduction to principles of acoustic radiation from vibrating bodies and their related fields. The radiation of simple sources, propagation of sound waves in confined spaces and transmission through different media."}, {"summer": "True", "name": "Linear Control and Design For Mimo Systems", "prerequisites": "Prerequisite: MAE 435, MA 341", "spring": "True", "number": "521", "fall": "True", "units": " 3", "description": "Linear Multivariable control and design for multibody engineering systems (robotics) and aircraft controls and navigation. Emphasis on multi-input and multi-output (MIMO) system analysis and design using frequency-based approach. Controllability andobservability, transmission zeroes and pole-zero cancellation, eigenstructures, singular value decomposition in frequency domain, stability and performance robustness of MIMO systems."}, {"summer": "True", "name": "Non Linear System Analysis and Control", "prerequisites": "Prerequisite: MAE 521 or equivalent", "spring": "True", "number": "522", "fall": "True", "units": " 3", "description": "Nonlinear system analysis, Lyapunov stability theory, absolute stability, feedback linearization, sliding mode control, backstepping control technique, as well as various advanced nonlinear control methods."}, {"summer": "True", "name": "Principles of Mechatronic Control", "prerequisites": "Prerequisite: MAE 315", "spring": "True", "number": "524", "fall": "True", "units": " 3", "description": "Principles of mechantronic control beginning with single and two-degree of freedom systems.  Linear feedback, disturbance rejection, state estimation, and filtering.  Applications to civil, robotic, automotive, aircraft, space systems.  Hands on experiments in linear feedback control and filtering."}, {"summer": "True", "name": "Advanced Flight Vehicle Stability and Control", "prerequisites": "Prerequisite: MAE 462", "spring": "True", "number": "525", "fall": "True", "units": " 3", "description": "Preliminary analysis and design of flight control systems to include autopilots and stability augmentation systems. Study of effects of inertial cross-coupling and nonrigid bodies on vehicle dynamics."}, {"summer": "True", "name": "Experimental Flight Testing", "prerequisites": "Prerequisite: Graduate standing, Aerospace Engineering Majors, MAE 525", "spring": "True", "number": "528", "fall": "True", "units": " 3", "description": "Application of engineering methods to experimental flight testing of fixed-wing aircraft for determination of performance and handling qualities of air vehicles. Risk minimization techniques are included in the formulation of a flight test plan. Collected flight test data is corrected for standard day and analyzed."}, {"summer": "True", "name": "Engineering Design Optimization", "prerequisites": "Prerequisite: Graduate standing in Engineering is recommended.", "spring": "True", "number": "531", "fall": "True", "units": " 3", "description": "Nonlinear optimization techniques with applications in various aspects of engineering design.  Terminology, problem formulation, single and multiple design variables, constraints, classical and heuristic approaches, single and multiobjective problems, response surface modeling, and tradeoffs in complex engineering systems.  Numerical optimization algorithms and implementation of these optimization techniques.  Graduate standing in engineering recommended."}, {"summer": "True", "name": "Finite Element Analysis I", "prerequisites": "Prerequisite: MAE 316 or MAE 472", "spring": "True", "number": "533", "fall": "True", "units": " 3", "description": "Fundamental concepts of the finite element method for linear stress and deformation analysis of mechanical components. Development of truss, beam, frame, plane stress, plane strain, axisymmetric and solid elements. Isoparametric formulations. Introduction to structural dynamics. Practical modeling techniques and use of general-purpose codes for solving practical stress analysis problems."}, {"summer": "True", "name": "Mechatronics Design", "prerequisites": "Prerequisite: Structured Programming Experience, Senior/Graduate Standing in WPS/MAE.", "spring": "True", "number": "534", "fall": "True", "units": " 3", "description": "Principles of Mechatronics Design, review of logic gates, microprocessor architecture, sensors and actuators, A/D and D/A conversion techniques, real-time multi-tasking programming concepts, direct digital control implementation.  \"Hands-on\" experience through several laboratory assignments and final team project."}, {"summer": "True", "name": "Design of Electromechanical Systems", "prerequisites": "Prerequisite: MA 341", "spring": "True", "number": "535", "fall": "True", "units": " 3", "description": "A practical introduction to electromechanical systems with emphasis on modeling, analysis, design, and control techniques.  Provides theory and practical tools for the design of electric machines (standard motors, linear actuators, magnetic bearings, etc).  Involves some self-directed laboratory work and culuminates in an industrial design project.  Topics include Maxwell's equations, electromechanical energy conversion, finite element analysis, design and control techniques."}, {"summer": "True", "name": "Micro/Nano Electromechanical Systems", "spring": "True", "number": "536", "fall": "True", "units": " 3", "description": "Fundamentals and applications of micro/nano sensors and actuators. Emphasis upon MEMS/NEMS design, microfabrication techniques, and case studies of MEMS devices. Nanomaterials and NEMS devices also covered. Students have opportunity to learn commercial software packages on design and simulation of MEMS and hear from experts from leading MEMS companies through guest lectures. Previous knowledge of MEMS and nanotechnology is not required. The course is restricted to advanced undergrads and graduate students in engineering, materials science, physics and biomedical fields."}, {"summer": "True", "name": "Mechanics Of Composite Structures", "prerequisites": "Prerequisite: MAE 316 or MAE 472", "spring": "True", "number": "537", "fall": "True", "units": " 3", "description": "Manufacturing techniques with emphasis on selection of those producing most favorable end result. Classical plate theory, materials properties and failure theories. Micromechanics, repair, plate solutions and elasticity solutions covered as requiredto meet special interests of students."}, {"summer": "True", "name": "Smart Structures and Materials", "prerequisites": "Prerequisite: MAE 415 or MAE 472", "spring": "True", "number": "538", "fall": "True", "units": " 3", "description": "An application-oriented introduction to smart structures and materials with examples from mechanical, aerospace and biomedical engineering.  Experimentally observed phenomena, micromechanisms, and models for material behavior.  Team work developing simulation tools for typical applications.  Validating results experimentally using PC-based data acquisition systems."}, {"summer": "True", "name": "Advanced Materials", "prerequisites": "Prerequisite: MSE 201 and MAE 314", "spring": "True", "number": "539", "fall": "True", "units": " 3", "description": "Introduces production/structure/property/function relation and application of a number of materials mainly for biomedical, mechanical and aerospace applications. Topics include ultra light materials (production, processing and applications of cellular solids), biomaterials (classes and application of materials in medicine and dentistry), composites (classes and application), refractory materials and coatings for high temperature applications, thin film shape memory alloys for micro-electro mechanical systems (MEMS)."}, {"summer": "True", "name": "Advanced Air Conditioning Design", "prerequisites": "Prerequisite: MAE 403, 404", "spring": "True", "number": "540", "fall": "True", "units": " 3", "description": "Psychrometric process representations. Heating and cooling coil design. Heat pump design. Air washer design. Direct contact heat and mass transfer systems. Ventilation requirements, air dilution calculations. Cooling load calculations; CLTD, CLF andtransfer functions methods. Room air distribution."}, {"summer": "True", "name": "Advanced Solid Mechanics I", "prerequisites": "Prerequisite: MAE 316", "spring": "True", "number": "541", "fall": "True", "units": " 3", "description": "Development of principles of advanced strength of materials and elasticity theory leading to solution of practical engineering problems concerned with stress and deformation analysis.  Tensor analysis, coordinate transformations, alternative measures of strain, elastic constitutive equations, stress measures, formulation and solution of two and three dimensional elasticity problems.  Examples include advanced beam theory for shear deformation and large deformation, contact mechanics, stress concentration, pressure vessels and compound cylinders, thermal stress analysis, and stresses in layered microelectronic devices."}, {"summer": "True", "name": "Fracture Mechanics", "prerequisites": "Prerequisite: MAE 316", "spring": "True", "number": "543", "fall": "True", "units": " 3", "description": "Concept of elastic stress intensity factor, Griffith energy balance, determination of the elastic field at a sharp crack tip via eigenfunction expansion methods, J integrals analysis, experimental determination of fracture toughness, fatigue crack growth, elastic-plastic crack tip fields. Emphasis on modern numerical methods for determination of stress intensity factors, critical crack sizes and fatigue crack propagation rate predictions."}, {"summer": "True", "name": "Real Time Robotics", "prerequisites": "Prerequisite: Pascal, C, FORTRAN or Assembly language experience", "spring": "True", "number": "544", "fall": "True", "units": " 3", "description": "Real-time programming for servo control using an embedded controller. Software and hardware interfacing for control of a D.C. servo device. Introduction of multi-tasking to establish concurrent control of several processes, transforming servo loop into a process executing concurrently on single board computer. Provision for hands-on development systems and software emulators."}, {"summer": "True", "name": "Metrology For Precision Manufacturing", "prerequisites": "Prerequisite: Senior standing in MAE or BS in other curriculum", "spring": "True", "number": "545", "fall": "True", "units": " 3", "description": "Foundations of dimensional metrology and error analysis as applied to accuracy and repeatability in machine design. Plane, length, angle, and roundness metrology. Design of precision systems, Abbe' principle, error analysis, measurement, and compensation.  Precision instruments and operating principles. Hands-on experience with measurement instruments and techniques."}, {"summer": "True", "name": "Photonic Sensor Applications in Structure", "prerequisites": "Prerequisite: MAE 371 or MAE 316", "spring": "True", "number": "546", "fall": "True", "units": " 3", "description": "Use of optical fiber and other photonic device based sensors to measure strain, temperature and other measurands in aerospace, mechanical, civil and biomedical applications.  An introduction to optical waveguide analysis will be provided at the beginning of the course."}, {"summer": "True", "name": "Foundations Of Fluid Dynamics", "prerequisites": "Prerequisite: MAE 301, MAE 355 or MAE 308", "spring": "True", "number": "550", "fall": "True", "units": " 3", "description": "Review of basic thermodynamics pertinent to gas dynamics. Detailed development of general equations governing fluid motion in both differential and integral forms. Simplification of the equations to those for specialized flow regimes. Similarity parameters. Applications to simple problems in various flow regimes."}, {"summer": "True", "name": "Airfoil Theory", "prerequisites": "Prerequisite: MAE 355", "spring": "True", "number": "551", "fall": "True", "units": " 3", "description": "Development of fundamental aerodynamic theory. Emphasis upon mathematical analysis and derivation of equations of motion, airfoil theory and comparison with experimental results. Introduction to super sonic flow theory."}, {"summer": "True", "name": "Compressible Fluid Flow", "prerequisites": "Prerequisite: MAE 356 or MAE 550", "spring": "True", "number": "553", "fall": "True", "units": " 3", "description": "Equations of motion in supersonic flow; unsteady wave motion, velocity potential equation; linearized flow; conical flow. Slender body theory. Methods of characteristics. Shockwave/ boundary layer interactions."}, {"summer": "True", "name": "Hypersonic Aerodynamics", "prerequisites": "Prerequisite: MAE 553", "spring": "True", "number": "554", "fall": "True", "units": " 3", "description": "Fundamentals of inviscid and viscous hypersonic flowfields. Classical and modern techniques for calculating shock wave shapes, expansions, surface pressures, heat transfer and skin friction. Applications to high speed aircraft, rockets and spacecraft."}, {"summer": false, "name": "Microfluidics and Nanofluidics", "prerequisites": "Prerequisite: MAE 310 and MA 427", "spring": true, "number": "558", "fall": false, "units": " 3", "description": "Macroscale fluid mechanics, heat and mass transfer.  Theories of microfluidics and nanofluidics.  Applications in mechanical, biomedical, and chemical engineering. Discussions of journal articles and modern fluid dynamics projects. Expert guest lectures on advanced micro/nanotechnology topics."}, {"summer": "True", "name": "Computational Fluid Mechanics and Heat Transfer", "prerequisites": "Prerequisite: MA 501 or MA 512, MAE 550 or MAE 557, proficiency in the FORTRAN programming language is required", "spring": "True", "number": "560", "fall": "True", "units": " 3", "description": "Introduction to integration of the governing partial differential equations of fluid flow and heat transfer by numerical finite difference and finite volume means. Methods for parabolic, hyper-bolic and elliptical equations and application to model equations. Error analysis and physical considerations."}, {"summer": "True", "name": "Wing Theory", "prerequisites": "Prerequisite: MAE 551", "spring": "True", "number": "561", "fall": "True", "units": " 3", "description": "Discussion of inviscid flow fields over wings in subsonic flow. Vortex lattice methods, lifting surface theories and panel methods developed for wings with attached flow and leading-edge separation. Calculation of aerodynamic characteristics and determination of effects of planform and airfoil shapes."}, {"summer": "True", "name": "Physical Gas Dynamics", "prerequisites": "Prerequisite: MAE 550", "spring": "True", "number": "562", "fall": "True", "units": " 3", "description": "Introduction to kinetic theory, statistical mechanics and chemical thermodynamics. Law of Action. Vibrational and chemical rate processes. Application to equilibrium and nonequilibrium flows."}, {"summer": "True", "name": "Hydrodynamic Stability and Transition", "prerequisites": "Prerequisite: MAE 550", "spring": "True", "number": "573", "fall": "True", "units": " 3", "description": "Conceptual framework and development of hydrodynamic stability theory.  Application of the theory to two-dimensional incompressible and compressible subsonic, transonic, supersonic and hypersonic flows.  Results for three-dimensional flows. Introduction of mechanisms of transition and discussion of transition models in numerical methods."}, {"summer": "True", "name": "Advanced Propulsion Systems", "prerequisites": "Prerequisite: Both MAE 475 and MAE 476 or both MAE 302 and MAE 308", "spring": "True", "number": "575", "fall": "True", "units": " 3", "description": "The course will focus on non-turbomachinery, air-breathing hypersonic aeropropulsion applications. Specific propulsion systems to be covered include ramjets and scramjets, pulsed detonation engines, and combined cycle engines, with historical perspective."}, {"summer": "True", "name": "Space Flight Orbital Mechanics", "spring": "True", "number": "581", "fall": "True", "units": " 3", "description": "Orbital mechanics of the 2, 3, and N body problems, orbit perturbations including drag and oblateness, time and celestial coordinate systems, application to special orbits including sun-and geo-synchronous, frozen, constellations, libration points."}, {"summer": "True", "name": " Control I", "spring": "True", "number": "582", "fall": "True", "units": " 3", "description": "Inertial and body-fixed reference frames for establishing spacecraft orientation, sequential rotations, quaternions, measuring rotation and rotation rates of rigid body, rigid body dynamics review and momentum exchange techniques, gyroscopic navigation systems, dynamic stability, stabilization methods, and spacecraft maneuvers."}, {"summer": "True", "name": "Project Work In Mechanical Engineering", "spring": "True", "number": "586", "fall": "True", "units": " 1-6", "description": "Individual or small group investigation of a problem stemming from a mutual student-faculty interest. Emphasis on providing a situation for exploiting student curiosity."}, {"summer": "True", "name": "Special Topics In Mechanical Engineering", "prerequisites": "Prerequisite: Advanced Undergraduate standing or Graduate standing", "spring": "True", "number": "589", "fall": "True", "units": " 1-3", "description": "Faculty and student discussions of special topics in mechanical engineering."}, {"summer": "True", "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "685", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "688", "fall": "True", "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": "True", "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "689", "fall": "True", "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": "True", "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "690", "fall": "True", "units": " 1-6", "description": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam."}, {"summer": "True", "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "693", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "695", "fall": "True", "units": " 1-9", "description": "Thesis Research"}, {"summer": "True", "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "696", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Graduate standing in Mechanical Engineering, Consent of Adviser", "spring": "True", "number": "699", "fall": "True", "units": " 1-3", "description": "Individual research in the field of mechanical engineering."}, {"summer": "True", "name": "Statistical Thermodynamics", "prerequisites": "Prerequisite: MAE 501", "spring": "True", "number": "702", "fall": "True", "units": " 3", "description": "Analysis and establishment of conclusions of classical thermodynamics from the microscopic viewpoint. Topics include: ensemble methods, partition functions, translational, rotational and vibrational energy modes of an ideal gas, chemical equilibrium, imperfect gases, dense fluids, critical-point theories, mean free path concepts, Boltzmann equation, hydrodynamic equations from kinetic theory and properties of disordered composite media."}, {"summer": "True", "name": "Fluid Dynamics of Combustion II", "prerequisites": "Prerequisite: MAE 504", "spring": "True", "number": "704", "fall": "True", "units": " 3", "description": "Advanced theory of detonation and deflagration. Ignition criteria. Direct initiation of detonation including blast-wave theory. Transition from deflagration to detonation. Combustion wave structure and stability. Liquid droplet and solid particle combustion."}, {"summer": "True", "name": "Advanced Conductive Heat Transfer", "prerequisites": "Prerequisite: MAE 505 or MA 501", "spring": "True", "number": "707", "fall": "True", "units": " 3", "description": "Comprehensive, unified treatment of methodologies for solving multidimensional transient and steady heat conduction. Approximate and exact methods of solving nonlinear problems, including phase and temperature-dependent thermal properties, nonlinearboundary conditions. Heat conduction in composite media and anisotropic solids. Use of finite integral transform and Green's function techniques."}, {"summer": "True", "name": "Advanced Convective Heat Transfer", "prerequisites": "Prerequisite: MAE 550", "spring": "True", "number": "708", "fall": "True", "units": " 3", "description": "Advanced topics in steady and transient, natural and forced convective heat transfer for laminar and turbulent flow through conduits and over surfaces. Mass transfer in laminar and turbulent flow. Inclusion of topics on compressible flow with heat and mass transfer."}, {"summer": "True", "name": "Advanced Radiative Heat Transfer", "prerequisites": "Prerequisite: MAE 505", "spring": "True", "number": "709", "fall": "True", "units": " 3", "description": "Comprehensive and unified treatment of basic theories; exact and approximate methods of solution of radiative heat transfer and the interaction of radiation with conductive and convective modes of heat transfer in participating and non-participatingmedia."}, {"summer": "True", "name": "Acoustic Radiation II", "prerequisites": "Prerequisite: MAE 518", "spring": "True", "number": "718", "fall": "True", "units": " 3", "description": "Advanced treatment of the theory of sound generation and transmission. Topics include: techniques for solution of the wave equation, radiation from spheres, cylinders and plates, sound propagation in ducts, scattering."}, {"summer": "True", "name": "Robust Control with Convex Methods", "prerequisites": "Prerequisite: Graduate standing in Engineering and Applied Mathematics, MAE 521 or ECE 716", "spring": "True", "number": "721", "fall": "True", "units": " 3", "description": "This course emphasizes on control design techniques which result in closed-loop systems that are insensitive to modeling errors and which achieve a prespecified level of performance.  Robustness margins against model uncertainty.  Robust control design techniques based on linear matrix inequalities.  Topics include uncertainty modeling, robust stability and performance, H_inf control, convex optimization technique (LMI), mu-analysis and synthesis, computer-aided analysis and control design."}, {"summer": "True", "name": "Geophysical Fluid Mechanics", "prerequisites": "Prerequisite: MAE 501", "spring": "True", "number": "725", "fall": "True", "units": " 3", "description": "The principles of fluid mechanics applied to geophysical systems.  Special emphasis placed on those features of these systems, such as almost rigid rotation and stable stratification, which produce unique and important effects.  The effects of almost rigid rotations on homogeneous and stratified flows examined in detail."}, {"summer": "True", "name": "Advanced Geophysical Fluid Mechanics", "prerequisites": "Prerequisite: MAE 725 or equivalent", "spring": "True", "number": "726", "fall": "True", "units": " 3", "description": "Principles of fluid mechanics applied to geophysical systems.  Special emphasis on role of stable stratification on the flows in these systems.  Detailed study of generation, interaction, propagation and dissipation of internal gravity waves.  Studyof other geophysically important flows."}, {"summer": "True", "name": "Computational Methods in Structural Vibration", "prerequisites": "Prerequisite: CE 722 or MAE 513", "spring": "True", "number": "727", "fall": "True", "units": " 3", "description": "Development of computational methods to analyze the field problems in structural vibration for which closed-form solutions generally unavailable. Aimed primarily at linear systems, topics include: linearization and stability, computational methods for the eigensolutions and discretization by local function, global function and hybrid approaches, applications to undampled, damped and spinning assemblages of beams, rods, strings, shafts, membranes and plates."}, {"summer": "True", "name": "Modem Plasticity", "prerequisites": "Prerequisite: Grad. course in elasticity or strength of materials", "spring": "True", "number": "730", "fall": "True", "units": " 3", "description": "Classical theories of plasticity and solutions pertaining to rate-independent and -dependent deformations modes in metals, geomaterials and concrete. Ductile failure modes, i.e., shear-strain localization and other failure modes associated with large deformation modes. Inelastic wave propagation, crystalline constitutive formulations and computational aspects of quasi-static and dynamic plasticity."}, {"summer": "True", "name": "Materials Processing by Deformation", "prerequisites": "Prerequisite: Six hrs. of solid mechanics and/or materials", "spring": "True", "number": "731", "fall": "True", "units": " 3", "description": "Presentation of mechanical and metallurgical fundamentals of materials processing by deformation. Principles of metal working, friction, forging, rolling, extrusion, drawing, high energy rate forming, chipless forming techniques, manufacturing system concept in production."}, {"summer": "True", "name": "Finite Element Analysis II", "prerequisites": "Prerequisite: MAE 533", "spring": "True", "number": "734", "fall": "True", "units": " 3", "description": "Advanced treatment of finite element analysis for non-linear mechanics problems, including most recent developments in efficient solution procedures. Plate bending and shell elements, computational plasticity and viscoplastic materials, large deformation formulations, initial stability and buckling, structural vibrations, incompressible elasticity, contact problems, flow in incompressible media, weighted residuals and field problems. Development of efficient algorithms for practical application."}, {"summer": "True", "name": "Mechanical Design for Automated Assembly", "prerequisites": "Prerequisite: Graduate standing or PBS status in Engineering", "spring": "True", "number": "742", "fall": "True", "units": " 3", "description": "Mechanical design principles important in high volume production using modern automated assembly technology. Production and component design for ease of assembly as dictated by part handling, feeding, orientation, insertion and fastening requirements. Existing product evaluation and redesign for improved assemblage."}, {"summer": "True", "name": "Computational Fluid Dynamics", "prerequisites": "Prerequisite: MAE 560; proficiency in the FORTRAN programming language is required", "spring": "True", "number": "766", "fall": "True", "units": " 3", "description": "Advanced computational methods for integrating, by use of finite differences, and finite volume discretizations, non-linear governing equations of fluid flow; the Euler equations and the Navier-Stokes equations. Topics from current literature."}, {"summer": "True", "name": "Computation of Reacting Flows", "prerequisites": "Prerequisite: MAE 560, MAE 766", "spring": "True", "number": "770", "fall": "True", "units": " 3", "description": "Development of governing equations for chemically and thermally nonequilibrium flows. Numerical formulation with application to planetary entry flows and supersonic combustion. Numerical examples. Computational problems."}, {"summer": "True", "name": "Turbulence", "prerequisites": "Prerequisite: MAE 550", "spring": "True", "number": "776", "fall": "True", "units": " 3", "description": "Development of basic concepts and governing equations for turbulence and turbulent field motion. Formulations of various correlation tensors and energy spectra for isotropic and nonisotropic turbulence. Introduction to turbulent transport processes,free turbulence, and wall turbulence."}, {"summer": "True", "name": " Control II", "spring": "True", "number": "782", "fall": "True", "units": " 3", "description": "Classical feed back control theory and application, passive stabilization of single and dual-spin satellites, advanced momentum exchange devices and three axis control, reaction control systems, magnetic torquers and momentum dumping, attitude determination, optimum control of spacecraft attitude."}, {"summer": "True", "name": "Space Flight Guidance and Navigation", "prerequisites": "Prerequisite: MAE 581 and MAE 582 or equivalent", "spring": "True", "number": "783", "fall": "True", "units": " 3", "description": "."}, {"summer": "True", "name": "Advanced Topics In Mechanical Engineering", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "789", "fall": "True", "units": " 1-3", "description": "Faculty and graduate student discussions of advanced topics in contemporary mechanical engineering."}, {"summer": "True", "name": "Mechanical Engineering Seminar", "spring": "True", "number": "801", "fall": "True", "units": " 1", "description": "Faculty and graduate student discussions centered around current research problems and advanced engineering theories."}, {"summer": "True", "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "885", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "890", "fall": "True", "units": " 1-9", "description": "For students who are preparing for and taking written and/or oral preliminary exams."}, {"summer": "True", "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "893", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "895", "fall": "True", "units": " 1-9", "description": "Dissertation Research"}, {"summer": "True", "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "896", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Doctoral Dissertation Preparation", "spring": "True", "number": "899", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hour, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations."}]