[{"summer": "True", "name": "Introduction to Microbiology and Biochemistry Laboratory Practices", "spring": "True", "number": "101", "fall": "True", "units": " 3", "description": "Curricular bridge between high school and college for high school and transitional students.  A \"hands on\" introduction to fundamentals in Microbiology and Biochemistry.  Bacterial isolation, identification and growth using aseptic technique, microscopy, and metabolic analysis.  Experiments with DNA isolation and analysis, protein isolation, and purification, and enzyme kinetics.  Lectures and readings on background, theory and applications of these techniques.  Field trips to university and industry research laboratories.  This course is part of the Summer College in Biotechnology and Life Sciences (SCIBLS) as well as other pre-college, transitional and early-college programs and is offered as 4 week intensive course.  Applicants should have completed high school courses in biology and chemistry.  Students must have completed no more than 30 credit hours.  Departmental approval is required for current NCSU students."}, {"summer": "True", "name": "Introductory Topics in Microbiology", "spring": "True", "number": "103", "fall": "True", "units": " 1", "description": "Introduction to scope and objectives of university education.  Emphasis on microbiology.  Career opportunities, computers, university resources."}, {"summer": "True", "name": "Introduction to Microbial Bioprocessing", "spring": "True", "number": "180", "fall": "True", "units": " 3", "description": "Curricular bridge between high school and college for high school and transitional students.  Fundamental cell biology concepts pertaining to biomanufacturing.  Students gain an understanding of the basic principles of microbiology, culture preparation, physiology, and genetics of microbial cell cultures.  Team-based decisions, collaborations and consideration of multiple perspectives are emphasized.  Practical experience in laboratory and culture techniques used in biomanufacturing.  Transportation will be provided for field trips.  This course is part of the Summer College in Biotechnology and Life Sciences (SCIBLS), as well as other pre-college, transitional and early-college programs.  Suitable for students with less than 30 credit hours."}, {"summer": "True", "name": "Microbiology and World Affairs", "spring": "True", "number": "200", "fall": "True", "units": " 3", "description": "An integrated and comprehensive study of the microbial world and its influence on global events and human affairs."}, {"summer": "True", "name": "Phage Hunters", "spring": "True", "number": "210", "fall": "True", "units": " 3", "description": "This course offers first-year students an opportunity for mentored research.  Students will apply the scientific method to make novel discoveries.  Students will isolate and characterize naturally-occurring bacteriophage (viruses that infect bacteria, but not humans) from the environment.  They will present their data to each other, and the genome of one phage will be sequenced.  Students have the option to continue in a second semester to annotate that genome, culminating in a submission to genbank and a poster presentation.  Students in the course are part of the National Genome Research Initiative funded by The Howard Hughes Medical Institute.  Student should have had a high school biology course before taking this course."}, {"summer": "True", "name": "Phage Genomics", "prerequisites": "Prerequisite: BIT(MB) 210", "spring": "True", "number": "211", "fall": "True", "units": " 2", "description": "This course offers first-year students an opportunity for mentored research. Student will apply the scientific method to make novel discoveries. Students will build on the work they began in BIT/MB 210; The novel phage isolated in the previous semester will undergo genome sequencing over winter break, and in this course students will learn to analyze and annotate the genome sequence. This semester will culminate in a submission to genbank and a poster presentation. Students in the course are part of the national genome research initiative funded by the Howard Hughes Medical Institute."}, {"summer": "True", "name": "Fundamentals of Microbial Cell Culture", "prerequisites": "Prerequisite: BIO 183", "spring": "True", "number": "320", "fall": "True", "units": " 2", "description": "This is a half-semester course.  This introductory module addresses fundamental cell biology concepts and enables students to gain an understanding of the basic principles of microbiology, culture preparation, physiology and genetics of microbial cell cultures.  The lab portion of the course provides students with practical experience in basic laboratory and culture techniques.  Students who have completed either MB 352 or MB 354 may not take this course for credit."}, {"summer": "True", "name": "Fundamentals of Microbial Cell Biotransformations", "prerequisites": "Prerequisite: BEC(MB) 320 or MB 352", "spring": "True", "number": "325", "fall": "True", "units": " 2", "description": "This is a half-semester course.  Basic microbial cell culture theory and practice:  cell physiology, mass balances, and metabolic control as seen in a dynamic bioreactor culture.  The biological understanding, mathematical models, and engineering controls that enable a bioreactor process to be scalable, consistent, and robust.  The lab portion of the course provides students with hands-on experience in culture techniques using bioreactors.  Students who have completed BIT(CHE) 463 may not take this course for credit."}, {"summer": "True", "name": "General Microbiology", "prerequisites": "Prerequisite: One Biology course (BIO 181, BIO 183, ZO 150 or ZO 160) and one Organic Chemistry course (CH 221 or CH 220)", "spring": "True", "number": "351", "fall": "True", "units": " 3", "description": "Rigorous introduction to basic principles of microbiology for students in biological and agricultural sciences and for all students planning to take further courses in microbiology."}, {"summer": "True", "name": "General Microbiology Laboratory", "prerequisites": "Corequisite: MB 351", "spring": "True", "number": "352", "fall": "True", "units": " 1", "description": "Laboratory experience in general microbiology.  Aseptic technique, isolation and identification of bacteria, staining and microscopy.  Enumeration of bacteria and viruses. Students who have completed either MB (BEC) 320 or MB 354 may not take this course for credit."}, {"summer": "True", "name": "Inquiry-Guided Microbiolgoy Lab", "prerequisites": "Corequisite: MB 351", "spring": "True", "number": "354", "fall": "True", "units": " 1", "description": "Inquiry-guided laboratory experience in general microbiology, for microbiology majors and honors students, and those desiring a more rigorous exposure to this topic.  Aseptic technique, isolation and identification of bacteria, staining and microscopy, and Koch's postulates.  Restricted to microbiology majors and honor's students.  Others require departmental permission.  Credit is not allowed for both MB 354 and either Mb 320 or MB 352."}, {"summer": false, "name": "Scientific Inquiry in Microbiology: At the Bench", "prerequisites": "Prerequisite:CH 101 and BIO 183", "spring": false, "number": "360", "fall": true, "units": " 3", "description": "Scientific questions, controls and variables, designing, preparing for and carrying out experiments, keeping a notebook, interpreting results, and presenting their findings: i.e. the pragmatic things a student must know in order to work efficiently in a research lab regardless of the discipline. The experimental system of choice for this class is the bacterial growth curve. Prior or current enrollment in MB 352 or MB 354 recommended. Microbiology majors/minors and certificate students only."}, {"summer": "True", "name": "Food Microbiology", "prerequisites": "Prerequisite: MB 351", "spring": "True", "number": "405", "fall": "True", "units": " 3", "description": "Microorganisms of importance in foods and their metabolic activities.  Source of microbial contamination during food production, processing and storage. Microbial spoilage; foods as vectors of human pathogens. Physical and chemical destruction of microorganisms in foods and the kinetics involved. Conversions of raw foods by microorganisms into food products. Microbiological standards for regulatory and trade purposes. Credit will not be given for both FS/MB 405 and  FS/MB 505."}, {"summer": "True", "name": "Food Microbiology Lab", "prerequisites": "Prerequisite: MB 351 and Corequisite: FS 405 or FS 505", "spring": "True", "number": "406", "fall": "True", "units": " 1", "description": "Laboratory experience to complement FS/MB 405.  Skills in detecting and quantitating microorganisms and their toxins in foods.  Application of colony and direct microscopic counts, most probable numbers, enzyme immunoassays, nucleic acid probes and computer modeling are used to understand the numbers and types of microorganisms or microbial end products in foods.  Laboratory safety and oral and written reports are emphasized."}, {"summer": "True", "name": "Medical Microbiology", "prerequisites": "Prerequisite: MB 351", "spring": "True", "number": "411", "fall": "True", "units": " 3", "description": "Comprehensive study of microbial pathogenesis and mammalian host resistance. Diagnosis, prevention, and therapy of common human diseases of microbial origin."}, {"summer": "True", "name": "Medical Microbiology Laboratory", "prerequisites": "Prerequisite: MB 352 or MB 354 and Corequisite: MB 411", "spring": "True", "number": "412", "fall": "True", "units": " 1", "description": "Laboratory experience to complement MB 411.  Techniques of detection, growth and identification of bacteria and viruses relevant in clinical microbiology laboratories.  Good laboratory practices (GLP) and safety stressed."}, {"summer": "True", "name": "Microbial Metabolic Regulation", "prerequisites": "Prerequisite: MB 351, BCH 451", "spring": "True", "number": "414", "fall": "True", "units": " 3", "description": "An integrative perspective on bacterial physiology and metabolism through an analysis of metabolic regulatory functions."}, {"summer": "True", "name": "Fundamentals of Microbial Cell Biotransformations", "prerequisites": "Prerequisite: MB 352 OR Corequisite of BEC(MB) 320", "spring": "True", "number": "420", "fall": "True", "units": " 2", "description": "This is a half-semester course.  Basic microbial cell culture theory and practice: cell physiology, mass balances, and metabolic control as seen in a dynamic bioreactor process to be scalable, consistent, and robust.  The lab portion of the course provides students with hands-on experience in culture techniques using bioreactors.  Students who have completed MB(BEC) 520 may not take BEC (MB) 420 for credit."}, {"summer": "True", "name": "Immunology", "prerequisites": "Prerequisite: MB 351", "spring": "True", "number": "441", "fall": "True", "units": " 3", "description": "Introduction to principles of molecular immunology. Overview of immune system development and function, and discussions of ongoing scientific research regarding immune regulation."}, {"summer": "True", "name": "Microbial Diversity", "prerequisites": "Prerequisite: MB 411 and (GN 311 or BCH 451)", "spring": "True", "number": "451", "fall": "True", "units": " 3", "description": "Molecular, biochemical, and evolutionary diversity of the microbial world, including Bacteria, Archaea, and Eukaryotes. Evolutionary perspective on microbial relationships, molecular methods of study and classical and modern biotechnological methods utilizing this genetic diversity to explore the microbial world and use the resulting insight to meet the needs of our own species."}, {"summer": "True", "name": "Microbial Diversity Lab", "prerequisites": "Prerequisite: MB 412; Corequisite: MB 451", "spring": "True", "number": "452", "fall": "True", "units": " 2", "description": "This lab course is project-oriented. Students perform a series of classical enrichments and isolations, starting from environmental samples collected by the students themselves. Some of these isolations serve as the starting materials for a series of modern molecular biology experiments, in which students purify DNA, amplify ribosomal DNA by PCR, and have a portion of this gene sequenced. This sequence information is the starting point for the term project, a detailed molecular phylogenetic analysis of the isolated organisms. Students will be required to provide their own transportation during non-scheduled class time for local field sample collection."}, {"summer": "True", "name": "Microbial Biotechnology", "prerequisites": "Prerequisite: MB 351 and GN 311", "spring": "True", "number": "455", "fall": "True", "units": " 3", "description": "Introduction to industrial microbiology with focus on biotechnology including developments employing recombinant nucleic acid and monoclonal antibody techniques.  Bioremediation, industrial enzymes, transgenic plants, biopesticides, medical diagnostics, recombinant vaccines production of important secondary metabolites, and other topics.  Field trips to local biotechnology companies."}, {"summer": "True", "name": "Molecular Virology", "prerequisites": "Prerequisite: MB 351, MB 411", "spring": "True", "number": "461", "fall": "True", "units": " 3", "description": "Introduction to principles of molecular virology.  Overview of classification and nomenclature, virus structure, interaction of viruses with cells, organisms (immunology, pathology), and populations (epidemiology).  Detailed case studies from major groups of viruses; picornaviruses, togaviruses, orthomyxoviruses, retroviruses, polyomaviruses, and herpesviruses."}, {"summer": "True", "name": "Current Issues in Microbiology", "prerequisites": "Prerequisite: SMB majors or minors, Senior standing, and MB 351", "spring": "True", "number": "480", "fall": "True", "units": " 1", "description": "Library research on current topics in all areas of microbiology.  Presentation of research results orally and in the form of a major term paper."}, {"summer": "True", "name": "External Learning Experience", "prerequisites": "Prerequisite: Sophomore standing", "spring": "True", "number": "492", "fall": "True", "units": " 1-6", "description": "A learning experience in agriculture and life sciences within an academic framework that utilizes facilities and resources which are external to the campus. Contact and arrangements with prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior to the experience."}, {"summer": "True", "name": "Special Problems in Microbiology", "prerequisites": "Prerequisite: Sophomore standing", "spring": "True", "number": "493", "fall": "True", "units": " 1-6", "description": "A learning experience in agriculture and life sciences within an academic framework that utilizes campus facilities and resources. Contact and arrangements with prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior to the experience."}, {"summer": "True", "name": "Special Topics in Microbiology", "spring": "True", "number": "495", "fall": "True", "units": " 1-3", "description": "Offered as needed to present materials not normally available in regular course offerings or for offering of new courses on a trial basis."}, {"summer": "True", "name": "Biology of Plant Pathogens", "prerequisites": "Prerequisite: PP 315, or PP 318, or an introductory course in microbiology", "spring": "True", "number": "501", "fall": "True", "units": " 3", "description": "Biology of microbes that cause plant diseases.  The ecology, genetics, physiology, taxonomy, and mechanisms of parasitism, pathogenicity and virulence of bacteria (and other prokaryotes), fungi (and oomycetes), nematodes, and viruses that cause plant diseases.  Prepares graduate students for advanced courses in plant pathology, host-parasite interactions, and provides a knowledge base for students in other disciplines involved with plant pathogens or who seek to broaden their knowledge of microbes."}, {"summer": "True", "name": "Food Microbiology", "prerequisites": "Prerequisite: MB 351", "spring": "True", "number": "505", "fall": "True", "units": " 3", "description": "Microorganisms of importance in foods and their metabolic activities.  Source of microbial contamination during food production, processing and storage. Microbial spoilage; foods as vectors of human pathogens. Physical and chemical destruction of microorganisms in foods and the kinetics involved. Conversions of raw foods by microorganisms into food products. Microbiological standards for regulatory and trade purposes. Credit will not be given for both FS/MB 405 and  FS/MB 505."}, {"summer": "True", "name": "Food Microbiology Lab", "prerequisites": "Prerequisite: MB 351 and Corequisite: FS 405 or FS 505", "spring": "True", "number": "506", "fall": "True", "units": " 1", "description": "Laboratory experience to complement FS/MB 405.  Skills in detecting and quantitating microorganisms and their toxins in foods.  Application of colony and direct microscopic counts, most probable numbers, enzyme immunoassays, nucleic acid probes and computer modeling are used to understand the numbers and types of microorganisms or microbial end products in foods.  Laboratory safety and oral and written reports are emphasized."}, {"summer": "True", "name": "Fundamentals of Microbial Cell Biotransformations", "spring": "True", "number": "520", "fall": "True", "units": " 2", "description": "This is a half-semester course.  Basic microbial cell culture theory and practice: cell physiology, mass balances, and metabolic control as seen in a dynamic bioreactor process to be scalable, consistent, and robust.  The lab portion of the course provides students with hands-on experience in culture techniques using bioreactors.  Students who have completed MB(BEC) 520 may not take BEC (MB) 420 for credit."}, {"summer": "True", "name": "Soil Microbiology", "prerequisites": "Prerequisite: MB 351, CH 220", "spring": "True", "number": "532", "fall": "True", "units": " 4", "description": "Soil as a medium for microbial growth, the relation of microbes to important mineral transformations in soil, the importance of biological equilibrium and significance of soil microbes to environmental quality."}, {"summer": "True", "name": "Bacterial Pathogenesis", "prerequisites": "Prerequisite: Graduate or Senior status and MB 351 required.  MB 411 is recommended.", "spring": "True", "number": "535", "fall": "True", "units": " 3", "description": "Basic principles of microbial pathogenesis: bacterial mechanisms of attachment/adherence, invasion, dissemination through, and persistence within animal hosts; host response; bacterial virulence and host immune-evasion strategies.  Primarily lecture-based, some research-article discussion.  Written paper, in-class presentation required."}, {"summer": "True", "name": "Microbial Biotechnology", "prerequisites": "Prerequisite: Undergraduate microbiology, genetics, and biochemistry course: MB351, BCH 351, and GN 311", "spring": "True", "number": "555", "fall": "True", "units": " 3", "description": "Overview of industrial microbiology focusing on current biotechnology methods (bacteria, yeast, fungi) employing rDNA, optimization of heterologous gene expression, microbial metabolic pathway engineering, metabolomics, protein engineering and recombinant antibodies.  Genetic and pathway engineering strategies for developing new microbes to screen for new therapeutic compounds or overproduce: primary metabolites, antibiotics, biotherapeutic proteins, industrially useful enzymes, medical diagnostics, recombinant vaccines, biopolymers.  Utilization of biofilms, methods to immobilize biocatalysts, and microbial kinetics are also covered.  Field trip to local biotechnology company.  Students cannot receive credit for both 455 and 555."}, {"summer": "True", "name": "Introduction to Mycology", "prerequisites": "Prerequisite: BS 125 or BS 181 and 183 or BO 200 or PP 315 or PP 318", "spring": "True", "number": "575", "fall": "True", "units": " 4", "description": "A survey of the fungal kingdom in context of phyla and classes.  Systematics, ecology, biology and utilization.  Illustrative material, cultural techniques in laboratories.  Collection and paper required."}, {"summer": "True", "name": "Topical Problems", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "590", "fall": "True", "units": " 1-3", "description": "Informal group discussion of prepared topics assigned by instructor."}, {"summer": "True", "name": "Seminar", "spring": "True", "number": "601", "fall": "True", "units": " 1"}, {"summer": "True", "name": "Special Topics Microbiology", "spring": "True", "number": "610", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Special Problems", "spring": "True", "number": "620", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Topical Problems", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "624", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Laboratory Research Methods", "spring": "True", "number": "670", "fall": "True", "units": " 1-3", "description": "Directed research of microbiology graduate students in departmental laboratories prior to selecting thesis research topic. Selection of a minimum of three laboratories for research experience lasting 3 to 5 weeks. Acquisition of research methods relevant to each laboratory.   Microbiology graduate students only."}, {"summer": "True", "name": "Microbiology Research Presentations", "spring": "True", "number": "680", "fall": "True", "units": " 1", "description": "Essential elements of structure, delivery, data presentation and use of media in scientific research seminars. Presentation and evaluation of student seminars. Coverage of topical material in microbiology as determined by instructor. Microbiology graduate students only."}, {"summer": "True", "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "685", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Teaching Experience", "prerequisites": "Prerequisite: Microbiology Graduate student", "spring": "True", "number": "686", "fall": "True", "units": " 1", "description": "Faculty mentoring in didactic and methodological aspects of teaching, including instructional technology as well as design and grading of assessment instruments. Provision of individual performance evaluations to encourage enhancement of teaching skills.  Microbiology graduate students only."}, {"summer": "True", "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "688", "fall": "True", "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": "True", "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "689", "fall": "True", "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": "True", "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "690", "fall": "True", "units": " 1-6", "description": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam."}, {"summer": "True", "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "693", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "695", "fall": "True", "units": " 1-9", "description": "Thesis research."}, {"summer": "True", "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "696", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "699", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their theses."}, {"summer": "True", "name": "Biological Scanning Electron Microscopy", "prerequisites": "Prerequisite: Graduate standing with some biological background", "spring": "True", "number": "705", "fall": "True", "units": " 2", "description": "On demand. Theory and application of scanning electron microscopy, including specimen preparation, microscope alignment and operation, performance evaluation, interpretation of problems and darkroom technique. (Limited to 8 students with prior approval of instructor.)"}, {"summer": "True", "name": "Microbial Metabolic Regulation", "prerequisites": "Prerequisite: MB 351, BCH 451", "spring": "True", "number": "714", "fall": "True", "units": " 3", "description": "An integrative perspective on bacterial physiology and metabolism through analysis of metabolic regulatory functions."}, {"summer": "True", "name": "Applied Evolutionary Analysis of Population Genetic Data", "spring": "True", "number": "715", "fall": "True", "units": " 3", "description": "This course will introduce nonparametric and model-based methods for making inferences on population processes (mutation, migration, drift, recombination, and selection).  The goal is to provide a conceptual overview of these methods and hands-on training on  how to implement and interpret the results.  Sample data sets in computer laboratories will integrate summary statistic, cladistic, coalescent, and bayesian approaches to examine population processes in different pathosystems with specific emphasis on eukaryotic microbes, viruses and bacteria."}, {"summer": "True", "name": "Introductory Virology", "prerequisites": "Prerequisite: BCH 451 or GN 411 or MB 351", "spring": "True", "number": "718", "fall": "True", "units": " 3", "description": "Introduction to principles of virology including: classification and nomenclature, epidemiology, structure, genome replication, gene expression strategies and cellular infection cycle. Major groups of viruses including those with DNA genomes and positive-sense or negative-sense RNA genomes."}, {"summer": "True", "name": "Fermentation Microbiology", "spring": "True", "number": "725", "fall": "True", "units": " 3", "description": "Fermentation bioprocessing and characteristics, function and ecology of responsible microorganisms.  Fermentative activities, growth responses and culture interactions related to metabolism, physiology and genetics of lactic acid bacteria and selected yeasts and molds. Current developments in starter culture technology and genetics; application to food and industrial fermentations."}, {"summer": "True", "name": "Fungal Genetics and Physiology", "prerequisites": "Prerequisite: BCH 451, BO 775, GN 411 or PP 501", "spring": "True", "number": "730", "fall": "True", "units": " 3", "description": "Basic concepts of genetics and physiology of fungi, with emphasis on saprophytic and plant pathogenic mycelial fungi. Current literature on evolution, cell structure, growth and development, gene expression, metabolism, sexual and asexual reproduction and incompatibility systems. Laboratory exercises on mutant isolation, sexual and parasexual analysis, genetic transformation, and RFLP and isozyme analysis."}, {"summer": "True", "name": "Immunology", "prerequisites": "Prerequisite: BCH 451, GN 411, MB 351", "spring": "True", "number": "751", "fall": "True", "units": " 3", "description": "Introduction to mechanisms of immunity in man and animals. Emphasis on interactions between cells of the immune system in production of immune responses and the molecules in control of these interactions."}, {"summer": "True", "name": "Prokaryotic Molecular Genetics", "prerequisites": "Prerequisite: BCH 451, GN 411", "spring": "True", "number": "758", "fall": "True", "units": " 3", "description": "Structure and function in prokaryotic molecular genetics, with emphasis on mutations and mutagenic pathways, transcriptional and translational regulation, RNA processing, DNA replication and recombination and characterization of recombinant DNA molecules. Applications of genetic and recombinant DNA techniques to microbial processes, including strain construction and enhancement of gene expression."}, {"summer": "True", "name": "Phycology", "spring": "True", "number": "774", "fall": "True", "units": " 3", "description": "Introduction to taxonomy, morphology, reproduction and ecological importance of organisms which may be included in the algae. Attention to local freshwater flow and physiology of selected species in relation to algal blooms, water quality and nutrient loading in aquatic habitats."}, {"summer": "True", "name": "Advanced Immunology", "prerequisites": "Prerequisite: MB (IMM) 751", "spring": "True", "number": "783", "fall": "True", "units": " 3", "description": "In depth study of the basic cellular and molecular mechanisms of immunity, including antigen processing and presentation, T cell development, initiation of the immune response, effector mechanisms, and immunological memory.  The course is designed for advanced graduate students who wish to focus on the current concepts in immunology."}, {"summer": "True", "name": "Topical Problems", "spring": "True", "number": "790", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Seminar", "spring": "True", "number": "801", "fall": "True", "units": " 1"}, {"summer": "True", "name": "Special Topics Microbiology", "spring": "True", "number": "810", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Special Problems", "spring": "True", "number": "820", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Topical Problems", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "824", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Doctoral Lab Rotations", "spring": "True", "number": "870", "fall": "True", "units": " 1-3", "description": "Directed research of microbiology graduate students in departmental laboratories prior to selecting thesis research topic. Selection of a minimum of three laboratories for research experience lasting 3 to 5 weeks. Acquisition of research methods relevant to each laboratory. Microbiology graduate students only."}, {"summer": "True", "name": "Doctoral Microbiology Research Presentations", "spring": "True", "number": "880", "fall": "True", "units": " 1", "description": "Essential elements of structure, delivery, data presentation and use of media in scientific research seminars. Presentation and evaluation of student seminars. Coverage of topical material in microbiology as determined by instructor. Microbiology graduate students only."}, {"summer": "True", "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "885", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Teaching Experience", "prerequisites": "Prerequisite: Microbiology Graduate student", "spring": "True", "number": "886", "fall": "True", "units": " 1", "description": "Faculty mentoring in didactic and methodological aspects of teaching, including instructional technology as well as design and grading of assessment instruments. Provision of individual performance evaluations to encourage enhancement of teaching skills.  Microbiology graduate students only."}, {"summer": "True", "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "890", "fall": "True", "units": " 1-9", "description": "For students who are preparing for and taking written and/or oral preliminary exams."}, {"summer": "True", "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "893", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "895", "fall": "True", "units": " 1-9", "description": "Dissertation research."}, {"summer": "True", "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "896", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "899", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hour, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations."}]