[{"summer": false, "name": "Systems Engineering", "prerequisites": "Prerequisite: C- or better in MAE 206", "spring": false, "number": "300", "fall": true, "units": " 4", "description": "This course provides an introduction to the theory and practice of formal systems engineering. Students are exposed to systems thinking, systems modeling and performing engineering design within a formal systems engineering framework. They will perform requirements definition and analysis, system architecting, test and integration plan development, economic evaluation of alternatives, and formal technical reviews. Requires Junior standing."}, {"summer": true, "name": "Mechanical Engineering Systems Lab I", "prerequisites": "Prerequisite: GC 120, MSE 201, MAE 206", "spring": false, "number": "305", "fall": false, "units": " 1", "description": "Course provides an introduction to the theory and practice of manual and computer assisted laboratory measurement techniques, data analysis, design of experiments and technical report writing. Students learn to successfully conduct and document an engineering experiment. For MES Majors only."}, {"summer": false, "name": "MES Capstone Design I", "prerequisites": "Prerequisite: MAE 316, MAE 310, MES 300; Corequisite: MAE 415", "spring": false, "number": "401", "fall": true, "units": " 3", "description": "This course is first of a two-semester engineering design and manufacturing experience which is the culmination of the MES student's undergraduate education experience. In teams, students design, cost, and build a working prototype to solve a real-world engineering problem supplied by an industry partner. Students follow a systems engineering approach to manage their project through a requirements definition review, a preliminary design review, and the completion of detailed design. Students develop communication skills through reports and presentations and gain insight into engineering design through guest lectures. Students must provide any transportation needed for this class. MES students only."}, {"summer": false, "name": "MES Capstone Design II", "prerequisites": "Prerequisite: MES 401", "spring": true, "number": "402", "fall": false, "units": " 4", "description": "This course is the second of the two semester senior engineering design and manufacturing experience.  In MES 402, students manage their design project through the completion of a critical design review, a production readiness review, manufacturing and fabrication, a test readiness review and a final verification review.  Students develop written and verbal communication skills through reports and presentations and gain insight into engineering design practices through guest lectures from local engineers.  Students must provide any transportation needed for this course.  MES majors only."}, {"summer": true, "name": "Mechanical Engineering Systems Lab II", "prerequisites": "Prerequisite: MES 305, MAE 314, MAE 308; Corequisite: MAE 435, MAE 310", "spring": false, "number": "405", "fall": false, "units": " 2", "description": "In this course, students apply the measurement and experimental techniques learned in MES 305 to explore, experience and verify key theoretical concepts from the fields of thermal science, fluid mechanics, solid mechanics, and dynamics and controls. Students learn to successfully design, conduct, analyze, document and present a statistically sound engineering experiment. For MES students only."}]