[{"summer": "True", "name": "Special Topics in International Studies", "prerequisites": "Prerequisite: Advanced Undergraduate standing, PBS status, or Graduate standing", "spring": "True", "number": "598", "fall": "True", "units": " 1-3", "description": "In-depth investigation of a contemporary topic in the field of international studies in a class context.  Topic and mode of instruction to be determined by faculty member.  May be taken for up to six hours of credit."}, {"summer": "True", "name": "Colloquium in International Studies", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "601", "fall": "True", "units": " 3", "description": "Selected topics in international studies required for writing and oral presentation of MIS capstone paper."}, {"summer": "True", "name": "Independent Study", "prerequisites": "Prerequisite: MIS standing", "spring": "True", "number": "630", "fall": "True", "units": " 1-6", "description": "Investigation of topics of particular interest to advanced students under faculty direction on a tutorial basis. Credits and content vary with student/faculty discretion and needs."}, {"summer": "True", "name": "Internship in International Studies", "prerequisites": "Prerequisite: MIS standing", "spring": "True", "number": "651", "fall": "True", "units": " 1-6", "description": "Exposure of student to value systems and technological environment of cultures other than his/her own through a supervised work experience.  Application of technological knowledge to development problems. Required technical paper summarizing and analyzing this experience."}, {"summer": "True", "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "685", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "688", "fall": "True", "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": "True", "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "689", "fall": "True", "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": "True", "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "690", "fall": "True", "units": " 1-6", "description": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam."}]