[{"summer": "True", "name": "Seminar In Liberal Studies", "prerequisites": "Prerequisite: Admission to M.A. in liberal studies", "spring": "True", "number": "501", "fall": "True", "units": " 3", "description": "Intensive study of an interdisciplinary issue or area. Seminars, varying each semester, address such topics as arts studies, history and literature, sociobiology and social sciences, world trade and world conflict, and technology and social change."}, {"summer": "True", "name": "Independent Study", "prerequisites": "Prerequisite: Admission to M.A. in liberal studies", "spring": "True", "number": "630", "fall": "True", "units": " 1-6", "description": "Advanced independent study of an interdisciplinary topic under supervision of a faculty member."}, {"summer": "True", "name": "Independent Project", "prerequisites": "Prerequisite: Admission to M.A. in liberal studies", "spring": "True", "number": "676", "fall": "True", "units": " 3", "description": "Advanced independent research on an interdisciplinary project under supervision of a faculty member."}, {"summer": "True", "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "685", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "688", "fall": "True", "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": "True", "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "689", "fall": "True", "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": "True", "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "690", "fall": "True", "units": " 1-6", "description": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam."}]