[{"summer": false, "name": "Introduction to Medical Textiles", "spring": false, "number": "105", "fall": true, "units": " 3", "description": "Introduction to the structures and methods of production of polymers, fibers, yarns and fabrics used in medical applications.  Survey of the performance requirements of current medical textiles and healthcare products used in health centers, as surgical implants and as consumer products.  Overview of the structure, organization and integration of the medical textile, medical device and pharmaceutical industries within the healthcare sector. Credit not allowed if previous credit for TT 105"}, {"summer": false, "name": "Introduction to Theory and Practice of Medical Fiber and Yarn Formation", "prerequisites": "Prerequisite: (PY 211 or PY 205) and (PCC 203 or CH 221 or TE 200)", "spring": false, "number": "323", "fall": true, "units": " 3", "description": "Introduction to the manufacture of fibers and filament yarns used in medical textiles.  It includes the flow behavior of polymeric materials as it relates to fiber formation.  It also includes the application of fiber forming theories to synthetic and biopolymeric fibers used in medical textiles.  The common methods of yarn manufacture are introduced."}, {"summer": false, "name": "Biotextile Product Development", "prerequisites": "P: (MT 105 or PCC 101 or TT 105) and MT 323 and BIO 183.", "spring": false, "number": "366", "fall": true, "units": " 3", "description": "Biotextile product development of surgical implants designed for the repair and replacement of tissues in cardiovascular, wound healing, orthopedic, dental and tissue engineering applications.  Mechanical, physical, chemical, surface and biological properties including cell/biotextile interactions of fibers and fibrous structures will be reviewed.  Bioresorbable polymers, drug delivery systems, fiber reinforced composites, and strategies for surface modification and biorecognition will be reviewed in the light of material selection and structural design. Credit for TE 366 and TE 466 is not allowed."}, {"summer": false, "name": "Medical Textile and the Regulatory Environment", "prerequisites": "Prerequisite: Junior standing.", "spring": true, "number": "381", "fall": false, "units": " 3", "description": "The course will focus on the legal and regulatory environment as it impacts the design, manufacture, marketing and distribution of medical textiles and healthcare products.  Fundamentals of legal theory, contract law, intellectual property, licensing, product liability and the Food and Drug Administration will be covered, providing the student with the ability to recognize and understand the legal issues involved with the medical textile supply chain."}, {"summer": false, "name": "Biotextiles Evaluation", "prerequisites": "Prerequisite: MT 323 and BIO 183; Corequisite: MT 366 or TE 466.", "spring": true, "number": "432", "fall": false, "units": " 3", "description": "Evaluation of the performance of biotextiles and medical polymers in biological and microbiological environments, with an emphasis on in vitro and in vivo techniques for testing the biocompatibility and biostability of implantable biomedical products.  Related issues will deal with quality assurance systems, inspection and sampling plans, ISO certification, good manufacturing practices, reference materials and organisms, and the use of accelerated tests and animal trials so as to meet regulatory requirements."}, {"summer": false, "name": "The Chemistry of Synthetic and Natural Bipolymers", "prerequisites": "Prerequisite: CH 220 or CH 221", "spring": true, "number": "471", "fall": false, "units": " 3", "description": "Introduction to natural and synthetic biopolymers used for biomedical applications.  Goals and challenges of biomaterials selection for biomedical engineering.  Polymer concepts of polymerization and characterization.  Sources/synthesis, chemical and physical properties and degradation mechanisms are described.  Polymer classes include: polysaccharides, proteins, polyesters, polyurethanes, polyanhydrides and polyethers."}]