[{"summer": false, "name": "Instrumental Music", "prerequisites": "Prerequisite: Satisfactorily passing audition", "spring": true, "number": "100", "fall": true, "units": " 1", "description": "The study and performance of instrumental music.  Repertoire dependent upon instrument and level of interest and accomplishment."}, {"summer": "True", "name": "Music Theory I", "prerequisites": "Prerequisite: MUS 120 or Rudiments Placement Test.  Co-requisite: MUS 104.", "spring": "True", "number": "103", "fall": "True", "units": " Performing Arts", "description": "Through the examination of musical styles, as exemplified by various composers of the western music common practice period, the student will explore the fundamentals of music theory.  Composition, analysis, and other practical skills will be used to enhance the study of traditional musical elements."}, {"summer": false, "name": "Aural Skills 1", "prerequisites": "Prerequisite: MUS 120 or aural skills placement test; Co-requisite: MUS 103", "spring": true, "number": "104", "fall": true, "units": " 1", "description": "This is the first course in a two-semester sequence which will lead to proficiency in sight singing, rhythmic skills, and conducting.  Aural dictation of melodies, rhythms, and harmonies will be enhanced through computer-based software."}, {"summer": false, "name": "Class Piano 1", "spring": true, "number": "107", "fall": true, "units": " 1", "description": "Development of technical and musical foundation for playing the piano.  Exploration of repertoire in various keys, scale structures, harmonization of melodies using chord progressions, use of pedal.  Materials supported with theory and aural examples. Section 001 for Music Minors and Hons. students only. Sectoin 002 for General Students and Hons. students."}, {"summer": false, "name": "Choral Music", "prerequisites": "Prerequisite: Satisfactorily passing audition", "spring": true, "number": "110", "fall": true, "units": " 1", "description": "Study and performance of choral music by participation in Varsity Men's Glee Club (male chorus), Women's Choir,  New Horizons Choir (mixed chorus), or Chamber Singers."}, {"summer": false, "name": "Men's Choir", "spring": true, "number": "112", "fall": true, "units": " 1", "description": "Rehearsal and performance of choral repertoire for men's voices.  Includes instruction in individual vocal techniques, rehearsal protocols, and discussion of historical and musical significance of repertoire.  May be repeated for credit. Possible charge for concert dress.  Students may be asked to provide their own transportation to a local performance venue."}, {"summer": false, "name": "Women's Choir", "spring": true, "number": "113", "fall": true, "units": " 1", "description": "Rehearsal and performance choral repertoire for women's voices. Includes instruction in individual vocal techniques, rehearsal protocols, and discussion of historical and musical significance of repertoire.  May be repeated for credit.  Possible charge for concert dress.  Students may be asked to provide their own transportation to a local performance venue. Audition required.  May be repeated up to 10 semesters."}, {"summer": false, "name": "Chamber SIngers", "spring": true, "number": "114", "fall": true, "units": " 1", "description": "Rehearsal and performance of choral repertoire for small vocal ensemble.  Includes instruction in individual vocal techniques, rehearsal protocols, and discussion of historical and musical significance of repertoire.  May be repeated for credit.  Possible charge for concert dress. Students may be asked to provide their own transportation to a local performance venue.  Audition required.  May be repeated up to 10 semesters."}, {"summer": false, "name": "State Chorale", "spring": true, "number": "115", "fall": true, "units": " 1", "description": "Rehearsal and performance of advanced choral repertoire from all eras.  Includes instruction in individual vocal techniques, rehearsal protocols, and discussion of historical and musical significance of repertoire.  May be repeated for credit.  Possible charge for concert dress.  Students may be asked to provide their own transportation to a local performance venue. Audition required.  May be repeated up to 10 semesters."}, {"summer": "True", "name": "Rudiments of Music", "spring": "True", "number": "120", "fall": "True", "units": " Performing Arts", "description": "Rudiments of music is designed for students with minimal or no music theory background and covers the fundamentals of music, including note reading in treble and bass clefs, rhythm, meter, scales, key signatures, intervals, and triads."}, {"summer": false, "name": "Raleigh Civic Symphony", "spring": true, "number": "121", "fall": true, "units": " 1", "description": "Rehearsal and performance of significant repertoire for symphony orchestra from the 18th-21st centuries, including individual practice techniques, rehearsal protocols, discussion of historical and musical significance of repertoire, and public performances.  May be repeated for credit.  Possible charge for concert dress.  Students may be asked to provide individual transportation to an off-campus local performance."}, {"summer": false, "name": "Chamber Orchestra", "spring": true, "number": "122", "fall": true, "units": " 1", "description": "Rehearsal and performance of significant repertoire for chamber orchestra from the 17th-21st centuries, including individual practice techniques, rehearsal protocols, discussion of historical and musical significance of repertoire, and public performances. May be repeated for credit .  Possible charge for concert dress.  Students may be asked to provide individual transportation to an off-campus local performance.  Audition required.  May be repeated for up to 10 semesters."}, {"summer": false, "name": "Marching Band", "spring": false, "number": "131", "fall": true, "units": " 1", "description": "Rehearsal and performance of repertoire for marching band.  Study of drill and instrumental techniques, memorization, and repertoire of varying styles for large ensemble.  May be repeated for credit.  There is a band uniform charge; transportation to performances will be provided.  Audition required.  May be repeated up to 10 semesters."}, {"summer": false, "name": "Varsity Band", "spring": true, "number": "132", "fall": true, "units": " 1", "description": "Rehearsal and performance of repertoire for varsity or athletic band.  Study of instrumental techniques and repertoire of varying styles for large ensemble.  May be repeated for credit.  There is a band uniform charge; transportation to performances will be provided.  Audition required.  May be repeated up to 10 semesters."}, {"summer": false, "name": "Wind Ensemble", "spring": true, "number": "134", "fall": true, "units": " 1", "description": "Rehearsal and performance of significant repertoire for wind ensemble, including individual practice techniques, rehearsal protocols, discussion of historical and musical significance of repertoire, and public performances.  May be repeated for credit.  Possible charge for concert dress.  Students may be asked to provide individual transportation to an off-campus local performance.  Audition required.  May be repeated for up to 10 semesters."}, {"summer": false, "name": "Jazz Improvisation", "spring": true, "number": "140", "fall": true, "units": " 1", "description": "Study of basic and advanced techniques for jazz improvisation, including in-class performance and study of historical models.  May be repeated for credit up to ten semesters.  Audition required."}, {"summer": false, "name": "Jazz Combo 2", "spring": true, "number": "141", "fall": true, "units": " 1", "description": "Rehearsal and performance of  basic to advanced repertoire for small jazz ensemble, including individual practice techniques, improvisation, rehearsal protocols, discussion of historical and musical significance of repertoire, and public performances.  May be repeated for credit.  Students may be asked to provide individual transportation to an off-campus local performance.  Audition required.  May be repeated up to 10 semesters."}, {"summer": false, "name": "Jazz Ensemble 2", "spring": true, "number": "142", "fall": true, "units": " 1", "description": "Rehearsal and performance of basic to advanced repertoire for jazz ensemble, including individual practice techniques, improvisation, rehearsal protocols, discussion of historical and musical significance of repertoire, and public performances. May be repeated for credit.  Students may be asked to provide individual transportation to an off-campus local performance.  Audition required.  May be repeated up to 10 semesters."}, {"summer": false, "name": "Jazz Combo 1", "spring": true, "number": "143", "fall": true, "units": " 1", "description": "Rehearsal and performance of advanced repertoire for small jazz ensemble, including individual practice techniques, improvisation, rehearsal protocols, discussion of historical and musical significance of repertoire, and public performances.  May be repeated for credit.  Students may be asked to provide individual transportation to an off-campus local performance.  Audition required.  May be repeated up to 10 semesters."}, {"summer": false, "name": "Jazz Ensemble 1", "spring": true, "number": "144", "fall": true, "units": " 1", "description": "Rehearsal and performance of advanced repertoire for jazz ensemble, including individual practice techniques, improvisation, rehearsal protocols, discussion of historical and musical significance of repertoire, and public performances.  May be repeated for credit. Students may be asked to provide individual transportation to an off-campus local performance.  Audition required.  May be repeated up to 10 semesters."}, {"summer": false, "name": "Vocal Techniques", "spring": true, "number": "150", "fall": true, "units": " 1", "description": "Development and practice of vocal techniques suitable to solo and ensemble singing in a variety of musical styles, both historical and contemporary."}, {"summer": false, "name": "Pipes and Drums", "spring": true, "number": "152", "fall": true, "units": " 1", "description": "Rehearsal and performance of music for bagpipes and drums, including individual practice techniques, traditional performance practices, and public performances.  May be repeated for credit.  Students may be asked to provide individual transportation to an off-campus local performance.  Audition required.  May be repeated up to 10 semesters."}, {"summer": "True", "name": "Introduction to Musical Experiences", "spring": "True", "number": "180", "fall": "True", "units": " Performing Arts", "description": "Examination of western musical materials, forms, styles and history through the primary musical experiences of composing, performing, and listening.  Course designed for students with no formal musical training."}, {"summer": "True", "name": "Exploring Music Theory", "prerequisites": "Prerequisite: Ability to read music", "spring": "True", "number": "181", "fall": "True", "units": " Performing Arts", "description": "Exploring music theory provides the student insight into Basic theoretical elements of music from Western civilization, which are fundamental to analysis and creation of musical compositions. The course will cover tonality, rhythm, intervals, triads, composition of melodies, harmonic progressions, and lead sheets. This course will enrich the student who performs, sings, composes, and enjoys listening to music."}, {"summer": "True", "name": "Understanding Music: Global Perspectives", "spring": "True", "number": "200", "fall": "True", "units": " Performing Arts, Global Knowledge", "description": "Music as universal human phenomenon. Global approach to music's elements and concepts like melody, rhythm, and timbre; and how it functions in relationship to religious belief, observation, and experience; its role in the formation, expression, and contestation of social identity; and its expressive power in the exposition of narrative and drama."}, {"summer": "True", "name": "Introduction to Music Literature I", "spring": "True", "number": "201", "fall": "True", "units": " Performing Arts, Global Knowledge", "description": "Survey of Western art music from antiquity to end of eighteenth century.  Includes examination of the art of music through discourses of philosophy (aesthetics) and anthropology (ethnomusicology).  Core requirement for music minor. Requires the ability to read music notation."}, {"summer": "True", "name": "Introduction to Music Literature II", "spring": "True", "number": "202", "fall": "True", "units": " Performing Arts, Global Knowledge", "description": "Survey of Western art music from end of eighteenth century through end of twentieth century.  Includes examination of contemporary popular genres and impact of media and technology on music production and consumption.  Core requirement for music minor. REQUIRES ABILITY TO READ MUSIC NOTATION."}, {"summer": false, "name": "Music Theory 2", "prerequisites": "Prerequisite: MUS 103 or Music Theory 1 Placement Test", "spring": true, "number": "203", "fall": false, "units": " 3", "description": "Second course in Music Theory. Musical analysis of representative works. Further study of chordal functions and orchestration technics through written exercises. Compositions, written by students."}, {"summer": false, "name": "Aural Skills 2", "prerequisites": "Prerequisite: MUS 104 or Aural Skills 1 Placement Test", "spring": true, "number": "204", "fall": false, "units": " 1"}, {"summer": "True", "name": "Introduction to Music in Western Society", "spring": "True", "number": "205", "fall": "True", "units": " Performing Arts", "description": "Introduction to the art of music in Western society, for the general student. Focuses on the western art music tradition, including stylistic periods from medieval to post-modern. Begins with the study of basic musical elements, formal principles and compositional techniques."}, {"summer": "True", "name": "America's Music", "spring": "True", "number": "206", "fall": "True", "units": " Performing Arts, U.S. Diversity", "description": "Historical survey of music in the United States, including classical and popular, secular and religious, vocal and instrumental music genres and styles from the 18th to 21st centuries, studied in the context of relevant social and cultural issues."}, {"summer": false, "name": "Class Piano 2", "prerequisites": "Prerequisite: MUS 107", "spring": true, "number": "207", "fall": true, "units": " 1", "description": "Continuation of materials and skills introduced in MUS 107. Development of technical and musical areas through study of solo and ensemble repertoire; practical, theoretical and aural study of keys, scales and chord structures, harmonization and transposition of melodies.  Section 001 for Music Minors and Hons. students only.  Corequisite of MUS 203 and MUS 204 for students in the Music Minor, Performance Concentration.  Section 002 for General Students and Hons. students."}, {"summer": "True", "name": "Introduction to African-American Music", "spring": "True", "number": "230", "fall": "True", "units": " Performing Arts, U.S. Diversity", "description": "Comprehensive survey of African-American music in the United States from Colonial times to the, with emphasis on its unique features and contributions to American culture."}, {"summer": "True", "name": "History of Jazz", "spring": "True", "number": "260", "fall": "True", "units": " Performing Arts, U.S. Diversity", "description": "History of jazz and the contributions of major artists. Emphasis of the various styles that have contributed to this American art form. Investigation of structural forms in the jazz idiom."}, {"summer": false, "name": "Chamber Music Performance", "prerequisites": "Prerequisite: Satisfactorily passing audition", "spring": true, "number": "300", "fall": true, "units": " 1", "description": "Performance of chamber music. Emphasis on chamber literature from the sixteen through the twentieth centuries written for a wide variety of combinations ranging from string quartets to pieces written for specific instruments and voices."}, {"summer": "True", "name": "Music Composition", "prerequisites": "Prerequisite: MUS 103 or MUS 203", "spring": "True", "number": "305", "fall": "True", "units": " Performing Arts", "description": "Study and creation of musical works. Emphasis on writing original music and works imitative of conventional and contemporary musical styles."}, {"summer": "True", "name": "Music Composition with Computers", "prerequisites": "Prerequisite: Some knowledge of music or computer science (e.g. CSC 200)", "spring": "True", "number": "306", "fall": "True", "units": " Performing Arts", "description": "Survey of the theory and history of computer music, compositional algorithms, digital synthesis techniques, composition of at least one computer music work -- a computer-assisted composition for traditional instruments, a piece for computer music ontape, a real-time piece, or a piece that combines tape and instrument(s)."}, {"summer": "True", "name": "Music of the 17th and 18th Centuries", "spring": "True", "number": "310", "fall": "True", "units": " Performing Arts, Global Knowledge", "description": "Evolution of European music from 1600 to 1820, with emphasis on characteristics of Baroque and Classical form and style.  Examination of major composers and representative works in light of social, political and cultural influences."}, {"summer": "True", "name": "Music of 19th Century Europe", "spring": "True", "number": "315", "fall": "True", "units": " Performing Arts, Global Knowledge", "description": "A survey of 19th century European music, including analysis of its texts, forms and composers, and its relations to other art forms of the period."}, {"summer": "True", "name": "Music of the Twentieth Century", "prerequisites": "Prerequisite: One 3-hour MUS class", "spring": "True", "number": "320", "fall": "True", "units": " Performing Arts, Global Knowledge", "description": "Study of Western Art Music from 1900 to present, emphasizing significant composers, repertoire, and compositional procedures and trends, including traditional, atonal, serial, aleatoric, electronic and computer music."}, {"summer": "True", "name": "Music Drama", "spring": "True", "number": "330", "fall": "True", "units": " Performing Arts, Global Knowledge", "description": "Survey of staged musical works spanning four centuries.  Emphasis on large-scale dramatic works in the genres of opera, operetta, and musical theater.  Designed for students with musical and/or theatrical experience."}, {"summer": "True", "name": "World Music I: Music of Asia", "spring": "True", "number": "350", "fall": "True", "units": " Performing Arts, Global Knowledge", "description": "Examination of music from a variety of Asian traditions including India and Pakistan, Japan and Korea, Thailand and Indonesia.  Emphasis place on philosophical, social and religious contexts from which music emerges and in which it is experienced bynative performers and listeners.  No previous formal training in music in required."}, {"summer": "True", "name": "Women In Music", "spring": "True", "number": "360", "fall": "True", "units": " Performing Arts, U.S. Diversity", "description": "The role of women in music as patrons, teachers, composers, and performers, placing them within the social, economic, and political framework to which they belong.  Emphasis on Western Art Music and the role of women in popular music.  No previous formal training in music is required."}, {"summer": false, "name": "Applied Music", "prerequisites": "Prerequisite: Music Minors Only", "spring": true, "number": "390", "fall": true, "units": " 1", "description": "Individual instruction in voice or instrumental performance.  Includes development of technique basic to voice or instrument, as well as advancement of artistry, musicianship, and repertoire."}, {"summer": false, "name": "Recital", "prerequisites": "Prerequisite: 4 Semesters of MUS 390 for Performance Concentration", "spring": true, "number": "493", "fall": true, "units": " 2", "description": "MUS 493: Recital is the capstone for a student in the Music Minor performance concentration. Students receive weekly 45-minute individual instruction culmination in a public recital. Students also receive instruction in organizing the recital."}, {"summer": false, "name": "Special Topics in Music", "spring": true, "number": "495", "fall": true, "units": " 3", "description": "Examination of selected topics in music."}, {"summer": "True", "name": "Independent Study in Music", "spring": "True", "number": "498", "fall": "True", "units": " 1-3", "description": "Directed independent study of selected topics for students with specialized interests in music and/or advanced musical ability. Credit and content determined by faculty member in consultation with Director of Music."}]