[{"summer": "True", "name": "Introduction to Nuclear Engineering", "prerequisites": "Prerequisite: MA 241, PY 205", "spring": "True", "number": "201", "fall": "True", "units": " 2", "description": "An introduction to the concepts, systems and application of nuclear processes. Topics include radioactivity, fission, fusion, reactor concepts, biological effects of radiation, nuclear propulsion, and radioactive waste disposal. Designed to give students a broad perspective of nuclear engineering and an introduction to fundamentals and applications of nuclear energy."}, {"summer": "True", "name": "Radiation Sources, Interaction and Detection", "prerequisites": "Prerequisite: PY 208 and CSC 112", "spring": "True", "number": "202", "fall": "True", "units": " 4", "description": "Introduction to nuclear energy. Topics include radioactivity, radiation detection, interaction of radiation with matter, nuclear reactions, fission, fusion, nuclear reactors, radiation safety and protection, and laboratory measurement of nuclear radiation."}, {"summer": "True", "name": "Nuclear Reactor Operations Training", "spring": "True", "number": "235", "fall": "True", "units": " 2", "description": "Principles of nuclear reactor operations.  Lectures to cover basic nuclear engineering theory pertaining to fission reactor operations; laboratory sessions to provide hands on training with the PULSTAR nuclear reactor including facility pre-startup checks, approach to criticality, steady state operations, and measurement of various operating parameters.  Qualified students may opt to enter training and study for the U.S. Nuclear Regulatory Commission exam to become federally licensed nuclear Reactor Operators. Does not count towards NE graduation requirements"}, {"summer": "True", "name": "Fundamentals of Nuclear Engineering", "prerequisites": "Prerequisite: MA 341,CSC 112, C- or better in NE 202", "spring": "True", "number": "301", "fall": "True", "units": " 4", "description": "Introductory course in nuclear engineering.  Neutron physics, reactor operation, and reactor dynamics.  Basic principles underlying the design and operation of nuclear systems, facilities and applications.  Laboratory sessions include neutron detection and measurement, reactor instrumentation, and reactivity measurements."}, {"summer": "True", "name": "Nuclear Reactor Energy Conversion", "prerequisites": "Prerequisite: MAE 301 and a C- or better in NE 301", "spring": "True", "number": "400", "fall": "True", "units": " 4", "description": "Introduction to the concepts and principles of heat generation and removal in reactor systems.  Power cycles, reactor heat sources, analytic and numerical solutions to conduction problems in reactor components and fuel elements, heat transfer in reactor fuel bundles and heat exchangers.  Problem sets emphasize design principles. Heat transfer lab included.  Credit will not be given for both NE 400 and NE 500."}, {"summer": "True", "name": "Reactor Analysis and Design", "prerequisites": "Prerequisite: C- or better in NE 301, Corequisite: MA 401", "spring": "True", "number": "401", "fall": "True", "units": " 4", "description": "Elements of nuclear reactor theory for reactor core design and operation. Includes one-group neutron transport and multigroup diffusion models, analytical and numerical criticality search, and flux distribution and calculations for homogeneous and heterogeneous reactors, slowing down and thermalization models and transient isotopics.  Laboratory observations and correlation of reactor measurements with theory."}, {"summer": "True", "name": "Reactor Engineering", "prerequisites": "Prerequisite: MAE 308 and either NE 400 or MAE 310", "spring": "True", "number": "402", "fall": "True", "units": " 4", "description": "A course in thermal-hydraulic design and analysis of nuclear systems.  Single and two-phase flow, boiling heat transfer, modeling of fluid systems.  Design constraints imposed by thermal-hydraulic considerations are discussed.  A thermal-hydraulics laboratory included.  Credit will not be given for both NE 402 and NE 502."}, {"summer": "True", "name": "Radiation Safety and Shielding", "prerequisites": "Prerequisite: NE 301 with a grade of C- or better or NE 419", "spring": "True", "number": "404", "fall": "True", "units": " 3", "description": "Radiation safety and environmental aspects of nuclear power generation.  Radiation interaction, photon attenuation, shielding theory and design project, external and internal dose evaluation, reactor effluents and release of radioactivity into the environment, transportation and disposal of radioactive waste; and environmental impact of nuclear power plants."}, {"summer": "True", "name": "Reactor Systems", "prerequisites": "Prerequisite: NE 401, NE 402", "spring": "True", "number": "405", "fall": "True", "units": " 3", "description": "Nuclear power plant systems: design criteria, design parameters, and economics. Topics covered include: PWR, BWR, core design, primary loops, auxiliary and emergency systems; containment, reactor control and protection systems, accident and transient behaviors."}, {"summer": "True", "name": "Nuclear Engineering Senior Design  Preparation", "prerequisites": "Prerequisite: NE 401, Corequisite: NE 402", "spring": "True", "number": "406", "fall": "True", "units": " 1", "description": "Preliminary design phase in nuclear engineering systems to prepare for the final phase design.  Preliminary designs developed by teams with advice of faculty, with reports presented in oral and written form.  Current and future systems emphasized, and use of computers encouraged."}, {"summer": "True", "name": "Nuclear Engineering Design Project", "prerequisites": "Prerequisite: NE 406", "spring": "True", "number": "408", "fall": "True", "units": " 3", "description": "Projects in design of practical nuclear engineering systems.  Preliminary designs developed by teams with advice by faculty as needed, with reports presented in oral and written form.  Current and future systems emphasized, and use of computers encouraged."}, {"summer": "True", "name": "Nuclear Materials", "prerequisites": "Prerequisite: MSE 201", "spring": "True", "number": "409", "fall": "True", "units": " 3", "description": "Students cannot receive credit for both 409 and 509."}, {"summer": "True", "name": "Nuclear Materials", "spring": "True", "number": "409", "fall": "True", "units": " 3", "description": "Students cannot receive credit for both 409 and 509."}, {"summer": "True", "name": "Nuclear Fuel Cycles", "prerequisites": "Prerequisite: NE 401", "spring": "True", "number": "412", "fall": "True", "units": " 3", "description": "Processing of nuclear fuel with descriptions of mining, milling, conversion, enrichment, fabrication, irradiation, reprocessing, and waste disposal. In-core and out-of-core nuclear fuel management design, including objectives, constraints, decisionsand methodologies.  Nuclear power plant and fuel cycle economics."}, {"summer": "True", "name": "Nuclear Power Plant Instrumentation", "prerequisites": "Prerequisite: ECE 221 or ECE 331", "spring": "True", "number": "418", "fall": "True", "units": " 3", "description": "Instrumentation and supporting systems required for control and protection of a nuclear power plant.  Radiation measurement, process measurement, and reactor operating principles used to develop instrumentation requirements and characteristics.  Requirements and implementations of instrumentation, control and protection systems for pressurized and boiling water reactors.  Design and implementation issues include power supplies, signal transmission, redundancy and diversity, response time, and reliability."}, {"summer": "True", "name": "Introduction to Nuclear Energy", "prerequisites": "Prerequisite: PY 202 or PY 208", "spring": "True", "number": "419", "fall": "True", "units": " 3", "description": "Electrical power generation from nuclear fission, fundamental aspects of fission chain reaction, and reactor design. Reactor types, their static and dynamic characteristics and instrumentation. Reactor operation and safety. Nuclear fusion and fusionreactor development.Not open to majors in Nuclear Engineering"}, {"summer": "True", "name": "Special Topics in Nuclear Engineering", "spring": "True", "number": "491", "fall": "True", "units": " 1-4", "description": "Detailed coverage of special topics."}, {"summer": "True", "name": "Nuclear Reactor Energy Conversion", "prerequisites": "Prerequisite: MAE 301", "spring": "True", "number": "500", "fall": "True", "units": " 3", "description": "Introduction to the concepts and principles of heat generation and removal in reactor systems.  Power cycles, reactor heat sources, analytic and numerical solutions to conduction problems in reactor components and fuel elements, heat transfer in reactor fuel bundles and heat exchangers.  Problem sets emphasize design principles.  Credit will not be given for both NE 400 and NE 500."}, {"summer": "True", "name": "Reactor Engineering", "prerequisites": "Prerequisite: MAE 308", "spring": "True", "number": "502", "fall": "True", "units": " 3", "description": "Thermal-hydraulic design and analysis of nuclear systems.  Single and two-phase flow, boiling heat transfer, modeling of fluid systems.  Design constraints imposed by thermal-hydraulic considerations are discussed.  Credit will not be given for bothNE 402 and NE 502."}, {"summer": "True", "name": "Radiation Safety and Shielding", "prerequisites": "Prerequisite: NE 401 or NE 520", "spring": "True", "number": "504", "fall": "True", "units": " 3", "description": "A basic course in radiation safety and environmental aspects of nuclear power generation.  Topics include radiation interaction, photon attenuation, shielding, internal and external dose evaluation, reactor effluents and release of radioactivity into the environment, transportation and disposal of radioactive waste; and environmental impact of nuclear power plants.  Term-long project."}, {"summer": "True", "name": "Reactor Systems", "prerequisites": "Prerequisite: NE 401", "spring": "True", "number": "505", "fall": "True", "units": " 3", "description": "Nuclear power plant systems: PWR, BWR and advanced concepts. Design criteria, design parameters, economics, primary and secondary loops, safety systems, reactor control and protection systems, containment, accident and transient behaviors, core design, and reactivity control mechanisms. Term-long project. Credit for both NE 405 and NE 505 is not allowed"}, {"summer": "True", "name": "Nuclear Materials", "prerequisites": "Prerequisite: MSE 201", "spring": "True", "number": "509", "fall": "True", "units": " 3", "description": "Introduces students to properties and selection of materials for nuclear steam supply systems and to radiation effects on materials. Implications of radiation damage to reactor materials and materials problems in nuclear engineering are discussed. Topics include an overview of nuclear steam supply systems, crystal structure and defects, dislocation theory, mechanical properties, radiation damage, hardening and embrittlement due to radiation exposure and problems concerned with fission and fusion materials. Students cannot receive credit for both 409 and 509."}, {"summer": "True", "name": "Nuclear Materials", "spring": "True", "number": "509", "fall": "True", "units": " 3", "description": "Students cannot receive credit for both 409 and 509."}, {"summer": "True", "name": "Nuclear Fuel Cycles", "prerequisites": "Prerequisite: NE 401", "spring": "True", "number": "512", "fall": "True", "units": " 3", "description": "Processing of nuclear fuel with description of mining, milling, conversion, enrichment, fabrication, irradiation, shipping, reprocessing and waste disposal. Fuel cycle economics and fuel cost calculation. In-core and out-of-core nuclear fuel management, engineering concepts and methodology. Term-long project. Credit for both NE 412 and NE 512 is not allowed"}, {"summer": "True", "name": "Radiation and Reactor Fundamentals", "prerequisites": "Prerequisite: MA 341 and PY 208", "spring": "True", "number": "520", "fall": "True", "units": " 3", "description": "Basics of nuclear physics and reactor physics that are needed for graduate studies in nuclear engineering.  Concepts covered include, atomic and nuclear models, nuclear reactions, nuclear fission, radioactive decay, neutron interactions, nuclear reactors, neutron diffusion in non-multiplying and multiplying systems, and basic nuclear reactor kinetics."}, {"summer": "True", "name": "Introduction to Plasma Physics and Fusion Energy", "prerequisites": "Prerequisite: MA 401 and PY 208", "spring": "True", "number": "528", "fall": "True", "units": " 3", "description": "Concepts in plasma physics, basics of thermonuclear reactions; charged particle collisions, single particle motions and drifts, radiation from plasmas and plasma waves, fluid theory of plasmas, formation and heating of plasmas, plasma confinement, fusion devices and other plasma applications."}, {"summer": "True", "name": "Nuclear Waste Management", "prerequisites": "Prerequisite: MA 341", "spring": "True", "number": "531", "fall": "True", "units": " 3", "description": "Scientific and engineering aspects of nuclear waste management.  Management of spent fuel, high-level waste, uranium mill tailings, low-level waster and decommissioning wastes.  Fundamental proesses and governing equations for the evaluation of waste management systems with emphais on the safey assessment of waste disposal facilities.  Regulations and policy issues."}, {"summer": "True", "name": "Special Topics In Nuclear Engineering I", "spring": "True", "number": "591", "fall": "True", "units": " 3", "description": "Credits Arranged"}, {"summer": "True", "name": "Special Topics In Nuclear Engineering II", "spring": "True", "number": "592", "fall": "True", "units": " 3", "description": "Credits Arranged"}, {"summer": "True", "name": "Seminar", "spring": "True", "number": "601", "fall": "True", "units": " 1", "description": "Discussion of selected topics in nuclear engineering."}, {"summer": "True", "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "685", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "688", "fall": "True", "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": "True", "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "689", "fall": "True", "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": "True", "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "690", "fall": "True", "units": " 1-6", "description": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam."}, {"summer": "True", "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "693", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "695", "fall": "True", "units": " 1-9", "description": "Thesis research."}, {"summer": "True", "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "696", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "699", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their theses."}, {"summer": "True", "name": "Nuclear Laboratory Fundamentals", "prerequisites": "Prerequisite: MA 401 and NE 401", "spring": "True", "number": "721", "fall": "True", "units": " 3", "description": "Labratory experiments and techniques that are useful and instructive to a Nuclear Engineer.  The labs include experiments on radiation detectors and detection techniques, Gamma-and X-ray spectroscopy, and use of the thermal neutron beam of the nuclear reactor for neutron imaging.  All state-of-the art radiation detectors are taught and used.  Restricted to Nuclear Engineering Graduate Students."}, {"summer": "True", "name": "Reactor Dynamics and Control", "prerequisites": "Prerequisite: NE 401 or NE 520", "spring": "True", "number": "722", "fall": "True", "units": " 3", "description": "Methods of describing and analyzing dynamic behavior of systems.  These methods applied to reactor systems and the effects of feedbacks studies.  Methods of measuring the behavior of reactor systems and development of logic systems for control and safety."}, {"summer": "True", "name": "Reactor Analysis", "prerequisites": "Prerequisite: NE 401 or NE 520", "spring": "True", "number": "723", "fall": "True", "units": " 3", "description": "Basic models of neutron motion and methods of calculating neutron flux distributions in nuclear reactors.  Emphasis on multigroup diffusion theory.  Criticality search, neutron slowing down models, resonance absorption, thermalization and heterogeneous cell calculations.  Objective is to enable students to read literature and perform relevant analysis in reactor physics."}, {"summer": "True", "name": "Reactor Heat Transfer", "prerequisites": "Prerequisite: NE 402 and NE 401 or NE 520", "spring": "True", "number": "724", "fall": "True", "units": " 3", "description": "Consideration of heat generation and transfer in nuclear power reactors.  Topics include reactor heat generation, steady-state and transient heat combustion in reactor fuel elements, boiling heat transfer and single and two-phase flow."}, {"summer": "True", "name": "Radioisotopes Measurement Applications", "prerequisites": "Prerequisite: NE 401 or NE 520", "spring": "True", "number": "726", "fall": "True", "units": " 3", "description": "Introduction the student to measurement applications using radioisotopes and radiation.  Discussion of all major tracing, gauging and analyzer principles and treatment of several specific applications in detail.  Objective is to familiarize student with design and analysis of industrial measurement systems using radioisotopes and/or radiation."}, {"summer": "True", "name": "Nuclear Engineering Analysis", "prerequisites": "Prerequisite: NE 401 or NE 520", "spring": "True", "number": "727", "fall": "True", "units": " 3", "description": "Fundamental material on: (1) numerical methods for solving the partial differential equations pertinent to nuclear engineering problems, (2) Monte Carlo simulation of radiation transport and (3) data and error analysis techniques including estimation of linear and nonlinear model parameters from experimental data."}, {"summer": "True", "name": "Reactor Theory and Analysis", "prerequisites": "Prerequisite: NE 723, NE 727", "spring": "True", "number": "729", "fall": "True", "units": " 3", "description": "Theoretical aspects of neutron diffusion and transport related to the design computation and performance analysis of nuclear reactors.  Principal topics: a unified view of the neutron cycle including slowing down, resonance capture and thermalization; reactor dynamics and control; fuel cycle studies; and neutron transport methods.  Background provided for research in power and test reactor analysis."}, {"summer": "True", "name": "Radiological Assessment", "prerequisites": "Prerequisite: NE 404 or NE 504", "spring": "True", "number": "730", "fall": "True", "units": " 3", "description": "Principles of analyzing environmental radiation transport and resulting human exposure and dose and dose management.  Sources term of radiation exposure, the radon problem, transport or radionuclides in the atmosphere, surface water, and groundwater, pathways modeling, radiation dosimetry, probabilistic models for environmental assessment, uncertainty analysis, and radiation risk management.  A package of computer codes is developed as a class project."}, {"summer": "True", "name": "Principles of Industrial Plasmas", "prerequisites": "Prerequisite: NE/PY 528", "spring": "True", "number": "732", "fall": "True", "units": " 3", "description": "Theory and fundamental physical principles of industrial plasmas.  Applications in plasma processing, plasma manufacturing technology, arcs and torches, plasma sprayers, high-voltage high-current switching devices, plasma-driven devices and plasma-aided technology.  Emphasis on particle transport and plasma flow."}, {"summer": "True", "name": "Laboratory Projects In Nuclear Engineering", "prerequisites": "Prerequisite: NE 721", "spring": "True", "number": "740", "fall": "True", "units": " 3", "description": "Enhancement of laboratory skills pertinent to nuclear engineering research through projects that requiring student to design the experiment, assemble equipment, carry out the measurements and analyze and interpret data. Students work in groups of two and perform to completion two laboratory projects."}, {"summer": "True", "name": "Plasma Laboratory", "prerequisites": "Prerequisite: NE 528 or PY 508 or PY 509", "spring": "True", "number": "745", "fall": "True", "units": " 3", "description": "Experimental plasma generation and plasma diagnostic techniques.  Lecture topics include high vacuum techniques, perturbing and non-perturbing probe techniques, and laser and emission spectroscopy.  Laboratories utilize various methods of measuring plasma parameters discussed in lectures."}, {"summer": "True", "name": "Fusion Energy Engineering", "prerequisites": "Prerequisite: NE 528", "spring": "True", "number": "746", "fall": "True", "units": " 3", "description": "Description and analysis of the technologies of devices necessary to produce fusion energy including vacuum technology, plasma heating and fueling, magnetics, special energy conversion, neutronics, materials, environment and safety. Stress upon design integration and ensuing technological constraints."}, {"summer": "True", "name": "Nuclear Reactor Design Calculations", "prerequisites": "Prerequisite: NE 723", "spring": "True", "number": "751", "fall": "True", "units": " 3", "description": "Application of digital computer to problems in reactor core nuclear design. Study and exercise of available reactor core physics computer modules. Description of systems and programs used by industry for power reactor core design and core follow. A review of relevant analytic and numerical methods facilitates computer program development by students."}, {"summer": "True", "name": "Thermal Hydraulic Design Calculations", "prerequisites": "Prerequisite: NE 724", "spring": "True", "number": "752", "fall": "True", "units": " 3", "description": "Advanced presentation of thermal-hydraulic analysis of nuclear power systems. Topics including development of single phase and two-phase fluid flow equations, subchannel analysis, interphase phenomena and numerical solution methods relevant to design and safety analysis codes."}, {"summer": "True", "name": "Reactor Kinetics and Control", "prerequisites": "Prerequisite: NE 722", "spring": "True", "number": "753", "fall": "True", "units": " 3", "description": "The control of nuclear reactor systems.  Development of basic control theory including the use of Bode, Nyquist and S-plane diagrams and state-variable methods. Analysis of reactor and reactor systems by these methods and development of control methods and optimum-control methods.  Discussion of models of reactors and reactor-associated units, such as heat exchangers. Presentation of effects of nonlinearities."}, {"summer": "True", "name": "Reactor Theory and Analysis", "prerequisites": "Prerequisite: NE 723, NE 727", "spring": "True", "number": "755", "fall": "True", "units": " 3", "description": "Theoretical aspects of neutron diffusion and transport related to the design computation and performance analysis of nuclear reactors. Principal topics: a unified view of the neutron cycle including slowing down, resonance capture and thermalization; reactor dynamics and control; fuel cycle studies; and neutron transport methods. Background provided for research in power and test reactor analysis."}, {"summer": "True", "name": "Radiation Effects On Materials", "spring": "True", "number": "757", "fall": "True", "units": " 3", "description": "Interaction of radiation with matter with emphasis on microstructural modification, physical and mechanical effects.  Defects generation and annealing, void swelling, irradiation growth and creep, and irradiation induced effects in reactor materialsare discussed.  Current theories and experimental techniques are discussed."}, {"summer": "True", "name": "Radiation Detection", "prerequisites": "Prerequisite: NE 726", "spring": "True", "number": "761", "fall": "True", "units": " 3", "description": "Advanced aspects of radiation detection such as computer methods applied to gamma-ray spectroscopy, absolute detector efficiencies by experimental and Monte Carlo techniques, the use and theory of solid state detectors, time-of-flight detection experiments and M?ssbauer and other resonance phenomena."}, {"summer": "True", "name": "Radioisotope Applications", "prerequisites": "Prerequisite: NE 726", "spring": "True", "number": "762", "fall": "True", "units": " 3", "description": "Presentation of advanced principles and techniques of radioisotope applications. Topics include radiotracer principles; radiotracer applications to engineering processes; radioisotope gauging principles; charged particle, gamma ray and neutron radioisotope gauges."}, {"summer": "True", "name": "Nuclear Radiation Attenuation", "prerequisites": "Prerequisite: NE 727", "spring": "True", "number": "770", "fall": "True", "units": " 3", "description": "Physical theory and mathematical analysis of the penetration of neutrons, gamma-rays and charged particles. Analytical techniques including point kernels, transport theory, Monte Carlo and numerical methods. Digital computers employed in the solution of practical problems."}, {"summer": "True", "name": "Environmental Exposure and Risk Analysis", "prerequisites": "Prerequisite: ST 511 or ST 515", "spring": "True", "number": "772", "fall": "True", "units": " 3", "description": "Course covers the identification, transport, and fate of hazardious substances in the environment; quantification of human exposures to such substances; dose-response analysis; and uncertainty and variability analysis.  The general risk assessment framework, study design aspects for exposure assessment, and quantitative methods for estimating the consequences and probablity of adverse health outcomes are emphasized."}, {"summer": "True", "name": " Transport in Plasmas", "prerequisites": "Prerequisite: NE 528, NE/PY 414 and 415", "spring": "True", "number": "780", "fall": "True", "units": " 3", "description": "Advanced fluid description of plasmas for magnetic fusion, space and industrial plasmas, and other applications.  Emphasis on a first principles approach to transport, equilibria, and stability."}, {"summer": "True", "name": " Non-Linear Effects in Plasmas", "prerequisites": "Prerequisite: NE 528, NE/PY 414 and 415, Corequisite: MA 775", "spring": "True", "number": "781", "fall": "True", "units": " 3", "description": "Kinetic theory, waves, and non-linear phenomena in magnetized plasmas.  First principles approach to the treatment of instabilities and other collective effects."}, {"summer": "True", "name": "Advanced Topics In Nuclear Engineering I", "spring": "True", "number": "795", "fall": "True", "units": " 1-3", "description": "A study of recent developments in nuclear engineering theory and practice."}, {"summer": "True", "name": "Advanced Topics In Nuclear Engineering II", "spring": "True", "number": "796", "fall": "True", "units": " 3", "description": "A study of recent developments in nuclear engineering theory and practice."}, {"summer": "True", "name": "Seminar", "spring": "True", "number": "801", "fall": "True", "units": " 1", "description": "Discussion of selected topics in nuclear engineering."}, {"summer": "True", "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "885", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "890", "fall": "True", "units": " 1-9", "description": "For students who are preparing for and taking written and/or oral preliminary exams."}, {"summer": "True", "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "893", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "895", "fall": "True", "units": " 1-9", "description": "Dissertation research."}, {"summer": "True", "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "896", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "899", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hour, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations."}]