[{"summer": false, "name": "Naval Science Lab", "spring": true, "number": "100", "fall": true, "units": " 0", "description": "Military drill, courtesies and honors, elements of unit leadership, physical fitness and professional development of the prospective Naval/Marine Corps Officer. Required for all Naval ROTC students."}, {"summer": false, "name": "Introduction to Naval Science", "spring": false, "number": "110", "fall": true, "units": " 2", "description": "Fundamental orientation to the Naval Service emphasizing the mission, organization, regulations, customs and traditions, broad warfare components of Navy and the major challenges facing today's Navy and Marine Officers."}, {"summer": false, "name": "Leadership and Management", "spring": false, "number": "210", "fall": true, "units": " 3", "description": "Assists students in acquiring knowledge and developing the cognitive processes necessary to make decisions in the practice of management.  The student will learn the traditional foundations of management while developing decision skills to apply this knowledge in a real-world setting.  The major focus is centered upon global management, ethics and social responsibility, total quality management, and cultural diversity."}, {"summer": false, "name": "Navigation", "spring": true, "number": "225", "fall": false, "units": " 4", "description": "A broad yet thorough education in basic ship navigation.  Course includes a study of various navigation methods, weather, the laws of the sea, and navigational rules.  Practical work includes chart plotting and understanding relative motion."}, {"summer": false, "name": "Naval Engineering", "spring": false, "number": "315", "fall": true, "units": " 3", "description": "Introduction to the application of engineering principles in the research, development, design, construction, and operation of ships, weapons systems, and ocean structures, with emphasis on thermodynamic processes and energy conversions."}, {"summer": false, "name": "Naval Weapons Systems", "spring": true, "number": "325", "fall": false, "units": " 3", "description": "An introduction to the concepts and properties of electronic, physical, electromagnetic and mechanical systems to foster an understanding of the theory and principles of operation of shipboard weapons systems, course emphasizes types of weapons and fire control systems, capabilities and limitations, theory of target acquisition, identification and tracking, trajectory and ballistics principles, and basic theory of radar and sonar."}, {"summer": false, "name": "Evolution of Warfare", "spring": true, "number": "330", "fall": false, "units": " 3", "description": "A survey of the evolution of warfare through the study of selected campaigns and classic battles with special emphasis on the principles of war, the military impact of leadership, and the evolution of tactics, weapons, and weaponry."}, {"summer": false, "name": "Naval Operations", "prerequisites": "Prerequisite: NS 225 Navigation", "spring": false, "number": "415", "fall": true, "units": " 4", "description": " control, communication, and an introduction to naval warfare doctrine.  Practical applications include the determination of advanced maneuvering methods through and in-depth understanding of relative motion."}, {"summer": false, "name": "Naval Leadership and Ethics", "prerequisites": "Prerequisite: Senior standing", "spring": true, "number": "420", "fall": false, "units": " 3", "description": "An intellectual exploration of Western moral traditions and ethical philosophy with a variety of topics, such as military leadership, core values, and professional ethics; the Uniform Code of Military Justice and Navy Regulations; and discussions relating to the roles of enlisted members, junior and senior officers, command relationships, and the conduct of warfare.  The course provides students with a foundation of moral traditions, combined with a discussion of actual current and historical events in the United States navy and Marine Corps, to prepare them for the role and responsibilities of leadership in the naval service of the 21st century."}, {"summer": false, "name": "Amphibious Warfare", "spring": true, "number": "430", "fall": false, "units": " 3", "description": "A survey of the projection of sea power ashore with special emphasis on the evolution of and innovation in amphibious warfare in the 20th Century through the study of historical amphibious landings and campaigns."}]