[{"summer": true, "name": "Introduction to Human Nutrition", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "301", "fall": true, "units": " 3", "description": "Functions, dietary sources and deficiencies of essential nutrients in humans; a balanced diet; role of nutrients in heart disease, cancer, hypertension, osteoporosis; weight control and eating disorders; vegetarianism; food safety; dietary supplements; government regulation of food supply; food quackery. Food science majors may use as a free elective only"}, {"summer": true, "name": "Nutrition Seminar", "prerequisites": "P: Sophomore Standing", "spring": true, "number": "390", "fall": true, "units": " 1", "description": "Location of recent literature in the library and discussion of current topics in nutrition.  Guest lectures on career opportunities and jobs available in the fields of human and animal nutrition.  Use of computer databases to conduct a literature search on the chosen topic.  Preparation and presentation of a final oral report, including an abstract and effective visual aids."}, {"summer": true, "name": "Advanced Nutrition and Metabolism", "prerequisites": "Prerequisite: (NTR 301 or NTR 415) and (CH 221 or CH 220)", "spring": false, "number": "401", "fall": true, "units": " 3", "description": "Credit will not be awarded for both NTR (FS) 401 and NTR (FS) 501."}, {"summer": false, "name": "Comparative Nutrition", "prerequisites": "Prerequisite: ANS 225 or ANS 230 or CH 220 or CH 223", "spring": false, "number": "415", "fall": true, "units": " 3", "description": "Principles of nutrition, including the classification of nutrients and the nutrient requirements of and metabolism by different species for health, growth, maintenance and productive functions."}, {"summer": false, "name": "Human Nutrition and Chronic Disease", "prerequisites": "Prerequisite: Junior standing, ANS 230, or ANS/FS/NTR 301 or ANS/NTR/PO 415", "spring": true, "number": "419", "fall": false, "units": " 3", "description": "Current concepts regarding, and physiological bases of the roles of nutrition in the prevention and treatment of acute and chronic disease states in humans with emphasis on the process of scientific discovery, reading of original research and transformation of research findings to public policy."}, {"summer": false, "name": "Community Nutrition", "prerequisites": "Prerequisite: NTR 301 and junior standing required", "spring": false, "number": "420", "fall": true, "units": " 4", "description": "This course exposes students to nutrition-related community programs, agencies, and activities. Through service-learning experiences, students will apply course material to teach nutrition in the community. Course topics will also cover behavior change models, educational pedagogies, and nutrition among diverse populations. Students are expected to provide their own transportation for the community service in the greater Raleigh area. Instructor consent required; Credit will not be given for both NTR 420 and NTR 520."}, {"summer": false, "name": "Life Cycle Nutrition", "prerequisites": "Prerequisite: NTR 301 and junior standing required", "spring": true, "number": "421", "fall": false, "units": " 3", "description": "This course focuses on the physiologic changes and nutritional needs throughout the life cycle.  Additionally, students will explore psychosocial and environmental influencers on food consumption and diet quality at each stage of life.  Pregnancy and lactation, fetal development, infancy, early childhood, childhood, adolescence, young and middle adulthood, and geriatrics will be examined.  Student will apply course content to real-world settings through individual and/or group service-learning projects.  Credit will not be given for both NTR 421 and NTR 521."}, {"summer": false, "name": "Lactation, Milk and Nutrition", "prerequisites": "Prerequisite: ANS 230 or FS/NTR 400; BCH 451 or ZO 421", "spring": true, "number": "454", "fall": false, "units": " 3", "description": "Nutritional properties of milk as a high-quality food with nutritional diversity.  Principles of physiology, biochemistry and cell biology in the mammary gland.  Procedures of milk production and milk collection for milk quality and nutrition.  Human lactation vs. that of domestic animals.  Impacts of biotechnology and food safety on dairy production. Credit will not be given for both ANS 454 and 554."}, {"summer": false, "name": "Experience in Teaching, Research, or Service in Nutrition", "prerequisites": "Prerequisite: Nutrition Science majors only; Senior status required", "spring": true, "number": "490", "fall": true, "units": " 3", "description": "This capstone course provides students with a supervised professional experience that involves both 90 hours of responsible participation in a teaching, research, or service setting and reflection on that experience through writing.  Students must complete a plan-of-study contract to be signed by the course instructor and the student-identified preceptor prior to registration."}, {"summer": false, "name": "External Learning Experience", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "492", "fall": true, "units": " 1-6", "description": "A learning experience in agriculture and life sciences within an academic framework that utilizes facilities and resources which are external to the campus. Contact and arrangements with prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior to the experience"}, {"summer": false, "name": "Special Problems in Nutrition", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "493", "fall": true, "units": " 1-6", "description": "A learning experience in agriculture and life sciences within an academic framework that utilizes campus facilities and resources. Contact and arrangements with prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior to the experience."}, {"summer": true, "name": "Special Topics in Nutrition", "spring": true, "number": "495", "fall": true, "units": " 1-3", "description": "Offered as needed to present materials not normally available in regular course offerings or for offering of new courses on a trial basis."}, {"summer": true, "name": "Principles of Human Nutrition", "prerequisites": "Prerequisite: CH 220, CH 221; ZO 160 or BIO 181/183", "spring": true, "number": "500", "fall": true, "units": " 3", "description": "Overview of fields of Nutritional Sciences; functions of nutrients in the human body; sources and properties of nutrients; relationships of food industry practices to nutrition. Credit will not be given for both NTR (FS)400 and NTR 500"}, {"summer": false, "name": "Advanced Nutrition and Metabolism", "spring": false, "number": "501", "fall": true, "units": " 3", "description": "Nutritional biochemistry and physiology as it relates to establishment of nutrient requirements and Dietary Reference intakes.  Digestion, absorption, metabolism, storage, and excretion of nutrients and other markers of nutritional adequacy or excess with emphasis on micronutrients.   Functions of nutrients, in bone, muscle, blood, growth and development, and communication.  Credit will not be awarded for both NTR(FS) 401 and NTR(FS) 501."}, {"summer": false, "name": "Food Lipids: Issues and Controversies", "prerequisites": "Prerequisite: BCH 451 and FS 402 and NTR 400/500, or equivalent", "spring": true, "number": "510", "fall": false, "units": " 3", "description": "Chemical, physical and functional properties of lipids or fats.  Effects of processing technologies on composition, stability and functional properties of lipids in food systems.  Biological and nutritional properties of different classes of lipids. Topical discussions of the role of lipids and lipid-soluble components as biological response modifiers in human and invitro model systems.  Credit will not be given for both NTR/FS 510 and NTR/FS 710."}, {"summer": true, "name": "Advanced Comparative Nutrition", "spring": true, "number": "515", "fall": true, "units": " 3", "description": "An in-depth presentation of core nutrition principles stressing the role nutrient availability plays in digestive and metabolic adaptations of a variety of animal species.  Consideration will be given to translational biomedical nutrition issues that apply to both human and animal health.  Students are expected to develop a term paper suitable for submission in a peer-reviewed scientific journal that reviews the latest information in metabolic or digestive adaptations of a specific species as related to nutritional processes. Credit will not be allowed for both ANS/NTR/PO 415 comparative Nutrition and NTR/PO 515 Advanced Comparative Nutrition."}, {"summer": false, "name": "Community Nutrition", "prerequisites": "Prerequisite: NTR 301 and junior standing required", "spring": false, "number": "520", "fall": true, "units": " 4", "description": "This course exposes students to nutrition-related community programs, agencies, and activities. Through service-learning experiences, students will apply course material to complete a needs assessment for a target audience, design and implement a program, and evaluate the program's effectiveness. Course topics will also cover behavior change models, educational pedagogies, and nutrition among diverse populations. Twenty hours of service is required. Students are expected to provide their own transportation for the community service in the greater Raleigh area. Instructor consent required; Credit will not be awarded for both NTR 420 and NTR 520."}, {"summer": false, "name": "Life Cycle Nutrition", "prerequisites": "Prerequisite: NTR 301 or other introductory human nutrition course", "spring": true, "number": "521", "fall": false, "units": " 3", "description": "This course focuses on the physiological changes and nutritional needs throughout the life cycle. Additionally, students will explore psychological and environmental influencers on flood consumption and diet quality at each stage of life. Pregnancy and lactation, fetal development, infancy, early childhood, childhood, adolescence, young and middle adulthood, and geriatrics will be examined. Students will apply course content to real-world settings through individual and/or group service-learning projects."}, {"summer": false, "name": "Advanced Feed Science and Technology", "prerequisites": "Prerequisite: PO/ANS/NTR 415 or ANS 230 or related feed industry experience", "spring": true, "number": "525", "fall": false, "units": " 3", "description": "Feed mill management, equipment, maintenance, operation, safety, and regulations pertaining to feed manufacturing. Feed ingredient purchasing, inventory, storage, quality evaluation, and computerized feed formulation. Advanced NTR525 topics include more detailed aspects of feed science and technology, feed mill design and process flow, operations management, feed quality assurance, regulations, and computer applications. The Distance Education section will have independent study assignments in place of lab experience. Credit will not be given for both PO/ANS 425 and NTR 525."}, {"summer": false, "name": "Applied Ruminant Nutrition", "prerequisites": "Prerequisite: ANS 230 or ANS(NTR,PO) 415", "spring": false, "number": "550", "fall": true, "units": " 3", "description": "Applied concepts in ruminant nutrition for the practicing agricultural professional.  Protein, energy, vitamin and mineral nutrition in relation to the nutritional needs and practical feeding of beef cattle, dairy cattle, sheep, and goats.  New developments in feeding systems, feed additives and the prevention and treatment of metabolic disorders.  Emphasis on solving problems in case studies. Permission given to undergraduates"}, {"summer": false, "name": "Lactation, Milk, and Nutrition", "prerequisites": "Prerequisite: ANS 230 or FS/NTR 400; BCH 451 or ZO 421", "spring": true, "number": "554", "fall": false, "units": " 3", "description": "Nutritional properties of milk as a high-quality food with nutritional diversity.  Principles of physiology, biochemistry and cell biology in the mammary gland.  Procedures of milk production and milk collection for milk quality and nutrition.  Human lactation vs. that of domestic animals.  Impacts of biotechnology and food safety on dairy production. Credit will not be given for both ANS 454 and 554."}, {"summer": false, "name": "Exercise Nutrition", "prerequisites": "Prerequisite: NTR 400/500", "spring": true, "number": "555", "fall": false, "units": " 3", "description": "Metabolism of macro- and micronutrients as affected by exercise and physical activity. Effects of dietary patterns, specific foods, dietary supplements and ergogenic aids on sports performance. Reading and discussion of current literature and individual or group projects."}, {"summer": false, "name": "Nutraceuticals and Functional Fooods", "spring": false, "number": "557", "fall": true, "units": " 3", "description": "This course evaluates the weight of evidence from peer-reviewed scientific literature relating food bioactives, whole foods, and diets to disease prevention, athletic performance, and cognitive development/enhancement.  Data are viewed in the context of processing effects, global food and supplement regulations, as well as commercial marketing claims.  Key concepts include dose-response, signal transduction, and the use of advanced technologies such as genomics, proteomics and metabolomics.  Students will work in teams to develop and write a critical review manuscript suitable for publication."}, {"summer": false, "name": "Equine Nutrition", "prerequisites": "Prerequisite:ANS 230 or ANS 225 or ANS (NTR,PO) 415 or PO/NTR 515", "spring": true, "number": "561", "fall": false, "units": " 3", "description": "This course explores concepts in equine nutrition including digestive physiology of horses, nutrient requirements for different classes of horses and feed management.  Ration evaluation and balancing, as well as problem solving will be a core component to this course."}, {"summer": true, "name": "Special Topics in Nutrition", "spring": true, "number": "594", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Master's Seminar", "spring": true, "number": "601", "fall": true, "units": " 1"}, {"summer": false, "name": "Topical Problems In Nutrition", "prerequisites": "Prerequisite: Graduate standing or Senior standing", "spring": true, "number": "624", "fall": true, "units": " 1-6", "description": "Analysis of current problems in nutrition. Also entails the scientific appraisal and solution of a selected problem designed to provide training and experience in research."}, {"summer": false, "name": "Advanced Special Problems In Nutrition", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "625", "fall": true, "units": " 1-6", "description": "Directed research in a specialized phase of nutrition designed to provide experience in research methodology and philosophy."}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "685", "fall": true, "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "688", "fall": true, "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "689", "fall": true, "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": false, "name": "Advanced Special Problems In Nutrition", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "690", "fall": true, "units": " 1-6", "description": "Directed research in a specialized phase of nutrition designed to provide experience in research methodology and philosophy."}, {"summer": true, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "693", "fall": true, "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": true, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "695", "fall": true, "units": " 1-9", "description": "Thesis research"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "696", "fall": false, "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": false, "name": "Research In Nutrition", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "699", "fall": true, "units": " 1-3", "description": "Original research preparatory to the thesis for Master of Science or Doctor of Philosophy degree."}, {"summer": false, "name": "Protein and Amino Acid Metabolism", "prerequisites": "Prerequisite: BCH 453, ZO 421, a 400-level nutrition course", "spring": true, "number": "701", "fall": false, "units": " 3", "description": "Study of protein and amino acid metabolism, regulation, dietary requirements and techniques for their investigation in human and other animals."}, {"summer": false, "name": "Vitamin Metabolism", "prerequisites": "Prerequisite: ANS(NTR,PO) 415 and BCH 453", "spring": false, "number": "706", "fall": true, "units": " 2", "description": "Structures, chemical and physical properties, functions, deficiency symptoms, distribution, absorption, transport, metabolism, storage, excretion and toxicity of vitamins in humans and domestic animals. Nutritional significance of essential fatty acids and metabolism of prostaglandins, prostacyclins and leucotrienes."}, {"summer": false, "name": "Energy Metabolism", "prerequisites": "Prerequisite: BCH 453 and an introductory NTR course", "spring": false, "number": "708", "fall": true, "units": " 3", "description": "Relationship of biochemical and physiological events within the cell, tissue, organ and system with the nutrient needs as sources of energy for productive animal life. Digestion, absorption and metabolism of energy sources. Presentation of processesof energy transformations within living structures in relation to energetics, biological oxidations, coupled reactions, anabolic and catabolic systems, metabolic control, partitioning and efficiency."}, {"summer": false, "name": "Human Nutrition", "prerequisites": "Prerequisite: FS 400 or NTR 415 or 419; BCH 451", "spring": true, "number": "730", "fall": false, "units": " 3", "description": "Biochemical and physiological bases of nutrition. Human nutrient requirements, assessment of nutritional status, clinical and subclinical disorders resulting from nutrient deficiencies or inadequacies."}, {"summer": false, "name": "Advances in Gastrointestinal Pathophysiology", "prerequisites": "Prerequisite: PHY 503, PHY 504", "spring": false, "number": "764", "fall": true, "units": " 3", "description": "This course will focus on advanced gastrointestinal physiology and the pathophysiology of deseases of relevance to scientsts involved in animal-related research.  In particular, the course will cover the pathophysiology of ulceration, infectious diarrhea, ischemia, motility disorders, and inflammatory diseases of the gut.  An in-depth review paper will be required based on recent literature rgarding a specific gastrointestinal disease."}, {"summer": false, "name": "Mineral Metabolism", "prerequisites": "Prerequisite: ANS(NTR,PO) 415, BCH 451 and ZO 421", "spring": false, "number": "775", "fall": true, "units": " 3", "description": "Requirements, function, distribution, absorption, excretion and toxicity of minerals in humans and domestic animals. Interactions between minerals and other factors affecting mineral metabolism or availability. Emphasis on mechanisms associated withmineral functions and the metabolic bases for the development of signs of deficiency."}, {"summer": false, "name": "Digestion and Metabolism in Ruminants", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "785", "fall": false, "units": " 3", "description": "Advanced concepts in ruminant digestion and metabolism, with emphasis on bovine, ovine, and caprine species.  Major topics include voluntary intake, ruminal fermentation, mechanisms and rates of digestion, absorption and passage of dietary components, and postabsorptive metabolism of carbohydrates, lipds, and proteins.  New developments in feeding systems, feed additives and the prevention and treatment of metabolic disorders."}, {"summer": false, "name": "Advanced Feed Formulation", "prerequisites": "Prerequisite: NTR(FM) 525", "spring": false, "number": "790", "fall": true, "units": " 3", "description": "Principles of feed and ingredient quality assurance and how to develop a comprehensive quality assurance program. The course will include the development of an approved supplier list, ingredient specifications, feed manufacturing quality assurance procedures, and risk based feed safety programs."}, {"summer": true, "name": "Special Topics in Nutrition", "spring": true, "number": "794", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Doctoral Seminar", "spring": true, "number": "801", "fall": true, "units": " 1"}, {"summer": false, "name": "Topical Problems In Nutrition", "prerequisites": "Prerequisite: Graduate standing or Senior standing", "spring": true, "number": "824", "fall": true, "units": " 1-6", "description": "Analysis of current problems in nutrition. Also entails the scientific appraisal and solution of a selected problem designed to provide training and experience in research."}, {"summer": false, "name": "Advanced Special Problems In Nutrition", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "825", "fall": true, "units": " 1-6", "description": "Directed research in a specialized phase of nutrition designed to provide experience in research methodology and philosophy."}, {"summer": true, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "885", "fall": true, "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": true, "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "890", "fall": true, "units": " 1-9", "description": "For students who are preparing for and taking written and/or oral preliminary exams."}, {"summer": true, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "893", "fall": true, "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": true, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "895", "fall": true, "units": " 1-9", "description": "Dissertation research."}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "896", "fall": false, "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": true, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "899", "fall": true, "units": " 1-3", "description": "For students who have completed all credit hour, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations."}]