[{"summer": false, "name": "Materials, Polymers, and Fibers used in Nonwovens", "prerequisites": "Prerequisite: MA 141, PY 205, PCC 203", "spring": false, "number": "503", "fall": true, "units": " 3", "description": "Fundamentals of raw material used in nonwoven processes.  Raw material production, chemical and physical properties of nonwoven raw materials and assessment of material properties.  Introduction of structure/property relationships for these materials and how these relationships influence end use applications."}, {"summer": true, "name": "Introduction to Nonwovens Processes and Products", "prerequisites": "Prerequisite: MA 141; PY 205, Corequisite: TT503", "spring": false, "number": "504", "fall": true, "units": " 3", "description": "Fiber web/nonwoven fabrics produced directly from fibers or their precursors.  Physical and chemical nature of local bonding and fiber entanglement.  Viable process for producing these fabrics.  Economic justification for process and production.  Product/process interaction.  Plant visits whenever possible."}, {"summer": false, "name": "Advanced Nonwovens Processing", "prerequisites": "Prerequisite: TT/NW503, TT/NW504", "spring": true, "number": "505", "fall": false, "units": " 3", "description": "An in-depth understanding of the mechanisms and processes used in the production of nonwoven materials. Design and operation of these mechanisms and processes. Process flow, optimization of process parameters, influence of process parameters on product properties."}, {"summer": true, "name": "Bonding Principles in Nonwovens", "prerequisites": "Prerequisite: MAE 308, MAE 310, TT /NW505", "spring": false, "number": "506", "fall": true, "units": " 3", "description": "Fundamentals of fluid mechanics and heat transfer mechanisms during the bonding nonwovens.  Provide engineering and in-depth description of hydroentangling, thermal bonding and needle punching techniques.  Modeling methods and laboratory work are assigned."}, {"summer": true, "name": "Nonwoven Characterization Methods", "prerequisites": "Prerequisite: ST 361, Corequisite: TT/NW 505", "spring": true, "number": "507", "fall": false, "units": " 3", "description": "Fundamentals of methods used in evaluating properties and performance of nonwovens.  Assessment of thermal, mechanical, moisture transport and barrier properties of nonwovens.  Reliability and interpretation of test results."}, {"summer": false, "name": "Nonwoven Product Development", "prerequisites": "Prerequisite: TTNW505, TT/NW507", "spring": false, "number": "508", "fall": true, "units": " 3", "description": "Fundamentals of nonwoven product development.  In-depth knowledge of the materials, processes and nonwovens products.  Design a set of experiments intended for product development.  Students work in teams to design and evaluate nonwoven products."}]