[{"summer": false, "name": "Public Policy Analysis and Evaluation", "spring": false, "number": "311", "fall": true, "units": " 3", "description": "This course will be an introductory course for the study og policy anaylsis, i.e. the systematic study of political-issue problems and alternative policy choices. An individula semester-long project will be completed by each student that identifies a policy issue of interest to the student and various alternatives to implement or improve the policy. Students will measure outcomes of their alternative choices and choose a course of action based on anticipated outcomes."}, {"summer": false, "name": "Human Resource Management in Public Sector", "spring": true, "number": "332", "fall": false, "units": " 3", "description": "PA 332 is a fundamental, comprehensive course designed to provide a view of the major influence human resources management has in a productive public sector organization. Specifically, it examines the challenges of managing complex work systems in the political and institutional environments. Emphasis is given to the challenges facing the public sector in attracting and developing human assets in an environment of conflicting goals, stakeholder obligations and a highly aware electorate. With theoretical concepts established, the focus will shift to practical implementation tools to include recruitment, retention, compensation, and evaluation techniques."}, {"summer": "True", "name": "Public Administration for Police Supervisors", "spring": "True", "number": "410", "fall": "True", "units": " 3", "description": "Introduces law enforcement supervisors to the subject of Public Administration as a field of intellectual inquiry and as a field of professional activity.  Students will learn how important founding principles such as federalism, separation of powers, equity, and democratic accountability impact police organizations today.  The more practical concerns of police administrators including budgeting and financial management, labor-management relations, and personnel law are also considered.  Available only to distance education students enrolled in the AOMP."}, {"summer": "True", "name": "Managing Police Organizational Behavior", "spring": "True", "number": "411", "fall": "True", "units": " 3", "description": "This course is designed to prepare police managers to develop more efficient and effective organizations.  Particular attention is given to improving leadership and interpersonal communication skills through self assessment.  Students will also study group dynamics, team building, and the importance of employee empowerment within a law enforcement context.  Problem-solving g tools and assessments utilized by police agencies to facilitate organizational change are also considered.  Available only to distance education students enrolled in the AOMP."}, {"summer": "True", "name": " Practices for Police Supervision", "spring": "True", "number": "412", "fall": "True", "units": " 3", "description": "The purpose of this course is to introduce law enforcement supervisors to management skills that can enhance their individual and organizational effectiveness.  Students will learn collaborative leadership, conflict resolution, staff development, group problem solving, delegation and coaching.  The skills taught in this class are considered theoretically (through reading assignments and lectures), experientially (through role plays, assessment center exercises, and management inventories), and analytically (through written analyses and class discussions).  Available only to distance education students enrolled in the AOMP."}, {"summer": false, "name": "State and Local Economic Development Policy", "spring": true, "number": "420", "fall": false, "units": " 3", "description": "In many communities, both rural and urban, the most immediate policy problem confronting public leaders is how to improve the local economy. The purpose of this course is to introduce public leaders to the tasks and challenges in policy development for improving the economies of communities. This course introduces students to the strategies fir attracting and retaining public and private investments in a local economy. An individual semester long project will be completed by each student that presents an original economic development strategy, program or project for a specific community (city/town or county)."}, {"summer": false, "name": "Effective Writing for Public Managers", "spring": false, "number": "501", "fall": true, "units": " 1", "description": "Focus on professional writing and emphasis on the types of documents most frequently written by public managers.  Drafting, editing, audience assessment, and persuasive writing. Student composition of memos, position papers, proposals and instructions."}, {"summer": false, "name": "The Public Policy Process", "spring": true, "number": "507", "fall": false, "units": " 3", "description": "Application of current theories of the public policy process to current issues in public policy and management. Emphasis on the dominant theories of the process, including policy streams, advocacy coalitions, punctuated equilibrium, institutional and rational choice models. Graduate standing or seniors with instructor's permission."}, {"summer": false, "name": " Public Administration", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": false, "number": "508", "fall": true, "units": " 1", "description": "Public administration and policy making in U.S. political system.  Covers Presidency, Congress, Supreme Court, Federal Reserve System, state and local government, intergovenmental relations. Credit is not allowed if student has prior credit for 3 ormore undergraduate American government courses"}, {"summer": false, "name": "Applied Political Economy", "prerequisites": "Prerequisite: EC/ARE 401", "spring": false, "number": "509", "fall": true, "units": " 3", "description": "Principles governing the interaction of politics and markets, and their application to public policy and public administration.  Economic and political market failure, dilemmas of public choice and effects of political institutions.  Case studies ofpublic policy-making."}, {"summer": false, "name": "Ethics and Professional Practice", "prerequisites": "Prerequisite: MPA student, Corequisite: PA 601", "spring": true, "number": "510", "fall": true, "units": " 1.5", "description": "Workshop on ethical responsibilities of public and nonprofit administrators and codes of ethics used by their professional organizations. Knowledge and problem-solving skills to assess ethical challenges encountered in public and nonprofit administration."}, {"summer": true, "name": "Public Policy Analysis", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": true, "number": "511", "fall": true, "units": " 3", "description": "Methods and techniques of analyzing, developing and evaluating public policies and programs. Emphasis given to benefit-cost and cost-effectiveness analysis and concepts of economic efficiency, equity and distribution. Methods include problem solving, decision making and case studies. Examples used in human resource, environmental and regulatory policy."}, {"summer": false, "name": "The Budgetary Process", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": true, "number": "512", "fall": true, "units": " 3", "description": "Examination of  generalized budgetary process used at all levels of government in the U. S. Understanding of the process based upon comprehension of institutions involved, roles of politicians and professionals and the objectives of budgetary systems. Focus also upon budgetary reforms and on Planning-Programming-Budgetary and Zero-Based Budgeting as management tools."}, {"summer": false, "name": "Public Organization Behavior", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": true, "number": "513", "fall": true, "units": " 3", "description": "Major conceptual frameworks developed to understand organization behavior. Motivation, leadership, group dynamics, communication, socio-technical systems, work design and organizational learning. Application of theories and concepts to public sectororganizations."}, {"summer": false, "name": "Management Systems", "prerequisites": "Prerequisite: Six hours of graduate PA course work", "spring": true, "number": "514", "fall": true, "units": " 3", "description": "Use of management systems by public and nonprofit organizations to monitor and manage their programs. Results-based management approaches, including strategic planning, goal setting, and output/outcome measurement.  Ways of increasing managerial effectiveness through the use of structural changes, process improvements, project planning tools, performance-based budget systems, and individual and group rewards."}, {"summer": false, "name": "Research Methods and Analysis", "prerequisites": "Prerequisite: ST 311", "spring": true, "number": "515", "fall": true, "units": " 3", "description": "A focus on behavioral approach to study of political and administrative behavior. Topics including philosophy of social science; experimental, quasi and non-experimental research design; data collection techniques; basic statistical analysis with computer applications."}, {"summer": false, "name": "Seminar in Urban Management", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": true, "number": "520", "fall": false, "units": " 3", "description": "A seminar focusing on analytical techniques and managerial principles required for policy formation and implementation in a complex urban governmental environment. Specific topics including urban planning and community development, housing, intergovernmental relations, organizational roles and decision making, budgeting and selected urban services (for example: police, transportation)."}, {"summer": false, "name": "Government and Planning", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": true, "number": "521", "fall": false, "units": " 3", "description": "The planning function at all levels of government in the U. S., with particular attention to problems posed for planning by rapid growth of metropolitan areas. Overview of community development, urban spatial structure, housing economics and land use planning."}, {"summer": false, "name": "Intergovernmental Relations in the United States", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": false, "number": "522", "fall": true, "units": " 3", "description": "Examination of distinctive features of intergovernmental relations in the U. S. Topics stressed including historical adaptations of federalism, emerging role of the administrator, contemporary trends in intergovernmental relations and assessment of contemporary trends from federal, state and local perspectives."}, {"summer": false, "name": "Municipal Law", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "523", "fall": true, "units": " 3", "description": "A focus on the legal nature of cities as municipal corporations and the legal context in which local governments operate.  Specific topics covered including incorporation, ethics, public access to meetings and records, annexation, land use, development, planning, liability, financing, contracting, and personnel actions."}, {"summer": false, "name": "Organizational Development and Change Management", "spring": true, "number": "525", "fall": false, "units": " 3", "description": "This course provides an introduction to the applied skills and knowledge necessary for helping public and nonprofit organizations and agencies effectively manage change. Students will gain knowledge and skills in organizational assessment, action research, systems change, and the stages of change management. Graduate standing only."}, {"summer": false, "name": "Financial Management in the Public Sector", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": true, "number": "530", "fall": false, "units": " 3", "description": "Survey of financial practices and concepts in the public sector.  Topics including public sector accounting, financial information systems, revenue projections, cash management and debt management.  Emphasis upon case-based applications."}, {"summer": false, "name": "Human Resource Management in Public and Nonprofit Organizations", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": true, "number": "531", "fall": true, "units": " 3", "description": " negotiation, and labor relations)."}, {"summer": false, "name": "Contract Negotiation and Mediation in the Public and Nonprofit Sectors", "prerequisites": "Prerequisite: Graduate standing or Management Development Certificate Program and 6 hours of 500-level course work", "spring": true, "number": "532", "fall": false, "units": " 3", "description": "Three inter-related leadership skills - negotiation, contracting, and mediation-essential for acheiving organizational success. Skills for negotiating with partners, for facilitation among colleagues, for crafting and monitoring contracts for equipment, services, or performance, and for using alternate dispute resolution techniques, primarily mediation."}, {"summer": true, "name": "Problem Solving for Public and Nonprofit Managers", "prerequisites": "Prerequisite: PA 513", "spring": false, "number": "535", "fall": true, "units": " 3", "description": "The course introduces a problem solving model specific to public and nonprofit organizations. The model is based on meeting three criteria: effectiveness, efficiency, and equity. Students learn to apply the model in interpersonal and group interactions. The course relies heavily on self-assessment to enable the students to recognize their problem solving propensities and the strengths and limitations of those tendencies."}, {"summer": false, "name": "Management of NonProfit Organizations", "prerequisites": "Prerequisite: PBS status or Graduate standing", "spring": false, "number": "536", "fall": true, "units": " 3", "description": "Strategies for developing board leadership, staffing, and managing volunteers, working in multi-cultural environments, developing partnerships with other organizations, conducting government relations.  Legal requirements and contraint on nonprofits: incorporation, lobbying, and tax policies."}, {"summer": true, "name": "Nonprofit Budgeting and Financial Management", "spring": true, "number": "538", "fall": true, "units": " 3", "description": "Nonprofit budgeting and financial management practices, including budgeting, financial analysis, cash flow forecasting, internally controlling financial transcations, borrowing, external auditing, investing, managing risk, purchasing and inventory control."}, {"summer": "True", "name": "Fund Development", "spring": "True", "number": "539", "fall": "True", "units": " 3", "description": "Identifies and assesses techniques and best practices of fund development, annual giving, capital campaigns, endowments.  Topics include setting achievable goals, organizing and staffing a fund development campaing, and identifying donors.  Discusses links between fund development and organization mission and governance, ethical issues, and government regulations.  PBS status or Graduate standing."}, {"summer": false, "name": "Geographic Information Systems for Public Administration", "prerequisites": "Prerequisite: Graduate standing, PBS status, Advanced Undergraduate standing with 12 hours in PS program", "spring": true, "number": "541", "fall": false, "units": " 3", "description": "Introduction to management of spatial data in relation to public administration databases, including preparation of maps, tables, and data graphics related to geographic information systems in the public sector.  Use of ArcView and a variety of other GIS computer applications."}, {"summer": false, "name": "Administrative Law", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": false, "number": "545", "fall": false, "units": " 3", "description": "Case law of exercise of administrative power, judicial and legislative control of administrative action, legal rights of public employers and legal procedures of administrative tribunals."}, {"summer": false, "name": "Seminar in program Evaluation", "prerequisites": "Prerequisite: Graduate standing and 6 hours of 500-level courses", "spring": true, "number": "546", "fall": false, "units": " 3", "description": "Combination of seminar and field research techniques to study evaluation of public programs.  Focus on political and administrative problems associated with program evaluation.  Examination of availiability and appropriateness of various quantitative methodologies.  Seminar concepts applied through evaluative projects conducted for public agencies."}, {"summer": false, "name": "Environmental Policy", "prerequisites": "Prerequisite: Advanced Undergraduate standing including 12 hours of PS program, Graduate standing or PBS status", "spring": true, "number": "550", "fall": true, "units": " 3", "description": "Focus on formation and impact of environmental policy in the U. S. Examination on decision-making processes at all levels of government. Comparisons between political, economic, social and technological policy alternatives. Emphasis upon applicationof policy analysis in environmental assessment and consideration on theoretical perspectives on nature of the environmental crisis."}, {"summer": "True", "name": "Disaster, Crisis and Emergency Management and Policy", "spring": "True", "number": "553", "fall": "True", "units": " 3", "description": "Study of the policies designed to prepare for, respond to, mitigate, and recover from natural and technological hazards, disasters, accidents, or terrorist attacks.  Surveys government, nonprofit, and private sector activities in hazards, disasters,emergency and crisis management and policy."}, {"summer": false, "name": "Administration of Criminal Justice", "prerequisites": "Prerequisite: PS 311 or Graduate standing", "spring": true, "number": "555", "fall": true, "units": " 3", "description": "Politics and administration in American criminal justice system. Emphasis upon interrelationships between ideology, organization and policy outputs in analysis of major problems confronting the system today. Topics including intergovernmental relations, discretionary justice, impact of judicial decisions on criminal justice administration and management trends in criminal justice bureaucracies.Credit for both PS 555 and PA 555 is not allowed.3"}, {"summer": true, "name": "Independent Study", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": true, "number": "580", "fall": true, "units": " 1-6", "description": "Independent research or readings by graduate students under direct supervision of individual faculty members. Students' work evaluated, based on reports, papers and exams."}, {"summer": true, "name": "Special Topics in Public Administration", "prerequisites": "Prerequisite: Advanced Undergraduate standing including 12 hours in PS program, Graduate standing or PBS status", "spring": true, "number": "598", "fall": true, "units": " 1-6", "description": "Detailed investigation of contemporary topics in fields of public administration. Topic and mode of study determined by program faculty."}, {"summer": false, "name": "Effective Public Communications", "prerequisites": "Corequisite: PA 510", "spring": true, "number": "601", "fall": true, "units": " 1.5", "description": "Written and oral skills and applications needed by public and nonprofit administrators. Includes drafting, editing, and presenting factual and persuasive materials. Use of visual aids, handling question and answer sessions, dealing with media, and holding effective meetings. Composing memos, position papers, and press releases. MPA students"}, {"summer": true, "name": "Readings and Research", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "635", "fall": true, "units": " 1-3", "description": "To enable graduate students to pursue a subject of particular interest to them by doing extensive readings or research in that subject under direct, individual faculty supervision."}, {"summer": false, "name": "Grantwriting", "spring": false, "number": "640", "fall": true, "units": " 1", "description": "Survey of funding environment; how to identify foundations, corporation and government funding sources, write proposals, and evaluate proposals."}, {"summer": true, "name": "Internship in Public Affairs", "prerequisites": "Prerequisite: Minimum 9 hours graduate work", "spring": true, "number": "650", "fall": true, "units": " 1-6", "description": "Exposure of the student to environment and value systems of the public organization through a supervised work experience. Involving application of substantive knowledge and analytical skills to organizational problems. Credit will vary with nature of the work experience."}, {"summer": "True", "name": "Advanced Practical Training", "prerequisites": "Prerequisite: 12 graduate credit hours", "spring": "True", "number": "651", "fall": "True", "units": " 1-3", "description": "Substantive knowledge and analytical skills applied to projects under agency supervision.  Participation in monthly on-campus meetings. Credit will not be given for placements in current or previous work unit.  Credit will not be given for both PA 650 and PA 651.  Credit will vary with number of work hours.  Must have MPA, current or previous professional work experience."}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "685", "fall": true, "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "688", "fall": true, "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "689", "fall": true, "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "696", "fall": false, "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": false, "name": "Quantitative Policy Analysis", "prerequisites": "Prerequisite: ST 407, ST 511, ST 513", "spring": false, "number": "715", "fall": true, "units": " 3", "description": "Application of quantitative tools to conduct public policy and administrative research.  Course identifies and uses secondary data, including U.S. Census Data, to empirically assess social and economic policies.  Emphasis is on the correct selection, use and interpretation of data to answer public policy questions and to understand the strengths and limitations of quantitative analysis."}, {"summer": false, "name": "Foundation of Public Administration", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "761", "fall": true, "units": " 3", "description": "Intellectual foundation of public administration and its development as a discipline.  Boundaries between public administration and large political process, external political control, factors producing administrative influence and the bases of administrative ethics."}, {"summer": false, "name": "Public Organization Theory", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "762", "fall": false, "units": " 3", "description": "Examination of fundamental questions guiding organization research in public administration with emphasis on reconciling democracy and organization.  Analysis of classical bureaucratic systems, rational choice, cognitive and organizational economic,and nonlinear and chaos theories."}, {"summer": false, "name": "Public Policy Process", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "763", "fall": true, "units": " 3", "description": "Examination of public policy process at federal level in the United States. Analysis of constitutional foundations of this process and the role of governmental institutions, political culture, parties, interest groups, and public opinion in policy making. Case studies of policy making and implementation in selected policy areas."}, {"summer": false, "name": "Budgeting and Financial Management", "prerequisites": "Prerequisite: PA 512", "spring": true, "number": "764", "fall": false, "units": " 3", "description": "Examination of budgetary and financial management processes in governmental and nonprofit agencies. Budgetary and financial management theory, practice, and unanswered research questions."}, {"summer": false, "name": "Quantitative Research in Public Administration", "prerequisites": "Prerequisite: PA 515 ; ST 507", "spring": true, "number": "765", "fall": false, "units": " 3", "description": "Review of quantitative procedures commonly applied in public administration with emphasis on applications found in leading journals in the discipline.  Exploration of data acquisition, appropriate research design, selection of procedures, data assumptions of procedures, and common errors in the research process and in statistical analysis."}, {"summer": false, "name": "Advanced Quantitative Research in Public Administration", "prerequisites": "Prerequisite: PA 765", "spring": false, "number": "766", "fall": true, "units": " 3", "description": "Review of advanced quantitative procedures commonly applied in public administration research with emphasis on multivariate models found in leading journals in the discipline. Illustrative topics include the application of specialized regression models, generalized linear models, event history models, mixed and multilevel models, and structural equation models to topics in public administration."}, {"summer": false, "name": "Contemporary Public Management", "prerequisites": "Prerequisite: PA 514", "spring": true, "number": "770", "fall": false, "units": " 3", "description": "Current public management practices, including evaluation of their underlying theoretical assumptions and of empirical evidence about their effectiveness.  Causes of recent shifts in public management theory; political implications of management choices; privatization in theory and practice; managerial use of performance measurement systems; customer feedback systems; worker incentive structures."}, {"summer": "True", "name": "Seminar on Nonprofit Organizations", "spring": "True", "number": "771", "fall": "True", "units": " 3", "description": "Course provides the necessary theoretical foundation to design scholarly research on nonprofit organizations, voluntary action, and the nonprofit sector.  Topics focus on the historical and philosophical roots of the nonprofit sector, the theories used to frame scholarly research and answer contemporary research questions.  Students assume a leadership role in shaping the course content.  Doctoral students only."}, {"summer": true, "name": "Independent Study", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": true, "number": "780", "fall": true, "units": "", "description": "Independent research or readings by graduate students under direct supervision of individual faculty members. Students' work evaluated, based on reports, papers and exams."}, {"summer": false, "name": "Special Topics in Public Administration and Policy", "spring": true, "number": "798", "fall": true, "units": " 1-3", "description": "In depth exploration of specialized or emerging topics in public administration or public policy. Student presentations on readings and research projects. Also used to test and develop new courses."}, {"summer": false, "name": "Advanced Research Design", "prerequisites": "Prerequisite: Doctoral student in Public Administration; PA 765, Corequisite: At least two graduate methodology or statistics courses", "spring": false, "number": "803", "fall": true, "units": " 3", "description": "Philsosphy and objectives of social scientific research with focus on basic and applied research, need for hypothesis development and testing as a basis of scientific research, inductive and deductive reasoning. Emphasis on preparation of research design of dissertation, published articles, and technical presentations. Students will present a research prospectus that will serve as the basis for their dissertation."}, {"summer": true, "name": "Special Topics in Public Administration", "prerequisites": "Prerequisite: Advanced Undergraduate standing including 12 hours in PS program, Graduate standing or PBS status", "spring": true, "number": "810", "fall": true, "units": " 1-6", "description": "Detailed investigation of contemporary topics in fields of public administration. Topic and mode of study determined by program faculty."}, {"summer": true, "name": "Readings and Research", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "835", "fall": true, "units": " 1-3", "description": "To enable graduate students to pursue a subject of particular interest to them by doing extensive readings or research in that subject under direct, individual faculty supervision."}, {"summer": true, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "885", "fall": true, "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": true, "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "890", "fall": true, "units": " 1-9", "description": "For students who are preparing for and taking written and/or oral preliminary exams."}, {"summer": true, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "893", "fall": true, "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate faculty."}, {"summer": true, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "895", "fall": true, "units": " 1-9", "description": "Dissertation research."}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "896", "fall": false, "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": true, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "899", "fall": true, "units": " 1-3", "description": "For students who have completed all credit hour, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations."}]