[{"summer": "True", "name": "Fitness and Wellness", "spring": "True", "number": "101", "fall": "True", "units": " 1", "description": "This course is designed to teach and apply the principles of lifetime physical fitness, utilizing the five major components of cardio-respiratory endurance, muscular strength, muscular endurance, flexibility and body composition.  A variety of health and wellness issues will be addressed.  The components of fitness will be met through structured individually paced running activities as well as strength and endurance conditioning exercises."}, {"summer": "True", "name": "Fitness Walking", "spring": "True", "number": "102", "fall": "True", "units": " 1", "description": "This course is designed to teach and apply the principles of lifetime physical fitness, utilizing the five major components of cardio-respiratory endurance, muscular strength, muscular endurance, flexibility and body composition.  A variety of health and wellness issues will be addressed.  The components of fitness will be met through structured individually paced fitness walking techniques and strength conditioning exercises."}, {"summer": "True", "name": "Water Aerobics", "spring": "True", "number": "103", "fall": "True", "units": " 1", "description": "This course is designed to teach and apply the principles of lifetime physical fitness, utilizing the five major components of cardio-respiratory endurance, muscular strength, muscular endurance, flexibility and body composition.  A variety of health and wellness issues are also addressed.  The components of fitness will be met through structured individually paced water aerobics classes that will take place in chest deep water.  Muscular strength activities could take place in or out of water."}, {"summer": "True", "name": "Swim Conditioning", "prerequisites": "Prerequisite: PE 215 or equivalent skill", "spring": "True", "number": "104", "fall": "True", "units": " 1", "description": "This course is designed to teach and apply the principles of lifetime physical fitness, utilizing the five major components of cardio-respiratory endurance, muscular strength, muscular endurance, flexibility and body composition.  A variety of health and wellness issues will be addressed.  This course covers the mechanics of a variety of strokes, training methods, training principles, safety, with swim techniques that maximize fitness gains and minimize injuries."}, {"summer": "True", "name": "Aerobics and Body Conditioning", "spring": "True", "number": "105", "fall": "True", "units": " 1", "description": "This course is designed to teach and apply the principles of lifetime physical fitness, utilizing the five major components of cardio-respiratory endurance, muscular strength, muscular endurance, flexibility and body composition.  A variety of health and wellness issues will be addressed.  The components of fitness will be met through structured individually paced aerobics classes.  Muscular strength activities could take place in or out of the aerobics room."}, {"summer": "True", "name": "Triathlon", "prerequisites": "Prerequisite: PE 221 or equivalent skill", "spring": "True", "number": "106", "fall": "True", "units": " 1", "description": "This course is designed to teach and apply the principles of lifetime physical fitness, utilizing the five major components of cardio-respiratory endurance, muscular strength, muscular endurance, flexibility and body composition.  A variety of health and wellness issues will be addressed.  The components of fitness will be met through structured individually paced swim, cycle and run training techniques.  The student must provide bicycles and ANSI approved helmets."}, {"summer": "True", "name": "Run Conditioning", "spring": "True", "number": "107", "fall": "True", "units": " 1", "description": "This course is designed to teach and apply the principles of lifetime physical fitness, utilizing the five major components of cardio-respiratory endurance, muscular strength, muscular endurance, flexibility and body composition.  A variety of health and wellness issues will be addressed.  The components of fitness will be met through structured individually paced running activities on an indoor or outdoor track, and/or a cross-country route.  Muscular strength activities will occur in a weight room or incorporated during running activities."}, {"summer": "True", "name": "Water Step Aerobics", "spring": "True", "number": "108", "fall": "True", "units": " 1", "description": "This course is designed to teach and apply the principles of lifetime physical fitness, utilizing the five major components of cardio-respiratory endurance, muscular strength, muscular endurance, flexibility and body composition.  A variety of health and wellness issues will be addressed.  The components of fitness will be met through structured individual paced water step aerobics classes that will take place in chest deep water on an aquatic exercise step.  Muscular strength activities could take place in our out of the water."}, {"summer": "True", "name": "Step Aerobics", "spring": "True", "number": "109", "fall": "True", "units": " 1", "description": "This course is designed to teach and apply the principles of lifetime physical fitness, utilizing the five major components of cardio-respiratory endurance, muscular strength, muscular endurance, flexibility and body composition.  A variety of health and wellness issues will be addressed.  The components of fitness will be met through structured individually paced step aerobics classes.  Muscular strength activities could take place in or out of the aerobics room."}, {"summer": "True", "name": "Adapted Physical Education", "spring": "True", "number": "110", "fall": "True", "units": " 1", "description": "This course is designed to teach and apply the principles of lifetime physical fitness, utilizing the five major components of cardio-respiratory endurance, muscular strength, muscular endurance, flexibility and body composition.  A variety of health and wellness issues will be addressed.  The components of fitness will be met through structured individually paced aerobic, muscular strength and muscular endurance activities that meet the need of students with medical/physical limitations. For students with medical problems who are unable to take regular Physical Education classes.  Repeatable up to two semesters."}, {"summer": "True", "name": "Indoor Group Cycling", "spring": "True", "number": "111", "fall": "True", "units": " 1", "description": "This course is designed to teach and apply the principles of lifetime physical fitness, utilizing the five major components of cardio-respiratory endurance, muscular strength, muscular endurance, flexibility and body composition. A variety of health and wellness issues will be addressed. The components of fitness will be met through structured individually paced indoor group cycling classes. Muscular strength activities could take place in or out of the main classroom."}, {"summer": "True", "name": "Beginning Swimming", "spring": "True", "number": "214", "fall": "True", "units": " 1", "description": "Swimming strokes and deep water skills for the non-swimmer to survive in the water."}, {"summer": "True", "name": "Advanced Beginning Swimming", "prerequisites": "Prerequisite: PE 214 or equivalent skill", "spring": "True", "number": "215", "fall": "True", "units": " 1", "description": "Continuation of Basic Strokes acquired in Beginning Swimming, additional new strokes, and survival skills."}, {"summer": "True", "name": "Soccer", "spring": "True", "number": "216", "fall": "True", "units": " 1", "description": "Soccer with emphasis on skills development, playing strategies, and rules of the game."}, {"summer": "True", "name": "Survival Swimming", "prerequisites": "Prerequisite: PE 214 or equivalent skill", "spring": "True", "number": "217", "fall": "True", "units": " 1", "description": "This course will provide NCSU students with the opportunity to learn water survival skills and techniques that will enhance their chances of survival if stranded in the water. Skills include drownproofing, underwater swimming, survival swim strokes, jumping from a height, clothing inflation techniques, and swimming through a simulated oil/debris field. These survival skills and techniques will help promote physical fitness and a healthy lifestyle."}, {"summer": "True", "name": "Gymnastics", "spring": "True", "number": "219", "fall": "True", "units": " 1", "description": "Develop basic gymnastics skills on vault, bars, beam, floor, and trampoline. 1) To assist the students in safely learning progressions on each of these events for skill development. 2) To acquire the fitness requirements associated with learning these skills. 3) To identify the hazards and risks associated with gymnastics and 4) To identify basic skills and terminology associated with the sport."}, {"summer": "True", "name": "Intermediate Swimming", "prerequisites": "Prerequisite: PE 214 or equivalent skill", "spring": "True", "number": "221", "fall": "True", "units": " 1", "description": "This course is designed to provide instruction in five basic swim strokes- front crawl (freestyle), back crawl (backstroke), breaststroke, elementary backstroke and sidestroke. Additional emphasis will be placed on increased cardiovascular fitness along with skill development in treading water, underwater swims, turns and dives."}, {"summer": "True", "name": "Lifeguard Training", "prerequisites": "Prerequisite: PE 221 or equivalent skill", "spring": "True", "number": "223", "fall": "True", "units": " 1", "description": "This course is designed to provide entry-level lifeguard participants with the knowledge and skills prevent, recognize and respond to emergencies and to provide care for injuries and sudden illnesses until Emergency Medical Services (EMS) personnel arrive and take over. Optional fee assessed for certification."}, {"summer": "True", "name": "Water Safety Instructor", "prerequisites": "Prerequisite: PE 221 or equivalent skill", "spring": "True", "number": "224", "fall": "True", "units": " 1", "description": "Designed to provide students with the skills and knowledge necessary to qualify for an American Red Cross Water Safety Instructor's certification. Optional fee assessed for certification."}, {"summer": "True", "name": "Skin and Scuba Diving I", "prerequisites": "Prerequisite: PE 221 or equivalent skill", "spring": "True", "number": "226", "fall": "True", "units": " 2", "description": "This course is designed for students with little or no experience, emphasizing safety and responsible skin and scuba diving techniques. Topics include the use and care of scuba equipment, diving skills, problem solving, emergency procedures, basic rescue techniques, direct and indirect effects of pressure, medical contradictions, oxygen enriched are diving, and gas management. Optional fee assessed for open-water training field trip and certification. Students must provide their own transportation for fieldtrip(s)."}, {"summer": "True", "name": " Scuba Diving II", "prerequisites": "Prerequisite: PE 226 or equivalent skills", "spring": "True", "number": "227", "fall": "True", "units": " 2", "description": " recovery techniques, and diving first aid than is required in Skin and Scuba Diving I. Optional fee assessed for open water training fieldtrip and certification. Students must provide their own transportation for fieldtrip(s)."}, {"summer": "True", "name": "Springboard Diving", "prerequisites": "Prerequisite: PE 215 or equivalent skills", "spring": "True", "number": "228", "fall": "True", "units": " 1", "description": "Development of  fundamental one-meter springboard diving."}, {"summer": "True", "name": "Scuba Leadership", "prerequisites": "Prerequisite: PE 227 or equivalent skill", "spring": "True", "number": "229", "fall": "True", "units": " 2", "description": "This course will provide NCSU students with the opportunity to build upon the skills learned in PE 227 and progress towards proficiency as a scuba diving leader.  This course will help promote physical fitness and skill development in scuba diving, as well as an understanding of the knowledge and skills of scuba diving leadership.  Participation in scuba leadership provides interested students with the opportunity to seek clarification as a scuba diving leader.  Fee is assessed for required field trip(s).  Students must provide their own transportation for field trip(s)."}, {"summer": "True", "name": "Scuba Leadership", "prerequisites": "Prerequisite: PE 227 or equivalent skill", "spring": "True", "number": "229", "fall": "True", "units": " 2", "description": "This course will provide NCSU students with the opportunity to build upon the kills learned in PE 227 and progress towards proficiency as a scuba diving leader. This course will help promote physical fitness and skill development in scuba diving, as well as an understanding  of the knowledge and skills of scuba diving leadership. Participation in scuba leadership provides interested students with the opportunity to seek clarification as a scuba diving leader. Fee is assessed for required fieldtrip(s). Students must provide their own transportation for fieldtrip(s)."}, {"summer": "True", "name": "Pilates/Core Training", "spring": "True", "number": "230", "fall": "True", "units": " 1", "description": "This course will teach the fundamentals of Pilates which are to improve body awareness, increase breathing capacity and improve postural alignment through simultaneous stretching and strengthening movements.  The goal of Pilates exercises is to achieve optimal functional fitness.  The knowledge and training gained from Pilates will not only benefit an individual in their daily activities, but also improve their performance in any physical activity they choose to participate in."}, {"summer": "True", "name": "Scientific Diving", "prerequisites": "Prerequisite: PE 227 or equivalent skill", "spring": "True", "number": "231", "fall": "True", "units": " 3", "description": "This course covers the knowledge, skills, and diving experience necessary to plan and safely conduct scientific dives with regards to site selection, safety procedures, gas mix considerations, equipment requirements, data collection techniques, and dive team selection. These skills and techniques will help promote physical fitness and a healthy lifestyle. Successful completion of all phases of the course will qualify students for certification as a \"scientific diver.\" This course meets American Academy of Underwater Sciences (AAUS) guidelines. Fee is assessed for required fieldtrip(s). Students must provide their own transportation for fieldtrip(s)."}, {"summer": "True", "name": "Clogging", "spring": "True", "number": "233", "fall": "True", "units": " 1", "description": "An entry level dance course stressing the fundamentals of traditional and precision clogging.  Emphasis on basic foot movements, combinations and individual freestyle."}, {"summer": "True", "name": "Country Dance", "spring": "True", "number": "234", "fall": "True", "units": " 1", "description": "American Heritage dances, Texas two-step, and Western Square Dance."}, {"summer": "True", "name": "Beginning Karate", "spring": "True", "number": "235", "fall": "True", "units": " 1", "description": "Introduction to traditional Japanese karate: kihon (basic punching, striking, blocking, and kicking techniques); kata (formal drills); yakusoku kumite (pre-arranged sparring); and demonstration of ji-yu-kumite (controlled free sparring).  Karate uniform required."}, {"summer": "True", "name": "Weight Training", "spring": "True", "number": "237", "fall": "True", "units": " 1", "description": "Provides essential knowledge of the Principles of Muscular Strength development and an opportunity to acquire skill in a variety of progressive resistance exercises."}, {"summer": "True", "name": "Self Defense", "spring": "True", "number": "239", "fall": "True", "units": " 1", "description": "Basic self defense and techniques. Skills covered include strikes, blocks, and escapes; plus psychology of general and sexual assault. Physical contact will occur between students and with the instructor as well."}, {"summer": "True", "name": "Social Dance", "spring": "True", "number": "240", "fall": "True", "units": " 1", "description": "Basic steps and fundamentals of leading and following in the Fox Trot, Waltz, Cha-Cha, Shag, and one other current popular dance form"}, {"summer": "True", "name": "Social Dance II", "prerequisites": "Prerequisite: PE 240 or equivalent skills", "spring": "True", "number": "241", "fall": "True", "units": " 1", "description": "This course will focus on training students to understand and perform more complex dances in an improvisational environment. Emphasis will be on learning advanced level dance steps and combinations that are more challenging or complex social dances not currently offered in the beginning level class. Dances taught will differ from semester to semester."}, {"summer": "True", "name": "Badminton", "spring": "True", "number": "242", "fall": "True", "units": " 1", "description": "Skills development, strategies and rules of singles and doubles play."}, {"summer": "True", "name": "Bowling", "spring": "True", "number": "243", "fall": "True", "units": " 1", "description": "Instruction in ball selection, grip, stance, approach, delivery, bowling etiquette, safety precautions, rules, scoring, terminology, and general theory of spare coverage. Additional fee assessed."}, {"summer": "True", "name": "Fencing", "spring": "True", "number": "244", "fall": "True", "units": " 1", "description": "This course will provide students with the fundamentals of modern foil fencing. Emphasis will be placed on safety, footwork, blade work, etiquette, refereeing, bouting, rules, techniques and strategy. Offensive and defensive techniques will be practiced in partner drills and during an in-class tournament. Basic rules in and techniques of epee and saber will be presented."}, {"summer": "True", "name": "Golf", "spring": "True", "number": "245", "fall": "True", "units": " 1", "description": "This course will provide golf instruction at an introductory level. Coursework will introduce full swing fundamentals, chipping, pitching and putting fundamentals, rules, and etiquette on the golf course, and history of the game. Students will develop and appreciation for the game of golf through practice, play, and time of the golf course. There is a required fee for class meetings at the Lonnie Poole Golf Course Range. Check the online scheduling for current charge. The student must provide their own transportation to the golf course."}, {"summer": "True", "name": "Handball", "spring": "True", "number": "246", "fall": "True", "units": " 1", "description": "This course will provide handball instruction at the beginning level in which students will develop the basic skills necessary to play the game of handball. Technical skills include serves, overhand, sidearm, and underhand strokes, ceiling shot, lob, three-wall shot, kill shots and passing shots. Instruction will include an emphasis on the fundamental strategies and rules used in singles, doubles, and cutthroat play. Basic fitness and training principles will be discussed as applicable to the game of handball. Students are required to purchase handball gloves and protective eyegear."}, {"summer": "True", "name": "Squash", "spring": "True", "number": "248", "fall": "True", "units": " 1", "description": "Skill development and strategies of play. Equipment selection, safety, history, and rules."}, {"summer": "True", "name": "Tennis I", "spring": "True", "number": "249", "fall": "True", "units": " 1", "description": "Basic tennis skills on grips, footwork, ground strokes, service. Rules and basic strategy for singles play. Introduction to volleys, lobs, overheads, and doubles."}, {"summer": "True", "name": "Tennis II", "prerequisites": "Prerequisite: PE 249", "spring": "True", "number": "250", "fall": "True", "units": " 1", "description": "Review basic tennis skills on grips, footwork, ground strokes, and service.  Stroke production involved in more aggressive/offensive style of play: approach and volley, spin serve and kick serve.  Emphasis on half-volleys, lobs, overheads, and supplemental shots. Active drills and point play situations for aggressive singles and doubles play"}, {"summer": "True", "name": "Target Archery", "spring": "True", "number": "251", "fall": "True", "units": " 1", "description": "Shooting fundamentals, safety, selection, and care of equipment."}, {"summer": "True", "name": "Skiing/Snowboarding", "spring": "True", "number": "252", "fall": "True", "units": " 1", "description": "Instruction and experience in the fundamentals of skiing or snowboarding. Emphasis on safety, controlled turns and stops, equipment selections, and pre-season preparation. Slope instruction held at a selected site during winter break. Additional charge assessed for trip with a non-refundable deposit. Refer to the online schedule of classes for program format options, current charges and trip dates. Students are responsible for providing their own transportation. Final grades will not post until the second week of January. In the interim, a grade of LA will be given. December graduating seniors should be aware this will delay graduation clearance and posting of degrees."}, {"summer": "True", "name": "Orienteering", "spring": "True", "number": "253", "fall": "True", "units": " 1", "description": "Navigating on foot from defined point to defined point, with use of map and compass in the shortest possible time."}, {"summer": "True", "name": "Beginning Equitation", "spring": "True", "number": "254", "fall": "True", "units": " 1", "description": "This course is designed to apply knowledge of the fundamentals of health-related fitness toward developing, maintaining and sustaining active and healthy lifestyle through equestrian sports. Basic techniques, theories and performance in equitation including skills at the walk, trot and over ground poles will be taught.  Care of the horse, grooming, tacking, and safety around horses will be addressed.  Students will travel off campus once a week.  Refer to the online schedule of classes for the current charge.  Students must provide their own transportation and paddock boots.  Students must meet the weight guidelines of the North American Horseman's Association."}, {"summer": "True", "name": "Basic Canoeing", "prerequisites": "Prerequisite: Basic swimming ability required", "spring": "True", "number": "255", "fall": "True", "units": " 1", "description": "Instruction and experience in flatwater canoe skills; emphasizing paddling skills, safety, flat and moving water travel techniques and proper equipment selection. Plan and participate in one required weekend fieldtrip. Additional charge assessed forthe fieldtrip. Refer to the online schedule of classes for the current charge."}, {"summer": "True", "name": "Racquetball", "spring": "True", "number": "256", "fall": "True", "units": " 1", "description": "Skill development, strategies and rules of singles, doubles and cutthroat play."}, {"summer": "True", "name": "Backpacking", "prerequisites": "Prerequisite: Must pass basic fitness test", "spring": "True", "number": "257", "fall": "True", "units": " 1", "description": "Designed for students with little or no backpacking experience. Safe and environmentally-sound camping practices. Equipment/clothing, first aid and safety management agencies, land navigation, and trip planning. Plan and participate in one required weekend fieldtrip. Additional charge assessed for the fieldtrip. Refer to online schedule of classes for the current charge."}, {"summer": "True", "name": "Basic Rock Climbing", "spring": "True", "number": "258", "fall": "True", "units": " 1", "description": "Instruction and direct experience for the beginning rock climber. Emphasis on safe rope systems for belaying and basic movement on rock."}, {"summer": "True", "name": "Intermediate Rock Climbing", "prerequisites": "Prerequisite: PE 258", "spring": "True", "number": "259", "fall": "True", "units": " 1", "description": "Development of intermediate rock climbing skills and practices including: climbing safety, belaying techniques, anchor systems, partner and self-rescue, rappelling and ascending techniques, minimal impact climbing, and climbing hazards. Participate in one required weekend fieldtrip. Additional charge assessed for the fieldtrip. Refer to the online schedule of classes for the current charge."}, {"summer": "True", "name": "Intermediate Equitation", "prerequisites": "Prerequisite: Beginning Equitation", "spring": "True", "number": "260", "fall": "True", "units": " 1", "description": "This course is designed to apply knowledge of the fundamentals of health related fitness toward developing, maintaining, and sustaining active and healthy lifestyle through equestrian sports.  Intermediate techniques, theories and performance in equitation including skill at walk, trot, canter over ground poles and small cross bars will be taught.  Care of the horse, tack and safety around horses will be assessed.  Students will travel off campus once a week.  Students must meet the weight restriction of the North American Horseman's Association.  Refer to the online schedule of classes for the current fee.  Students must provide their own transportation to the stable, paddock boots, and riding pants."}, {"summer": "True", "name": "Basketball", "spring": "True", "number": "261", "fall": "True", "units": " 1", "description": "Offensive and defensive skills development and systems of team work. Coverage of strategies, history and rules of the sport."}, {"summer": "True", "name": "Introduction to Whitewater Canoeing", "prerequisites": "Prerequisite: PE 255, Intermediate swimming ability required", "spring": "True", "number": "262", "fall": "True", "units": " 1", "description": "Instruction and direct experience in fundamental whitewater canoeing skills. Basic paddling strokes and maneuvers for use on whitewater, river safety, basic river rescue, equipment selection and care, and environmental ethics. Participate in one required weekend fieldtrip. Additional charge assessed for the fieldtrip. Refer to the online schedule of classes for the current charge."}, {"summer": "True", "name": "Tap Dance", "spring": "True", "number": "263", "fall": "True", "units": " 1", "description": "Entry level dance course stressing fundamental movements of tap.  Emphasis on foundation skill movements, rhythmic exercises, and the relationship of movement to music."}, {"summer": "True", "name": "Ballet", "spring": "True", "number": "264", "fall": "True", "units": " 1", "description": "Beginning level ballet technique course.  Fundamental ballet concepts and vocabulary introduced through barre and center exercises and combinations."}, {"summer": "True", "name": "Slow Pitch Softball", "spring": "True", "number": "265", "fall": "True", "units": " 1", "description": "Develop basic skills, rules and strategies for playing slow pitch softball.  This course provides an ideal setting for beginning through intermediate players to acquire or enhance skill sets and obtain knowledge to participate recreationally in a slow pitch softball game or league."}, {"summer": "True", "name": "Ultimate Frisbee", "spring": "True", "number": "266", "fall": "True", "units": " 1", "description": "Emphasis on skill development, aerobic fitness and spirit of competition.  Includes flight dynamics, various throwing and catching techniques, offensive skills, defensive skills, equipment, strategies, and rules of the game."}, {"summer": "True", "name": "Flag Football", "spring": "True", "number": "267", "fall": "True", "units": " 1", "description": "An introduction to the skills, history, rules and strategy of flag football."}, {"summer": "True", "name": "Volleyball I", "spring": "True", "number": "269", "fall": "True", "units": " 1", "description": "This course is designed to teach and apply the basic volleyball fundamentals of setting, passing, serving, spiking, court movement, and game strategy."}, {"summer": "True", "name": "Volleyball II", "prerequisites": "Prerequisite: PE 269", "spring": "True", "number": "270", "fall": "True", "units": " 1", "description": "This course is designed to go beyond the basic volleyball skills.  Emphasis will be placed on floater, top spin, and jump serves, forearm passing, setting, back setting, strong side and weak side attacking, blocking and advance serve reception techniques."}, {"summer": "True", "name": "Varsity Sports Military Conditioning", "spring": "True", "number": "271", "fall": "True", "units": " 1", "description": "This course is for student athletes on a team sponsored by the NCSU Department of Athletics or currently enrolled ROTC students.  Coursework will require a high level of skill acquisition and mastery of the fitness skills required to perform training techniques and safe sport practice.  The rules and terminology of each activity will also be addressed.  Course not repeatable."}, {"summer": "True", "name": "Jazz Dance", "spring": "True", "number": "273", "fall": "True", "units": " 1", "description": "Beginning level jazz dance technique course covering basic jazz skills in warm-up exercises, combinations, and compositions.  Concentration on learning and performing combinations in jazz styles."}, {"summer": "True", "name": "Modern Dance I", "spring": "True", "number": "274", "fall": "True", "units": " 1", "description": "Introduction of movement and dance concepts and techniques through theory and analysis, improvisation and composition, structured dance exercises combinations."}, {"summer": "True", "name": "Modern Dance II", "prerequisites": "Prerequisite: PE/DAN 274 (or permission of instructor)", "spring": "True", "number": "275", "fall": "True", "units": " 1", "description": "Continuation of Modern Dance I. Emphasis on design of body in space, movement qualities and musicality through structured technical exercises and combinations."}, {"summer": "True", "name": "Whitewater Rafting", "prerequisites": "Prerequisite: Intermediate swimming ability required", "spring": "True", "number": "276", "fall": "True", "units": " 1", "description": "Whitewater rafting skills and practices emphasizing safe river travel, minimal impact river camping techniques, and trip planning. Participate in one required weekend fieldtrip. Additional charge assessed for the fieldtrip. Refer to PackTracks for the current charge."}, {"summer": "True", "name": "Mountain Biking", "spring": "True", "number": "277", "fall": "True", "units": " 1", "description": "Bike handling, minimal impact trail riding skills, safety, fitness, basic maintenance and repair, and equipment selection.  Students must provide their own bike, helmet, protective equipment, and clothing."}, {"summer": "True", "name": "Fly-Fishing", "prerequisites": "Prerequisite: Basic swimming ability", "spring": "True", "number": "278", "fall": "True", "units": " 1", "description": "Instruction and experience in basic fly-fishing skills.  Emphasis on casting techniques, tackle selection, habitat evaluation, minimal impact travel, safety, fitness, equipment selection and trip planning.  Basic swimming ability and field trip required.  Transportation provided by the Physical Education Department.  Charge required with a non-refundable deposit."}, {"summer": "True", "name": "Yoga I", "spring": "True", "number": "279", "fall": "True", "units": " 1", "description": "This course will emphasize the physical practice of yoga at an introductory level. Coursework will introduce breathing exercises, relaxation techniques and a variety of yoga poses: standing, twisting, balancing, backward bending, and inversions. Students will develop the fitness skills required to perform these poses and maintain a safe yoga practice."}, {"summer": "True", "name": "Yoga II", "spring": "True", "number": "280", "fall": "True", "units": " 1", "description": "This course will build upon material introduced in Yoga I by emphasizing the physical practice of yoga at an intermediate level.  Coursework will require a deeper level of understanding of a variety of yoga poses, as well as mastery of the fitness skills required to perform these poses and maintain a safe yoga practice.  Breathing techniques and the philosophy of Hatha Yoga will also be addressed."}, {"summer": "True", "name": "Introduction to Challenge Course Programming", "prerequisites": "Prerequisite: PE 258 or equivalent skills", "spring": "True", "number": "281", "fall": "True", "units": " 1", "description": "Participants are introduced to ropes and group initiative courses including a variety of adventure games, initiatives, love and high ropes course events, Safety, risk management issues and facilitation techniques are presented and discussed. Transportation is provided to and from the challenge course by the department. An additional charge is assessed for the course. Refer to the online schedule of classes for the current charge and field trip date(s)."}, {"summer": "True", "name": "Advanced Aerobics and Leadership", "prerequisites": "Prerequisite: PE 105 or PE 109", "spring": "True", "number": "282", "fall": "True", "units": " 1", "description": "Safe and effective high-low impact aerobics program with emphasis on student choreography and leadership, development of individual exercise prescription, and related health topics"}, {"summer": "True", "name": "Mountaineering", "prerequisites": "Prerequisite: PE 258, PE 257", "spring": "True", "number": "283", "fall": "True", "units": " 1", "description": "Instruction and experience in alpine climbing skills emphasizing snow and ice travel, safety, land navigation, winter hazard evaluation, minimal impact camping skills, and equipment selection.  Three full-day classroom sessions before the trip required.  Plan and participate in a ten-day field trip over winter break. Additional charge assessed for the field trip with a non-refundable deposit. Refer to the online schedule of classes for the current charge. Final grades will not post until the second week of January. In the interim, a grade of LA will be given. December-graduating seniors should be aware this will delay graduation clearance and posting of degrees."}, {"summer": "True", "name": "Sea Kayaking", "prerequisites": "Prerequisite: Intermediate swimming ability", "spring": "True", "number": "284", "fall": "True", "units": " 1", "description": "Instruction and experience in basic sea kayaking skills. Emphasis on paddling techniques, open water travel, navigation, minimal impact camping, safety, fitness, equipment selection and trip planning. Plan and participate in one required field trip.Additional charge assessed for the field trip with a non-refundable deposit. Refer to the online schedule of classes for the current charge."}, {"summer": "True", "name": "Special Topics in Physical Education", "spring": "True", "number": "295", "fall": "True", "units": " 1-3", "description": "Examination of selected topics in health, fitness, outdoor leadership, physical education, and sport."}, {"summer": "True", "name": "Independent Study in Physical Education", "spring": "True", "number": "296", "fall": "True", "units": " 1-3", "description": "Independent study in Physical Education will vary according to the specialized topic of interest. Credit and content determined by instructor."}]