[{"summer": "True", "name": "Parks, Recreation and Tourism Management Orientation", "spring": "True", "number": "150", "fall": "True", "units": " 1", "description": "Introduction topics related to the department of Parks, Recreation and Tourism Management; The recreation, tourism, sport and golf industries; all PRTM curricula; advising, academic skills, and team work; and research and personnel involved in the department and college. PRT, SMT and PGM Majors Only."}, {"summer": "True", "name": "Introduction to Parks, Recreation and Tourism", "spring": "True", "number": "152", "fall": "True", "units": " 3", "description": "Introduction to the professional field of recreation by presenting the basic principles, fundamentals and concepts of recreation as related to such factors as recreation history and objectives, sociological and economic aspects of recreation, leadership qualities and facility provision; and settings for organized recreation in modern society."}, {"summer": "True", "name": "Professional Golf Management Orientation", "prerequisites": "Prerequisite: PGM Majors", "spring": "True", "number": "156", "fall": "True", "units": " 3", "description": " beverage control, customer services, personnel management, and tournament operations.  Theoretical foundations for understanding leisure behavior and the parks, recreation and tourism management profession."}, {"summer": "True", "name": "Leisure Behavior, Health and Wellness", "spring": "True", "number": "200", "fall": "True", "units": " 3", "description": "Leisure as a lifelong resource for human satisfaction and fulfillment; its potential for physical, mental, social and emotional growth and emotional growth and development of the individual. Leisure opportunity areas presented and evaluated."}, {"summer": "True", "name": "Golf Management I", "prerequisites": "Prerequisite: PRT 156", "spring": "True", "number": "210", "fall": "True", "units": " 1", "description": "Emphasis on concepts, techniques, and practices of teaching golf skills; understanding the Professional Golfers' Association Constitution; rules of golf, golf tournament operations; and golf car fleet management."}, {"summer": "True", "name": "Golf Management II", "prerequisites": "Prerequisite: PGM Majors, PRT/PEG 210", "spring": "True", "number": "211", "fall": "True", "units": " 1", "description": "Advanced concepts, techniques, and practices of teaching golf; golfer development programs, golf club design and repair."}, {"summer": "True", "name": "Golf Instructor Development", "prerequisites": "Prerequisite: PRT 156 and PRT 210", "spring": "True", "number": "212", "fall": "True", "units": " 2", "description": "Students will learn to teach using a variety of instructional methods including various technologicalmethods. Students will also learn to teach to students with a variety of learning styles including visual, auditory and kinesthetic. The students will learn the fundamental theories and concepts of the golf swing as well as basic ball flight laws."}, {"summer": "True", "name": "Introduction to Adventure Education", "spring": "True", "number": "214", "fall": "True", "units": " 3", "description": "History and philosophy, social psychology of adventure, theories of adventure, benefits, risk-taking behavior, current rends and issues, research and evaluation, and model programs.  Field trip required.  Students are responsible for their own transportation for field trip."}, {"summer": "True", "name": "Principles and Practices of Outdoor Leadership", "spring": "True", "number": "215", "fall": "True", "units": " 3", "description": "Principles and practices of leadership in adventure education and recreation programs: group management, trip planning, staffing, group dynamics, health and safety issues, risk management and other relevant topics."}, {"summer": "True", "name": "Commercial Recreation and Tourism Management", "prerequisites": "Prerequisite: PRT 152", "spring": "True", "number": "220", "fall": "True", "units": " 3", "description": "Commercial recreation and the tourism industry, including its origin, present characteristics, behavioral foundations and societal impacts. Emphasis on recreation administration in the commercial sector."}, {"summer": "True", "name": "Diversity and Inclusion in Recreation and Sport", "prerequisites": "Prerequisite: PRT 152", "spring": "True", "number": "238", "fall": "True", "units": " 3", "description": "Provides knowledge, attitude awareness and resources needed to provide programs, services and facilities for all people. Students gain an understanding of people's differences and potential barriers to participation. 10 hours of volunteer work with people who have disabilities is required. Students are responsible for providing their own transportation to and from volunteer work. PRT, SMT and PGM Majors Only; PRT minors."}, {"summer": "True", "name": "Management of Park and Recreation Facilities", "prerequisites": "Prerequisite: PRT 152", "spring": "True", "number": "250", "fall": "True", "units": " 3", "description": "Management principles applied to park, recreation, sport areas and facilities.  Emphasis on operational efficiency, quality service, fiscal responsibility and maintenance management.  Laboratory provides for application of management and maintenanceprinciples."}, {"summer": "True", "name": "Introduction to Sport Management", "spring": "True", "number": "266", "fall": "True", "units": " 3", "description": "Introduction to concepts and practices of effective sport programming and management at the professional, collegiate and community levels.  Overview of various program delivery systems such as fitness, instructional sport, informal sport, and intramural sport.  Examination of management elements of sport programming, including planning, personnel, finance, facilities, risk and liability and marketing."}, {"summer": "True", "name": " Cultural Dimensions of Sport", "prerequisites": "Prerequisite: Sport Management or PRT Majors, PRT 266", "spring": "True", "number": "277", "fall": "True", "units": " 3", "description": "The psychological behavior of the individual in physical activity and sport. The development of sport and the sports industry, political and cultural significance of sport, and sport in international relationships. The relationship between sport, gender, class, ethnicity, health, drugs, violence, education, and life long physical activity."}, {"summer": "True", "name": "Writing and Speaking in Sports Organizations", "prerequisites": "Prerequisite: Sport Management or PRT Majors, PRT 266", "spring": "True", "number": "286", "fall": "True", "units": " 3", "description": "Concepts related to effective communication within sport organizations. Including interpersonal communication, group communication, public speaking, use of electronic media, and basic knowledge and understanding of media in sport and sport enterprises."}, {"summer": "True", "name": "Golf Course Turf Grass Management", "prerequisites": "Prerequisite: PGM Majors, Sophomore standing, PRT 211", "spring": "True", "number": "311", "fall": "True", "units": " 3", "description": "Introduction to the roles and responsibilities of the golf course superintendent as well as the practices and procedures associated with golf course turfgrass management.  Preparation for completion of Level II Turfgrass Management, elements of the Professional Golfers' Association of America's Professional Golf Management apprentice program.  Periodically class/lab meetings require transportation to area golf facilities.  Students are expected to provide their own transportation accommodations."}, {"summer": "True", "name": "Golf Management III", "prerequisites": "Prerequisite: PGM Majors, PRT 311", "spring": "True", "number": "312", "fall": "True", "units": " 1", "description": "Advanced concepts, techniques, and practices of golf management:  business analysis, planning and operations, and analysis of the golf swing.  Preparation for completion of PGA of America's Professional golf Management Level II knowledge tests and skills simulations."}, {"summer": "True", "name": "Organization and Administration of Adventure Programs", "prerequisites": "Prerequisite: PRT 152", "spring": "True", "number": "315", "fall": "True", "units": " 3", "description": "Overview of the organizational and administration of adventure programs and services, professional standards, programming, management, staffing, budgeting, public relations, liability and risk management."}, {"summer": "True", "name": "Convention and Visitor Services", "prerequisites": "Prerequisite: PRT 152", "spring": "True", "number": "320", "fall": "True", "units": " 3", "description": "An examination of the programmatic issues of providing visitor services for  conventions, meetings, group tours and special events.  The focus is on the planning and delivery of visitor service programs designed to enhance visitor experiences in a community."}, {"summer": "True", "name": "Outdoor Recreation Management", "prerequisites": "Prerequisite: PRT 152", "spring": "True", "number": "350", "fall": "True", "units": " 3", "description": "Concepts and methods of outdoor recreation planning and management explored with emphasis on the public sector.  Current issues relative to recreation provision identified and debated."}, {"summer": "True", "name": "Outdoor Consortium", "spring": "True", "number": "351", "fall": "True", "units": " 3", "description": "Examines outdoor recreation and resource management approaches and research results from an applied perspective. Students will practice problem-solving techniques and interact with a wide variety of park managers and planners. This course culminatesin a week-long field experience that may conflict with other scheduled courses. Field experience held in conjunction with four other universities in the Great Smoky Mountains National Park. A fee will be assessed for the trip."}, {"summer": "True", "name": "The Recreation Program", "prerequisites": "Prerequisite: PRT 152", "spring": "True", "number": "358", "fall": "True", "units": " 3", "description": "Theoretical and applied approaches to the recreation program planning process. Basic elements of programming using a variety of recreational settings and diversity of practical experience."}, {"summer": "True", "name": "Leadership and Supervision in Recreation", "prerequisites": "Prerequisite: PRT 250", "spring": "True", "number": "359", "fall": "True", "units": " 3", "description": "Systematic principles for managing human resource component of parks, recreation and tourism organizations.  Leadership, group dynamics, human resources planning and organizing, employee recruitment, selection and supervision."}, {"summer": "True", "name": "Sport Programming", "prerequisites": "Prerequisite: Sport Management and PRT Majors, PRT 266", "spring": "True", "number": "366", "fall": "True", "units": " 3", "description": "Foundations, administrative support systems, delivery systems and desirable practices of sport programming. Program delivery systems overview with emphasis on problems and solutions associated with sport programs. Topics include sport league administration, youth sport delivery issues, sport tournament operations, community based sport delivery issues, college/university recreation sport delivery."}, {"summer": "True", "name": "Internship Orientation", "prerequisites": "Prerequisite: PRT 152", "spring": "True", "number": "375", "fall": "True", "units": " 1", "description": "Preparation for recreation and park internship.  Resume writing, interviewing skills, cover letters and internship search techniques and resources."}, {"summer": "True", "name": "Sport Administration", "prerequisites": "Prerequisite: Sport Management and PRT Majors, PRT 266", "spring": "True", "number": "376", "fall": "True", "units": " 3", "description": "Concepts related to policy development, organization and management specific to sport organizations. Including theories and practices of policy development and implementation, management theories, organizational behavior, the strategic management process, organizational design, managing change, and operational planning."}, {"summer": "True", "name": "Analysis and Evaluation in Parks, Recreation", "prerequisites": "Prerequisite: 300-level Statistics course, PRT 359", "spring": "True", "number": "380", "fall": "True", "units": " 3", "description": "Examination of the steps involved in analyzing and estimating the impact of recreation and parks services. Includes relevant issues and useful approaches for systematic analysis. Emphasis is placed on an understanding and development of various types of systematic evaluation designs. Activities leading to the analysis and development of performance reports to assess and improve managerial operational efficiency are covered."}, {"summer": "True", "name": "Sports Law", "prerequisites": "Prerequisite: Junior standing.", "spring": "True", "number": "406", "fall": "True", "units": " 3", "description": "Fundamental principles of law, especially tort and contract law, applied to sports situations. Analysis of liability of sports personnel in various roles including participant, coach, promoter, trainer and official.  Analysis of common law court decisions in sports contexts well as key state and federal statutory legislation such as civil rights and antitrust."}, {"summer": "True", "name": "Services, Facilities and Event Marketing", "prerequisites": "Prerequisite: PRT 358,", "spring": "True", "number": "407", "fall": "True", "units": " 3", "description": "Examination of marketing methods as applied to Parks, Recreation, Tourism and Sport Management facilities and programs.  Aspects of advanced marketing: market research, marketing strategy and revenue-generation in both public and private settings. Credit will not be given for both PRT 407 and PRT 507"}, {"summer": "True", "name": "Food and Beverage Management", "prerequisites": "Prerequisite: PGM Majors, Junior standing, PRT 312", "spring": "True", "number": "410", "fall": "True", "units": " 3", "description": "Introduction to practices and procedures in food and beverage service.  Basics of food service needs, cost controls, legal issues affecting food and beverage service, staffing, and customer satisfaction.  Critical elements of food costing, purchasing, inventory control, menu planning, and security.  Preparation for completion of Level III Food and Beverage control elements of the Professional Golfers' Association of America's Professional Golf Management apprentice Program"}, {"summer": "True", "name": "Club Management", "prerequisites": "Prerequisite: Junior standing, PRT 152", "spring": "True", "number": "411", "fall": "True", "units": " 3", "description": "Introduction to practices and procedures in contemporary club management.  Application of general management functions to club environments including human resources, training, financial management marketing; leadership food and beverage service operations facilities and risk management; legal issues; and career planning.  Preparation for completion of Club Management elements of the Professional Golfers' Association of America's Professional Golf Management apprentice Program"}, {"summer": "True", "name": "Golf Course Architecture", "prerequisites": "Prerequisite: PRT 211", "spring": "True", "number": "412", "fall": "True", "units": " 3", "description": "Basic principles of golf course design.  Historical architectural influences on current golf course design trends.  Strategic golf course design principles, shot values, construction practices, environmental issues, and maintenance issues.  Golf course design and management implications. Restricted to PGM and Landscape Arch. Majors.  Junior Standing"}, {"summer": "True", "name": "Golf Management IV", "prerequisites": "Prerequisite: PGM Majors, PRT 312, Senior standing", "spring": "True", "number": "413", "fall": "True", "units": " 1", "description": "Advanced concepts, techniques, and practices of golf management: swing concepts of teaching, supervising and delegating, merchandising and inventory control.  Preparation for completion of PGA of America's Professional Golf Management Level III knowledge tests and skill simulations."}, {"summer": "True", "name": "PGA Apprentice Program Completion", "prerequisites": "Prerequisite: PGM Majors", "spring": "True", "number": "414", "fall": "True", "units": " 0", "description": "Checkpoint mechanism to register the successful completion of the Professional Golfers' Association Apprentice requirement."}, {"summer": "True", "name": "Resort Planning and Management", "prerequisites": "Prerequisite: PRT 152", "spring": "True", "number": "420", "fall": "True", "units": " 3", "description": "Theory and practical applications of planning, accommodations management, food and beverage operations, recreation programs and management in the resort industry."}, {"summer": "True", "name": "Recreation and Park Interpretive Services", "prerequisites": "Prerequisite: Junior standing.", "spring": "True", "number": "442", "fall": "True", "units": " 3", "description": "The principles and practices of environmental and historical interpretation. Personal (attended) and non-personal (unattended) interpretive communication techniques. Comprehensive planning and implementation of interpretive programs, and equipment and facilities used in environmental and historical interpretation. One overnight field trip required."}, {"summer": "True", "name": "Human Dimensions of Natural Resources in Australia/New Zealand", "prerequisites": "Corequisite: PRT 450", "spring": "True", "number": "449", "fall": "True", "units": " 3", "description": "This 3.5 week study abroad program examines human dimensions of natural and environmental conservation in Australia. The course will involve an orientation and lectures from faculty at James Cook University. Students wills explore the natural environments in Australia including Great Barrier Reed, Tropical Rainforest and Outback and be introduced to Australian culture and history through interactions with communities. Educational travel, active participation, lectures, seminars, and reflective exercises facilitate learning to improve understanding of relationships between human societies and the natural environment. Students must pay program fees, airfare, some meals, and incidentals."}, {"summer": "True", "name": "Sustaining Natural Resources in Australia/New Zealand", "prerequisites": "Corequisite: PRT 449", "spring": "True", "number": "450", "fall": "True", "units": " 3", "description": "This 3.5 week study abroad program will examine issues related to natural history and environmental conservation in Australia. This course will involve an orientation and lectures from Australian university faculty. Students will explore natural environments in Australia including the Great Barrier Reef, Tropical Rainforest and Outback; learn about sustainable development and protection of the natural environment through educational travel, field trips, active participation, lecture presentations and seminars, written assignments, research projects and reflective exercises. Students must apply through NCSU Study Abroad Office. Students must pay program fees, airfare, some meals and incidentals."}, {"summer": "True", "name": "Principles of Recreation Planning and Facility Development", "prerequisites": "Prerequisite: PRT 358", "spring": "True", "number": "451", "fall": "True", "units": " 3", "description": "Planning activities analyzed as decision-making processes. Identification, interpretation, evaluation and utilization of data and resources necessary for recreation planning. Planning principles applied in the analysis of proposed and existing recreation sites."}, {"summer": "True", "name": "Parks and Recreation Finance and Administration", "prerequisites": "Prerequisite: PRT 359", "spring": "True", "number": "454", "fall": "True", "units": " 3", "description": "Recreation and park fiscal administration, sources of finance for operating and capital expenditures, revenue activities, financial planning, budgeting, expenditure policies, auditing and planning for recreation and park services, decision-making tools, legal aspects of administration."}, {"summer": "True", "name": "Special Events Planning", "prerequisites": "Prerequisite: PRT 358", "spring": "True", "number": "458", "fall": "True", "units": " 3", "description": "Theoretical and applied approaches to the planning of special events.  Components and considerations of event planning, applied to various recreational settings.  Participation in a community special event is required.  Attendance at professional conference also required."}, {"summer": "True", "name": "Sport Finance and Economics", "prerequisites": "Prerequisite: Sport Management and PRT Majors, PRT 266, ACC 210, and (ARE 201 or EC 201 or EC 205)", "spring": "True", "number": "466", "fall": "True", "units": " 3", "description": "Concepts include sources of revenue for financing, principles of budgeting, spreadsheet utilization, and financial management of sport facilities and enterprises. Additional topics include fundraising principles and methods, economic impact principles and their application to sport venues and events, economic theory applied to sport manufacturing, service industries, professional sports, stadiums and arenas, intercollegiate sports, and the sport club industry."}, {"summer": "True", "name": "Recreation and Park Internship", "prerequisites": "Prerequisite: PRT 350, PRT 358, PRT 359, PRT 375, PRT 380, 100 hours of approved work experience.", "spring": "True", "number": "475", "fall": "True", "units": " 8", "description": "Provides prospective park, recreation and leisure service professionals a 400-hour (ten week) learning experience in a selected agency or organization, under the joint supervision of a qualified manager and a university internship supervisor."}, {"summer": "True", "name": "Sport Marketing", "prerequisites": "Prerequisite: PRT 486, Sport Management or PRT Majors, PRT 266", "spring": "True", "number": "476", "fall": "True", "units": " 3", "description": "Fundamental marketing principles and concepts related to the sport industry. Overview of marketing mix, marketing strategies and the bases of segmentation, sponsorship, licensing, fundraising and merchandising. Special emphasis on the marketing of sport and its strong relationship to research. Credit will not be given for both PRT 476 and PRT 407."}, {"summer": "True", "name": "Park, Recreation and Tourism Management", "prerequisites": "Prerequisite: Senior standing", "spring": "True", "number": "477", "fall": "True", "units": " 3", "description": "Integration of knowledge, theory and methods from coursework and experience; development and presentation of comprehensive operational and management problems and plans.  Designed to encourage students to function as professionals and to relate areas of specialty to the broader Parks, Recreation and Tourism Management profession. Must be taken during student's last semester of coursework"}, {"summer": "True", "name": "Senior Seminar in Sports Management", "prerequisites": "Prerequisite: Sport Management Majors, Senior standing, PRT 476", "spring": "True", "number": "486", "fall": "True", "units": " 3", "description": "Issues affecting sport management at a national and global level. Interactive effect of strategies and decisions in each cognate area in sport management. Professional ethics and the notion of rights and responsibilities will be examined in the context of sport marketing, finance, communications, risk management and other management functions inherent in the sport enterprise. Students will also examine various theories of ethics and concepts of morality and develop a personal philosophy for social responsibility and management values."}, {"summer": "True", "name": "Special Topics in Recreation", "spring": "True", "number": "491", "fall": "True", "units": " 1-3", "description": "Investigation and analysis of a problem associated with recreation resources."}, {"summer": "True", "name": "Conceptual Foundations of Recreation", "spring": "True", "number": "500", "fall": "True", "units": " 3", "description": "Exploration of the conceptual foundations of leisure, recreations, sport, play, and work, the history of ideas in the field and the relationships of these ideas to contemporary professional and social problems. Restricted to PRTM masters and students and others by consent of the instructor. This course will be offered in an accelerated seven-week format."}, {"summer": "True", "name": "Research Methods In Recreation", "prerequisites": "Prerequisite: Graduate-level statistics", "spring": "True", "number": "501", "fall": "True", "units": " 3", "description": "Examination and understanding of advanced scientific investigative methods in their application toward explaining recreation and leisure behavioral phenomena and for resolution of recreation management problems."}, {"summer": "True", "name": "Advanced Fiscal Management for Parks, Recreation, Tourism and Sport Organizations", "spring": "True", "number": "503", "fall": "True", "units": " 3", "description": "This course is intended to provide students with advanced concepts of fiscal management as applied to the unique industries of parks, recreation, tourism and sport management. Emphasis will be placed on understanding how the receipt, disbursement, and utilization of funds can foster sustainability within these types of organizations. Additionally, this course will focus on developing the skills necessary to apply ethical financial analysis principles through financial risk management. This course is restricted to PRTM masters students  and others by consent of the instructor. This course will be offered online in an accelerated seven-week format."}, {"summer": "True", "name": "Data Management and Applications in Parks, Recreation, Tourism and Sport Management", "spring": "True", "number": "504", "fall": "True", "units": " 3", "description": "Introduction to procedures and techniques used in research and evaluation in parks, recreation, sport, and tourism settings to solve management problems. The course emphasizes techniques for data collection, management, analysis, and communication of research findings. This course is restricted to PRTM masters students and others by consent of the instructor. This course will be offered online in an accelerated seven-week format."}, {"summer": "True", "name": "GIS and Spatial Analysis in PRTS", "prerequisites": "Prerequisite: ST 311", "spring": "True", "number": "505", "fall": "True", "units": " 3", "description": "Introduction to spatial reasoning and spatial analysis as implemented in geographic information systems (GIS) to perform evaluation and research in parks, recreation, tourism, and sport settings. This course is restricted to PRTM master's degree students or others with consent of the instructor."}, {"summer": "True", "name": "Organizational Behavior and Leadership in Parks, Recreation, Tourism and Sport", "spring": "True", "number": "506", "fall": "True", "units": " 3", "description": "This course will focus on the organization and administration of public, private and not-for-profit park, recreation, tourism and sports (PRTS) agencies. Emphasis will be placed on understanding the structural, human, political, and cultural factors that impact organizational efficiency and effectiveness - specifically focusing on these environments. The course will primarily address issues related to organization, management, ethical leadership, human personnel supervision, theory, and research. This course is restricted to PRTM master's degree students or by permission of instructor. This course will be offered online in an accelerated seven-week format."}, {"summer": "True", "name": "Strategic Marketing Management in Parks, Recreation, Tourism and Sport Organizations", "spring": "True", "number": "507", "fall": "True", "units": " 3", "description": "This course examines the theoretical principles and applications of marketing and promotion strategies for recreational sport and key marketing concepts and strategies using case studies. There is significant discussion on marketing activation, leveraging strategies of sport/event sponsor brands/ companies, and developing a marketing plan. This course is restricted to PRTM master's degree students and others with the content of the instructor. This course will be offered online in an accelerated seven-week format."}, {"summer": "True", "name": "Risk Management for Parks, Recreation, Tourism and Sport Organizations", "spring": "True", "number": "508", "fall": "True", "units": " 3", "description": "This course explores risk management in PRTs organizations with an emphasis on ethical managerial strategies. The topics include legal concepts related to specific managerial functions, impacts on functions in recreation environments that result in more efficient and successful operation and protection for the organization. In addition, effective strategies for risk management related to facilitating active-healthy lifestyles and sustainable communities will be explored. This course is restricted to PRT master's degree students and others by consent of the instructor. This course will be offered online in an accelerated seven-week format."}, {"summer": "True", "name": "Program Evaluation for Parks, Recreation, Tourism and Sport Organizations", "spring": "True", "number": "509", "fall": "True", "units": " 3", "description": "This course focuses on the development of a working knowledge of the rationale, procedures and tools for conducting sound program evaluation assessments in parks, recreation, tourism, and sport organizations. Effective skills for mastering comprehensive program evaluation strategies including formative, summative, and knowledge building strategies are taught. Students explore social science methods specifically appropriate for evaluation of youth programs."}, {"summer": "True", "name": "Concepts in Travel and Tourism", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "520", "fall": "True", "units": " 3", "description": "This course provides an in-depth knowledge of the conceptual foundation of tourism by introducing students to selected theories, methods, techniques, current issues, practices, and principles that govern tourism behavior.  This course is restricted to students with graduate standing.  This course will be offered online in an acelerated seven-week format."}, {"summer": "True", "name": "Introduction to Geographic Information Science", "prerequisites": "Prerequisite: Graduate standing or PBS status, proficiency with WindowsNT,98, or 2000 and in web browsing(Netscape or Explorer)to the level described in the NCSU Computing essentials+CD is required", "spring": "True", "number": "531", "fall": "True", "units": " 3", "description": "Application of Geographic Information Systems (via the PRT 462 companion course) and the research issues that surround the use and current limitations of this technology.  Successful students will have mastered the general framework for GIS modelingand will be prepared for further graduate study in spatial analysis. Credit will not be given for both PRT 462 and NR/PRT 531"}, {"summer": "True", "name": "Principles of Geographic Information Science", "prerequisites": "Prerequisite: NR/PRT 531 or PA 541 or ECI 630/496E or SSC 495G", "spring": "True", "number": "532", "fall": "True", "units": " 3", "description": "Exploration of theoretical underpinnings of Geographic Information Systems(GIS); focus on spatial concepts, analysis and modeling with computing and programming experiences using a GIS software; required major project, computer homework assignments and independent learning with on-line course modules."}, {"summer": "True", "name": "Application Issues In Geographic Information Systems", "prerequisites": "Prerequisite: NR/PRT 532", "spring": "True", "number": "533", "fall": "True", "units": " 3", "description": "Operation and management issues related to GIS use in natural resource organizations. Issues in proposing and implementing GIS through case study analyses and experimental project planning including social and legal impacts, cost and benefit assessments, institutional constraints to implementation, benchmarks, proposal development, education concerns, and planning for technological advances."}, {"summer": "True", "name": "Computer Cartography", "prerequisites": "Prerequisite: PRT 462 or GIS 410 or NR/PRT 531 or GIS 510", "spring": "True", "number": "535", "fall": "True", "units": " 2", "description": "Principles of cartographic design and how to apply them to produce high-quality Geographic Information System based maps.  Successful students will acquire an understanding of map design and experience in applying this with ArcView GIS.  Students produce project maps in both print and web media. Offered only through the Internet"}, {"summer": "True", "name": "Outdoor Recreation Behavior", "prerequisites": "Prerequisite: PRT 501", "spring": "True", "number": "550", "fall": "True", "units": " 3", "description": "An understanding of outdoor recreation behavior in natural resource-oriented areas such as state and national parks and national forests. Nature of resource-based recreation experience, influencing factors and implications of this behavior for park management."}, {"summer": "True", "name": "Environmental Impacts of Recreation and Tourism", "spring": "True", "number": "555", "fall": "True", "units": " 3", "description": "Understanding of environmental impacts of recreation and tourism, and different methods for assessing and managing such impacts.  Examination of the scientific and management literature and application of impact assessment techniques."}, {"summer": "True", "name": "Special Topics In Recreation Resources", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "595", "fall": "True", "units": " 1-3", "description": "Special topics in various aspects of recreation resources developed under direction of a graduate faculty member on a tutorial basis. Subjects offered under this course listing also used to test and develop new courses."}, {"summer": "True", "name": "Seminar In Recreation Research", "prerequisites": "Prerequisite: PRT 501", "spring": "True", "number": "601", "fall": "True", "units": " 1", "description": "Research studies, scientific articles and progress reports on research effects presented and critically evaluated. Each student pursuing a graduate degree expected to take this offering twice for one hour of credit each time."}, {"summer": "True", "name": "Special Topics In Recreation Resources", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "610", "fall": "True", "units": " 1-3", "description": "Special topics in various aspects of recreation resources developed under direction of a graduate faculty member on a tutorial basis. Subjects offered under this course listing also used to test and develop new courses."}, {"summer": "True", "name": "Recreation Resources Problems", "prerequisites": "Prerequisite: Advanced Undergraduate standing or Graduate standing", "spring": "True", "number": "620", "fall": "True", "units": " 1-4", "description": "Assigned or selected problems in field of recreation administration, planning, supervision, maintenance, operations, financing or program. Special research problems selected on basis of interest of students and supervised by members of graduate faculty."}, {"summer": "True", "name": "Professional Electronic Portfolio for Parks, Recreation and Tourism Management", "prerequisites": "Prerequisite: Graduate Standing and PRT 500 and PRT 504 and PRT 505 and PRT 506 and PRT 508 and PRT 503 and PRT 507.", "spring": "True", "number": "650", "fall": "True", "units": " 1", "description": " Tourism Management program. The portfolio should include evidence, reflection, and critical analysis of core competencies achieved throughout their academic course of study. This course must be taken during a student's last semester after he or she has completed all the required courses."}, {"summer": "True", "name": "Professional Practicum", "spring": "True", "number": "660", "fall": "True", "units": " 3", "description": "Provides prospective park, recreation, sport or tourism professionals with a 200-hour learning experience in a selected agency or organization, under the joint guidance of a qualified manager and a university supervisor.  Requires completion of a project or analytical report for the agency."}, {"summer": "True", "name": "Professional Project", "prerequisites": "Prerequisite: 12 credits of PRT graduate courses", "spring": "True", "number": "665", "fall": "True", "units": " 3", "description": "Directed study in a specialized phase of parks, recreation, sport or tourism management such as supervision, evaluation or administration."}, {"summer": "True", "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "685", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "688", "fall": "True", "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": "True", "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "689", "fall": "True", "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": "True", "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "690", "fall": "True", "units": " 1-6", "description": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam."}, {"summer": "True", "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "693", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "695", "fall": "True", "units": " 1-9", "description": "Thesis Research"}, {"summer": "True", "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "696", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "699", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis. Credits Arranged"}, {"summer": "True", "name": "Advanced Theories of Leisure", "spring": "True", "number": "700", "fall": "True", "units": " 3", "description": "This course is designed to examine theory as it can be applied to understanding of leisure behavior and parks, recreation, and tourism management research. The goal is to provide a foundation for identifying, evaluating, and applying theoretical perspectives to PRTM research. Students are expected to engage in a critical analysis of theory in PRTM. Ph.D. student"}, {"summer": "True", "name": "Qualitative Approaches to Recreation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "705", "fall": "True", "units": " 3", "description": "This course provides an introduction to post-positivist and interpretive paradigms as well as the management of qualitative data used in recreation-related research. The interpretive approach and the relationship between methods and research questions are examined along with  an assessment of qualitative approaches and applied techniques for data management. Procedures for data analysis and interpretation, the role of the \"self\" in conducting research, and the issues and ethics that arise in using qualitative approaches are discussed."}, {"summer": "True", "name": "Special Topics in Recreation Resources", "spring": "True", "number": "795", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Seminar In Recreation Research", "spring": "True", "number": "801", "fall": "True", "units": " 1", "description": "Research studies, scientific articles and progress reports on research effects presented and critically evaluated. Each student pursuing a doctoral degree is expected to take this offering four times for one hour of credit each time."}, {"summer": "True", "name": "Special Topics In Recreation Resources", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "810", "fall": "True", "units": " 1-3", "description": "Special topics in various aspects of recreation resources developed under direction of a graduate faculty member on a tutorial basis. Subjects offered under this course listing also used to test and develop new courses."}, {"summer": "True", "name": "Recreation Resources Problems", "prerequisites": "Prerequisite: Advanced Undergraduate standing or Graduate standing", "spring": "True", "number": "820", "fall": "True", "units": " 1-4", "description": "Assigned or selected problems in field of recreation administration, planning, supervision, maintenance, operations, financing or program. Special research problems selected on basis of interest of students and supervised by members of graduate faculty."}, {"summer": "True", "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "885", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Doctoral Preliminary Exam", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "890", "fall": "True", "units": " 1-9", "description": "For students who are preparing for and taking written and/or oral preliminary exams."}, {"summer": "True", "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "893", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "895", "fall": "True", "units": " 1-9", "description": "Dissertation research."}, {"summer": "True", "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "896", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "899", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hour, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations."}]