[{"summer": true, "name": "Internet Research", "spring": true, "number": "101", "fall": true, "units": " 1", "description": "Tools and techniques for conducting Internet research and electronic literature reviews.  Documentation and ethics of using and citing information sources."}, {"summer": true, "name": "Data Analysis", "spring": true, "number": "102", "fall": true, "units": " 1", "description": "Statistical analysis of governmental and survey data.  Introduction to data sets and collecting, computerizing and analyzing political and social data."}, {"summer": true, "name": "Designing Political Web Pages", "spring": true, "number": "103", "fall": true, "units": " 1", "description": "Principles of effective internet communication in political professions, for constituency contact and grassroots mobilization, and use of web documents by politicians and political organizations.  Design of web page documents and creation of internet directories."}, {"summer": true, "name": "American Politics and Government", "spring": true, "number": "201", "fall": true, "units": " 3", "description": "Analysis of American political institutions and processes, including the constitution, political culture, campaigns and elections, political parties, interest groups, the media, the president, congress, the federal courts, and public policy.  Discussion of contemporary and controversial issues in American politics. Emphasis on placing current issues in comparative and historical perspective where relevant."}, {"summer": true, "name": "State and Local Government", "spring": true, "number": "202", "fall": true, "units": " 3", "description": "State and local governments within the context of the American federal system. Special emphasis on federalism, the constitutional/legal relationships between state and local governments, and the institutions, organizational forms, and political processes in American state and local government."}, {"summer": false, "name": "Introduction to Nonprofits", "spring": true, "number": "203", "fall": true, "units": " 3", "description": "Development of nonprofit organizations and the contributions of nonprofits in the U.S., other countries, and the international community; political, social, and economic roles of nonprofits; nonprofit governance; partnerships with government and other nonprofits; types of organizations in the nonprofit sector; contemporary policy issues.  Service project with minor transportation costs."}, {"summer": false, "name": "Problems of American Democracy", "spring": false, "number": "204", "fall": true, "units": " 3", "description": "Political problems in America from the perspective of political theory. Democracy, economics and politics, racial and sexual equality, civil disobedience, and individual freedom."}, {"summer": true, "name": "Law and Justice", "spring": true, "number": "205", "fall": true, "units": " 3", "description": "Role of law from practical, political and theoretical perspective; linkages between law and justice in addressing social problems, such as gun control; drug legalization; civil disobedience; gender equality; and property rights; the impact of media on public perceptions of law and justice."}, {"summer": true, "name": "Introduction to International Relations", "spring": true, "number": "231", "fall": true, "units": " 3", "description": "Evolution of relations among nations and of the roles of the United Nations and other international institutions, including changes in the world political system since the end of the cold war."}, {"summer": false, "name": "Issues in Global Politics", "spring": true, "number": "236", "fall": true, "units": " 3", "description": "Selected problems facing the world community, related political issues, and international responses to them, including international trade, economic development, wars, arms control, terrorism, ethnic conflict, human rights, status of women, population growth, food security, and environmental degradation."}, {"summer": false, "name": "Introduction to Comparative Politics", "spring": false, "number": "241", "fall": true, "units": " 3", "description": "Introductory comparative analysis of a selected variety of political systems always including some developed democracies, some communist states and some developing countries. A minimum familiarity with the American political system is assumed."}, {"summer": "True", "name": "Special Topics in Political Science", "spring": "True", "number": "298", "fall": "True", "units": " 1-6", "description": "Experimental course at the freshman and sophomore levels."}, {"summer": false, "name": "The Presidency and Congress", "prerequisites": "Prerequisite: PS 201", "spring": true, "number": "301", "fall": false, "units": " 3", "description": "Historical development, selection, and internal organization of the presidency and congress.  Discussion of the relations between the branches and the influence of public opinion, interest groups and parties on the federal government.  Analysis of the legislative process."}, {"summer": false, "name": "Campaigns and Elections in the US Political System", "prerequisites": "Prerequisite: PS 201", "spring": false, "number": "302", "fall": true, "units": " 3", "description": "Campaigns and elections in the United States with emphasis on presidential and congressional primary and general elections.  Development of theoretical propositions concerning how and why people vote, how and why candidates campaign, and behavioral reasons underlying candidates' successes and failures.  Special emphasis on the role of the mass media in the electoral process."}, {"summer": false, "name": "Race in U.S. Politics", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "303", "fall": false, "units": " 3", "description": "Race in American politics with emphasis on the African-American political experience: civil rights legislation, voting rights, political representation, campaigns and party politics, survey attitudes, and public policies including affirmative action."}, {"summer": true, "name": "The Justice System in the American Political Process", "spring": true, "number": "305", "fall": true, "units": " 3", "description": "Criminal justice process and civil justice system in the American judiciary, including court organization and legal professionals such as police, attorneys and judges; formulation and implementation of policies by law enforcement and the courts; impact of political system upon police, attorneys and judges; interaction between public and legal professionals in judicial decision making.  Students who have successfully completed PS 306 or PS 311 may not receive credit for PS 305."}, {"summer": false, "name": "Gender and Politics in the United States", "prerequisites": "Prerequisite: PS 201", "spring": true, "number": "306", "fall": false, "units": " 3", "description": "This course explores the role of gender in contemporary American politics.  The course examines the historical course of gender politics to see how we have arrived at the present state.  It investigates the activities that women and men play in modern politics-voting, running for office, serving in office, etc., and how women and men perform these activities in different ways.  The course also focuses on major areas of public policy that affect women and men in different ways."}, {"summer": false, "name": "Introduction to Criminal Law in the United States", "spring": true, "number": "307", "fall": true, "units": " 3", "description": "Principles underlying the criminal law in the United States and classification of crimes, criminal act, factors affecting criminal responsibility and various types of offenses. Observation of state and federal court sessions."}, {"summer": false, "name": "Supreme Court and Public Policy", "spring": true, "number": "308", "fall": false, "units": " 3", "description": "The role of the Supreme Court in American politics, with emphasis on the use of litigation as a form of political activity. Readings include relevant court cases as well as descriptions of the Supreme Court in action."}, {"summer": false, "name": "Equality and Justice in United States Law", "spring": true, "number": "309", "fall": false, "units": " 3", "description": "Equality and justice in American law; federal and state court interpretation of constitutional and statutory law.  Topics include racial justice; prisoners' rights and just punishments; nontraditional families and reproductive technologies; gay rights; immigration law; criminal justice practices."}, {"summer": false, "name": "Public Policy", "spring": false, "number": "310", "fall": false, "units": " 3", "description": "Introduction to public policy formulation and analysis, including agenda-setting strategies, problems of legitimation, the appropriations process, implementation, evaluation, resolution, and termination."}, {"summer": false, "name": "Introduction to Public Administration", "spring": true, "number": "312", "fall": true, "units": " 3", "description": "Administration in city, state and national governments: effectiveness and responsiveness, involvement in policy areas, and issues of ethics and responsibilities."}, {"summer": false, "name": "Criminal Justice Policy", "prerequisites": "Prerequisite: PS 201", "spring": false, "number": "313", "fall": true, "units": " 3", "description": "This course covers the basic policies and controversies in criminal justice in the United States. The course will explore how criminal justice policies get made, why they get made, how well or poorly they work, and what we can do better. The course will examine primarily longstanding areas of policy debate, e.g., illegal drugs, prisons, capital punishment, etc., but we will also pay attention to policy debates in the news."}, {"summer": false, "name": "Criminal Justice Policy", "prerequisites": "Prerequisite: PS 201", "spring": false, "number": "313", "fall": true, "units": " 3", "description": "This course covers the basic policies and controversies in criminal justice in the United States.  The course will explore how criminal justice policies get made, why they get made, how well or poorly they work, and what we can do better.  The course will examine primarily longstanding areas of policy debate, e.g., illegal drugs, prisons, capital punishments, etc., but we will also pay attention to policy debates in the news."}, {"summer": false, "name": "Science, Technology and Public Policy", "spring": true, "number": "314", "fall": false, "units": " 3", "description": "Societal impacts of science and technology. Structures and processes for formulation, implementation, evaluation of United States science and technology policy.  Political implications of selected issues in science and technology policy studies."}, {"summer": false, "name": "Public Leadership", "spring": true, "number": "315", "fall": false, "units": " 3", "description": "Nature and varieties of political leadership by elected and appointed officials in government, officials and volunteers in nonprofit organizations, and leaders of political movements and community groups drawing on literature in political science, self-assessment of student's leadership characteristics and examination of outlets for political leadership activity."}, {"summer": false, "name": "U.S. Environmental Law and Politics", "spring": true, "number": "320", "fall": true, "units": " 3", "description": "Emergence of the environment as an issue in United States politics. Law and policy pertaining to air and water pollution, land-use, water, energy, toxic substances, and wilderness. Roles of national and state governments, scientists, corporations, and citizens groups in addressing environmental problems"}, {"summer": false, "name": "U.S. Foreign Policy", "spring": true, "number": "331", "fall": true, "units": " 3", "description": "The content, formulation, and execution of U.S. foreign policy during the postwar period, with concentration on major issues and trends, the instruments for implementing foreign policy, and analysis of the policy-making process."}, {"summer": false, "name": "International Law", "spring": true, "number": "335", "fall": false, "units": " 3", "description": "Usefulness and limitations of international law, including obligations and immunities of sovereign states, non-state actors, peaceful settlement of disputes, human rights, laws of war, and recent international war crimes tribunals.  Emphasis on individual case decisions in U.S. and international courts."}, {"summer": false, "name": "Global Environmental Politics", "spring": true, "number": "336", "fall": true, "units": " 3", "description": "International politics, laws, and policies pertaining to global environmental problems in the realms of population, pollution, climate change, biological diversity, forests oceans, and fisheries."}, {"summer": false, "name": "Politics of the World Economy", "spring": true, "number": "339", "fall": false, "units": " 3", "description": "Politics of international trade and payments, including barriers to trade, dispute settlement, multinational corporations, financial crises, international economic institutions and the problems of economic underdevelopment."}, {"summer": false, "name": "European Politics", "spring": false, "number": "341", "fall": true, "units": " 3", "description": "Comparative analysis of the interests, institutions and processes that determine political stability and economic security in Europe, including the political and economic development of Europe, the role of parties and party politics, the institutions and politics of the European Union."}, {"summer": false, "name": "Politics of China and Japan", "spring": true, "number": "342", "fall": true, "units": " 3", "description": "Politics, public policy, and foreign affairs of China and Japan."}, {"summer": false, "name": "Government and Politics in South Asia", "spring": false, "number": "343", "fall": true, "units": " 3", "description": "Survey of government structures, politics, foreign policies and economic policies of India, Pakistan, Bangladesh and Sri Lanka.  Democratization; religious, ethnic and sectarian conflicts; nuclear proliferation; Kashmir conflict; and economic development."}, {"summer": false, "name": "Governments and Politics in the Middle East", "spring": false, "number": "345", "fall": false, "units": " 3", "description": "Historical, geographic, religious, and political-economic factors of the Middle East.  Particular attention is given to the internal politics of selected countries, as well as issues of international concern."}, {"summer": true, "name": "Introduction to Political Theory", "spring": true, "number": "361", "fall": true, "units": " 3", "description": "Nature and purpose of politics, as treated by such writers as Plato, Aristotle, St. Augustine, Machiavelli, Locke, Rousseau, Mill, Marx, and Nietzsche."}, {"summer": false, "name": "American Political Thought", "spring": true, "number": "362", "fall": false, "units": " 3", "description": "American ideas and institutions as viewed from the perspective of great American political thinkers, such as Frederick Douglass, Thomas Jefferson, James Madison, Alexander Hamilton, Henry David Thoreau, Abraham Lincoln, Franklin Roosevelt, and Malcolm X."}, {"summer": true, "name": "Research Methodology of Political Science", "prerequisites": "Prerequisite: ST 311 or (ST301 and ST302)", "spring": true, "number": "371", "fall": true, "units": " 3", "description": "Research methods in social science and quantitative analysis in political science and public policy including research design, data collection, statistical analysis and computer applications."}, {"summer": true, "name": "Internship in Political Science", "spring": true, "number": "391", "fall": true, "units": " 1-6", "description": "Internship in a governmental agency, interest group, or like organization involves seminar or formal report."}, {"summer": false, "name": "American Parties and Interest Groups", "spring": true, "number": "401", "fall": false, "units": " 3", "description": "American parties and interest groups as instruments for mobilizing electorates, shifting public opinion and setting political priorities.  The role of parties and interest groups in operating and financing elections.  Strategies, tactics and problems of parties and interest groups influencing elected officials, bureaucrats and the policy process."}, {"summer": "True", "name": "American State Politics", "spring": "True", "number": "406", "fall": "True", "units": " 3", "description": "Comparative study of the politics and policies of the fifty American states. Socioeconomic and political variations and  state response to intergovernmental domestic programs. Analysis of state policy in economic development, environment, health, housing, education, transportation, criminal justice and regulation."}, {"summer": "True", "name": "Urban Politics", "spring": "True", "number": "408", "fall": "True", "units": " 3", "description": "Examination of politics in small towns, cities, counties, and urban regions including political development of cities, groups in urban politics, governmental institutions, local government officials, citizen participation, suburban development, metropolitan reform, and intergovernmental relations."}, {"summer": false, "name": "Black Political Participation in America", "spring": false, "number": "409", "fall": true, "units": " 3", "description": "African American political participation in the United States; political culture, socialization, and mobilization, with a focus on the interaction between African Americans and actors, institutions, processes, and policies of the American political system."}, {"summer": "True", "name": "Public Opinion and the Media in American Politics", "prerequisites": "Prerequisite: PS 201", "spring": "True", "number": "411", "fall": "True", "units": " 3", "description": "Nature, content, origins, and effects of public opinion in the American political system; role of the mass media in articulating and shaping public opinion; issues concerning measurement of public opinion."}, {"summer": false, "name": "Criminal Justice Field Work", "prerequisites": "Prerequisite: Acceptance in Criminal Justice Option; Senior standing; SOC 306 and PS 311", "spring": true, "number": "413", "fall": true, "units": " 4", "description": "Supervised observation and experience in a criminal justice agency. Study of relationships between ongoing programs and relevant political and sociological theory and research. Weekly seminars, small groups and individual conferences. Presentation of an integrative report."}, {"summer": false, "name": "Administration of Justice", "prerequisites": "Prerequisite: PS 311 and Junior standing", "spring": false, "number": "415", "fall": true, "units": " 3", "description": "Politics and administration in the American system of justice. Credit will not be given for both PS 415 and PA 515"}, {"summer": false, "name": "Gender Law and Policies", "prerequisites": "Prerequisite: Nine hours of Political Science", "spring": false, "number": "418", "fall": true, "units": " 3", "description": "Law and policy pertaining to contemporary gender issues.  Examination of agenda setting, policy formation, implementation, judicial interpretation and evaluation of selected issues, such as reproductive policies, equal employment and sexual abuse."}, {"summer": false, "name": "The United Nations and Global Order", "prerequisites": "Prerequisite: PS 231 or PS 236 or PS 335", "spring": false, "number": "431", "fall": false, "units": " 3", "description": "United Nations in contemporary world politics.  Functions and operation of central organs, commissions, and specialized agencies.  Role in addressing global issues including peacekeeping, arms control, human rights, economic and social development, and environment."}, {"summer": false, "name": "Violence, Terrorism, and Public Policy", "prerequisites": "Prerequisite: SOC 300 or PS 371", "spring": true, "number": "432", "fall": true, "units": " 3", "description": "The course examines interpersonal and group violence in contemporary societies and the causes for its occurrences. Specific forms of violence that will be examined include domestic violence, gangs, homicide, and terrorism, domestically and internationally. Throughout the course students will use data to critically evaluate policies and practices to prevent and control violence and will examine potential solutions to the problems of violence."}, {"summer": false, "name": "Global Problems and Policies", "prerequisites": "Prerequisite: PS 231 or PS 236 or PS 241", "spring": false, "number": "433", "fall": true, "units": " 3", "description": "Critical analysis of issues and events in world politics, including terrorism, drug trafficking and money laundering, transmission of infectious diseases, democratization, globalization and economic development."}, {"summer": false, "name": "Ethnic Conflict and Political Violence", "spring": true, "number": "434", "fall": false, "units": " 3", "description": "In this course, students will examine the phenomenon of ethnic conflict in the modern world. Why is ethnicity such a potent source of conflict? How important is \"ethnicity\" as opposed to politics, economic, or other factors in generating ethnic conflict? Is ethnic conflict inevitable? Why is it more prominent in some places than others? What can states, international organizations, and peoples of the world do to prevent or ameliorate interethnic strife? We will examine these questions through a mix of theoretical readings and in-depth case studies of sectarian violence, terrorism, state failure and collapse, riots, and racial tensions, and etc.."}, {"summer": "True", "name": "U.S. National Security Policy", "prerequisites": "Prerequisite: PS 331", "spring": "True", "number": "437", "fall": "True", "units": " 3", "description": "Formulation and implementation of United States national security policy, including its military, political and economic dimensions.  Historical evolution of US policy primarily from the end of World War II through the end of the Cold War and to itscontemporary context."}, {"summer": false, "name": " Caribbean Politics", "prerequisites": "Prerequisite: Six hours of Political Science including PS 231", "spring": true, "number": "443", "fall": false, "units": " 3", "description": "Comparative political development in Latin America and the Caribbean.  Emphasis on democratization and implications for US foreign policy. Credit cannot be given for both PS 443 and PS 543"}, {"summer": "True", "name": "Comparative Systems of Law and Justice", "prerequisites": "Prerequisite: PS 311 and Junior standing", "spring": "True", "number": "445", "fall": "True", "units": " 3", "description": "Legal culture and administration of justice in various countries and in the U.S. Emphasis on the impact of legal ideology on crime, political justice, police administration, corrections and judicial process. Credit will not be given for both PS 445 and PS 545"}, {"summer": false, "name": "Seminar in Political Theory", "prerequisites": "Prerequisite: PS 361 or Consent of Instructor", "spring": true, "number": "462", "fall": false, "units": " 3", "description": "A special area in political theory through selected texts, independent research, and seminar reports. Topics vary from year to year, such as ancient and modern political thought, democratic theory, and political theory in literature."}, {"summer": false, "name": "Public Choice and Political Institutions", "prerequisites": "Prerequisite: Junior standing or Senior standing, Political Science Majors, 12 hours of Political Science Courses", "spring": false, "number": "463", "fall": true, "units": " 3", "description": "Examination of public choice approach to political science. Analysis of political institutions and how they modify human behavior and influence political and policy outcomes. Fulfills department's undergraduate senior seminar requirement."}, {"summer": false, "name": "Public Opinion Research Methodology", "spring": true, "number": "471", "fall": true, "units": " 3", "description": "Survey research methodology in public opinion polling, campaign management, media and market research, needs assessment and program evaluation. Topics include questionnaire design, survey sampling, computer applications, and data analysis."}, {"summer": false, "name": "Readings and Research in Political Science", "spring": true, "number": "490", "fall": true, "units": " 1-6", "description": "Extensive readings or research in political science under direct faculty supervision."}, {"summer": true, "name": "Honors Readings and Thesis in Political Science", "prerequisites": "Prerequisite: Admission to Honors Program", "spring": true, "number": "492", "fall": true, "units": " 1-6", "description": "Independent reading and preparation of an honors thesis in political science."}, {"summer": false, "name": "Special Topics in Political Science", "prerequisites": "Prerequisite: Six hours of Political Science", "spring": true, "number": "498", "fall": true, "units": " 1-6", "description": "Detailed investigation of a topic. Topic and mode of study determined by the student and a faculty member."}, {"summer": false, "name": "The Legislative Process", "prerequisites": "Prerequisite: Advanced Undergraduate standing including 12 hrs. of PS, Graduate standing or PBS status", "spring": true, "number": "502", "fall": false, "units": " 3", "description": "The formulation of public policy from institutional and behavioral viewpoints. Important current legislative problems at congressional and state legislative levels selected and serve as basis for analyzing legislative process."}, {"summer": false, "name": "United States Constitutional Law", "prerequisites": "Prerequisite: 12 hours of PS or Graduate standing or PBS status", "spring": false, "number": "506", "fall": true, "units": " 3", "description": "Basic constitutional doctrines, including fundamental law, judicial review, individual rights and political privileges and national and state power. Special attention given to application of these doctrines to regulation of business, agriculture andlabor and to rights safeguarded by First, Fifth and Fourteenth Amendments to the Constitution."}, {"summer": false, "name": "Civil Liberties In the United States", "prerequisites": "Prerequisite: 12 hours of PS or Graduate standing or PBS status", "spring": true, "number": "507", "fall": true, "units": " 3", "description": "Leading constitutional cases in civil liberties and individual rights along with writings of leading commentators."}, {"summer": true, "name": "Seminar In International Relations", "spring": true, "number": "530", "fall": true, "units": " 3", "description": "May be taken for up to six hours credit. In-depth examination of a topic within larger field of international politics to be selected by instructor for each semester from subjects pertaining to interstate relations, international law and organization, regional politics, foreign and security policy or global issues. Students undertake substantial independent research project."}, {"summer": false, "name": "International Law", "prerequisites": "Prerequisite: Graduate standing or Advanced Undergraduate standing", "spring": true, "number": "531", "fall": true, "units": " 3", "description": "Sources and subjects of international law, domestic and international jurisdictions, judicial settlement, legal and illegal uses of force and substance of law in selected policy areas."}, {"summer": false, "name": "Seminar in Global Governance", "spring": true, "number": "532", "fall": false, "units": " 3", "description": "The politics of global governance, with emphasis on the role of intergovernmental organizations, non-governmental organizations, international regimes, and supranational institutions, and the comparative analysis of different governance structures. Includes study of the mechanisms of international cooperation between states and their citizens in a variety of issue areas, such as trade, money, development, humanitarianism, the environment, human rights, and security. Graduate standing."}, {"summer": false, "name": "Global Problems and Policy", "prerequisites": "Prerequisite: Advanced Undergraduate standing including 12 hours of PS program, Graduate standing or PBS status", "spring": false, "number": "533", "fall": true, "units": " 3", "description": "International policy processes and policy responses to problems of global scope including role of international law. Consideration given to economic development, human rights and other policy problems selected for specific semesters. Independent research on a global policy problem of student's choice."}, {"summer": false, "name": "The Politics of Human Rights Policies", "spring": false, "number": "534", "fall": true, "units": " 3", "description": "Human rights policies and politics within the modern global society; the interplay of international organizations, governments and non-governmental actors in promoting and undermining international human rights; examines how domestic politics, sovereignty, cultural norms, religion, geo-political competition, past colonialism, and economic considerations affect efforts to address human rights violations in different countries; human rights issues such as genocide, humanitarian intervention, women and gender issues, refugees, transitional justice or reconciliation, ethnic/racial divisions, human trafficking, etc.  Graduate standing."}, {"summer": false, "name": "Global Environmental Law and Policy", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": true, "number": "536", "fall": false, "units": " 3", "description": "International organizations, laws and policies addressing global environmental problems including:  population growth, atmospheric pollution, climate change, use of oceans, forests and biodiversity. Relationship between environment and Third World economic development."}, {"summer": false, "name": "International Political Economy", "prerequisites": "Prerequisite: Advanced Undergraduate standing, Graduate standing or PBS status", "spring": false, "number": "539", "fall": true, "units": " 3", "description": "Politics of international trade and payments, with special emphasis on international and domestic determinants of protectionism, international and national political institutions, multinational corporations, debt crises, and dilemmas of economic underdevelopment."}, {"summer": false, "name": "Seminar In Comparative Politics", "prerequisites": "Prerequisite: One course in comparative politics and one course in PS methodology", "spring": true, "number": "540", "fall": true, "units": " 3", "description": "This seminar opens with a survey of the problems and methods of comparative political analysis, after which students assigned a specific, limited subject to be examined within framework of a systematic, analytical scheme appropriate to topic. Specific topics drawn from subjects of political ideologies, political groups, political elites and decision-making institutions and processes."}, {"summer": false, "name": "Political Islam", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "541", "fall": false, "units": " 3", "description": "Explores the diversity of movements, organizations, and political parties that fall within political Islam, from the extremist, violent fringe to democratically functioning groups.  Begins with an overview of the interaction of religion and politics before defining political Islam and exploring major groups practicing it.  The course provides a comparative perspective on Islam's interactions with the political realm, as well as a study of the role it plays in promoting or hindering democratic development."}, {"summer": false, "name": "European Politics", "prerequisites": "Prerequisite: Nine hours of PS program, Graduate standing or PBS status", "spring": true, "number": "542", "fall": false, "units": " 3", "description": "Analysis of political institutions and processes in selected European states and the European community and major social, economic and political issues confronting European societies."}, {"summer": "True", "name": "Latin American nd Caribbean Politics", "prerequisites": "Prerequisite: Advanced Undergraduate standing including 12 hours of Political Science or PBS status", "spring": "True", "number": "543", "fall": "True", "units": " 3", "description": "Comparative political development in Latin America and the Caribbean.  Emphasis on democratization and implications for US foreign policy."}, {"summer": false, "name": "Comparative Systems Of Law and Justice", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "545", "fall": true, "units": " 3", "description": "Legal culture and administration of justice in various countries and in the U.S. Emphasis on impact of legal ideology on nature of crime, political justice, police administration, corrections and judicial processes. Credit for both PS 445 and PS 545is not allowed"}, {"summer": false, "name": "Research Methods and Analysis", "prerequisites": "Prerequisite: Advanced Undergraduate standing including 12 hours of PS program, Graduate standing or PBS status", "spring": true, "number": "571", "fall": false, "units": " 3", "description": "A survey of methods used in behavioral research as applied to field of political science: elements of empirical theory, research design, measurement of variables, sampling procedures, data courses, techniques of data collection, statistical analysis, qualitative methodologies and presentation of research findings."}, {"summer": "True", "name": "Constitutional and Legal Principles for Police Supervisors", "spring": "True", "number": "585", "fall": "True", "units": " 3", "description": "Intensive look at the constitutional underpinnings and restrictions on laws and government agency policies impacting police agencies.  Specific constitutional protections relating to interrogation and search of employees, freedom of speech, freedom of religion and drug testing.  Legal risks and liabilities facing police managers and how to reduce these risks."}, {"summer": true, "name": "Special Topics", "spring": true, "number": "590", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Special Topics In Political Science", "prerequisites": "Prerequisite: Six hours of PS program", "spring": true, "number": "598", "fall": true, "units": " 1-6", "description": "Detailed investigation of a topic. Topic and mode of study determined by student and a faculty member."}, {"summer": false, "name": "Special Topics", "prerequisites": "Prerequisite: Six hours of PS program", "spring": true, "number": "610", "fall": true, "units": " 1-6", "description": "Detailed investigation of a topic. Topic and mode of study determined by student and a faculty member."}]