[{"summer": "True", "name": "Pulping and Papermaking Technology", "spring": "True", "number": "201", "fall": "True", "units": " 3", "description": "Survey of the pulping and papermaking processes.  Covers characteristics of wood and different types of fiber, key equipment and process variables for pulping, bleaching and chemical recovery processes, with emphasis on the kraft process.  Papermaking variables and equipment, particularly on a Fourdrinier machine, secondary fiber processing, and aspects of printing and coverting discussed."}, {"summer": "True", "name": "Pulp and Paper Internship", "prerequisites": "Prerequisite: PSE 201", "spring": "True", "number": "211", "fall": "True", "units": " 1", "description": "Experience in the pulp and paper industry. Problem solving in an industrial setting to gain insight of pulp and paper technology. Written report required."}, {"summer": "True", "name": "Paper Properties", "prerequisites": "Prerequisite: PSE 201", "spring": "True", "number": "212", "fall": "True", "units": " 4", "description": "Measurement and characterization of the structural, mechanical, and optical properties of paper and board.  Effect of raw materials and manufacturing processes on structure and properties.  Basic concepts of paper physics."}, {"summer": "True", "name": "From Papyrus to Plasma Screens: Paper and Society", "spring": "True", "number": "220", "fall": "True", "units": " 2", "description": "The impact of paper and paper products on society, examined from the broad interdisciplinary perspectives of technology/engineering and sociology/communication. How the written word and printing affected human development and history.  How paper products affect people with regard to communication, education, commerce, and comfort/hygiene.  The history and development of paper making and the paper industry.  Important properties of paper.  Basic types of paper products, how they are manufactured, and their impacts  The environmental impacts of paper and the paper industry.  Current issues involving the paper industry."}, {"summer": "True", "name": "Wet End and Polymer Chemistry", "prerequisites": "Prerequisite: PSE 212, CH 221, and CH 222", "spring": "True", "number": "322", "fall": "True", "units": " 4", "description": "Prepares students to solve problems related to chemical usage on paper machines.  Subjects include water chemistry, paper machine operations, fibers, fillers, alum, sizing agents, polyelectrolytes, colloidal interactions, strength agents, dyes, strategies to optimize retention, dewatering strategies, strategies to achieve more uniform paper, strategies to improve production rates, recycling acqueous coatings, and wet-end chemical process control."}, {"summer": "True", "name": "Wood and Pulping Chemistry", "prerequisites": "Prerequisite: CH221, CH222, CH223, CH224", "spring": "True", "number": "332", "fall": "True", "units": " 3", "description": "Introduction to carbohydrate chemistry focusing on the structure and reactivity of wood polysaccharides, hemicelluloses and cellulose and on the chemical structure of lignins and wood extractives. Special emphasis on the chemical reaction of wood components occurring in pulping and bleaching processes."}, {"summer": "True", "name": "Principles of Green Chemistry", "prerequisites": "Prerequisite: CH 101/102, CH 201/202 (or equivalent general chemistry series), and CH 221/22 (or equivalent)", "spring": "True", "number": "335", "fall": "True", "units": " 4", "description": "Introduction to the topic of green chemistry as an emerging field; Identification of hazards and classes; overview of sources; alternative solvents and reagents; sustainability of chemical reactions; alternative chemical reactions and pathways; alternative feedstocks; enzymatic catalysis; ionic liquids; re-engineering of chemical processes; chemical synthesis."}, {"summer": "True", "name": "Pulp and Paper Unit Processes I", "prerequisites": "Prerequisite: CHE 205", "spring": "True", "number": "355", "fall": "True", "units": " 3", "description": "Selected topics in chemical engineering as applied in the pulp and paper industry. Emphasis on computational practice."}, {"summer": "True", "name": "Pulp and Paper Unit Processes II", "prerequisites": "Prerequisite: PSE 201, PSE 355 or CHE 311", "spring": "True", "number": "360", "fall": "True", "units": " 3", "description": "Application of chemical engineering principles to the analysis of pulp and paper unit processes. Emphasis on practical problems in fluid dynamics, heat transfer, mass transfer and thermodynamics.  Problem solution techniques include hand calculationand computer simulation tools."}, {"summer": "True", "name": "Pulping Process Analysis", "prerequisites": "Prerequisite: PSE 201", "spring": "True", "number": "371", "fall": "True", "units": " 3", "description": "Preparation and evaluation of different types of wood pulp. A new wood raw material is selected each year with the purpose of studying and critically evaluating the principal pulping and bleaching variables."}, {"summer": "True", "name": "Paper Industry Strategic Project Analysis", "spring": "True", "number": "415", "fall": "True", "units": " 3", "description": "Design problems in process and project engineering are analyzed from strategic, economic, and business perspectives.  Typical pulp and paper processes are computer modeled and analyzed with regard to feasibility and profitability.  Specific capital projects are assessed for capital requirements, total installed cost, operating costs, payback, and cash flow.  Traditional business concepts are presented, including: financial analysis; capital allocation; marketing and pricing theory; manufacturing work systems; management systems; leadership; what \"good\" looks like.  Senior Standing."}, {"summer": "True", "name": "Process Design and Analysis", "prerequisites": "Prerequisite: PSE 417", "spring": "True", "number": "416", "fall": "True", "units": " 3", "description": "Design, management and analysis of technical projects.  Emphasis on concepts and techniques used in economic analysis of projects. Use of computer simulation for process design and cost analyses.  Team projects to analyze cost and operating feasibility of proposed major mill modification.  Written and oral presentations required throughout the semester."}, {"summer": "True", "name": " Paper Processes", "prerequisites": "Prerequisite: PSE 360", "spring": "True", "number": "417", "fall": "True", "units": " 3", "description": "Application of modeling and simulation techniques for the analysis of pulping and papermaking processes.  Model development and computer simulation using existing models will allow analysis of process interactions and operating/economic feasibility of process modifications of complex manufacturing systems."}, {"summer": "True", "name": " Biomaterials Engineering", "prerequisites": "Prerequisite: For PSE Majors: (MAE 301 or CHE 316) and PSE 360; For CHE Majors: CHE 312 and CHE 316; For BAE Majors: MAE 301 and BAE 402", "spring": "True", "number": "425", "fall": "True", "units": " 3", "description": "This course acquaints students with the basic science, terminology, technology, economic concepts, and engineering concepts associated with the conversion of biomass into energy and materials. Topics include: biomass types and properties; biochemical platforms; thermochemical platforms; unit operations; the biorefinery; biocomposites. Some design content is included. Targeted to engineering students with a suitable background (PSE, CHE, BAE)."}, {"summer": "True", "name": "Paper Physics and Product Design", "prerequisites": "Prerequisite: Senior standing in PSE", "spring": "True", "number": "465", "fall": "True", "units": " 3", "description": "Study of fundamental knowledge on the structure and properties of fibers and fibrous products, and the related physical and physiochemical mechanisms.  Product design exercises will apply the fundamental understanding to specific end use requirements."}, {"summer": "True", "name": "Paper Process Analysis", "prerequisites": "Prerequisite: PSE 212, PSE 322, PSE 371", "spring": "True", "number": "472", "fall": "True", "units": " 3", "description": "Product analysis, materials selection, process planning, manufacture of various types of paper using pilot plant equipment, finished product testing and comparison with standard products.  Machine unit operations, materials flow balances, energy balances performed on operations.  Team assignments with written and oral presentation of results."}, {"summer": "True", "name": "Process Control in Pulp and Paper", "prerequisites": "Prerequisite: Senior standing in PSE", "spring": "True", "number": "475", "fall": "True", "units": " 3", "description": "Overview of the various aspects of control including process modeling, design of control loops and stability analysis in pulp and paper.  Emphasis on distributed digital control (DDC), including hands-on programming and control loop development on aDDC computer."}, {"summer": "True", "name": "Environmental Life Cycle Analysis", "spring": "True", "number": "476", "fall": "True", "units": " 3", "description": "Overview of the various aspects of conducting and interpreting an environmental life cycle analysis on a product or service.  Students will learn how to construct a life cycle analysis goal and scope, inventory, assessment and interpretation.  Skills in the critique and communication of a life cycle analysis will be developed.  Includes an overview of the following life cycle stages: raw materials, energy, transportation, production, use, and end of life.  Emphasis on systems thinking. Targeted for students in any science or engineering program.  Credit not allowed for both PSE 476 and WPS 576."}]