[{"summer": false, "name": "Introduction to the Study of Religion", "spring": true, "number": "200", "fall": true, "units": " 3", "description": "Historical, theoretical, and methodological introduction to the study of religion.  Critical analysis of development of the discipline of Religious Studies.  Preparation for all advanced study in Religious Studies theory and method, as well as training to study religious traditions of the world."}, {"summer": false, "name": "South Asian Religious Traditions", "spring": false, "number": "230", "fall": false, "units": " 3", "description": "Hindu, Buddhist, Jain, Sikh, Islamic, Chrisitan, Jewish, and Zoroastrian religious traditions in comparative perspective. Religious and cultural history through literature, film, and art of India, Pakistan, Bangladesh, Sri Lanka, Nepal, and Afghanistan. Doctrine, practice, teaching tales, and issues of change and conflict in South Asia and in the diaspora, especially the USA."}, {"summer": "True", "name": "Special Topics in Religious Studies", "spring": "True", "number": "298", "fall": "True", "units": " 3", "description": "Selected studies in religion that do not appear regularly in the curriculum. Topics will be announced for each semester in which the course is offered."}, {"summer": false, "name": "Religious Traditions of the World", "spring": false, "number": "300", "fall": false, "units": " 3", "description": "Major Eastern and Western religious traditions with attention to their basic teachings and practices as well as to the historical, geographical, social, and political settings in which they have arisen and developed."}, {"summer": false, "name": "Religion and Society", "prerequisites": "Prerequisite: 3 cr. in SOC, 200 level", "spring": false, "number": "309", "fall": false, "units": " 3", "description": "Religious beliefs, practices and organizations addressed as social phenomena. Structural functionalism, conflict and subjectivism as theoretical orientations for understanding influences between religion and society. Relationship of religions to family, government, and economy and to social divisions, conflict and change."}, {"summer": false, "name": "Introduction to the Old Testament", "spring": false, "number": "311", "fall": false, "units": " 3", "description": "Study of Old Testament books, examining their content, background and development. Comparisons of the biblical material with other Ancient Near Eastern literature. Assessment of contributions from archeology and literary studies to clarifying the text."}, {"summer": false, "name": "Introduction to the New Testament", "spring": false, "number": "312", "fall": false, "units": " 3", "description": "Literary and historical study of the New Testament in its Jewish and Greco-Roman contexts. Special attention to distinctive characteristics of the Gospels and their relationships, early controversies with Judaism and the emergence of church structure and teaching."}, {"summer": false, "name": "Introduction to Intertestamental Literature", "spring": false, "number": "314", "fall": false, "units": " 3", "description": "Intertestamental literature in the context of Jewish history, institutions and beliefs of the Intertestamental Period (ca. 300 B.C.-ca. 100 A.D.)"}, {"summer": false, "name": "Christianity", "spring": false, "number": "317", "fall": false, "units": " 3", "description": "Development of Christianity from its origins to the present; events, persons, ideas, beliefs and practices which were most significant in this development."}, {"summer": false, "name": "Religion in American History", "prerequisites": "Prerequisite: 3 hours of History or Sophomore standing", "spring": false, "number": "320", "fall": false, "units": " 3", "description": "Representative people, movements and thought in the major religions within the context of American society and culture."}, {"summer": false, "name": "Religious Cults, Sects, and Minority Faiths in America", "spring": false, "number": "323", "fall": false, "units": " 3", "description": "Religious cults, sects and minority faiths in America, including Mormonism, Christian Science and Jehovah's Witnesses. Also covers such alternate groups as the holiness-charismatic movement and the Unification Church. Origins, development and teachings of these groups within the context of American culture and religion."}, {"summer": false, "name": "Issues in Contemporary Religion", "spring": false, "number": "327", "fall": false, "units": " 3", "description": "Responses of contemporary Western religious thinkers to critics of religion and to challenges posed by the 20th century including the Nazi Holocaust, social injustice (liberation theologies - black, feminist, Third World), ecological crisis, threat of nuclear warfare, and conflicts between religions."}, {"summer": false, "name": "The Hindu Tradition", "spring": false, "number": "331", "fall": false, "units": " 3", "description": "Basic religio-philosophical concepts, social institutions, and individual practices of Hindu civilization from earliest Vedic times to the present.  Focus on major traditions:  Action (karma), Knowledge (jnana), and Devotion (bhakti), with emphasis on disciplines (yoga), myth, symbol, art."}, {"summer": false, "name": "The Buddhist Traditions", "spring": false, "number": "332", "fall": false, "units": " 3", "description": "History and structure of the Buddhist tradition analyzed through the \"three jewels\": the Buddha, the Monastic Community (sangha), and the Teachings (dharma). Emphasis on fundamental religio-philosophical concepts, social history and ritual practicesof Southern Buddhism, early Mahayana development, and Tantric ideals. Growth of the traditions in China and Japan."}, {"summer": false, "name": "Chinese Religions", "spring": false, "number": "333", "fall": false, "units": " 3", "description": "Survey of Chinese religions from prehistoric times to present.  Confucianism, Daoism, primary Buddhist schools in China, spirit possession, divination and popular religious worship."}, {"summer": false, "name": "Japanese Religions", "spring": false, "number": "334", "fall": false, "units": " 3", "description": "Survey of various strands of Japanese religious life from prehistoric times until present.  Kami worship; primary Buddhist schools in Japan; Japanese Christianity; Confucianism; and New Religions."}, {"summer": "True", "name": "Islam", "spring": "True", "number": "340", "fall": "True", "units": " 3", "description": "Introductory survey of the Islamic religious tradition. Examination of the primary historical, literary, and theological sources for Islamic religious thought in global contexts. Topics include the Prophet Muhammad, the development of the early Muslim community, Islamic religious practice, Sunni and Shi'i Islam, Sufism, theology, law and Islamic art and architecture."}, {"summer": false, "name": "Introduction to Judaism", "spring": false, "number": "350", "fall": false, "units": " 3", "description": "A survey of Jewish religious traditions from the bible through the present day.  Evolution of major religious ideas through classical texts including torah, Talmud, philosophical and mystical literature, and contemporary fiction."}, {"summer": false, "name": "Religion, Globalism, and Justice", "prerequisites": "Prerequisite: One course in religion, philosophy, history, political science, anthropology or sociology", "spring": false, "number": "383", "fall": false, "units": " 3", "description": "Issues and problems in religion and societies since 1945.  Historical, theoretical, sociological, and cultural approaches to globalism and religion.  Inquiry into the role of ethical reasoning in religious debates on the problem of globalization."}, {"summer": "True", "name": "Early Christianity to the Time of Eusebius", "prerequisites": "Prerequisite: One of: REL 312, REL 317, or HI 207", "spring": "True", "number": "402", "fall": "True", "units": " 3", "description": "Growth and diffusion of early Christianity from the end of the first century up to the time of Eusebius and the conversion of Constantine (early fourth century); Christianity in its Greco-Roman environment; Roman policy towards Christianity; heterodox Christian movements; anti-heretical writings; orthodox institutions of authority."}, {"summer": false, "name": "Islamic History to 1798", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": false, "number": "407", "fall": false, "units": " 3", "description": "Credit will not be given for both HI 407 and HI 507. The history of the Islamic Near East to 1798. Topics include the East Mediterranean before Islam, Muhammad and the development of Islam, sources of Muslim civilization, Islamic law, science, philosophy, art and architecture, Islam in Spain, India, Asia and Africa, the Crusades, the Ottomans, Islam and Europe."}, {"summer": false, "name": "Islam in the Modern World", "prerequisites": "Prerequisite: 3 hours of history or religious studies", "spring": false, "number": "408", "fall": false, "units": " 3", "description": "Evolution of modern Islam from 17th century to the present.  Primary emphasis on North Africa, the Middle East and South Asia.  Pre-modern Islamicate empires, reform and revival.  Historical origins of current issues in the Islamic world."}, {"summer": false, "name": "Advanced Readings in the Christian Gospels", "prerequisites": "Prerequisite: REL 312 or REL 317", "spring": false, "number": "412", "fall": false, "units": " 3", "description": "Close study of the varieties of gospel writings, both canonical and non-canonical, in early Christianity. Analysis of the constituent features of the gospels (parables, healing narratives, sermons), and their \"pre-history\"; the use of the gospels inthe reconstruction of the life and ministry of Jesus; and critical methods in gospel research."}, {"summer": false, "name": "The Life and Letters of the Apostle Paul", "prerequisites": "Prerequisite: REL 312 or REL 317", "spring": false, "number": "413", "fall": false, "units": " 3", "description": "Intensive study of the apostle Paul and his writings in their historical, literary and religious contexts. Sources for the life and ministry of Paul; the structure and theology of the Pauline and deutero-Pauline epistles; the influence and image of Paul in early Christianity; and contemporary controversies and issues in the study of Paul."}, {"summer": "True", "name": "Religion and Politics in America", "prerequisites": "Prerequisite: one 300-level course in religion, philosophy, or history", "spring": "True", "number": "423", "fall": "True", "units": " 3", "description": "Issues and problems in religion and politics in the United States since 1900.  Historical, theoretical, sociological, and cultural approaches to religion and politics.  Inquiry into the relations between religion and the state.  Responses of religious traditions to American social and political issues."}, {"summer": false, "name": "Darwinism and Christianity", "prerequisites": "Prerequisite: One course in religious studies, biological sciences, philosophy of science, or history of science. Credit is not allowed for both REL 471 and REL 571.", "spring": false, "number": "471", "fall": false, "units": " 3", "description": "Evolutionary biology and Christianity. Darwin's evolutionary theory; neo-Darwinism; conflicts between evolutionary theory and Christian thought; methodological parallels and differences between science and religion; proposals for divine action in anevolutionary world."}, {"summer": false, "name": "Women and Religion", "prerequisites": "Prerequisite: one course in religious studies or women's and gender studies", "spring": false, "number": "472", "fall": false, "units": " 3", "description": "Historical, literary, and theological sources dealing with portrayals of women and women's religious experience in several religious traditions of the world through different historical periods, from ancient to modern.  Impact of feminist theory on the academic study of religion; methodological issues surrounding the study of women's religious history; role of religion in shaping attitudes toward women and their status in society."}, {"summer": "True", "name": "Religion, Gender, and Reproductive Technologies", "prerequisites": "Credit is not allowed for both REL 473 and REL 573.", "spring": "True", "number": "473", "fall": "True", "units": " 3", "description": "Examines comparative religious ethics concerning gender marriage, parenthood, children, and the relationship of human beings to the \"natural\".  Relates these views to new and emerging reproductive and genetic technologies.  Compares the internally diverse perspectives of three major religious traditions with regard to their interpretations of these technologies.  Analyzes the impact of particular uses of these technologies on the rights of women and girls.  Students cannot earn credit for both REL 473 and REL 573."}, {"summer": false, "name": "Religion and Conflict", "prerequisites": "Prerequisite: A 300 or above level Religion course", "spring": false, "number": "482", "fall": false, "units": " 3", "description": "Critical and theoretical inquiry into religious violence and nonviolence.  Source materials on violence and nonviolence from histories and texts.  Case studies of inter- and intra-religious conflict and violence.  Conflict Resolution and role of religion in peacebuilding.  Politics and public policy of religion, violence, and conflict. Students cannot earn credit for both REL 482 and REL 582."}, {"summer": false, "name": "Interpretations of Religion", "prerequisites": "Prerequisite: One course in religion, philosophy, anthropology, history, or sociology.", "spring": false, "number": "489", "fall": false, "units": " 3", "description": "Theory and method in the study of religion.  Historical survey of the discipline of religious studies.  Investigation of the major schools of interpretation and themes of study.  Application of methodologies to historical and sociological case studies."}, {"summer": "True", "name": "Advanced Readings in Theological and Religious Literature", "prerequisites": "Prerequisite: 300-level course in Religion", "spring": "True", "number": "491", "fall": "True", "units": " 3", "description": "Critical analysis of advanced theological works; close reading of primary texts; methods of interpretation (hermeneutics). Course may be used for individualized study programs by arrangement with the instructor"}, {"summer": "True", "name": "Seminar in Religious Studies", "prerequisites": "Prerequisite: 300-level course in Religion", "spring": "True", "number": "496", "fall": "True", "units": " 3", "description": "Advanced research and writing in selected topics; application of contemporary and historical methods for the study of religion; hermeneutic theory. Open primarily to Religious Studies majors and minors"}, {"summer": "True", "name": "Special Topics in Religious Studies", "prerequisites": "Prerequisite: 6 hours REL", "spring": "True", "number": "498", "fall": "True", "units": " 1-6", "description": "Detailed investigation of selected topics in religion. Topics determined by faculty members in consultation with head of the department. Course may be used for individualized study programs."}, {"summer": "True", "name": "Darwinism and Christianity", "prerequisites": "Prerequisite: Graduate standing. Credit is not allowed for both REL 571 and REL 471.", "spring": "True", "number": "571", "fall": "True", "units": " 3", "description": "Evolutionary biology and Christianity.  Darwin's evolutionary theory; neo-Darwinism; conflicts between evolutionary theory and Christian thought; methodological parallels and differences between science and religion; proposals for divine action in an evolutionary world."}, {"summer": "True", "name": "Religion, Gender, and Reproductive Technologies", "prerequisites": "Prerequisite: Graduate Standing. Credit is not allowed for both REL 573 and REL 473", "spring": "True", "number": "573", "fall": "True", "units": " 3", "description": "Examines comparative religious ethics concerning gender marriage, parenthood, children, and the relationship of human beings to the \"natural\".  Relates these views to new and emerging reproductive and genetic technologies.  Compares the internally diverse perspectives of three major religious traditions with regard to their interpretations of these technologies.  Analyzes the impact of particular uses of these technologies on the rights of women and girls.  Students cannot earn credit for both REL 473 and REL 573."}, {"summer": false, "name": "Religion and Conflict", "spring": false, "number": "582", "fall": false, "units": " 3", "description": "Critical and theoretical inquiry into religious violence and nonviolence.  Source materials on violence and nonviolence from histories and texts.  Case studies of inter- and intra-religious conflict and violence.  Conflict Resolution and role of religion in peacebuilding.  Politics and public policy of religion, violence, and conflict. Students cannot earn credit for both REL 482 and REL 582."}]