[{"summer": false, "name": "Introductory Topics in Crop, Soil and Turfgrass Sciences", "spring": false, "number": "103", "fall": true, "units": " 1", "description": "Introduction to the scope, purpose, and objectives of a university education with an emphasis on areas related to Crop, Soil and Turfgrass Sciences.  Students will explore university, college and departmental resources, academic policies and procedures, opportunities for minors, career opportunities, and current trends and issues in our related disciplines. Students cannot receive credit for both CS 103 and ALS 103. Freshman Only; PAA, PAB, PAC, PAE, PCB, SST, TFG"}, {"summer": false, "name": "Land and Life", "spring": true, "number": "185", "fall": true, "units": " 3", "description": "Soil is a fundamental natural resource that sustains life on earth.  Detailed information is provided about soils at local, community, regional, national, and global scales; and their importance to world food security and human health, agricultural production, environmental quality, and sustainable ecosystems.  Students will gain practical knowledge about soils, their use and management, and their critical role in supporting life.  Understanding basic soil properties, their interactions, and how they are influenced or impacted by human activity is essential to everyday life and to being a well-informed citizen."}, {"summer": true, "name": "Soil Science", "prerequisites": "Prerequisite: CH 101 or CH 100", "spring": true, "number": "200", "fall": true, "units": " 3", "description": "Fundamentals of soils including origin, composition and classification; their physical, chemical, and biological properties; significance of these properties to soil-plant relationships and soil management."}, {"summer": false, "name": "Soil Science Laboratory", "prerequisites": "Corequisite: SSC 200", "spring": true, "number": "201", "fall": true, "units": " 1", "description": "Hands-on laboratory experience in fundamentals of soils including origin, composition and classification; their physical, chemical, and biological properties; significance of these properties to soil-plant relationships, soil management and the environment."}, {"summer": false, "name": "Environmental Soil Microbiology", "prerequisites": "Prerequisite: BIO 181 and SSC 200", "spring": true, "number": "332", "fall": false, "units": " 3", "description": "Analysis of the effects of soil environments on microbial growth.  Relationships and significance of microbes to mineral transformations, plant development, and environmental quality.  Management of soil microorganisms in different ecosystems."}, {"summer": false, "name": "Soil Fertility and Fertilizers", "prerequisites": "Prerequisite: SSC 200", "spring": false, "number": "341", "fall": true, "units": " 3", "description": "Principles of managing plant nutrition for crop production, fertilizer materials, crop fertilization, soil fertility maintenance and management practices for optimizing fertilizer use; soil and plant tissue testing as diagnostic tools in nutrient management."}, {"summer": false, "name": "Soil Fertility Laboratory", "prerequisites": "Corequisite: SSC 341", "spring": false, "number": "342", "fall": true, "units": " 1", "description": "Soil sampling and analyses for acidity and nutrient content.  Calculating lime and fertilizer recommendations and calibrating fertilizer spreaders.  Discussion of fertilizer materials and calculation of least cost blends.   Computer programs to confirm recommendations and least cost blends.  Field trip to a fertilizer distributor and to a fertilizer user."}, {"summer": false, "name": "Role of Soils in Environmental Management", "prerequisites": "Prerequisite: SSC 200", "spring": true, "number": "361", "fall": false, "units": " 3", "description": "Importance of soils in land application of municipal, industrial and agricultural wastes; onsite disposal of domestic wastewater; bioremediation of contaminated sites; erosion and sedimentation control; farm nutrient management; and nonpoint sourcewater pollution."}, {"summer": false, "name": "Biological Approaches to Sustainable Soil Systems", "prerequisites": "Prerequisite: SSC 200 or equivalent, BIO 181 or 183, and CH 101", "spring": false, "number": "427", "fall": true, "units": " 3", "description": "Ecological and biochemical concepts will be applied to managing soils in agro-ecological settings such as organic and conventionally managed farms and gardens, emphasizing microbial transformations of nutrients and matter. Topics covered include soil organic matter formation and fractionation, decomposition, microbial assimilation of nutrients, fertilizer management, tillage, crop rotations, cover crop management. Companion course SSC 428 and SSC 341 recommended."}, {"summer": false, "name": "Service-Learning for Sustainable Soil Management in Community Gardens", "prerequisites": "Prerequisite: SSC 200 or equivalent, BIO 181 or 183, and CH 101", "spring": false, "number": "428", "fall": true, "units": " 1", "description": "Course provides students a hands-on experience in urban agriculture with under-served youth in the Raleigh area.  Students partner with a community gardening organization to provide knowledge and experience in soil science and agriculture to youth with the goals of increasing urban food security and developing student leadership skills.  Particular emphasis is places on reflecting on course activities and deepening of skills related to extension, outreach, and working with diverse populations.  Course designed to be taken as a companion course to SSC 427, however can be taken as a stand-alone course."}, {"summer": false, "name": "Geographic Information Systems in Production Agriculture", "prerequisites": "Prerequisite: SSC 200", "spring": true, "number": "440", "fall": false, "units": " 3", "description": "Fundamentals of the global positioning system, geographic information systems, and site-specific management.  Geospatially located soil sampling strategies will be addressed as well as appropriate interpolation methods for point-sampled data.  The course will cover variable rate fertilizer recommendation models and the technology necessary for variably applying fertilizer.  Spatial measurement of crop yields."}, {"summer": false, "name": "Soil and Environmental Biogeochemistry", "prerequisites": "Prerequisite: SSC 200 and (CH 101, or CH 201, or CH 220, or CH 221)", "spring": true, "number": "442", "fall": false, "units": " 3", "description": "Quantitative approaches to the cycling of elements and chemical species in soils and the environment, including carbon and organic contaminants, non-metallic macronutrients, metals and metalloids."}, {"summer": false, "name": "Soil Classification", "prerequisites": "Prerequisite: SSC 200", "spring": true, "number": "452", "fall": false, "units": " 4", "description": "Genesis, morphology, and classification of soils; characterization of soils according to their diagnostic properties; interpreting soil use potential; emphasis on North Carolina soils and their taxonomy; field exercise in soil mapping and site evaluation; several field trips, one overnight.\t\t\t\t\t\t\t\t\t"}, {"summer": false, "name": "Soil Physical Properties and Plant Growth", "prerequisites": "Prerequisite: SSC 200", "spring": false, "number": "461", "fall": true, "units": " 3", "description": "Soil physical properties and their influence on plant growth and environmentally sound land use; soil solid-porosity-density relationships, soil water, heat and air relations and transport.  Principles and applications of these topics using current literature in agronomy, turf, horticulture, water quality, waste management and urban land use."}, {"summer": false, "name": "Soil-Crop Management Systems", "prerequisites": "Prerequisite: CS 213, CS 414, SSC 342, SSC 452; senior standing", "spring": true, "number": "462", "fall": false, "units": " 3", "description": "Unites principles of soil science and crop science with those of allied areas into realistic agronomic applications; practical studies in planning and evaluation of soil and crop management systems."}, {"summer": false, "name": "Wetland Soils", "prerequisites": "Prerequisite: SSC 200, SSC 452 recommended", "spring": false, "number": "470", "fall": true, "units": " 3", "description": "Wetland definitions, concepts, functions and regulations; chemical, physical and morphological characteristics of wetland soils.  Wetland soil identification using field indicators and monitoring equipment; principles of wetland creation, restoration and mitigation.  Special project required for SSC 570.  Two mandatory field trips. Field trips for distance education students are not required but optional. Credit will not be given for both SSC 470 and SSC 570."}, {"summer": false, "name": "Senior Seminar in Crop Science and Soil Science", "prerequisites": "Prerequisite: Senior standing in Agronomy, Plant and Soil Sciences, or Turfgrass Science", "spring": true, "number": "490", "fall": false, "units": " 1", "description": "Review and discussion of current topics in crop science, soil science, agronomy and natural resource management. Preparation and presentation of scientific information in written and oral format. Senior standing in Agronomy, Plant and Soil Sciences, or Turfgrass Science."}, {"summer": false, "name": "External Learning Experience", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "492", "fall": true, "units": " 1-6", "description": "A learning experience in agriculture and life sciences within an academic framework that utilizes facilities and resources which are external to the campus. Contact and arrangements with the prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior to the experience."}, {"summer": false, "name": "Special Problems in Soil Science", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "493", "fall": true, "units": " 1-6", "description": "A learning experience in agriculture and life sciences within an academic framework that utilizes campus facilities and resources. Contact and arrangements with prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, the departmental teaching coordinator prior to the experience."}, {"summer": false, "name": "Special Topics in Soil Science", "prerequisites": "Prerequisite: SSC 200", "spring": true, "number": "495", "fall": true, "units": " 1-6", "description": "Offered as needed to present materials not normally available in regular course offerings or for offering of new courses on a trial basis."}, {"summer": "True", "name": "Soil Physics", "prerequisites": "Prerequisite: SSC 200, PY 212", "spring": "True", "number": "511", "fall": "True", "units": " 4", "description": "Soil physical properties and theory of selected instrumentation to measure them. Topics including soil solids, soil water, air and heat. Emphasis on transport processes and the energy concept of soil and water."}, {"summer": false, "name": "Soil Chemistry", "prerequisites": "Prerequisite: SSC 200, one yr. of general inorganic chemistry", "spring": true, "number": "521", "fall": false, "units": " 3", "description": "A consideration of the chemical and colloidal properties of clay and soil systems, including ion exchange and retention, soil solution reactions, solvation of clays and electrokinetic properties of clay-water systems."}, {"summer": "True", "name": "Soil Microbiology", "prerequisites": "Prerequisite: MB 351; CH 220", "spring": "True", "number": "532", "fall": "True", "units": " 4", "description": "Soil as a medium for microbial growth, the relation of microbes to important mineral transformations in soil, the importance of biological equilibrium and significance of soil microbes to environmental quality."}, {"summer": "True", "name": "Soil Fertility", "prerequisites": "Prerequisite: SSC 341", "spring": "True", "number": "541", "fall": "True", "units": " 3", "description": "Soil conditions affecting plant growth and the chemistry of soil and fertilizer interrelationships. Factors affecting the availability of nutrients. Methods of measuring nutrient availability."}, {"summer": false, "name": "Remote Sensing Applications in Soil Science and Agriculture", "prerequisites": "Prerequisite: SSC 200, PY 212", "spring": true, "number": "545", "fall": false, "units": " 3", "description": "Overview of remote sensing including history, evolution, vocabulary, and physical principles, i.e., electromagnetic radiation and its interaction with matter. Distant and proximate remote sensing techniques (aerial photography, satellite imaging, radar, lidar, etc.), hardware, and platforms and their application in the characterization and management of soils and crops. Development of strategies for incorporating remote sensing into soil and agronomic research, and of practical skills for processing, analysis, display, and discussion of remote sensing data with applications in soil science and agriculture."}, {"summer": "True", "name": "Soil Morphology, Genesis and Classification", "prerequisites": "Prerequisite: SSC 200", "spring": "True", "number": "551", "fall": "True", "units": " 3", "description": "Morphology: Chemical, physical and mineralogical parameters useful in characterizing soil. Genesis: soil-forming factors and processes. Classification: historical development and present concepts of soil taxonomy with particular reference to worldwide distribution of great soil groups as well as discussions of logical bases of soil classification."}, {"summer": "True", "name": "Environmental Applications Of Soil Science", "prerequisites": "Prerequisite: SSC 200", "spring": "True", "number": "562", "fall": "True", "units": " 3", "description": "Identification and evaluation of basic factors influencing movement of potential pollutants through soil and their underlying strata.  Development of understanding of processes of soil and site evaluation for waste disposal and transport of pollutants through soils."}, {"summer": false, "name": "Wetland Soils", "prerequisites": "Prerequisite: SSC 200, SSC 452 recommended", "spring": false, "number": "570", "fall": true, "units": " 3", "description": "Wetland definitions, concepts, functions and regulations; chemical, physical and morphological characteristics of wetland soils.  Wetland soil identification using field indicators and monitoring equipment; principles of wetland creation, restoration and mitigation.  Special project required for SSC 570.  Two mandatory field trips. Field trips for distance education students are not required but optional. Credit will not be given for both SSC 470 and SSC 570."}, {"summer": false, "name": "Introduction to Surface Hydrologic/Water Quality Modeling", "prerequisites": "Prerequisite: BAE 471, SSC 200", "spring": false, "number": "573", "fall": true, "units": " 3", "description": "Concepts in basic hydrologic, erosion and chemical transport used in modeling. Evaluation of typical hydrologic/water quality models on watershed systems. Usage of state-of-the-art models in project examples."}, {"summer": true, "name": "Special Problems", "prerequisites": "Prerequisite: SSC 200", "spring": true, "number": "590", "fall": true, "units": " 1-3", "description": "Special problems in various phases of soils. Emphasis placed on review of recent and current research. Credits Arranged"}, {"summer": false, "name": "Seminar", "prerequisites": "Prerequisite: Graduate standing in SSC", "spring": true, "number": "601", "fall": true, "units": " 1", "description": "A maximum of two semester hours allowed toward the master's degree, but any number toward the doctorate. Scientific articles, progress reports in research and special problems of interest to soil scientists reviewed and discussed."}, {"summer": false, "name": "Colloquium In Soil Science", "prerequisites": "Prerequisite: Graduate standing in SSC", "spring": true, "number": "609", "fall": true, "units": " 1-3", "description": "Seminar-type discussions and lectures on specialized and advanced topics in soil science. Credits Arranged"}, {"summer": false, "name": "Special Problems", "prerequisites": "Prerequisite: SSC 200", "spring": true, "number": "620", "fall": true, "units": " 1-3", "description": "Special problems in various phases of soils. Emphasis placed on review of recent and current research. Credits Arranged"}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "685", "fall": true, "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment and evaluate the student upon completion of the assignment."}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "688", "fall": true, "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "689", "fall": true, "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": true, "name": "Master's Exam", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "690", "fall": true, "units": " 1-6", "description": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam. Credits Arranged"}, {"summer": true, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "693", "fall": true, "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": true, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "695", "fall": true, "units": " 1-9", "description": "Thesis Research"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "696", "fall": false, "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": true, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "699", "fall": true, "units": " 1-3", "description": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis. Credits arranged"}, {"summer": false, "name": "Tropical Soils: Characteristics and Management", "prerequisites": "Corequisite: Six credits in SSC", "spring": false, "number": "701", "fall": true, "units": " 3", "description": "Characteristics of the tropical environment. Distribution and classification of tropical soils. Soil-plant relationships in the tropics. Soil management systems with emphasis on shifting cultivation, flooded rice production, subsistence farming and tropical pasture management."}, {"summer": false, "name": "Soil and Plant Analysis", "prerequisites": "Prerequisite: PY 212; CH 315; at least three soils courses including SSC 341", "spring": true, "number": "720", "fall": false, "units": " 3", "description": "Theory and advanced principles of utilization of chemical instruments to aid research on the heterogeneous systems of soils and plants."}, {"summer": false, "name": "Advanced Soil Chemistry", "prerequisites": "Prerequisite: SSC 521, CH 730", "spring": false, "number": "722", "fall": true, "units": " 3", "description": "Critical review of application of chemical thermodynamics and kinetics to under standing soil systems, solution equilibria, precipitation and dissolution, complexation, reduction-oxidation, surface-solute interactions and chemical transport. Application of chemical speciation models."}, {"summer": false, "name": "Pesticide Chemistry", "prerequisites": "Prerequisite: CH 201 and 221", "spring": true, "number": "725", "fall": false, "units": " 1", "description": "Chemical properties of pesticides including hydration and solvation, ionization, volatilization, lipophilicity, molecular structure and size, and reactivity and classification according to chemical description, mode of action or ionizability. Taughtduring the first 5 weeks of semester. Drop date is last day of 3rd week of the minicourse."}, {"summer": false, "name": "Pesticide Behavior and Fate In the Environment", "prerequisites": "Prerequisite: CS(HS,SSC,TOX) 725,SSC 200", "spring": true, "number": "727", "fall": false, "units": " 2", "description": "Sorption/desorption, soil reactivity, movement, volatilization, bioavailability, degradation and stability of pesticides in the environment. Taught during the last 10 weeks of semester. Drop date is last day of 3rd week of the minicourse."}, {"summer": false, "name": "Soil Mineralogy", "prerequisites": "Prerequisite: SSC 200, SSC 341", "spring": false, "number": "753", "fall": true, "units": " 3", "description": "Composition, structure, classification, identification, origin, occurrence and significance of soil minerals with emphasis on primary weatherable silicates, layer silicate clays and sesquioxides."}, {"summer": false, "name": "Theory Of Drainage--Saturated Flow", "spring": false, "number": "771", "fall": true, "units": " 3", "description": "Discussion of physical concepts and properties of fluids and porous media in relation to soil-water movement. Derivation and discussion of the fundamental laws and equations governing saturated flow in porous media. Analysis of mathematical solutions of steady-state and transient flow equations to determine their applicability to drainage problems. Consideration of analogs and models of particular drainage problems."}, {"summer": true, "name": "Special Topics", "spring": true, "number": "790", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Seminar", "spring": true, "number": "801", "fall": true, "units": " 1"}, {"summer": true, "name": "Colloquium In Soil Science", "prerequisites": "Prerequisite: Graduate standing in SSC", "spring": true, "number": "809", "fall": true, "units": " 1-3", "description": "Seminar-type discussions and lectures on specialized and advanced topics in soil science. Credits Arranged"}, {"summer": false, "name": "Special Problems", "prerequisites": "Prerequisite: SSC 200", "spring": true, "number": "820", "fall": true, "units": " 1-3", "description": "Special problems in various phases of soils. Emphasis placed on review of recent and current research. Credits Arranged"}, {"summer": true, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "885", "fall": true, "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": true, "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "890", "fall": true, "units": " 1-9", "description": "For students who are preparing for and taking written and/or oral preliminary exams."}, {"summer": true, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "893", "fall": true, "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graudate Faculty."}, {"summer": true, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "895", "fall": true, "units": " 1-9", "description": "Dissertation research."}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "896", "fall": false, "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": true, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "899", "fall": true, "units": " 1-3", "description": "For students who have completed all credit hour, full-time enrollment, preliminary examination and residency requirements for the doctoral degree and are writing and defending their dissertations."}]