[{"summer": false, "name": "Statistics by Example", "spring": false, "number": "101", "fall": false, "units": " 3", "description": "Sampling, experimental design, tables and graphs, relationships among variables, probability, estimation, hypothesis testing.  Real life examples from the social, physical and life sciences, the humanities and sports. Credit not allowed if student has prior credit for another ST course"}, {"summer": false, "name": "Introduction to Behavioral Research I", "prerequisites": "Prerequisite: PSY and HRD Majors, PSY 200, Corequisite: PSY (ST) 241", "spring": true, "number": "240", "fall": true, "units": " 3", "description": "Introduction to quantitative methods in psychology, including measurement, experimental control, validity, and fundamentals of research design. Discussion of distributions and statistical inference."}, {"summer": false, "name": "Introduction to Behavioral Research I Lab", "prerequisites": "Prerequisite: PSY 200, PSY and HRD Majors, Corequisite: PSY (ST) 240", "spring": true, "number": "241", "fall": true, "units": " 1", "description": "Students design, analyze and report a variety of simple experiments."}, {"summer": false, "name": "Introduction to Behavioral Research II", "prerequisites": "Prerequisite: PSY or HRD Majors, PSY (ST) 240, Corequisite: PSY (ST) 243", "spring": true, "number": "242", "fall": true, "units": " 3", "description": "Continuation of PSY (ST) 240. Ethics of Research in Psychology. Techniques for the development of research proposals. Statistical techniques for data analysis including non-parametrics, one-way and two-way ANOVA and introduction to correlation and regression."}, {"summer": false, "name": "Introduction to Behavioral Research II Lab", "prerequisites": "Prerequisite: PSY or HRD Majors, PSY (ST) 240, Corequisite: PSY (ST) 242", "spring": true, "number": "243", "fall": true, "units": " 2", "description": "Design and analysis of a major research project."}, {"summer": "True", "name": "Special Topics ST", "spring": "True", "number": "295", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Statistical Methods I", "prerequisites": "Prerequisite: MA 141 and either PAMS 100 or E 115", "spring": "True", "number": "301", "fall": "True", "units": " 3", "description": "Contemporary description and analysis of single samples of data. Graphical data presentation methods for determination of patterns and relationships among variables. Classical and robust alternative methods for single sample data summary procedures.Probability concepts, sampling, and expectations. Confidence interval and hypothesis testing for sample mean and proportion. Computer use emphasized."}, {"summer": "True", "name": "Statistical Methods II", "prerequisites": "Prerequisite: ST 301", "spring": "True", "number": "302", "fall": "True", "units": " 3", "description": "Confidence intervals and hypothesis testing with graphics in multiple samples and/or variables cases: tests for means/proportions of two independent groups, analysis of variance for completely randomized design, contingency table analysis, correlation, single and multiple linear regression; design of experiments with randomized blocks, factorial design and analysis of covariance. Computer use emphasized."}, {"summer": false, "name": "Statistical Methods", "prerequisites": "Prerequisite: MA 141 and either PAMS 100 or E 115", "spring": true, "number": "305", "fall": true, "units": " 4", "description": "Basic concepts of data collection, sampling, and experimental design. Descriptive analysis and graphical displays of data. Probability concepts, and expectations. Normal and binomial distributions. Sampling distributions and the Central Limit Theorem. Confidence intervals and hypothesis testing. Tests for means/proportions of two independent groups. One factor analysis of variance. Understanding relationships among variables; correlation and simple linear regression. Computer use is emphasized."}, {"summer": false, "name": "Introduction to Statistics", "spring": false, "number": "311", "fall": false, "units": " 3", "description": "Examining relationships between two variables using graphical techniques, simple linear regression and correlation methods. Producing data using experiment design and sampling. Elementary probability and the basic notions of statistical inference including confidence interval estimation and tests of hypothesis. One and two sample t-tests, one-way analysis of variance, inference for count data and regression. Credit not allowed if student has prior credit for another ST course or BUS 350"}, {"summer": false, "name": "Introduction to Statistics II", "prerequisites": "Prerequisite: ST 311", "spring": true, "number": "312", "fall": true, "units": " 3", "description": "A further examination of statistics and data analysis.  Inference for comparing multiple samples, experimental design, analysis of variance and post-hoc tests. Inference for correlation, simple regression, multiple regression, and curvilinear regression.  Analysis of contingency tables and categorical data. No credit for students who have credit for ST 305."}, {"summer": true, "name": "Economics and Business Statistics", "prerequisites": "Prerequisite: MA 114; College of Management Majors must have passed Software Applications Proficiency Requirement", "spring": true, "number": "350", "fall": true, "units": " 3", "description": "Introduction to statistics applied to management, accounting, and economic problems.  Emphasis on statistical estimation, inference, simple and multiple regression, and analysis of variance.  Use of computers to apply statistical methods to problems encountered in management and economics."}, {"summer": false, "name": "Data Analysis for Economists", "prerequisites": "Prerequisite: BUS/ST 350", "spring": false, "number": "351", "fall": true, "units": " 3", "description": "Tools for describing and analyzing data as used in economics.  Probability, random variables, sampling, point and interval estimation.  Hypothesis testing and regression analysis with emphasis on economic applications."}, {"summer": true, "name": "Introduction to Statistics for Engineers", "prerequisites": "Prerequisite: College algebra", "spring": true, "number": "361", "fall": true, "units": " 3", "description": "Statistical techniques useful to engineers and physical scientists. Includes elementary probability, frequency distributions, sampling variation, estimation of means and standard deviations, basic design of experiments, confidence intervals, significance tests, elementary least squares curve fitting. Credit not allowed for both ST 361 and ST 370 or ST 380"}, {"summer": false, "name": "Probability and Statistics for Engineers", "prerequisites": "Prerequisite: MA 241", "spring": true, "number": "370", "fall": true, "units": " 3", "description": "Calculus-based introduction to probability and statistics with emphasis on Monte Carlo simulation and graphical display of data on computer workstations.  Statistical methods include point and interval estimation of population parameters and curve and surface fitting (regression analysis).  The principles of experimental design and statistical process control introduced. Credit not allowed for both ST 370 and ST 361 or ST 380"}, {"summer": true, "name": "Introduction to Probability and Distribution Theory", "prerequisites": "Prerequisite: MA 241, Corequisite: MA 242", "spring": true, "number": "371", "fall": true, "units": " 3", "description": "Basic concepts of probability and distribution theory for students in the physical sciences, computer science and engineering. Provides the background necessary to begin study of statistical estimation, inference, regression analysis, and analysis of variance."}, {"summer": true, "name": "Introduction to Statistical Inference and Regression", "prerequisites": "Prerequisite: ST 371", "spring": true, "number": "372", "fall": true, "units": " 3", "description": "Statistical inference and regression analysis including theory and applications. Point and interval estimation of population parameters. Hypothesis testing including use of t, chi-square and F. Simple linear regression and correlation. Introduction to multiple regression and one-way analysis of variance."}, {"summer": false, "name": "Probability and Statistics for the Physical Sciences", "prerequisites": "Prerequisite: MA 241", "spring": true, "number": "380", "fall": true, "units": " 3", "description": "Introduction to probability models and statistics with emphasis on Monte Carlo simulation and graphical display of data on computer laboratory workstations. Statistical methods include point and interval estimation of population parameters and curveand surface fitting (regression analysis). Credit not allowed for both ST 380 and ST 361 or ST 370"}, {"summer": true, "name": "Experiences in Data Analysis", "prerequisites": "Prerequisite: Permission of Instructor and either ST 311 or ST 305", "spring": false, "number": "401", "fall": false, "units": " 4", "description": "This course will allow students to see many practical aspects of data analysis.  Each section of this course will expose students to the process of data analysis in a themed area such as biostatistics or environmental statistics.  Students will see problems of data collection and analysis  through a combination of classroom demonstrations, hands on computer activities and visits to local industries."}, {"summer": false, "name": "Long-Term Actuarial Models", "prerequisites": "Prerequisite: MA 241 or MA 231, Corequisite: MA 421, BUS(ST) 350, ST 301, ST 305, ST 311, ST 361, ST 370, ST 371, ST 380 or equivalent", "spring": false, "number": "412", "fall": true, "units": " 3", "description": "Long-term probability models for risk management systems.  Theory and applications of compound interest, probability distributions of failure time random variables, present value models of future contingent cash flows, applications to insurance, health care, credit risk, environmental risk, consumer behavior and warranties."}, {"summer": false, "name": "Short-Term Actuarial Models", "prerequisites": "Prerequisite: MA 241 or MA 231, and one of MA 421, ST 301, ST 305, ST 370, ST 371, ST 380, ST 421.", "spring": true, "number": "413", "fall": false, "units": " 3", "description": "Short-term probability models for risk management systems.  Frequency distributions, loss distributions, the individual risk model, the collective risk model, stochastic process models of solvency requirements, applications to insurance and businessdecisions."}, {"summer": false, "name": "Introduction to Mathematical Statistics I", "prerequisites": "Prerequisite: MA 242", "spring": false, "number": "421", "fall": true, "units": " 3", "description": "First of a two-semester sequence of mathematical statistics, primarily for undergraduate majors and graduate minors in Statistics.  Introduction to probability, univariate and multivariate probability distributions and their properties, distributions of functions of random variables, random samples and sampling distributions."}, {"summer": false, "name": "Introduction to Mathematical Statistics II", "prerequisites": "Prerequisite: ST 421", "spring": true, "number": "422", "fall": false, "units": " 3", "description": "Second of a two-semester sequence of mathematical statistics, primarily for undergraduate majors and graduate minors in Statistics.  Random samples, point and interval estimators and their properties, methods of moments, maximum likelihood, tests ofhypotheses, elements of nonparametric statistics and elements of general linear model theory."}, {"summer": false, "name": "Introduction to Regression Analysis", "prerequisites": "Prerequisite: (ST 302 or ST 305) and (MA 305 or MA 405)", "spring": false, "number": "430", "fall": true, "units": " 3", "description": "Regression analysis as a flexible statistical problem solving methodology. Matrix review; variable selection; prediction; multicolinearity; model diagnostics; dummy variables; logistic and non-linear regression. Emphasizes use of computer."}, {"summer": false, "name": "Introduction to Experimental Design", "prerequisites": "Prerequisite: ST 302 or ST 305", "spring": true, "number": "431", "fall": false, "units": " 3", "description": "Experimental design as a method for organizing analysis procedures. Completely randomized, randomized block, factorial, nested, latin squares, split-plot and incomplete block designs. Response surface and covariance adjustment procedures. Stresses use of computer."}, {"summer": false, "name": "Introduction to Survey Sampling", "prerequisites": "Prerequisite: ST 302 or ST 305", "spring": true, "number": "432", "fall": false, "units": " 3", "description": "Design principles pertaining to planning and execution of a sample survey. Simple random, stratified random, systematic and one- and two-stage cluster sampling designs. Emphasis on statistical considerations in analysis of sample survey data. Class project on design and execution of an actual sample survey."}, {"summer": false, "name": "Statistical Methods for Quality and Productivity Improvement", "prerequisites": "Prerequisite: ST 302 or ST 305", "spring": false, "number": "435", "fall": true, "units": " 3", "description": "Use of statistics for quality control and productivity improvement. Control chart calculations and graphing, process control and specification; sampling plans; and reliability. Computer use will be stressed for performing calculations and graphing. \t"}, {"summer": false, "name": "Introduction to Statistical Computing and Data Management", "prerequisites": "Corequisite: ST 302 or ST 305", "spring": true, "number": "445", "fall": false, "units": " 3", "description": "Use of computers to manage, process and analyze data.  Concepts of research; data management; JCL and utility programs; use of statistical program package for data analyses and graph production; and writing statistical programs to perform simulationexperiments.  Major paper required."}, {"summer": true, "name": "Special Topics in Statistics", "spring": true, "number": "495", "fall": true, "units": " 1-6", "description": "Offered as needed to present material not normally available in regular departmental course offerings, or for offering new courses on a trial basis."}, {"summer": true, "name": "Independent Study In Statistics", "prerequisites": "Prerequisite: Six hours of ST", "spring": true, "number": "498", "fall": true, "units": " 1-6", "description": "Detailed investigation of topics of particular interest to advanced undergraduates under faculty direction."}, {"summer": false, "name": "Applied Nonparametric Statistics", "prerequisites": "Prerequisite: ST 372 or ST 511", "spring": true, "number": "505", "fall": false, "units": " 3", "description": "Statistical methods requiring relatively mild assumptions about the form of the population distribution. Hypothesis testing, point and interval estimation and multiple comparison procedures for a variety of statistical problems."}, {"summer": false, "name": "Sampling Animal Populations", "prerequisites": "Prerequisite: ST 512", "spring": false, "number": "506", "fall": true, "units": " 3", "description": "Statistical methods applicable to sampling of wildlife populations, including capture-recapture, removal, change in ratio, quadrant and line transect sampling. Emphasis on model assumptions and study design."}, {"summer": false, "name": "Statistics For the Behavioral Sciences I", "spring": true, "number": "507", "fall": true, "units": " 3", "description": "A general introduction to the use of descriptive and inferential statistics in behavioral science research. Methods for describing and summarizing data presented, followed by procedures for estimating population parameters and testing hypotheses concerning summarized data."}, {"summer": false, "name": "Statistics For the Behavioral Sciences II", "prerequisites": "Prerequisite: ST 507", "spring": true, "number": "508", "fall": true, "units": " 3", "description": "Introduction to use of statistical design principles in behavioral science research. Presentation of use of a statistical model to represent structure of data collected from a designed experiment or survey study. Opportunities provided for use of a computer to perform analyses of data, to evaluate proposed statistical model and to assist in post-hoc analysis procedures. Least squares principles used to integrate topics of multiple linear regression analysis, the analysis of variance and analysis of covariance."}, {"summer": true, "name": "Experimental Statistics For Biological Sciences I", "prerequisites": "Prerequisite: ST 311 or Graduate standing", "spring": true, "number": "511", "fall": true, "units": " 3", "description": "Basic concepts of statistical models and use of samples; variation, statistical measures, distributions, tests of significance, analysis of variance and elementary experimental design, regression and correlation, chi-square."}, {"summer": true, "name": "Experimental Statistics For Biological Sciences II", "prerequisites": "Prerequisite: ST 511", "spring": true, "number": "512", "fall": true, "units": " 3", "description": "Covariance, multiple regression, curvilinear regression, concepts of experimental design, factorial experiments, confounded factorials, individual degrees of freedom and split-plot experiments. Computing laboratory addressing computational issues and use of statistical software."}, {"summer": false, "name": "Statistics for Management I", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "513", "fall": true, "units": " 3", "description": "Analysis of data to represent facts, guide decisions and test opinions in managing systems and processes.  Graphical and numerical data analysis for descriptive and predictive decisions.  Scatter plot smoothing and regression analysis.  Basic statistical inference.  Integrated use of computer."}, {"summer": false, "name": "Statistics For Management and Social Sciences II", "prerequisites": "Prerequisite: ST 507", "spring": false, "number": "514", "fall": true, "units": " 3", "description": "Linear regression, multiple regression and concepts of designed experiments in an integrated approach, principles of the design and analysis of sample surveys, use of computer for analysis of data."}, {"summer": false, "name": "Experimental Statistics for Engineers I", "prerequisites": "Prerequisite: ST 361 or Graduate standing", "spring": false, "number": "515", "fall": true, "units": " 3", "description": "General statistical concepts and techniques useful to research workers in engineering, textiles, wood technology, etc.  Probability distributions, measurement of precision, simple and multiple regression, tests of significance, analysis of variance,enumeration data and experimental design."}, {"summer": false, "name": "Experimental Statistics For Engineers II", "prerequisites": "Prerequisite: ST 515", "spring": true, "number": "516", "fall": false, "units": " 3", "description": "General statistical concepts and techniques useful to research workers in engineering, textiles, wood technology, etc. Probability distributions, measurement of precision, simple and multiple regression, tests of significance, analysis of variance, enumeration data and experimental designs."}, {"summer": false, "name": "Teaching and Learning of Statistical Thinking", "prerequisites": "Prerequisite: ST 507 or ST 511", "spring": true, "number": "519", "fall": false, "units": " 3", "description": "This course is designed to bridge theory and practice on how students develop understandings of key concepts in data analysis, statistics, and probability. Discussion of students' understandings, teaching strategies and the use of manipulatives and technology tools. Topics include distribution, measures of center and spread, sampling, sampling distribution, randomness, and law of large numbers. Must complete a first level graduate statistics course ( ST 507, ST 511, or equivalent) before enrolling."}, {"summer": false, "name": "Statistical Principles of Clinical Trials and Epidemiology", "prerequisites": "Prerequisite: ST 511, Corequisite: ST 512", "spring": false, "number": "520", "fall": true, "units": " 3", "description": "Statistical methods for design and analysis of clinical trials and epidemiological studies.  Phase I, II, and III clinical trials.  Principle of Intention-to Treat, effects of non-compliance, drop-outs.  Interim monitoring of clinical trials and data safety monitoring boards.  Introduction to meta-analysis.  Epidemiological design and methods."}, {"summer": false, "name": "Statistical Theory I", "prerequisites": "Corequisite: MA 425 or MA 511 and MA 405", "spring": false, "number": "521", "fall": true, "units": " 3", "description": "Probability tools for statistics: description of discrete and absolutely continuous distributions, expected values, moments, moment generating functions, transformation of random variables, marginal and conditional distributions, independence, orderstatistics, multivariate distributions, concept of random sample, derivation of many sampling distributions."}, {"summer": false, "name": "Statistical Theory II", "prerequisites": "Prerequisite: MA 511 or MA 425 and ST 521", "spring": true, "number": "522", "fall": false, "units": " 3", "description": "General framework for statistical inference. Point estimators: biased and unbiased, minimum variance unbiased, least mean square error, maximum likelihood and least squares, asymptotic properties. Interval estimators and tests of hypotheses: confidence intervals, power functions, Neyman-Pearson lemma, likelihood ratio tests, unbiasedness, efficiency and sufficiency."}, {"summer": false, "name": "Statistics In Plant Science", "prerequisites": "Prerequisite: ST 512", "spring": false, "number": "524", "fall": true, "units": " 3", "description": "Principles and techniques of planning, establishing and executing field and greenhouse experiments. Size, shape and orientation of plots; border effects; estimation of size of experiments for specified accuracy; subsampling plots and yields for laboratory analysis; combining data from a series of years and/or locations; rotation experiments; repeated measures data; multiple comparisons in variety trial results; selection of predictors in multiple regression; introduction to interspecies and intraspecies plant competition experiments and models."}, {"summer": false, "name": "Statistical Process Control", "prerequisites": "Prerequisite: ST 515, Students must have access to an MS-DOS PC", "spring": false, "number": "535", "fall": true, "units": " 3", "description": "Modern methods of statistical process control for graduate students with calculus-level course in engineering statistics. Classical and modern methods of SPC in framework of the Deming quality management philosophy emphasizing continuous process improvement. Orientation toward use of PC-class computers for computations."}, {"summer": false, "name": "Off-Line Quality Control", "prerequisites": "Prerequisite: ST 421 or ST 515", "spring": true, "number": "536", "fall": false, "units": " 3", "description": "Off-line quality control methods for graduate students with a calculus-level first course in engineering statistics.  About one third of lectures presentation of material from area of sampling inspection with emphasis upon using PCs for computations. Remainder of course presentation of material from design of experiments especially important in industrial applications:  factorial experiments, orthogonal arrays, Plackett-Burman plans, Box-Behnken designs, response surfaces, design optimality, variability analysis."}, {"summer": false, "name": "Probability and Stochastic Processes I", "prerequisites": "Prerequisite: MA 421 and MA 425 or MA 511", "spring": false, "number": "546", "fall": true, "units": " 3", "description": "Modern introduction to Probability Theory and Stochastic Processes.  The choice of material is motivated by applications to problems such as queueing networks, filtering and financial mathematics.  Topics include: review of discrete probability and continuous random variables, random walks, markov chains, martingales, stopping times, erodicity, conditional expectations, continuous-time Markov chains, laws of large numbers, central limit theorem and large deviations."}, {"summer": false, "name": "Linear Models and Variance Components", "prerequisites": "Prerequisite: MA 405, ST 521, Corequisite: ST 522", "spring": true, "number": "552", "fall": false, "units": " 3", "description": "Theory of estimation and testing in full and non-full rank linear models. Normal theory distributional properties. Least squares principle and the Gauss-Markoff theorem. Estimability and properties of best linear unbiased estimators. General linear hypothesis. Application of dummy variable methods to elementary classification models for balanced and unbalanced data. Analysis of covariance. Variance components estimation for balanced data."}, {"summer": false, "name": "Intermediate Econometrics", "prerequisites": "Prerequisite: ECG 700 and ST 514", "spring": true, "number": "561", "fall": false, "units": " 3", "description": "Formalization of economic hypotheses into testable relationships and application of appropriate statistical techniques. Major attention to procedures applicable for single equation stochastic models expressing microeconomic and macroeconomic relation-ships. Statistical considerations relevant in working with time series and cross sectional data in economic investigations. Survey of simultaneous equation models and the available estimation techniques."}, {"summer": true, "name": "Special Topics", "spring": true, "number": "590", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Seminar", "spring": true, "number": "601", "fall": true, "units": " 1"}, {"description": "Special topics in Statistics.", "number": "610", "name": "Topics in Stat"}, {"summer": true, "name": "Special Problems", "spring": true, "number": "620", "fall": true, "units": " 1-3", "description": "Development of techniques for specialized cases, particularly in connection with thesis and practical consulting problems."}, {"summer": true, "name": "Advanced Special Problems", "prerequisites": "Prerequisite: ST 512, ST 552", "spring": true, "number": "625", "fall": true, "units": " 1-3", "description": "Any new advance in the field of statistics which can be presented in lecture series as unique opportunities arise."}, {"summer": "True", "name": "Independent Study", "spring": "True", "number": "630", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Readings", "spring": "True", "number": "635", "fall": "True", "units": " 1-3"}, {"summer": true, "name": "Statistical Consulting", "prerequisites": "Prerequisite: ST 512 and ST 522", "spring": true, "number": "641", "fall": true, "units": " 1", "description": "Participation in regularly scheduled supervised statistical consulting sessions with faculty member and client. Consultant's report written for each session. Regularly scheduled meetings with course instructor and other student consultants to present and discuss consulting experiences."}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "685", "fall": true, "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "688", "fall": true, "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "689", "fall": true, "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": true, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "690", "fall": true, "units": " 1-6", "description": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam."}, {"summer": true, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "693", "fall": true, "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": true, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "695", "fall": true, "units": " 1-9", "description": "Thesis Research"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "696", "fall": false, "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": true, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "699", "fall": true, "units": " 1-3", "description": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis. Credits Arranged"}, {"summer": false, "name": "Nonlinear Programming", "prerequisites": "Prerequisite: OR(IE,MA) 505 and MA 425", "spring": true, "number": "706", "fall": true, "units": " 3", "description": "An advanced mathematical treatment of analytical and algorithmic aspects of finite dimensional nonlinear programming. Including an examination of structure and effectiveness of computational methods for unconstrained and constrained minimization. Special attention directed toward current research and recent developments in the field."}, {"summer": false, "name": "Applied Least Squares", "prerequisites": "Prerequisite: ST 512", "spring": false, "number": "708", "fall": true, "units": " 3", "description": "Least squares estimation and hypothesis testing procedures for linear models. Consideration of regression, analysis of variance and covariance in a unified manner. Emphasis on use of the computer to apply these techniques to experimental (including unequal cell sizes) and survey situations."}, {"summer": false, "name": "Design Of Experiments", "prerequisites": "Prerequisite: ST 512", "spring": false, "number": "711", "fall": true, "units": " 3", "description": "Review of completely randomized, randomized complete block and Latin square designs and basic concepts in the techniques of experimental design. Designs and analysis methods in factorial experiments, confounded factorials, response surface methodology, change-over design, split-plot experiments and incomplete block designs. Examples used to illustrate application and analysis of these designs."}, {"summer": false, "name": "Theory Of Sampling Applied To Survey Design", "prerequisites": "Prerequisite: ST 422, ST 512", "spring": false, "number": "715", "fall": true, "units": " 3", "description": "Principles for interpretation and design of sample surveys. Estimator biases, variances and comparative costs. Simple random sample, cluster sample, ratio estimation, stratification, varying probabilities of selection. Multi-stage, systematic and double sampling. Response errors."}, {"summer": false, "name": "Genetic Data Analysis", "prerequisites": "Prerequisite: ST 430 and GN 411", "spring": true, "number": "721", "fall": false, "units": " 3", "description": "Analysis of discrete data, illustrated with genetic data on morphological characters allozymes, restriction fragment length polymorphisms and DNA sequences. Maximum likelihood estimation, including iterative procedures. Numerical resampling. Development of statistical techniques for characterizing genetic disequilibrium and diversity. Measures of population structure and genetic distance. Construction of phylogenetic trees. Finding alignments and similarities between DNA sequences. Locating genes with markers."}, {"summer": false, "name": "Applied Time Series Analysis", "prerequisites": "Prerequisite: ST 512", "spring": false, "number": "730", "fall": true, "units": " 3", "description": "An introduction to use of statistical methods for analyzing and forecasting data observed over time. Trigonometric regression, periodogram/spectral analysis. Smoothing. Autoregressive moving average models. Regression with autocorrelated errors. Linear filters and bivariate spectral analysis. Stress on methods and applications; software implementations described and used in assignments."}, {"summer": false, "name": "Applied Multivariate Statistical Analysis", "prerequisites": "Prerequisite: ST 512", "spring": true, "number": "731", "fall": false, "units": " 3", "description": "An introduction to use of multivariate statistical methods in analysis of data collected in experiments and surveys. Topics covered including multivariate analysis of variance, discriminant analysis, canonical correlation analysis and principal components analysis. Emphasis upon use of a computer to perform multivariate statistical analysis calculations."}, {"summer": false, "name": "Applied Longitudianal Data Analysis", "prerequisites": "Prerequisite: ST 512", "spring": true, "number": "732", "fall": false, "units": " 3", "description": "Statistics methods for analysis of multivariate data, focusing on data collected in form of repeated measurements.  Multivariate normal distribution, Hotelling's T2, multivariate analysis of variance, repeated measures analysis of variance, growth curve models, mixed effects models.  Methods for analyzing multivariate data in form of counts, categorical data and binary data, emphasizing recent approaches in statistical literature."}, {"summer": false, "name": "Applied Spatial Statistics", "prerequisites": "Prerequisite: ST 512", "spring": true, "number": "733", "fall": false, "units": " 3", "description": "Graphical and quantitative description of spatial data.  Kriging, block kriging and cokriging. Common variogram models. Analysis of mean-nonstationary data by median polish and universal kriging. Spatial autoregressive models, estimation and testing. Spatial sampling procedures. Use of existing software with emphasis on analysis of real data from the environmental, geological and agricultural sciences."}, {"summer": false, "name": "Bayesian Inference and Analysis", "prerequisites": "Prerequisite: ST 522", "spring": true, "number": "740", "fall": false, "units": " 3", "description": "Introduction to Bayesian inference; specifying prior distributions; conjugate priors, summarizing posterior information, predictive distributions, hierachical models, asymptotic consistency and asymptotic normality.  Markov Chain Monte Carlo (MCMC) methods and the use of exising software(e.g., WinBUGS)."}, {"summer": false, "name": "Categorical Data Analysis", "prerequisites": "Prerequisite: ST 512 and ST 522", "spring": true, "number": "744", "fall": false, "units": " 3", "description": "Statistical models and methods for categorical responses including the analysis of contingency tables, logistic and Poisson regression, and generalized linear models.  Survey of asymptotic and exact methods and their implementation using standard statistical software."}, {"summer": false, "name": "Analysis of Survival Data", "prerequisites": "Prerequisite: ST 522", "spring": true, "number": "745", "fall": false, "units": " 3", "description": "Statistical methods for analysis of time-to-event data, with application to situations with data subject to right-censoring and staggered entry, including clinical trials.  Survival distribution and hazard rate; Kaplan-Meier estimator for survival distribution and Greenwood's formula; log-rank and weighted long-rank tests; design issues in clinical trials.  Regression models, including accelerated failure time and proportional hazards; partial likelihood; diagnostics."}, {"summer": false, "name": "Introduction To Stochastic Processes", "prerequisites": "Prerequisite: MA 405 and MA(ST) 546 or ST 521", "spring": true, "number": "746", "fall": false, "units": " 3", "description": "Markov chains and Markov processes, Poisson process, birth and death processes, queuing theory, renewal theory, stationary processes, Brownian motion."}, {"summer": false, "name": "Probability and Stochastic Processes II", "prerequisites": "Prerequisite: MA(ST) 546", "spring": true, "number": "747", "fall": false, "units": " 3", "description": "Fundamental mathematical results of probabilistic measure theory needed for advanced applications in stochastic processes.  Probability measures, sigma-algebras, random variables, Lebesgue integration, expectation and conditional expectations w.r.t.sigma algebras, characteristic functions, notions of convergence of sequences of random variables, weak convergence of measures, Gaussian systems, Poisson processes, mixing properties, discrete-time martingales, continuous-time markov chains."}, {"summer": false, "name": "Stochastic Differential Equations", "prerequisites": "Prerequisite: MA(ST) 747", "spring": false, "number": "748", "fall": true, "units": " 3", "description": "Theory of stochastic differential equations driven by Drownian motions.  Current techniques in filtering and financial mathematics.  Construction and properties of Brownian motion, wiener measure, Ito's integrals, martingale representation theorem, stochastic differential equations and diffusion processes, Girsanov's theorem, relation to partial differential equations, the Feynman-Kac formula."}, {"summer": false, "name": "Introduction to Econometric Methods", "prerequisites": "Prerequisite: ST 421; Corequisite: ST 422", "spring": true, "number": "750", "fall": false, "units": " 3", "description": "Introduction to principles of estimation of linear regression models, such as ordinary least squares and generalized least squares.  Extensions to time series and panel data.  Consideration of endogeneity and instrumental variables estimation.  Limited dependent variable and sample selection models.  Attention to implementation of econometric methods using a statistical package and microeconomic and macroeconomic data sets."}, {"summer": false, "name": "Econometric Methods", "prerequisites": "Prerequisite: ST 421, ST 422", "spring": false, "number": "751", "fall": true, "units": " 3", "description": "Introduction to important econometric methods of estimation such as Least Squares, instrumentatl Variables, Maximum Likelihood, and Generalized Method of Moments and their application to the estimation of linear models for cross-sectional ecomomic data. Discussion of important concepts in the asymptotic statistical analysis of vector process with application to the inference procedures based on the aforementioned estimation methods."}, {"summer": false, "name": "Time Series Econometrics", "prerequisites": "Prerequisite: ECG(ST) 751", "spring": true, "number": "752", "fall": false, "units": " 3", "description": "The characteristics of macroeconomic and financial time series data. Discussion of stationarity and non-stationarity as they relate to economic time series. Linear models for stationary economic time series: autoregressive moving average (ARMA) models; vector autoregressive (VAR) models. Linear models for nonstationary data: deterministic and stochastic trends; cointegration. Methods for capturing volatility of financial time series such as autoregressive conditional heteroscedasticity (ARCH) models. Generalized Method of Moments estimation of nonlinear dynamic models."}, {"summer": false, "name": "Microeconometrics", "prerequisites": "Prerequisite: ECG 751", "spring": true, "number": "753", "fall": false, "units": " 3", "description": "The characteristics of microeconomic data. Limited dependent variable models for cross-sectional microeconomic data: logit/probit models; tobit models; methods for accounting for sample selection; count data models; duration analysis; non-parametricmethods. Panel data models: balanced and unbalanced panels; fixed and random effects; dynamic panel data models; limited dependent variables and panel data analysis."}, {"summer": false, "name": "Advanced Analysis Of Variance and Variance Components", "prerequisites": "Prerequisite: ST 512, ST 552", "spring": true, "number": "755", "fall": false, "units": " 3", "description": "Expected mean squares, exact and approximate tests of hypotheses for balanced and unbalanced data sets. Fixed, mixed and random models. Randomization theory. Estimation of variance components using regression, MINQUE and general quadratic unbiased estimation theory."}, {"summer": false, "name": "Computational Molecular Evolution", "prerequisites": "Prerequisite: GN 411 and ST 511", "spring": false, "number": "756", "fall": true, "units": " 3", "description": "Phylogenetic analyses of nucleotide and protein sequence data.  Sequence alignment, phylogeny reconstruction and relevant computer software.  Prediction of protein secondary structure, database searching, bioinformatics and related topics.  Project required."}, {"summer": false, "name": "Statistics for Molecular Quantitative Genetics", "prerequisites": "Prerequisite: ST 512 and GN 703 or ST 721", "spring": false, "number": "757", "fall": true, "units": " 3", "description": "Genetic mapping data.  Linkage map reconstruction, quantitative genetical models.  Statistical methods and computer programs for mapping quantitative trait loci and estimating genetic architecture of quantitative traits."}, {"summer": false, "name": "Computation for Statistical Research", "prerequisites": "Prerequisite: ST 522 and ST 552", "spring": false, "number": "758", "fall": true, "units": " 3", "description": "Computational tools for research in statistics, including applications of numerical linear algebra, optimization and random number generation, using the statistical language R. A project encompassing a simulation experiment will be required."}, {"summer": false, "name": "Nonlinear Statistical Models for Univariate and Multivariate Response", "prerequisites": "Prerequisite: ST 512, ST 552", "spring": false, "number": "762", "fall": true, "units": " 3", "description": "Inference for general nonlinear parametric statistical models for univariate and multivariate continuous and discrete response, including generalized linear models, nonlinear models with nonconstant variance, and generalized estimating equation procedures for multivariate response, including repeated measurement data.  Linear and quadratic estimating equations, models for covariance structure, effects of model misspecification and robustness. Survey of major theoretical results and implementation using standard statistical software."}, {"summer": false, "name": "Biomathematics I", "prerequisites": "Prerequisite: Advanced calculus, reasonable background in biology", "spring": false, "number": "771", "fall": true, "units": " 3", "description": "Role of theory construction and model building in development of experimental science. Historical development of mathematical theories and models for growth of one-species populations (logistic and off-shoots), including considerations of age distributions (matrix models, Leslie and Lopez; continuous theory, renewal equation). Some of the more elementary theories on the growth of organisms (von Bertalanffy and others; allometric theories; cultures grown in a chemostat). Mathematical theories oftwo and more species systems (predator-prey, competition, symbosis; leading up to present-day research) and discussion of some similar models for chemical kinetics. Much emphasis on scrutiny of biological concepts as well as of mathematical structureof models in order to uncover both weak and strong points of models discussed. Mathematical treatment of differential equations in models stressing qualitative and graphical aspects, as well as certain aspects of discretization. Difference equation models."}, {"summer": false, "name": "Biomathematics II", "prerequisites": "Prerequisite: BMA 771, elementary probability theory", "spring": true, "number": "772", "fall": false, "units": " 3", "description": "Continuation of topics of BMA 771. Some more advanced mathematical techniques concerning nonlinear differential equations of types encountered in BMA 771: several concepts of stability, asymptotic directions, Liapunov functions; different time-scales. Comparison of deterministic and stochastic models for several biological problems including birth and death processes. Discussion of various other applications of mathematics to biology, some recent research."}, {"summer": false, "name": "Stochastic Modeling", "prerequisites": "Prerequisite: BMA 772 or ST (MA) 746", "spring": true, "number": "773", "fall": false, "units": " 3", "description": "Survey of modeling approaches and analysis methods for data from continuous state random processes. Emphasis on differential and difference equations with noisy input. Doob-Meyer decomposition of process into its signal and noise components. Examples from biological and physical sciences, and engineering. Student project."}, {"summer": false, "name": "Measure Theory and Advanced Probability", "prerequisites": "Prerequisite: MA 426; ST 521 or MA(ST) 546", "spring": true, "number": "778", "fall": true, "units": " 3", "description": "Modern measure and integration theory in abstract spaces. Probability measures, random variables, expectations. Distributions and characteristic functions. Modes of convergence. Independence, zero-one laws, laws of large numbers, three-series theorem. Central limit problem. Conditional expectations, martingales and martingale convergence theorems."}, {"summer": false, "name": "Advanced Probability", "prerequisites": "Prerequisite: MA 425 and ST 521.", "spring": false, "number": "779", "fall": true, "units": " 3", "description": "Sets and classes, sigma-fields and related structures, probability measures and extensions, random variables, expectation and integration, uniform integrability, inequalities, L_p-spaces, product spaces, independence, zero-one laws, convergence notions, characteristic functions, simplest limit theorems, absolute continuity, conditional expectation and conditional probabilities, martingales."}, {"summer": false, "name": "Time Series Analysis: Time Domain", "prerequisites": "Prerequisite: ST 512 and ST 522", "spring": true, "number": "782", "fall": false, "units": " 3", "description": "Estimation inference for coefficients in autoregressive, moving average and mixed models and large sample. Distribution theory for autocovariances and their use in identification of time series models. Stationarity and seasonality. Extensions of theory and methods to multiple series including vector autoregressions, transfer function models, regression with time series errors, state space modelin"}, {"summer": false, "name": "Time Series Analysis: Frequency Domain", "prerequisites": "Prerequisite: ST 512 and ST 522", "spring": true, "number": "783", "fall": false, "units": " 3", "description": "Theory and methods of time series analysis from frequency point of view. Harmonic analysis, complex demodulation and spectrum estimation. Frequency domain structure of stationary time series and space-time processes. Sampling distributions of commonly used statistics."}, {"summer": false, "name": "Multivariate Analysis", "prerequisites": "Prerequisite: ST 522", "spring": true, "number": "784", "fall": false, "units": " 3", "description": "Survey of multivariate statistical theory. Multivariate distributions including the multinormal, Wishart, Hotelling's T, Fisher-Roy-Hsu, Wilks'   and multivariate Beta distributions. Applications of maximum likelihood estimation, likelihood ratio testing and the union-intersection principle. Development of the theory of Hotelling's T tests and confidence sets, discriminant analysis, canonical correlation, multivariate analysis of variance and principal components."}, {"summer": true, "name": "Advanced Special Topics", "spring": true, "number": "790", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Advanced Statistical Inference", "prerequisites": "Prerequisite: ST 522", "spring": true, "number": "793", "fall": false, "units": " 3", "description": "Statistical inference with emphasis on the use of statistical models, construction and use of likelihoods, general estimating equations, and large sample methods.  Includes introduction to Bayesian statistics and the jackknife and bootstrap."}, {"summer": false, "name": "Advanced Statistical Inference II", "prerequisites": "Prerequisite: ST 778 and 793", "spring": true, "number": "794", "fall": false, "units": " 3", "description": "Principles of inference including introduction to Bayesian inference. Optimality results for regular estimation and hypothesis testing situations. Asymptotic results for estimators and tests based on likelihoods, general estimating equations and resampling plans."}, {"summer": true, "name": "Seminar", "spring": true, "number": "801", "fall": true, "units": " 1"}, {"summer": false, "name": "Advanced Topics in Statistics", "spring": true, "number": "810", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Special Problems", "spring": true, "number": "820", "fall": true, "units": " 1-3", "description": "Development of techniques for specialized cases, particularly in connection with thesis and practical consulting problems."}, {"summer": true, "name": "Advanced Special Problems", "prerequisites": "Prerequisite: ST 512, ST 552", "spring": true, "number": "825", "fall": true, "units": " 1-3", "description": "Any new advance in the field of statistics which can be presented in lecture series as unique opportunities arise."}, {"summer": false, "name": "Independent Study", "spring": true, "number": "830", "fall": true, "units": " 1-3"}, {"summer": "True", "name": "Readings", "spring": "True", "number": "835", "fall": "True", "units": " 1-3"}, {"summer": true, "name": "Statistical Consulting", "prerequisites": "Prerequisite: ST 512 and ST 522", "spring": true, "number": "841", "fall": true, "units": " 1", "description": "Participation in regularly scheduled supervised statistical consulting sessions with faculty member and client. Consultant's report written for each session. Regularly scheduled meetings with course instructor and other student consultants to present and discuss consulting experiences."}, {"summer": true, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "885", "fall": true, "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planing for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": true, "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "890", "fall": true, "units": " 1-9", "description": "For students who are preparing for and taking written and/or oral preliminary exams."}, {"summer": true, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "893", "fall": true, "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": true, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "895", "fall": true, "units": " 1-9", "description": "Dissertation Research"}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "896", "fall": false, "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": true, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "899", "fall": true, "units": " 1-3", "description": "For students who have completed all credit hour requirements, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations."}]