[{"summer": "True", "name": "Women and Gender in Science and Technology", "spring": "True", "number": "210", "fall": "True", "units": " 3", "description": "Interdisciplinary introduction to the reciprocal relationships between scientific/technological research and contemporary understanding of gender.  Special emphasis on social factors influencing scientists and engineers in their professions."}, {"summer": "True", "name": "Introduction to Science, Technology, and Society", "spring": "True", "number": "214", "fall": "True", "units": " 3", "description": "Introduction to the field of Science, Technology, and Society (STS), including most important STS scholars, major schools of thought, and important theoretical and empirical issues in STS."}, {"summer": "True", "name": "Technology in the Arts", "spring": "True", "number": "257", "fall": "True", "units": " 3", "description": "The interaction between technology and the arts with an emphasis on developments in Western art of the twentieth century.  Historical and emerging issues include: sound and film recordings, the addition of sound to films, the impact of films and television on theater, the impact of radio, computer applications to music, the visual arts, and literature."}, {"summer": "True", "name": "Science and Civilization", "prerequisites": "Prerequisite: Sophomore standing", "spring": "True", "number": "301", "fall": "True", "units": " 3", "description": "An inquiry into the scientific achievement and cultural impact of three different, but interrelated, models (or paradigms) of understanding the world and man's place in it; the Ancient-Medieval model of Aristotle, Ptolemy and Aquinas; the 17th century model of Newtonian physics; and the emerging, but fragmentary, 20th century model based upon the new physics of Einstein, Planck and Heisenberg."}, {"summer": "True", "name": "Contemporary Science, Technology and Human Values", "prerequisites": "Prerequisite: Sophomore standing", "spring": "True", "number": "302", "fall": "True", "units": " 3", "description": "Interdisciplinary evaluation of recent and potential influences of current scientific and technological developments on society. Emerging social, ethical, and intellectual issues include: The adequacy of contemporary scientific frameworks; the relations among science, technology, and society; the social consequences of scientific and technological applications, and human prospects and possibilities."}, {"summer": "True", "name": "Ethical Dimensions of Progress", "spring": "True", "number": "304", "fall": "True", "units": " 3", "description": "Multidisciplinary examination of traditional western notion of progress, focusing on ethical issues raised by concept of progress, and connections between science, technology and society.  Places relationships such as engineering and social responsibility within the context of present day redefinitions of the notion of progress."}, {"summer": "True", "name": "Technological Catastrophes", "prerequisites": "Prerequisite: Sophomore standing", "spring": "True", "number": "322", "fall": "True", "units": " 3", "description": "Interdisciplinary examination of the human, organizational and technical factors contributing to the causes and impacts of recent technological accidents such as the Bhopal chemical leak, the space shuttle Challenger explosion, the Chernobyl nuclear accident, and the Exxon Valdez oil spill.  Evaluation of risk assessment, risk perception and risk communication strategies.  Consideration of options for living with complex technological systems."}, {"summer": "True", "name": "World Population and Food Prospects", "spring": "True", "number": "323", "fall": "True", "units": " 3", "description": "Examination of the dynamics of population size and food needs, production, distribution and utilization. Consequences of inadequate nutrition and food choices, efforts to increase the compatibility of effective food production systems and alternate crops and cropping systems examined."}, {"summer": "True", "name": "Bio-Medical Ethics", "spring": "True", "number": "325", "fall": "True", "units": " 3", "description": "Interdisciplinary examination and appraisal of emerging ethical and social issues resulting from recent advances in the biological and medical sciences. Abortion, euthanasia, physician-assisted suicide, compromised infants, aids, reproductive technologies, and health care. Focus on factual details and value questions, fact-value questions, fact-value interplay, and questions of impact assessment and policy formulation."}, {"summer": "True", "name": "Technology Assessment", "spring": "True", "number": "326", "fall": "True", "units": " 3", "description": "Impacts of technologies as they are applied in society. Description and forecasting of effects, interactions, and potential irreversibilities."}, {"summer": "True", "name": "Peace and War in the Nuclear Age", "spring": "True", "number": "402", "fall": "True", "units": " 3", "description": "An interdisciplinary examination of contemporary wars and international conflict, arms, races, nuclear strategy and defense policy, arms control, theories and strategies of peace."}, {"summer": "True", "name": "Seminar in Science, technology, and Society", "prerequisites": "Prerequisite: STS 214, STS or STB Majors", "spring": "True", "number": "403", "fall": "True", "units": " 3", "description": "Capstone course for the Science, Technology, and Society (STS) major. Review of the principal theoretical and empirical issues of the field. Research project focused on each student's STS specialty."}, {"summer": "True", "name": "Technology and American Culture", "spring": "True", "number": "405", "fall": "True", "units": " 3", "description": "An interdisciplinary study of the role of technology in American culture which examines the ideological, political, social, economic, and institutional contexts of technological change from the 1760's to the present, and explores the cultural impacts of new technological systems."}, {"summer": "True", "name": "Darwinism and Christianity", "prerequisites": "Prerequisite: One course in religious studies, biological sciences, philosophy of science, or history of science", "spring": "True", "number": "471", "fall": "True", "units": " 3", "description": "Evolutionary biology and Christianity. Darwin's evolutionary theory; neo-Darwinism; conflicts between evolutionary theory and Christian thought; methodological parallels and differences between science and religion; proposals for divine action in anevolutionary world."}, {"summer": "True", "name": "Cross Cultural Technology Transfer", "spring": "True", "number": "484", "fall": "True", "units": " 3", "description": "Technology transfer into cultures with different values and traditions.  Special attention to the role of local and international organizations and to gender and environmental concerns.  Case studies: crop science, water, energy, forest resources, banking, information technology"}, {"summer": "True", "name": "Issues in Science, Technology, and Society", "prerequisites": "Prerequisite: Junior standing.", "spring": "True", "number": "490", "fall": "True", "units": " 3", "description": "Examination of a significant issue, method, or historical episode in the area of science, technology, and society."}, {"summer": "True", "name": "Independent Study in Science, Technology, and Society", "spring": "True", "number": "491", "fall": "True", "units": " 3", "description": "Independent investigation and discussion of a selected topic in science, technology, and society."}, {"summer": "True", "name": "Darwinism and Christianity", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "571", "fall": "True", "units": " 3", "description": "Evolutionary biology and Christianity.  Darwin's evolutionary theory; neo-Darwinism; conflicts between evolutionary theory and Christian thought; methodological parallels and differences between science and religion; proposals for divine action in an evolutionary world."}]