[{"summer": "True", "name": "Community Social Services", "spring": "True", "number": "201", "fall": "True", "units": " 4", "description": "This course, the basis for all other social work courses, provides an introduction to generalist practice and an overview of social work practice in a variety of settings. Successful completion of this course is a prerequisite for all advanced SW courses. This course is designed to acquaint students with social services typical of most American communities: what they are, who uses them, their impact, who pays for them, and who works in them. 40-hour pre-professional placement  required, intern liability insurance required. Transportation to and from agency and/or community settings is the responsibility of the student."}, {"summer": "True", "name": "The Development of Social Welfare and Social Work in the U.S.", "spring": "True", "number": "290", "fall": "True", "units": " 3", "description": "This course reviews the major policy and program developments in American social welfare and the emergence and development of professional social work. Emphasis will be on the socio-cultural context of policy and programs, and the ideas and ideals that shape social welfare. In addition, the basic elements of social policy development will be considered. This course provides the history, mission, philosophy, and evolution of social welfare policies and services that form the foundation of social welfare, particularly as they relate to poverty, racism, and efforts to address the needs of oppressed and marginalized populations."}, {"summer": "True", "name": "Research Methods in Social Work", "prerequisites": "Prerequisite: Social Work Majors or Social Work Minors, ST 311", "spring": "True", "number": "300", "fall": "True", "units": " 3", "description": "Course provides an overview of the principles and methods of basic social work research. Substantive research knowledge, quantitative and qualitative research methodology are highlighted. Research ethics within the context of social work purposes and values are emphasized. Course exposes students to how high quality research in social work is designed and conducted and how it can assist in making important decisions about the design and implementation of projects, programs, and policies that address the social needs of diverse groups."}, {"summer": "True", "name": "Social Welfare Policy: Analysis and Advocacy", "prerequisites": "Prerequisite: SW 290", "spring": "True", "number": "307", "fall": "True", "units": " 3", "description": "Course enables students to understand the processes by which social welfare policies are developed and implemented as well as the ways in which people can intervene to affect these processes. Students have the opportunity to review recent developments in national and state social welfare policies and programs in major areas such as poverty, welfare, social security , housing, health and mental health care, and child welfare. The course focuses on the development of students' policy analysis and advocacy skills."}, {"summer": "True", "name": "Human Behavior Theory for Social Work Practice", "prerequisites": "Prerequisite: SW 201", "spring": "True", "number": "310", "fall": "True", "units": " 3", "description": "Designed to introduce theory regarding human life/development for students intending to practice social work. Students learn to recognize ways in which diversity characterizes and shapes the human experience and is critical to the formation of identity, the extent to which a culture's structures and values may oppress, marginalize, alienate, create or enhance privilege and power. Course surveys major theoretical frameworks and normative developmental variations. Students learn to apply these theories and knowledge from the liberal arts to understand biological, psychological, social, cultural, and spiritual development. Transportation to and from agency and/or community setting is the responsibility of the student."}, {"summer": "True", "name": "Multicultural Social Work", "spring": "True", "number": "312", "fall": "True", "units": " 3", "description": "Course prepares students to work with diverse groups of people locally and globally defined by gender, ethnicity, race, national origin, sexual orientation, income, physical and mental ability, age and religion. Emphasis is placed on defining and developing skills for culturally competent social work generalist practice with these populations through students' self-examination, experiential learning, and critical reading of class material. This course helps students develop competencies in critical self-reflection, multicultural values and ethics, knowledge, awareness and skills in a variety of ways so that they can work against manifestations of social injustice. Students are expected to provide their own transportation as needed."}, {"summer": "True", "name": "Social Work Practice I", "prerequisites": "Corequisite: Social Work Majors, and a prerequisite or corequisite of SW 310", "spring": "True", "number": "320", "fall": "True", "units": " 4", "description": "First of a three-course sequence. Practice I presents the generalist social work practice method and focuses on interviewing skills, engaging clients in the helping process, and integrating theory and social work practice. It addresses ethical and professional standards and emphasizes understanding and applying systems and ecological frameworks to practice situations. It examines strengths-based assessment, the phases of the helping relationship, and the dynamics of change in interpersonal helping relationships, within a framework of human rights, social justice, and diversity. 40-hour preprofessional placement required; intern liability insurance required. Transportation to and from agency and/or community settings is the student's responsibility."}, {"summer": "True", "name": "Social Work Practice II", "prerequisites": "Prerequisite: Social Work Majors, SW 320, Corequisite: SW 480/SW 408", "spring": "True", "number": "405", "fall": "True", "units": " 4", "description": "Second of a three-course sequence (Practice I, II, and III). Practice II examines generalist social work roles and techniques with families and groups. Building on the foundation interviewing and engagement skills presented in Practice I, it focuses on assessment, planning, and intervention with individuals, families and small groups within a framework of human rights, social justice, and diversity. 40-hour preprofessional placement is required, intern liability insurance is required. Transportation to and from agency and/or community settings is the student's responsibility."}, {"summer": "True", "name": "Social Work Practice III", "prerequisites": "Prerequisite: Social Work Majors, SW 320, Corequisite: SW 405, SW 480", "spring": "True", "number": "408", "fall": "True", "units": " 3", "description": "Course prepares students for practice will organizations, communities, policy structures, and institutions that are viewed as both tools and targets for change efforts. Course emphasizes multiculturalism, diversity, and social justice in relation to social systems. It is designed to provide social work practitioners with the means to help organizations and communities empower themselves to make change through networking, political participation, leadership development, mobilization, utilization of resources, and other strategies and techniques. Transportation to and/or from community settings is the responsibility of the student."}, {"summer": "True", "name": "Social Work in Schools", "prerequisites": "Prerequisite: Nine credits in Social Work courses, including SW 320", "spring": "True", "number": "412", "fall": "True", "units": " 3", "description": "Models and roles relevant to school social work practice. Cooperative work with school personnel in the identification, prevention and treatment of social, emotional and behavioral problems of children and interventive techniques with parents and community groups. For individuals preparing for social work practice in the public schools and for school social workers seeking licensure."}, {"summer": "True", "name": "African American Families: History, Tradition, and Community", "prerequisites": "Prerequisite: Sophomore standing", "spring": "True", "number": "413", "fall": "True", "units": " 3", "description": "Characteristics, traditions, history and strengths of African American families and their relationship to other social institutions, social advocacy and social policy development.  African-centered worldview and relevant theory pertaining to best practice with African American families."}, {"summer": "True", "name": "Child Welfare", "prerequisites": "Prerequisite: SW 201", "spring": "True", "number": "415", "fall": "True", "units": " 3", "description": "Generalist perspective on the practice of public child welfare. History of child welfare, practices in child welfare, and current trends in child welfare programs. Skills needed to practice in child protective services, adoption, and foster care with specific attention to the North Carolina child welfare system. Application of cultural diversity and cultural competency integrated throughout as it relates to child welfare issues."}, {"summer": "True", "name": "Addiction Recovery and Social Work Practice", "prerequisites": "Prerequisite: SW 310", "spring": "True", "number": "416", "fall": "True", "units": " 3", "description": "Knowledge and skills in identifying Alcohol and Other Drugs (AOD) problems, screening, assessment, intervention, referral, and prevention: history of AOD problems and treatment, AOD classification, effects and signs/symptoms of AOD, models of addiction, diversity, assessment, diagnosis, intervention, treatment modalities, mutual-help groups, family dynamics, prevention, and ethical considerations. Students cannot receive credit for both SW 416 and SW 516"}, {"summer": "True", "name": "Social Work and Aging", "spring": "True", "number": "417", "fall": "True", "units": " 3", "description": "Physical, psychological, social, and cultural theories of the aging process as it relates to social work practice, social policy, and services for working with older adults and their families. Emphasis on  mental and physical well-being, diversity, social and economic justice,  intergenerational issues, policy and programs. Credit is not allowed for both SW 417 and SW 517"}, {"summer": "True", "name": "Child Welfare Seminar", "prerequisites": "Prerequisite: Students are Participants in the NC Child Welfare Education Collaborative Program", "spring": "True", "number": "418", "fall": "True", "units": " 1", "description": "Best practice seminar for participants in the NC Child Welfare Education Collaborative Program. Seminars focus on current issues in child welfare practice and policy. Topics vary from semester to semester. Students arrange own transportation for occasional field trips to community agencies."}, {"summer": "True", "name": "The Legal Aspects of Social Work", "prerequisites": "Prerequisite: Social Work Majors and Social Work Minors", "spring": "True", "number": "420", "fall": "True", "units": " 3", "description": "Legal environment of the social work profession. Relationships among legal processes, the delivery of social work services and client problems."}, {"summer": "True", "name": "International Learning Experience in Social Work", "spring": "True", "number": "440", "fall": "True", "units": " 6", "description": "A seven week learning experience in Guatemala. Through this course, the student will develop a global perspective of social welfare and social work practice, will learn about the people and culture of the Lake Atitlan area of Guatemala, will learn the variety of resources available in response to social need, and will enhance or develop Spanish language competence. All costs associated with learning opportunities and activities for this course are included in the cost of the program."}, {"summer": "True", "name": "Preparation for Field Work", "prerequisites": "Prerequisite: Social Work Majors, SW 320, Corequisite: SW 405, SW 408", "spring": "True", "number": "480", "fall": "True", "units": " 1", "description": "Introduction to aspects of field placement process and necessary skills for a successful internship.  Application, interview, ethical practice, documentation, supervision and learning contract."}, {"summer": "True", "name": "Field Work in Social Services", "prerequisites": "Prerequisite: Social Work Majors, SW 405, SW 408, SW 480", "spring": "True", "number": "490", "fall": "True", "units": " 12", "description": "Supervised placement in a social service organization; demonstration of CSWE core competencies and professional practice behaviors. Weekly integrative seminar.  Intern liability insurance required. Students are expected to provide their own transportation to the internship site."}, {"summer": "True", "name": "Special Topics in Social Work", "spring": "True", "number": "495", "fall": "True", "units": " 3", "description": "Detailed investigation of a topic in social work.  Topic and mode of study determined by faculty member."}, {"summer": "True", "name": "Independent Studies in Social Work", "prerequisites": "Prerequisite: Junior standing or Senior standing, Social Work Majors or Social Work Minor, Nine credits in social work courses", "spring": "True", "number": "498", "fall": "True", "units": " 1-6", "description": "Independent or small group study of a social work practice or social welfare area."}, {"summer": "True", "name": "Advanced Standing Seminar", "prerequisites": "Corequisite: SW 505", "spring": "True", "number": "500", "fall": "True", "units": " 4", "description": "Orients advanced standing students to the Department and the MSW Program; provides connection between the BSW curriculum and advanced MSW curriculum; assures attainment of CSWE Foundation Curriculum Competencies; provides opportunities to demonstrate/evaluate practice skills of engagement, assessment, intervention, and evaluation; assists students with successful entry into advanced MSW program of study and advanced field placement. For graduate students in the advanced standing program."}, {"summer": "True", "name": "Social Work Policy, Services and Programs", "prerequisites": "Prerequisite: Students must be enrolled in the Master of Social Work program", "spring": "True", "number": "501", "fall": "True", "units": " 3", "description": "Provides students with an understanding of and critical perspective on the development of social systems, social policy and the profession of Social Work in the United States. Examination of the history, mission, philosophy, and evolution of social welfare polices and services that form the foundation of social welfare, particularly as they relate to poverty, racism, and efforts to address the needs of oppresses and marginalized populations."}, {"summer": "True", "name": "Social Welfare Planning and Analysis", "prerequisites": "Prerequisite: Master of Social Work SW 501", "spring": "True", "number": "502", "fall": "True", "units": " 3", "description": "Reviews a range of frameworks for analyzing social policy. Highlights the relationships among social problems, policies and programs, and social work practice. Addresses issues of social and economic justice and explores the values and ethical choices involved in various approaches to social welfare policy."}, {"summer": "True", "name": "Human Behavior and the Social Environment: Social Justice", "prerequisites": "Prerequisite: Students must be enrolled in the Master of Social Work program", "spring": "True", "number": "505", "fall": "True", "units": " 3", "description": "Theoretical and experiential knowledge related to oppression, privilege, and social and economic justice. Particular attention is given to persons and groups most affected by oppression and mechanisms that advance the achievement of a more just society."}, {"summer": "True", "name": "Human Behavior and the Social Environment: Individuals, Families, and Groups", "spring": "True", "number": "506", "fall": "True", "units": " 3", "description": "An overview of normative individual and family development trajectories through the life cycle and survey of major theoretical frameworks and normative development variations: Theories of individual, familial, and group interaction and ways that informal groupings and support networks function to maintain individual and family well-being and stability. Admission to the MSW program or permission of the instructor."}, {"summer": "True", "name": "Human Behavior and the Social Environment: Organizations and Communities", "prerequisites": "Prerequisite: Students must be enrolled in the Master of Social Work program", "spring": "True", "number": "507", "fall": "True", "units": " 3", "description": "Theories and models for understanding human service organizations and communities. Emphasis on communication and collaboration with diverse task groups, organizations, and communities."}, {"summer": "True", "name": "Research Methods for Social Work", "prerequisites": "Prerequisite: ST 311", "spring": "True", "number": "510", "fall": "True", "units": " 3", "description": "Social work research methods, interpretation of empirical research findings within the context of social work practice. Major activities include 1)identification of the steps of the research process, 2)utilization of mixed methodologies, 3)assessment of empirical research studies, and 4)discussion of human diversity and ethical issues in research design and implementation. Admission to the MSW Program and ST 311 or equivalent."}, {"summer": "True", "name": "Evaluation of Social Work Interventions", "prerequisites": "Prerequisite: SW 510", "spring": "True", "number": "511", "fall": "True", "units": " 3", "description": "Evaluating social work practice and health and human services.  Prepares students for designing a study relevant to social work goals and meeting professional ethics, collecting and analyzing qualitative and quantitative data, and presenting findings to diverse stakeholders.  Master of Social Work required."}, {"summer": "True", "name": "Evaluation of a Social Work Intervention", "prerequisites": "Prerequisite: SW 510", "spring": "True", "number": "512", "fall": "True", "units": " 2", "description": "Second of three courses in social work research. Evaluating social work practice and health and human services programs within different research paradigms. Prepares students for collecting, analyzing, and reporting qualitative and quantitative data; includes laboratory experience. Restricted to students who have completed all foundation courses in the MSW program."}, {"summer": "True", "name": "Child Welfare", "spring": "True", "number": "515", "fall": "True", "units": " 3", "description": "Generalist perspective on the practice of public child welfare. History of child welfare, practices in child welfare, and current trends in child welfare programs. Skills needed to practice in child protective services, adoption, and foster care with specific attention to the North Carolina child welfare system. Application of cultural diversity and cultural competency integrated throughout as it relates to child welfare issues. Credit is not allowed for both SW 415 and SW 515."}, {"summer": "True", "name": "Addiction Recovery and Social Work Practice", "spring": "True", "number": "516", "fall": "True", "units": " 3", "description": "Knkowledge and skills in identifying Alcohol and Other Drugs (AOD) problems, screening, assessment, intervention, referral, and prevention: history of AOD problems and treatment, AOD classification, effects and signs/symptoms of AOD, models of addiction, diversity, assessment, diagnosis, intervention, treatment modalities, mutual-help groups, family dynamics, prevention, and ethical considerations. Credit is not allowed for both SW 416 and SW 516"}, {"summer": "True", "name": "Social Work and Aging", "spring": "True", "number": "517", "fall": "True", "units": " 3", "description": "Physical, psychological, social, and cultural theories of the aging process as it relates to social work practice, social policy, and services for working with older adults and their families. Emphasis on mental and physical well-being, diversity, social and economic justice, intergenerational issues, policy and programs. Credit is not allowed for both SW 417 and SW 517."}, {"summer": "True", "name": "SW Generalist Practice I", "prerequisites": "Corequisite: SW 651", "spring": "True", "number": "520", "fall": "True", "units": " 3", "description": "Provides the foundation knowledge and skills needed to engage and assess individuals, families and groups. Examines underlying theories and models of research-informed practice and evidence-based social work interventions with particular emphasis on the ecological systems model from a strengths perspective. Presents the phases and dynamics of change in interpersonal helping relationships within a framework of human rights, social justice, and diversity. Restricted to students admitted to the MSW program."}, {"summer": "True", "name": "SW General Practice II", "prerequisites": "Prerequisite: A grade of C- or better in  SW 520 and SW 651", "spring": "True", "number": "521", "fall": "True", "units": " 3", "description": "Prepares students for Social Work practice within organizations, communities and policy structures. Emphasizes multiculturalism, diversity, and social justice in relation to social systems. Restricted to students admitted to the MSW program."}, {"summer": "True", "name": "International Learning Experience in Social Work", "spring": "True", "number": "540", "fall": "True", "units": " 6", "description": "A seven week learning experience in Guatemala. Through this course, the student will develop a global perspective of social welfare and social work practice, will learn about the people and culture of the Lake Atitlan area of Guatemala, will learn the variety of resources available in response to social need, and will enhance or develop Spanish language competence. All costs associated with learning opportunities and activities for this course are included in the cost of the program."}, {"summer": "True", "name": "Advanced Social Work Practice with Families", "prerequisites": "Prerequisite: SW 652, Corequisite: SW 654", "spring": "True", "number": "550", "fall": "True", "units": " 3", "description": "Theories, concepts, and skills needed for practice with diverse, at-risk family populations.  Includes overview of historical and current social work approaches to family intervention as well as skill development in contemporary intervention methods.  Focuses on understanding families within their cultural and community contexts, and presents several family intervention models useful for helping families build on their strengths to cope with a variety of family constellations, changes, and challenges."}, {"summer": "True", "name": "Social Work Practice with Children and Adolescents", "prerequisites": "Prerequisite: SW 521 and SW 652", "spring": "True", "number": "551", "fall": "True", "units": " 3", "description": "Focuses on assessment and intervention strategies for clinical practice with children and adolescents.  Explores issues common to these client groups."}, {"summer": "True", "name": "SW Program Development and Grant Writing", "prerequisites": "Prerequisite: SW 521 and SW 652; Corequisite: SW 653", "spring": "True", "number": "557", "fall": "True", "units": " 3", "description": "Provides a comprehensive introduction to program development and grant writing in social work. Examines the major steps in the process including problem identification, needs assessment, program planning, and resource identification and development. Designed to provide a hands-on approach to developing grant writing and other resource development skills. Restricted to students who have completed all foundation courses in the MSW program."}, {"summer": "True", "name": "Advanced Policy Practice with Organizations and Communities", "prerequisites": "Prerequisite: SW 501 and Corequisite: SW 654", "spring": "True", "number": "560", "fall": "True", "units": " 3", "description": "Second of two courses on social policy. Examines how social workers collaborate with organizations and communities to intervene in social policy. Strategies for policy practice include values clarification, legislative advocacy, analytic advocacy, and implementation advocacy. These strategies build upon concepts and skills from community development, social planning, and community organizing. Emphasis is given to working with economically disadvantaged and historically disempowered communities. Restricted to students who have completed all foundation courses in the MSW program."}, {"summer": "True", "name": "Social Work Administration and Supervision", "prerequisites": "Prerequisite: SW 521 and SW 652; Corequisite: SW 653", "spring": "True", "number": "561", "fall": "True", "units": " 3", "description": "Addresses the theoretical frameworks and functions of managing human service organizations. Explores personal and professional values and ethical dilemmas in exercising leadership in the management of culturally diverse community groups, boards and committee meetings. Issues of staff development, team building, group decision-making, problem solving strategies, legal structure, governance, funding, accountability systems, and human resources will be discussed. Restricted to students who have completed all foundation courses in the MSW program."}, {"summer": "True", "name": "Community Mental Health", "prerequisites": "Prerequisite: SW 691", "spring": "True", "number": "571", "fall": "True", "units": " 3", "description": "Focuses on social work practice in the field of Mental Health.  Reviews policy and practice as it pertains to the promotion of mental health, the prevention of mental illnesses, and the delivery of psychosocial treatment.  Strategies and practice for use at the individual, family, group, organizational, community, and societel levels are explored.  Master of social work required."}, {"summer": "True", "name": "Social Work Professional Seminar", "prerequisites": "Prerequisite: SW 653", "spring": "True", "number": "580", "fall": "True", "units": " 4", "description": "Capstone course taken in the final semester of the MSW program intended to help students integrate all coursework in preparation for graduation and professional practice.   Directs students to apply promising practices to their professional work andencourages students to interact and blend perspectives from both direct practice and community partnership concentration options."}, {"summer": "True", "name": "Advanced Social Work Practice with Individuals", "prerequisites": "Prerequisite: SW 521 and SW 652", "spring": "True", "number": "581", "fall": "True", "units": " 3", "description": "Prepares the student for advanced generalist practice with individuals who are experiencing a range of complex life challenges. Focus on traditional and emerging social work practice theories used by social workers to assist individuals in experiencing external and/or internal stressors. Interventions with diverse populations risk. Restricted to students who have completed all foundation courses in the MSW program."}, {"summer": "True", "name": "Advanced Social Work Practices with Groups", "prerequisites": "Prerequisite: SW 521 and SW 652; Corequisite: SW 653", "spring": "True", "number": "582", "fall": "True", "units": " 3", "description": "Focuses on advanced social work practice with groups. Uses ecological systems and empowerment perspectives to explore major theories of social work practice with groups. Critical examination of contemporary issues in designing and evaluation group interventions in assessing their impact on individual and social change. Restricted to students who have completed all foundation courses in the MSW program."}, {"summer": "True", "name": "Advanced Social Work Practice with Family Systems", "prerequisites": "Prerequisite: SW 521 and SW 652;   Corequisite: SW 654", "spring": "True", "number": "583", "fall": "True", "units": " 3", "description": "Theories, concepts, and skills needed for practice with diverse, at-risk families. Overview of historical and current social work approaches to family intervention as well as skill development in contemporary methods. Focuses on understanding families within their cultural and community contexts and presents several family intervention models useful for helping families build on their strengths to cope with a variety of family constellations, changes, and challenges experienced throughout their lifespan. Restricted to students who have completed all foundation courses in the MSW program."}, {"summer": "True", "name": "Social Work Capstone", "prerequisites": "Prerequisite: SW 653;  Corequisite: SW 654", "spring": "True", "number": "590", "fall": "True", "units": " 2", "description": "Integration of ecological systems and empowerment perspectives with concepts of intersectionality and covert and overt oppression in group and organizational life leading to design and implementation of a capstone project reflecting mastery of all curricular content and demonstrating readiness to practice as an MSW level professional social worker. Restricted to students who have completed the first semester in the Advanced Year of the MSW Program."}, {"summer": "True", "name": "Special Topics in Social Work", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "595", "fall": "True", "units": " 3", "description": "In-depth exploration of specialized or emerging topics in social work or social welfare. Topic of current interest and mode of study determined by faculty member. Also used to test and develop new courses."}, {"summer": "True", "name": "Independent Study in Social Work", "prerequisites": "Prerequisite: Master of Social Work, SW 510", "spring": "True", "number": "630", "fall": "True", "units": " 1-6", "description": "An independent study addressing an area of social work practice or social welfare."}, {"summer": "True", "name": "Social Work Field Internship I", "prerequisites": "Prerequisite: SW 520 and Corequisite: SW 652", "spring": "True", "number": "651", "fall": "True", "units": " 5", "description": "First course in a two-course foundation sequence that provides students the opportunity to use generalist practice social work skills in a field agency under the supervision of an MSW social work practitioner."}, {"summer": "True", "name": "Social Work Field Internship II", "prerequisites": "Prerequisite: SW 520 and SW 651, Corequisite: SW 521", "spring": "True", "number": "652", "fall": "True", "units": " 5", "description": "Second course in a two-course foundation field internship sequence that provides students the opportunity to use generalist practice social work skills in a field agency under the supervision of an MSW social work practitioner."}, {"summer": "True", "name": "Advanced Social Work Field Internship I", "prerequisites": "Prerequisite: SW 652 and SW 521; Corequisite: SW 512, SW 557, SW 581, SW 582", "spring": "True", "number": "653", "fall": "True", "units": " 5", "description": "First course in the advanced field internship sequence that provides students with the opportunity to use advanced generalist practice social work in a field agency under the supervision of an MSW social work practitioner."}, {"summer": "True", "name": "Advanced Social Work Field Internship II", "prerequisites": "Prerequisite: SW 653; Corequisite: SW 560 or SW 561 or SW 583 or SW 590", "spring": "True", "number": "654", "fall": "True", "units": " 5", "description": "Second course in the advanced field internship sequence that provides students the opportunity to use advanced generalist practice social work skills in a field agency under the supervision of an MSW social work practitioner."}]