[{"summer": "True", "name": "Introduction to the College of Textiles", "spring": "True", "number": "101", "fall": "True", "units": " 1", "description": "Introduction topics related to the College of Textiles, the textile industry, all textile curricula, advising, academic skills, team work, research and personnel involved in the college. Students will not receive credit for both USC 301 and T 101."}, {"summer": "True", "name": "Introduction to Product Evolution", "spring": "True", "number": "102", "fall": "True", "units": " 2", "description": "Students explore the new product development (NPD) process through analysis of case studies of how textile products are designed and developed for a variety of sectors of our economy, including automotive, medical, industrial, furniture, and clothing.  Students develop critical thinking skills as they read a variety of texts and respond using several forms of writing techniques."}, {"summer": "True", "name": "Introduction to Textiles", "spring": "True", "number": "200", "fall": "True", "units": " 3", "description": "Survey of textiles including technical and economic history of the industry; physical and chemical processes involved in producing textile products from raw materials; unique aesthetic, physical and chemical properties of textiles and how these properties are determined by raw materials and production processes; and influence of properties of textile materials on their utilization and performance. Not open to students required to take TT 105; open to transfer students"}, {"summer": "True", "name": "Honors Seminar in Textiles", "prerequisites": "Prerequisite: By invitation into Honors Program in Textiles", "spring": "True", "number": "491", "fall": "True", "units": " 1", "description": "A seminar on current university and industrial research in the field of  textiles."}, {"summer": "True", "name": "Industrial Internship in Textiles", "prerequisites": "Prerequisite: Textile core courses", "spring": "True", "number": "493", "fall": "True", "units": " 3", "description": "Paid professional-level work experience in textiles, relating academic training in science and technology to industrial practice under professional guidance. Written and final oral presentation used for grading. Limited to three hours per student"}, {"summer": "True", "name": "International Collaboration in Textiles Research", "prerequisites": "Prerequisite: GPA of 2.75 or better and JR standing", "spring": "True", "number": "495", "fall": "True", "units": " 1-6", "description": "Directed undergraduate research in Textiles and/or Apparel related areas that requires collaboration with students at an institution abroad.  The research project is structured as an international team project in an applied field that allows students in different countries to work together using various communication tools.  Students shall arrange international contacts and provide a written proposal of the project to the undergraduate administrator or course coordinator prior to registration."}, {"summer": "True", "name": "Independent Research in Textile Engineering, Chemistry and Materials Science I", "prerequisites": "Prerequisite: Junior standing in TECS; 2.8 GPA", "spring": "True", "number": "497", "fall": "True", "units": " 3", "description": "Independent research in Textile Engineering, Chemistry and Materials Science topics through experimental, theoretical and literature studies. Written and oral reports required."}, {"summer": "True", "name": "Independent Research in Textile Engineering, Chemistry and Materials Science II", "prerequisites": "Prerequisite: T 497", "spring": "True", "number": "498", "fall": "True", "units": " 1-3", "description": "Independent research in Textile Engineering, Chemistry and Materials Science topics through experimental, theoretical and literature studies. Written and oral reports required."}]