[{"summer": false, "name": "Textile Wet Processing", "spring": true, "number": "502", "fall": false, "units": " 4", "description": "Introduction to the technology of textile wet processing.  Topics include preparation, coloration, and finishing of textile substrates, color science and color measurement.  Emphasis on basic science and equipment of textile wet processing.  Not forTC graduate students."}, {"summer": false, "name": "The Chemistry Of Textile Auxiliaries", "prerequisites": "Prerequisite: One yr. of organic chemistry", "spring": false, "number": "530", "fall": true, "units": " 3", "description": "Industrially important textile chemicals used for enhancing fiber and fabric properties such as durable press, water repellency, anti-soiling, flame retardancy, softness, stiffness, lubricity and other uses. Correlation of effect with structure, end-use influences, interaction with fabric and fibers, sources and synthetic routes, economic and environmental considerations."}, {"summer": "True", "name": "Organic Chemistry Of Polymers", "prerequisites": "Prerequisite: TC 461 and CH 231 or CH 431", "spring": "True", "number": "561", "fall": "True", "units": " 3", "description": "Principles of step reaction and addition polymerizations; copolymerization; emulsion polymerization; ionic polymerization; characterization of polymers; molecular structure and properties."}, {"summer": false, "name": "Polymer Applications and Technology", "prerequisites": "Prerequisite: One yr. of organic chemistry, TC 461", "spring": true, "number": "565", "fall": false, "units": " 3", "description": "Poly(olefins), poly(vinyl chloride), poly(vinyl acetate), poly(urethanes), epoxies, silicones, styrene copolymers used as textile finishes, nonwoven binders, fabric coatings, composites, adhesives, foams, carpet backing adhesives. Emphasis upon synthesis, industrial processes, properties and products."}, {"summer": true, "name": "Special Studies In Textile Engineering and Science", "prerequisites": "Prerequisite: Senior standing or Graduate standing", "spring": true, "number": "589", "fall": true, "units": " 1-4", "description": "New or special course on developments in textile engineering and science. Specific topics and prerequisites identified vary. Generally used for first offering of a new course."}, {"summer": true, "name": "Seminar", "spring": true, "number": "601", "fall": true, "units": " 1", "description": "Discussion of scientific articles and presentations; review and discussion of student papers and research problems."}, {"summer": true, "name": "Independent Study", "spring": true, "number": "630", "fall": true, "units": " 3"}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "685", "fall": true, "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "688", "fall": true, "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "689", "fall": true, "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": true, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "690", "fall": true, "units": " 1-6", "description": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam."}, {"summer": true, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "693", "fall": true, "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": true, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "695", "fall": true, "units": " 1-9", "description": "Thesis Research"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "696", "fall": false, "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": true, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "699", "fall": true, "units": " 1-3", "description": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis. Credits arranged"}, {"summer": false, "name": "Fiber Formation--Theory and Practice", "prerequisites": "Prerequisite: MA 301, PY 208", "spring": false, "number": "704", "fall": true, "units": " 3", "description": "Practical and theoretical analysis of the chemical and physical principles underlying conventional methods of converting bulk polymer to fiber; rheology; melt, dry and wet polymer extrusion; fiber drawing; heat setting; general theory applied to unit processes."}, {"summer": false, "name": "Theory Of Dyeing", "prerequisites": "Prerequisite: CH 433", "spring": true, "number": "705", "fall": false, "units": " 3", "description": "Mechanisms of dyeing. Application of thermodynamics to dyeing systems. Kinetics of diffusion in dyeing processes."}, {"summer": false, "name": "Color Science", "prerequisites": "Prerequisite: Senior standing or Graduate standing in TC, Corequisite: TC 707", "spring": false, "number": "706", "fall": true, "units": " 3", "description": "Basis of modern techniques for color specification, measurement, control and communication. Applications of color science to textiles, plastics, color reproduction, computer-based imaging and display systems. Basic concepts taught by computer color graphics."}, {"summer": false, "name": "Color Laboratory", "prerequisites": "Prerequisite: Senior standing or Graduate standing in TC, Corequisite: TC 706", "spring": false, "number": "707", "fall": true, "units": " 1", "description": "Exercises with modern methods and equipment to aid in understanding color perception, color science and color measurement. Computer color graphics exercises for comprehension of basic concepts. Independent projects in color science. Limited enrollment."}, {"summer": false, "name": "Chemistry Of Dyes and Color", "prerequisites": "Prerequisite: CH 221 and CH 223", "spring": true, "number": "720", "fall": false, "units": " 3", "description": "Correlation of color and chemical constitution, synthetic routes for popular dyes of all important types; electronic mechanisms for reactive dyes; chemistry of dye interactions with light, washing and other in-use influences; economic and environmental considerations."}, {"summer": false, "name": "Dye Synthesis Laboratory", "prerequisites": "Prerequisite: TC 720", "spring": false, "number": "721", "fall": true, "units": " 3", "description": "Laboratory work in preparation and analysis of synthetic dyes of a large number of types. Personal instruction in techniques and processes for preparation and purification of intermediates and dyes."}, {"summer": false, "name": "Polymer Microstructures, Conformations and Properties", "prerequisites": "Prerequisite: CH 220", "spring": false, "number": "771", "fall": true, "units": " 3", "description": "Exploration of connections between microstructures and properties of polymers afforded by analysis of their conformational characteristics. Analysis of NMR spectroscopy and conformational energy estimates to establish polymer microstructures and resultant sizes and shapes of polymer chains, which then related to their unique and rich variety of physical properties."}, {"summer": false, "name": "Special Topics In Textile Science", "prerequisites": "Prerequisite: Senior standing or Graduate standing", "spring": true, "number": "791", "fall": true, "units": " 1-4", "description": "Intensive treatments of selected topics in textile, polymer and fiber science."}, {"summer": false, "name": "Special Topics In Fiber Science", "spring": true, "number": "792", "fall": true, "units": " 1-3", "description": "Study of selected topics of particular interest in various advanced phases of fiber science."}, {"summer": "True", "name": "Summer Dissert Res", "spring": "True", "number": "896", "fall": "True", "units": " 1"}]