[{"summer": false, "name": "Introduction to Technology Education", "spring": false, "number": "101", "fall": true, "units": " 1", "description": "Orientation to technology teacher education curricula. Overview of the philosophy, objectives and scope of technology education programs in the public schools, multicultural and individual differences of students. A study of current technology issues will be conducted throughout the course."}, {"summer": false, "name": " Processes Technology", "spring": true, "number": "110", "fall": true, "units": " 4", "description": "Basic knowledge and skills needed to process common materials and produce functional products of woods, metals, plastics, and composite materials. Includes laboratory safety, use of hand tools, operation of materials, and teaching strategies. Laboratory experiences in materials testing and construction of multi-material projects."}, {"summer": false, "name": "Technology through Engineering and Design I", "prerequisites": "Prerequisite: TDE 110", "spring": false, "number": "131", "fall": true, "units": " 3", "description": "Study of engineering and design processes used to solve technological problems, innovate and invent.  Students will actively design, model and test solutions to technological problems and explore methods to teach middle and high school students about engineering design and the design process."}, {"summer": false, "name": "Introduction to Teaching Technology Engineering and Design Education", "prerequisites": "Prerequisite: Sophomore standing; Corequisite: ED 204", "spring": true, "number": "202", "fall": true, "units": " 1", "description": " Risk Management for details on acquiring the insurance and the current charge.  The URL for information on this policy is: http://www2.acs.ncsu.edu/insurance/Students.html."}, {"summer": false, "name": "Desktop Publishing and Imaging Technology", "spring": true, "number": "205", "fall": true, "units": " 3", "description": "An introduction to digital document production and techniques.  Explores software packages used in producing documents for print.  Structured for public school teachers and other interested persons, the course introduces basic standards and concepts of page layout, copyright and trademark laws, document usability, readability, and methods of document production."}, {"summer": false, "name": "Civil Engineering Graphics", "spring": true, "number": "220", "fall": true, "units": " 3", "description": "Civil engineering graphics is an introductory course in basic graphic principles for constructed facilities.  The emphasis is on sketching and CAD (computer-aided design) drawing skills and how specific construction systems and materials selected for a design affect production of civil engineering drawings for buildings, residences, and other constructed facilities through CAD.  Topics include orthographic and axonometric engineering drawing of site plans, plat plans, section details, utility structure details, elevations and related topics.  Restricted to Civil Engineering Majors."}, {"summer": false, "name": "Scientific and Technical Visualization", "spring": true, "number": "230", "fall": false, "units": " 3", "description": "Communication of scientific and technical information with graphics.  Using current practice in science, technology, and engineering disciplines as the context, the class will use general and discipline-specific techniques to explore how to effectively communicate with graphics.  Current software and computer technologies will be used to design and create graphics.  Students will also learn to critically examine and discuss graphics produced by themselves and others."}, {"summer": false, "name": "Digital Media Education", "prerequisites": "Prerequisite: TDE 205", "spring": true, "number": "261", "fall": false, "units": " 3", "description": "Image creation and control, aesthetics, production processes and environments, and media transfer are explored. This course emphasizes concepts of audio and video design, various digital media technologies, and nonlinear editing concepts through laboratory experiments and projects in radio, television, original audio development, and video production. TDE Majors or instructor permission."}, {"summer": false, "name": "Technology Through Engineering and Design II", "prerequisites": "Prerequisite: TDE 131 and Corequisite: GC 350", "spring": true, "number": "331", "fall": true, "units": " 3", "description": "TDE Majors or instructor approval."}, {"summer": "True", "name": "Technology Through Engineering and Design II", "spring": "True", "number": "331", "fall": "True", "units": " 3", "description": "AVAILABLE TO TDE MAJORS OR BY INSTRUCTOR APPROVAL ONLY."}, {"summer": "True", "name": "Ceramics: The Art and Craft of Clay", "spring": "True", "number": "351", "fall": "True", "units": " Performing Arts", "description": "Contemporary and historical examples of the art and craft of ceramics will be studied. Experiences in designing ceramic forms and expressing individual ideas through the medium of clay."}, {"summer": "True", "name": "Electronics Technology", "prerequisites": "Prerequisite: Junior standing.", "spring": "True", "number": "359", "fall": "True", "units": " 3", "description": "Direct current, alternating current, and semiconductors. Measurement and circuit behavior. Experimentation with application circuits."}, {"summer": false, "name": "Emerging Issues in Technology", "prerequisites": "Prerequisite: TDE 131, TDE 261, and GC 120", "spring": false, "number": "371", "fall": true, "units": " 3", "description": "Examination of current and projected technology topics which are growing in importance but are not presently reflected in the Technology Education programs of NC public schools. Laboratory experiences include development, revision, and field testingof appropriate learning activities for middle and high school students in the selected topic areas."}, {"summer": false, "name": "Robotics Education", "prerequisites": "Corequisite: TDE 386", "spring": true, "number": "385", "fall": true, "units": " 1", "description": "This course is an introduction to design and invention system control mechanisms and robot sensors. Students will classify foundational technical developments in autonomous, computer, and radio-control teleoperations. Students will explore the history and evolution of robots and automation and their social, economic, industrial, and educational impacts."}, {"summer": false, "name": "Robotics Education Lab", "prerequisites": "Corequisite: TDE 385", "spring": true, "number": "386", "fall": true, "units": " 3", "description": "Students will apply technological problem solving skills toward 21st century design and innovation. This includes experiences multiple robotics design and invention systems and related programming and designing, prototyping, and programming an autonomous robot to resolve a real world issue."}, {"summer": true, "name": "Field Work in Technology Education", "spring": true, "number": "407", "fall": true, "units": " 1-6", "description": "Supervised off-campus field experience in Technology Education that relates on-the-job experiences in the field to the technical competencies which are the content of the curriculum. May be repeated for a maximum of 6 credits."}, {"summer": false, "name": "Lab Planning in Technology Education", "spring": true, "number": "452", "fall": false, "units": " 3", "description": "Laboratory planning, management, and safety for technology education. Physical layout, selection, specification, and cost of equipment; the safe operation, repair and maintenance of power and hand tools; specification of expendable supplies, estimating, and ordering."}, {"summer": false, "name": "Curriculum and Methods in Technology Education", "prerequisites": "Prerequisite: Technology Education Majors, Admittance to teacher education candidacy", "spring": false, "number": "456", "fall": true, "units": " 4", "description": "Methods of teaching Technology Education.  Emphasis on curriculum development, instructional methods, laboratory instruction, meeting needs of special populations, and management of student organizations.  Field experiences and course assignments two hours each week.  Students are responsible for their own transportation."}, {"summer": false, "name": "Student Teaching in Technology Education", "spring": true, "number": "457", "fall": false, "units": " 1-8", "description": "Skills and techniques involved in teaching technology education through practice in a public school setting."}, {"summer": false, "name": " Development in Technology Education", "prerequisites": "Prerequisite: TDE 331, TDE 385, and TDE 386", "spring": false, "number": "481", "fall": true, "units": " 3", "description": "Senior design, research, and development experience in technology education. Students research a problem, ideate potential solutions, select a final solution, construct a prototype, and complete a final report analyzing the chosen solution."}, {"summer": false, "name": "Special Problems in Technology Education", "prerequisites": "Prerequisite: Junior standing.", "spring": true, "number": "490", "fall": true, "units": " 1-6", "description": "Supervised, independent investigation in a defined area of interest in Technology Education."}, {"summer": false, "name": "Senior Seminar in Technology Education", "prerequisites": "Prerequisite: Junior standing.", "spring": true, "number": "495", "fall": false, "units": " 3", "description": "An in-depth investigation of a topic or a set of problems and/or issues in Technology Education."}, {"summer": true, "name": "Independent Study in Technology Education", "prerequisites": "Prerequisite: Junior standing.", "spring": true, "number": "498", "fall": true, "units": " 1-3", "description": "Individual or group study of special topics in professional technology education. The topic and mode of study are determined by the faculty member after discussion with the student. May be repeated for a maximumof 6 credits."}]