[{"summer": "True", "name": "Introduction to the Theater", "spring": "True", "number": "103", "fall": "True", "units": " Performing Arts", "description": "Artistic, technical, historical, and literary areas of theater, including acting, directing, design, stagecraft, lighting, costuming, makeup, and criticism."}, {"summer": "True", "name": "Theory and Practice of Acting", "spring": "True", "number": "203", "fall": "True", "units": " Performing Arts", "description": "Basic contemporary  theories on acting, with practical application through classroom exercises. Role analysis, adaptation of voice and body to performance demands, and role development through various rehearsal activities."}, {"summer": "True", "name": "Stagecraft", "spring": "True", "number": "223", "fall": "True", "units": " 3", "description": "Fundamentals of scenery design, set construction, and related technical activities. Practical applications with use of design media and shop facilities. Required production participation in University Theater presentations."}, {"summer": "True", "name": "Introduction to Stage Lighting", "spring": "True", "number": "233", "fall": "True", "units": " 3", "description": "Fundamentals and uses of  stage lighting equipment and stage lighting design. Practical application of design media  and shop facilities. Participation in production activity for University Theater presentations."}, {"summer": "True", "name": "Makeup Design for the Stage", "spring": "True", "number": "234", "fall": "True", "units": " 3", "description": "The process of design and application of makeup for the stage including techniques for character and age makeup, making and applying facial hair and other specialized techniques. Taught from the play script to production with emphasis on historical research, play analysis, and applications techniques. The course includes hands-on experience with makeup. May not be taken concurrently with ARS 236 or ARS 333.  May not be taken concurrently with ARS 236 or ARS 333"}, {"summer": "True", "name": "Text to Stage", "spring": "True", "number": "236", "fall": "True", "units": " 3", "description": "Study of script preparation beginning with the directors' and designers' collaborative efforts through rehearsal process, to the production itself and ending with the final evaluation. Directors' methods and designer processes in theory and practice. Attendance at one rehearsal and two productions is required. May not be taken concurrently with ARS 233 or 333.  May not be taken concurrently with ARS 233 or ARS 333"}, {"summer": "True", "name": "Theater Practicum", "spring": "True", "number": "293", "fall": "True", "units": " 1-6", "description": "Practical experience in one  or more of the various areas of artistic and technical theater through active participation in Thompson Theater's play production program."}, {"summer": "True", "name": "Stage Directing", "spring": "True", "number": "303", "fall": "True", "units": " 3", "description": "Basic theory of directing and its application to theatrical production. Play reading, evaluation, casting procedure, staff organization, and  rehearsal planning and practices. Laboratory productions of short plays."}, {"summer": "True", "name": "Introduction to Scenic Design", "prerequisites": "Prerequisite: THE 103 or 223", "spring": "True", "number": "323", "fall": "True", "units": " 3", "description": "Aesthetics, elements, and principles of scenic design. Theories and applications to the  physical stage in relation to the script. Practical applications with the use of design media in University Theater productions."}, {"summer": "True", "name": "Costume Design and Technology", "prerequisites": "Prerequisite: THE 103 or THE 236", "spring": "True", "number": "333", "fall": "True", "units": " 3", "description": "The process of designing costumes taught from the perspective of both the play's script and the anticipated production with emphasis on historical research, play analysis, rendering technique, and basic construction. Hands-on experience required. May not be taken concurrently with ARS 233 or ARS 236.  May not be taken concurrently with ARS 233 or ARS 236."}, {"summer": "True", "name": "Advanced Acting", "prerequisites": "Prerequisite: THE 203 or demonstrated competence in  acting", "spring": "True", "number": "334", "fall": "True", "units": " 3", "description": "Advanced methods in role preparation through exercises in concentration, imagination, sensory and emotional recall, and other Stanislavskian techniques. Analyses and critiques of plays and in-class performances."}, {"summer": "True", "name": "African American Theatre", "spring": "True", "number": "340", "fall": "True", "units": " 3", "description": "This course examines African American dramaturgy and its impact on American theatre.  We will study plays from the early period, 1847-1938, and from the recent period, 1935-present.  This course will investigate the thematic structure of each section of plays including family life, social protest, and religion.  The course will also help students to better understand the social milieu that shaped the content of each play."}, {"summer": "True", "name": "Dress, Style, Change", "prerequisites": "Prerequisite: Junior standing.", "spring": "True", "number": "352", "fall": "True", "units": " 3", "description": "Interdisciplinary course focusing on historical and cultural principles of style as related to dress and fashion. Examination of fashion and stylistic trends in cycles of dress."}, {"summer": "True", "name": "Audition and Interpretation Techniques", "spring": "True", "number": "363", "fall": "True", "units": " 3", "description": "Cold-reading scenes broken down to meet challenges of theatrical auditions.  Personal technique developed to interpret texts through exercises, monologues, and scenes.  Promotion of self-awareness, confidence, and understanding of dramatic literature as reflector of contemporary and historic lives."}, {"summer": "True", "name": "Special Topics in University Theatre", "spring": "True", "number": "398", "fall": "True", "units": " 1-3", "description": "Presentation of material normally not available in regular course offerings, or offerings of a new course on a trial basis."}, {"summer": "True", "name": "Touring Theatre", "prerequisites": "Prerequisite: Audition required", "spring": "True", "number": "403", "fall": "True", "units": " 3", "description": "A touring performance experience consisting of text analysis, characterization, role development, and performance of scripts."}, {"summer": "True", "name": "Period Styles in Acting", "prerequisites": "Prerequisite: THE 493", "spring": "True", "number": "433", "fall": "True", "units": " 3", "description": "Interpreting daily lives in earlier eras through reading, discussion, research, and performance. Plays of complex heightened language, in verse and prose, studied from perspective of character's daily lives and their relevance to contemporary performance skills. Scenes, monologues, and soliloquies rehearsed and performed."}]