[{"summer": "True", "name": "Introduction to Textile Technology", "spring": "True", "number": "105", "fall": "True", "units": " 3", "description": "Introduction to Textile and Apparel, Technology and Management.  Structures and production methods for fabrics, yarn, and fibers.  Introduction to the nature of polymers and the characteristics of polymers which make them useful for producing fibersthat are practically and aesthetically desirable.  Design of end products as well as fundamental economic and supply chain issues."}, {"summer": "True", "name": "Yarn Production and Properties I", "prerequisites": "Prerequisite: TT 105 or MT 105; Corequisite: MA 131 or MA 141", "spring": "True", "number": "221", "fall": "True", "units": " 2", "description": "The techniques available for manufacturing yarns from staple fibers.  A review of yarn numbering and fiber properties.  The principles involved in opening, cleaning, blending, drafting, twisting and winding.  Short and long staple spinning systems including a review of opening and cleaning lines, carding, draw frames, roving frames and different spinning machines.  Filament yarn processing."}, {"summer": "True", "name": "Formation and Structure of Textile Fabrics", "prerequisites": "Prerequisite: TT 221", "spring": "True", "number": "252", "fall": "True", "units": " 4", "description": "Fundamentals of the conversion of fibers and yarns into woven, knitted, and nonwoven fabrics, and fabrics' conversion systems.  Introduction to woven, knitted and nonwoven fabric design structure.  Structure, property, and performance relations of textile fabrics.  Testing and evaluation of textile structures."}, {"summer": "True", "name": "Introduction to Nonwoven Products and Processes", "prerequisites": "Prerequisite: TMS 211 and (MA 131 or MA 141) and (PY 211 or PY 208); Corequisite: (ST 311 or BUS 350 or ST 361 or ST 370)", "spring": "True", "number": "305", "fall": "True", "units": " 3", "description": "Fiber web/nonwoven fabrics produced directly from fibers or their precursors. Physical and chemical nature of local bonding and fiber entanglement. Viable processes for producing these fabrics. Economic justification for process and production. Product/process interaction.  Plant visits whenever possible."}, {"summer": "True", "name": "Yarn Production and Properties II", "prerequisites": "Prerequisite: TT 221", "spring": "True", "number": "321", "fall": "True", "units": " 3", "description": "Fiber and machine interactions in blending, carding, drawing and spinning.  Drafting theories and the influence of fiber and machine variables on irregularity.  The role of twist on yarn structure, properties and productivity.  Developments and limitations in processing technology."}, {"summer": "True", "name": "Performance Evaluation of Textile Materials", "prerequisites": "Prerequisite: (ST 311 or BUS 350 or ST 361 or ST 370) and TMS 211 and TT 221 and (PY 211 or PY 205) and (MA 231 or MA 241); Corequisite: TT 252 or (TT 341 and TT 351).", "spring": "True", "number": "331", "fall": "True", "units": " 4", "description": "Standards, principles and effects of test conditions in measuring basic physical and mechanical properties of textile materials.  Design of test and interpretation of test results in relation to end-use performance, product development, process control, research and development and other requirements."}, {"summer": "True", "name": "Knitted Fabric Technology", "prerequisites": "Prerequisite: TT 221", "spring": "True", "number": "341", "fall": "True", "units": " 3", "description": "Review of knitted fabric production techniques.  Technology of more advanced weft and warp knitting.  Jersey and rib fabric modification techniques, yarn knitability and productivity, yarns, creels, patterning and machinery developments, manufactureand properties of warp knit fabrics such as mesh, laid-in, weft insertion and plush.  Quality measures, measurement and standards, defects and problem solving.  Management of knitting operations."}, {"summer": "True", "name": "Woven Products and Processes", "prerequisites": "Prerequisite: TT 221 and (PY 212 or PY 208)", "spring": "True", "number": "351", "fall": "True", "units": " 3", "description": "Design and development of various woven textile products including their component properties, performance, requirements, structures, and methods of production. The primary objective of the course is to introduce students to various woven textile products, including those used in automotives, agriculture, construction, ETC. and stimulate understanding of their structure, performance requirements, and relevant manufacturing principles including braiding."}, {"summer": "True", "name": "Woven Textile Design", "prerequisites": "Prerequisite: TT 252", "spring": "True", "number": "371", "fall": "True", "units": " 3", "description": "Design and production of woven fabrics.  Exploration of various basic structures, color and textural effects. Development of design abilities through hand-production methods, including an introduction to Computer-integrated Design systems and an awareness of industrial processes."}, {"summer": "True", "name": "Knitted Textile Design", "prerequisites": "Prerequisite: TT 252", "spring": "True", "number": "372", "fall": "True", "units": " 3", "description": "Design and production of hand- and machine-knitted fabrics.  Exploration of basic structures, color and textural effects.  Development of design abilities through hand- and machine-production methods, including an introduction to Computer-integratedDesign Systems and an awareness of industrial processes."}, {"summer": "True", "name": "Management and Control of Textile and Apparel Systems", "prerequisites": "Prerequisite: FTM 217; Corequisite: TT 221", "spring": "True", "number": "380", "fall": "True", "units": " 3", "description": "Management approaches, practices and basic economic considerations in the development, production and distribution of industrial and consumer textile and apparel products."}, {"summer": "True", "name": "Advanced Nonwovens Processing", "prerequisites": "Prerequisite: MA 241, PY 208, TT 305", "spring": "True", "number": "405", "fall": "True", "units": " 3", "description": "Mechanisms used in the production of nonwoven materials.  Design and operation of these mechanisms.  Process flow, optimization of process parameters, influence of process parameters on product properties."}, {"summer": "True", "name": "Bonding Fundamentals in Nonwovens", "prerequisites": "Prerequisite: TT 405, MAE 308, MAE 310", "spring": "True", "number": "406", "fall": "True", "units": " 3", "description": "Fundamentals of fluid mechanics and heat transfer mechanisms during the bonding of nonwovens.  In-depth description of hydroentangling, thermal bonding and needle punching techniques.  Modeling methods and laboratory work are assigned."}, {"summer": "True", "name": "Characterization Methods in Nonwovens", "prerequisites": "Prerequisite: ST 361 or ST 370; Corequisite: TT 405", "spring": "True", "number": "407", "fall": "True", "units": " 3", "description": "Fundamentals of methods used in evaluating properties and performance of nonwovens.  Assessment of thermal, mechanical, moisture transport and barrier properties of nonwovens.  Reliability and interpretation of test results."}, {"summer": "True", "name": "Nonwoven Product Development", "prerequisites": "Prerequisite: TT 407", "spring": "True", "number": "408", "fall": "True", "units": " 3", "description": "Fundamentals of nonwoven product development.  In-depth knowledge of the materials, processes and nonwovens products.  Design of a set of experiments intended for product development.  Students work in teams to design, fabricate and evaluate nonwoven products."}, {"summer": "True", "name": "Textured Yarn Production and Properties", "prerequisites": "Prerequisite: TT 331", "spring": "True", "number": "425", "fall": "True", "units": " 3", "description": "Structure and properties of continuous filament yarns.  Examine response to elevated temperature and variables for texturing methods of producing bulked, textured and torqued yarns.  Testing of yarn behaviors and discussion of problems encountered during processing."}, {"summer": "True", "name": "Quality Management and Control In Textile Manufacturing", "prerequisites": "Prerequisite: TT 331", "spring": "True", "number": "431", "fall": "True", "units": " 3", "description": "Principles of quality and process management and control in textile/apparel manufacturing with emphases in quality management systems, quality costs, statistical control chart procedures, process capability, acceptance sampling, and optimal process and product design and improvement methods."}, {"summer": "True", "name": "Advanced Woven Fabric Design", "prerequisites": "Prerequisite: (TT 252 or TT 351) and Senior Standing", "spring": "True", "number": "451", "fall": "True", "units": " 3", "description": "Design and production requirements for highly specialized woven fabric structures. The laboratory activities will include a project on design from concept to final production and finishing."}, {"summer": "True", "name": "Jacquard Woven Fabric Design", "prerequisites": "Prerequisite: TT 252, TT 371", "spring": "True", "number": "470", "fall": "True", "units": " 3", "description": "This course is dedicated to the study of Jacquard woven fabric design and structural technology through the use of CAD as both an aesthetic and technical tool, and will culminate in each student producing a unique fabric collection based upon his/her developed area of interest.  Jacquard design for many different end uses is addressed, from art fabrics to unique specialty products.  A field trip in this course will require personal transportation."}, {"summer": "True", "name": "Operations Management Decisions for Textiles", "prerequisites": "Prerequisite: FTM 380, ACC 210, ST 361, (MA 131 and 132 or MA 141)", "spring": "True", "number": "480", "fall": "True", "units": " 3", "description": "Quantitative techniques for decision making and management in the textile complex. Applications include vendor selection, plant location, retail inventory management, forcasting demand, project management, and logistics planning. Techniques covered include simulation, PERT/CPM, mathematical modeling."}, {"summer": "True", "name": "Design and Technology of Technical Textiles", "prerequisites": "Prerequisite: TT 305, TT 341 and TT 351", "spring": "True", "number": "481", "fall": "True", "units": " 3", "description": "Performance requirements of various technical textiles. Underlying principles of design, application, manufacture, and evaluation of fibrous structures intended to meet specific end-use requirement."}, {"summer": "True", "name": "Textile Computer Integrated Enterprise", "prerequisites": "Prerequisite: TT/FTM 380", "spring": "True", "number": "485", "fall": "True", "units": " 3", "description": "Survey of information technology in textile and apparel industries. Topics discussed include: computer aided design (CAD); computer aided manufacturing (CAM); computer aided engineering (CAE); material handling systems; automation and robotics; logistics and warehousing systems; retail product tracking, and Internet resources."}, {"summer": "True", "name": "Supply Chain Management in the Textile Industry", "prerequisites": "Prerequisite: TT/FTM 380", "spring": "True", "number": "486", "fall": "True", "units": " 3", "description": "Study of the operations necessary to produce and distribute a product, starting with the procurement of the raw material used in making the goods and ending with the delivery of the finished product. Topics covered include approaches to solving problems in manufacturing, sourcing, transportation logistics, and retail operations within the Integrated Textile Complex. Credit cannot be given for both TAM486 and MT386."}, {"summer": "True", "name": "Textile Senior Project", "prerequisites": "Prerequisite: Senior standing", "spring": "True", "number": "499", "fall": "True", "units": " 4", "description": "This is a project based course to be taken in the last semester of the Senior year.  In this capstone course the students work in cross-functional teams to research and solve applied problems in textile related fields.  The results of the projects will be presented formally at the end of the semester. Course should be taken in the last semester of the Senior year.  It cannot be substituted by other project courses"}, {"summer": "True", "name": "Understanding the Textile Complex", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "500", "fall": "True", "units": " 3", "description": "This course provides an overview of product development, processing, managing, financing, etc., for the textile industry.  It is designed to give new graduate students basic preparations for more advanced, required textile courses.  Students will also gain insight into the research being conducted within the College of Textiles."}, {"summer": "True", "name": "Materials, Polymers, and Fibers used in Nonwovens", "prerequisites": "Prerequisite: MA 141, PY 205, PCC 203", "spring": "True", "number": "503", "fall": "True", "units": " 3", "description": "Fundamentals of raw material used in nonwoven processes.  Raw material production, chemical and physical properties of nonwoven raw materials and assessment of material properties.  Introduction of structure/property relationships for these materials and how these relationships influence end use applications."}, {"summer": "True", "name": "Introduction to Nonwovens Processes and Products", "prerequisites": "Prerequisite: MA 141; PY 205, Corequisite: TT503", "spring": "True", "number": "504", "fall": "True", "units": " 3", "description": "Fiber web/nonwoven fabrics produced directly from fibers or their precursors.  Physical and chemical nature of local bonding and fiber entanglement.  Viable process for producing these fabrics.  Economic justification for process and production.  Product/process interaction.  Plant visits whenever possible."}, {"summer": "True", "name": "Advanced Nonwovens Processing", "prerequisites": "Prerequisite: TT/NW503, TT/NW504", "spring": "True", "number": "505", "fall": "True", "units": " 3", "description": "An in-depth understanding of the mechanisms and processes used in the production of nonwoven materials. Design and operation of these mechanisms and processes. Process flow, optimization of process parameters, influence of process parameters on product properties."}, {"summer": "True", "name": "Bonding Principles in Nonwovens", "prerequisites": "Prerequisite: MAE 308, MAE 310, TT /NW505", "spring": "True", "number": "506", "fall": "True", "units": " 3", "description": "Fundamentals of fluid mechanics and heat transfer mechanisms during the bonding nonwovens.  Provide engineering and in-depth description of hydroentangling, thermal bonding and needle punching techniques.  Modeling methods and laboratory work are assigned."}, {"summer": "True", "name": "Nonwoven Characterization Methods", "prerequisites": "Prerequisite: ST 361, Corequisite: TT/NW 505", "spring": "True", "number": "507", "fall": "True", "units": " 3", "description": "Fundamentals of methods used in evaluating properties and performance of nonwovens.  Assessment of thermal, mechanical, moisture transport and barrier properties of nonwovens.  Reliability and interpretation of test results."}, {"summer": "True", "name": "Nonwoven Product Development", "prerequisites": "Prerequisite: TTNW505, TT/NW507", "spring": "True", "number": "508", "fall": "True", "units": " 3", "description": "Fundamentals of nonwoven product development.  In-depth knowledge of the materials, processes and nonwovens products.  Design a set of experiments intended for product development.  Students work in teams to design and evaluate nonwoven products."}, {"summer": "True", "name": "Yarn Processing Dynamics", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": "True", "number": "520", "fall": "True", "units": " 3", "description": "Principles and practice involved in modern yarn and manufacture; including machine-fiber interactions occurring during different processing stages.  Not normally for credit for undergraduate textile majors."}, {"summer": "True", "name": "Filament Yarn Production Processing and Properties", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": "True", "number": "521", "fall": "True", "units": " 3", "description": "Structure, properties and processes for manufacturing and treating continuous filament yarns.  Response of fibers to elevated temperatures, twist, false twist and various bulking processes.  Yarn structures and properties required for stretch and molded fabrics.  Independent laboratory and critical literature review in general area of filament yarn processing, properties and test methods. credit not allowed for both TT 521 and TT 425"}, {"summer": "True", "name": "Textile Quality and Process Control", "prerequisites": "Prerequisite: TT 420, Corequisite: ST 511 or ST 515", "spring": "True", "number": "530", "fall": "True", "units": " 3", "description": "Quality control and improvement methods for textile processes and products including quality systems, statistical control chart procedures, process capabilities, acceptance sampling plans, textiles process and product designs, on-line and off-line control systems and specific quality factors governing textile products and processes and their variabilities."}, {"summer": "True", "name": "Evaluation of Biotextiles", "prerequisites": "Prerequisite: ZO 160, TC 203, TMS 211, CH 220", "spring": "True", "number": "532", "fall": "True", "units": " 3", "description": "Evaluation of the performance of biotextiles and medical polymers in biological and microbiological environments, with an emphasis on \"in vitro\" and \"in vivo\" techniques for testing the biocompatibility and biostability of implantable biomedical products.  Related issues will deal with quality assurance systems, inspection and sampling plans, ISO certification, GMP's, reference materials and organisms, and the use of accelerated tests an animal trials so as to meet regulatory requirements."}, {"summer": "True", "name": "Lean Six Sigma Quality", "prerequisites": "Prequisite: ST 361 and ST 371,  or equivalent", "spring": "True", "number": "533", "fall": "True", "units": " 3", "description": "Systematic approach (Lean Six Sigma philosophy) for improving products and processes. Defining the improvement opportunity, measurement system analysis, data collection, statistical analysis, design of experiment (DOE) methods, and statistical process control (SPC) methods. Application of Lean Six sigma methods to improve product or process."}, {"summer": "True", "name": "Research Methods and Management", "prerequisites": "Prerequisite: ST 361, Graduate standing", "spring": "True", "number": "535", "fall": "True", "units": " 3", "description": ", project design and management, intellectual property rights, and maximization of research output."}, {"summer": "True", "name": "Warp Knit Engineering and Structural Design", "prerequisites": "Prerequisite: TT 443", "spring": "True", "number": "549", "fall": "True", "units": " 3", "description": "Engineering analysis of tricot and raschel machinery. Design of yarn let-off and fabric take-up mechanisms. Studies of fabric production techniques and quality control systems. Theory of production optimization and the properties of fabrics. Complexgeometrical loop models and their application."}, {"summer": "True", "name": "Production Mechanics and Properties of Woven Fabrics", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": "True", "number": "550", "fall": "True", "units": " 3", "description": "Interrelation between mechanics of production and mechanical properties of woven fabric; unit operations required to prepare yarns for weaving and the mechanism employed in weaving; fabric structure, geometry and mechanical properties; designing forspecific fabrics properties.  Not normally for credit for undergraduate textiles majors."}, {"summer": "True", "name": " Structures", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "551", "fall": "True", "units": " 3", "description": "Theory and practice of structural design and technology requirements for highly specialized woven fabrics.  Emphasis upon resultant physical behavior of different fabrics and their components. Credit not allowed for TT 451 and TT 551"}, {"summer": "True", "name": "Formation and Structure of Woven and Knitted Fabrics", "spring": "True", "number": "553", "fall": "True", "units": " 3", "description": "The interrelation between the mechanics of production and mechanical properties of woven and knitted fabrics; unit operations required to prepare yams for weaving and knitting and mechanisms employed in weaving and knitting; fabric structure, geometry and mechanical properties; designing for specific fabric properties.  Students will not be allowed credit for TT 553 and (TT 541, TT 549, and TT 550)."}, {"summer": "True", "name": "Textile Digital Design and Technology", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "570", "fall": "True", "units": " 3", "description": "This course focuses on design of textile products balancing industry and creative foci.  Students will study a range of industry focused technologies and techniques essential to creation of textile products in a technology intensive environment.  Basics of textile product design and relevant technologies will be covered along with methods and techniques to improve commercial textile product design process.  Students will research in-depth a topic related to textile product design, and present their research in an oral format."}, {"summer": "True", "name": "Professional Practices in Textile Design and Technology", "prerequisites": "Prerequisite: TT 570", "spring": "True", "number": "571", "fall": "True", "units": " 3", "description": "This course builds on the concepts introduced in TT 570 with increased focus on professional practice and methods.  Focus on advanced textile product design topics incorporating an industry focus and utilizing commercial technologies.  Students willinvestigate in depth a textile product design industry application, technique or method of interest using individual and tam based strategies.  Topics include advanced study of textile product design concepts, techniques and preparation for professional competitions, displays and conferences."}, {"summer": "True", "name": "Technical Textiles", "prerequisites": "Prerequisite: TT 520 or TT 521, and TT 550", "spring": "True", "number": "581", "fall": "True", "units": " 3", "description": "Performance requirements of various technical textiles.  Underlying principles of design and manufacturing of fibrous structures to meet specific needs in mechanical and other behaviors."}, {"summer": "True", "name": "Special Studies in Textile Technology", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": "True", "number": "591", "fall": "True", "units": " 1-4", "description": "Special Studies in Textile Technology to fulfill needs not covered by current offering.  Student and faculty required to submit topics to be covered to director of graduate programs within first week of semester."}, {"summer": "True", "name": "Seminar", "spring": "True", "number": "601", "fall": "True", "units": " 1", "description": "Discussion of scientific articles of interest to the textile industry; review and discussion of student papers and research problems."}, {"summer": "True", "name": "Independent Study in Textile Technology", "spring": "True", "number": "630", "fall": "True", "units": " 3", "description": "Problems of specific interest in textile technology.  Preparation of report, in format suitable for publication required.  One-page outline signed by advisor must be submitted to director of graduate programs within first week of semester. A maximumof 3 credit hours will be allowed towards Master of Textiles Degree.  No credit is allowed towards MS (Textiles)."}, {"summer": "True", "name": "Special Projects Textile Technology", "spring": "True", "number": "676", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "685", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "690", "fall": "True", "units": " 1-6", "description": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam."}, {"summer": "True", "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "693", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "695", "fall": "True", "units": " 1-9", "description": "Thesis Research"}, {"summer": "True", "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "696", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "699", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis."}, {"summer": "True", "name": "Summer Dissert Res", "spring": "True", "number": "896", "fall": "True", "units": " 1"}]