[{"summer": false, "name": "Careers in Veterinary Medicine", "spring": false, "number": "910", "fall": true, "units": " 1", "description": "Specialists and invited speakers from multiple areas of veterinary medicine will present information about career opportunities."}, {"summer": false, "name": "Advanced Topics in Equine Medicine and Surgery", "prerequisites": "Prerequisite: VMB 921", "spring": true, "number": "911", "fall": false, "units": " 1", "description": "The major objectives are to expose students to additional in-depth information related to equine medicine and surgery.  This course will build on information covered in equine portions of the veterinary curriculum. Students must have a degree in veterinay medicine, enrollment in the veterinary curriculum, or approval of the course coordinator."}, {"summer": "True", "name": "Ethic Jurispru", "spring": "True", "number": "915", "fall": "True", "units": " 2"}, {"summer": "True", "name": " Mgmt I", "spring": "True", "number": "917", "fall": "True", "units": " 1"}, {"summer": false, "name": "Special Topics in Zoological Medicine", "prerequisites": "Prerequisite: 1st, 2nd, or 3rd year DVM student", "spring": true, "number": "921", "fall": true, "units": " 1-3", "description": "This elective course allows students to participate in customized laboratory and field experiences in zoological medicine (avian, aquatic, reptile, amphibian, invertebrate, and mammalian species). This course is designed to be adapted to the needs of students in the DVM program who desire practical experiences in the discipline. Specific details of individual projects are developed by the course coordinator and participating faculty. this elective course can provide partial fulfillment for elective credit for Zoo Focus Area"}, {"summer": false, "name": "Veterinary Acupuncture in China", "prerequisites": "Prerequisite: VMB 911 and VMB 921; Corequisite: Current enrollment in the DVM program", "spring": true, "number": "922", "fall": false, "units": " 2", "description": "This elective course is a two week international experience in China that will introduce DVM students to Traditional Chinese Veterinary Medicine (TCVM), including acupuncture, moxibustion, and related therapies.  The course will include an overview of TCVM history, terminology, theory, and practical applications using equine (horse or donkey) and canine species. In addition, the course will include elective opportunities to meet and interact with Chinese veterinary students, and opportunities to explore the many cultural options available in China."}, {"summer": false, "name": "Topics in Wild Avian medicine", "prerequisites": "Prerequisite: DVM student", "spring": false, "number": "926", "fall": true, "units": " 1", "description": "Emphasis on wild avian medicine, husbandry and captive management issues.  Development of skills in the laboratory setting: species identification (especially raptors), capture and handling, physical examination, bandaging, sample collection and treatment techniques.  Students are expected to attend a minimum of 5 seminars related to wild avian medicine, participate in 2 scheduled raptor lecture/labs (1/semester-date TBA); and complete 3 web-based lectures included in the course web site."}, {"summer": false, "name": "Introduction to Companion Animal Behavior", "prerequisites": "Doctor of Veterinary Medicine Majors Only", "spring": true, "number": "927", "fall": false, "units": " 2", "description": "This course explores the behavior of companion animals from a veterinary perspective. An emphasis is placed on behavior as an indicator of welfare and health, humane handling of animals, prevention of behavior problems, and treatment of common behavior problems. In addition the nature of human-animal bond and ethical issues relating to human-animal interactions will be discussed. Students will learn how to diagnose and treat common behavior problems on the basis of video-rich case presentations, lecture material, and class discussion. This course is restricted to students enrolled in the DVM Curriculum."}, {"summer": false, "name": "Chelonian Medicine and Surgery", "spring": false, "number": "928", "fall": true, "units": " 1", "description": "The NCSU-CVM Turtle Rescue Team treats sick and injured wild turtles belonging to nine different species.  First, second, and third year veterinary students will be responsible for case management, coordinating consultations, diagnostic testing within the hospital, and placing recuperating animals with local wildlife rehabilitators.  Students are also required to attend weekly rounds and make an oral presentation."}, {"summer": false, "name": "Introduction to Physical Examination Skills- Laboratory Animal and Zoological Species", "spring": true, "number": "931", "fall": false, "units": " 1", "description": "Introduction to the biology, husbandry, physical examination, laboratory sample collection, and medication administration skills in laboratory animals and zoological species. Students must be enrolled in the Doctor of Veterinary Medicine program. Enrollment in year 2 of the Doctor of Veterinary Medicine Program."}, {"summer": false, "name": "Principles of Surgery", "prerequisites": "Prerequisite: 2nd year DVM student", "spring": false, "number": "932", "fall": true, "units": " 3", "description": "This course covers the science, art and craft of surgery, as a foundation for clinical applications.  The principles you learn will give you a foundation for performing surgery on all species, even though the examples in this course are centered on the dog and cat."}, {"summer": false, "name": "Theriogenology", "prerequisites": "Prerequisite:Successful completion of the second year of the DVM program", "spring": false, "number": "933", "fall": true, "units": " 3", "description": "The physiology, endocrinology, and pathology of the reproductive system are presented. Emphasis includes genital anatomy and function, endocrine interrelationships, and methods for examination of mammary gland and reproductive tract function, including diagnosis and treatment of clinical disorders."}, {"summer": false, "name": "Introduction to Physical Examination Skills- Small Animal", "spring": false, "number": "937", "fall": true, "units": " 1", "description": "Introduction to physical examination, laboratory sample collection, and medication administration skills in dogs and cats. Students will also be taught how to understand and use the problem oriented approach for patient management. Students must be enrolled in the Doctor of Veterinary Medicine program. Enrollment in year 2 of Doctor of Veterinary Medicine Program."}, {"summer": false, "name": "General Limited Small Animal Practice", "spring": true, "number": "939", "fall": true, "units": " 2", "description": "Will expose clinical year veterinary students to a general small animal veterinary practice. There will be several areas of focus: learning clinical skills relevant to a general veterinary practitioner; developing strong problem solving abilities; developing the strong communication skills necessary to interact effectively with client, colleagues and staff, incorporating and conducting behavioral evaluations of pets during wellness examinations. Enrollment in this course is limited to students in the DVM professional program."}, {"summer": false, "name": "Clinical Theriogenology", "spring": true, "number": "940", "fall": true, "units": " 2", "description": "This course is designed to instruct veterinary students to make clinical diagnoses and problems of the reproduction system of domestic animals. Instruction is provided on medical and surgical correction of clinical reproductive system problems, such as infertility, obstetrical procedures, assisted reproductive techniques, and traumatic injuries. Must be enrolled in fourth year clinical rotations."}, {"summer": false, "name": "Special Topics in Theriogenology", "spring": true, "number": "941", "fall": false, "units": " 2", "description": "The primary objective of this course is to provide additional information and training to veterinary students that have taken the VMP 980 (VMC 940 new course #) clinical theriogenology senior clinical rotation. Emphasis will be directed to acquaint students with modern and current practices of clinical Theriogenology. It is expected that the majority of the information and activities offered in this course will involve equine species (80%) and, to a lesser extent, canine (10%) and bovine species (10%). Requires satisfactory completion of 3rd year of professional program and clinical theriogenology senior rotations."}, {"summer": true, "name": "Sea Turtle Medicine and Rehabilitation", "prerequisites": "Prerequisite: 4th year DVM student", "spring": true, "number": "950", "fall": true, "units": " 2", "description": "This course provides practical experience in husbandry and disease diagnosis and treatment in rehabilitating sea turtles at the Karen Beasley Sea Turtle Rescue and Rehabilitation Center (KBSRRC) in Topsail Beach, NC.  Skills to be acquired in clinical and didactic setting include sea turtle husbandry and rehabilitation techniques, diagnostic sample collection and interpretation, physical examination and safe handling, medication delivery, wound treatment, and necropsy protocols."}, {"summer": false, "name": "Companion Animal Medicine and Surgery I", "prerequisites": "Prerequisite: Successful completion of the 2nd year of the professional curriculum", "spring": false, "number": "951", "fall": true, "units": " 5", "description": "Overview of medical and surgical management of selective metabolic, neoplastic, nutritional, immune-mediated, developmental and degenerative diseases of companion animals."}, {"summer": false, "name": "Equine Medicine and Surgery", "spring": true, "number": "952", "fall": true, "units": " 4", "description": "Medical conditions in large domesticated animals are presented in this course. Discussions involve the agents causing diseases and the therapeutic methods used to correct. 4 semester hours."}, {"summer": "True", "name": "Lab Anim Medicine", "spring": "True", "number": "953", "fall": "True", "units": " 3", "description": "The biology, use, and diseases of laboratory animal species are presented. Emphasis is on signs, epizootiology, pathogenesis, treatment, and disease control programs for the more significant diseases of these animals. Clinically important conditionsof wildlife, zoo species caged birds, and aquarium fishes are presented. 3 semester hours."}, {"summer": true, "name": "Companion Animal Medicine for Food Animal Students", "prerequisites": "Prerequisite: Senior DVM student", "spring": true, "number": "954", "fall": true, "units": " 2", "description": "Small animal medicine clinical rotation emphasizing the disciplined detection, prioritizing and planning for therapy of medical diseases in small companion animals. Development of medical judgment and the use of the problem oriented medical record is stressed. This course is intended for DVM students in the food animal focus area."}, {"summer": "True", "name": "Extramural Experiences in Lab An Med", "prerequisites": "Corequisite: Current enrollment in DVM program.", "spring": "True", "number": "955", "fall": "True", "units": " 2", "description": "DVM students will have the opportunity to undertake a two-week rotation in an approved labratory animal facility under the supervision of a labratory animal veterinarian.  This opportunity will meet the need to increase \"hands-on\" experience as partof the focus area requirements or recommendations."}, {"summer": "True", "name": "Shelter Medecine", "spring": "True", "number": "956", "fall": "True", "units": " 2", "description": "This rotation is geared towards students interested in learning about managing health and welfare of small animal populations, including animal shelters, catteries or kennels.  The students will have hands on experience evaluating animals as individuals as well as part of a population in regards to health, disease prevention and management, and animal well being.  Animal neglect/cruelty will be explored as well as animal behavior as it relates to shelter issues, euthanasia, facility design and animal overpopulation issues.  Must be a fourth year veterinary student."}, {"summer": "True", "name": "Intro Clinic Pract", "spring": "True", "number": "957", "fall": "True", "units": " 1", "description": "The problem-oriented approach to diagnosis is introduced through exposure to clinical case studies, supervised visits with local veterinary practitioner, and participation in the medicine and surgery services in The Veterinary Teaching Hospital. Familiarity is gained with admission procedures, medical records, patient management, and clinical rounds. 1 semester hour."}, {"summer": false, "name": "Advanced Prosimian Medicine", "prerequisites": "Prerequisite: VMC 991, restricted to 4th year DVM students", "spring": true, "number": "958", "fall": true, "units": " 2", "description": "This course is designed to provide senior veterinary students with clinical experience in prosimian medicine.  Students will gain practical experience in the diagnosis, treatment, and prevention of disease in captive prosimians maintained in research facilities.  Students participate in formal rounds, autodidactic exercises, and case management at the Duke Lemur Center.  Limited to 4th Year DVM curriculum students."}, {"summer": false, "name": "Advanced Primate Medicine", "prerequisites": "Prerequisite: VMC 991 Primate Medicine", "spring": true, "number": "959", "fall": true, "units": " 2", "description": "This course is designed to provide senior veterinary students with clinical experience in nonhuman primate medicine.  Students will gain practical experience in the diagnosis, treatment, and prevention of disease in captive research primates maintained in research facilities.  Students participate in formal rounds, autodidactic exercises, and case management at Primate Center at Wake Forest University.  Limited to 4th  year DVM curriculum students."}, {"summer": true, "name": "Small Animal Emergency Service", "prerequisites": "Prerequisite: fourth year clinics student, DVM student", "spring": true, "number": "960", "fall": true, "units": " 2", "description": "Assessment, triage, and management of canine and feline patients admitted to the small animal emergency service after hours."}, {"summer": "True", "name": "Comp An Med Sur II", "spring": "True", "number": "961", "fall": "True", "units": " 4", "description": "This course is an overview of medical and surgical management of selected metabolic, neoplastic, nutritional, immune-mediated, developmental, and degenerative diseases of companion animals. 4 semester hours."}, {"summer": false, "name": "Animal Welfare, Ethics and Societal Responsibility", "prerequisites": "Prerequisite: DVM student", "spring": true, "number": "962", "fall": false, "units": " 2", "description": "Examines the social, legal and ethical issues behind the science of veterinary medicine and allows for critical evaluation and discussion of a variety of controversial issues challenging current belief systems.  Provides the basic leadership and operational training necessary to become a Credentialed responder for the State of North Carolina.  Limited to DVM students or by permission of instructor."}, {"summer": true, "name": "Extramural Experience in Zoo Medicine", "prerequisites": "Prerequisite: DVM student", "spring": true, "number": "963", "fall": true, "units": " 2", "description": " zoo species. does not fulfill senior year requirement for elective credit in Zoo Focus Area"}, {"summer": false, "name": "Zoological Husbandry and Nutrition", "prerequisites": "Successful completion of 3 Zoological Medicine Selectives or course coordinator permission", "spring": true, "number": "964", "fall": true, "units": " 2", "description": "This course is designed to provide senior veterinary students with husbandry and background experience in a zoo setting as a foundation for health management. Students will gain practical experience in the husbandry and nutrition of zoo animals while learning the importance of prevention of disease in captive wildlife. Students participate in formal rounds, autodidactic exercises, and hands on animal care delivery."}, {"summer": false, "name": "Advanced Principles of Surgery", "prerequisites": "Prerequisite: DVM student, Completion of fall semester, VM3 students", "spring": true, "number": "965", "fall": false, "units": " 1", "description": "This laboratory includes induction and maintenance of anesthesia in representative companion animal, food animal, and equine species; the practice of surgery on anesthetized animals and cadaver specimens; and experience with diagnostic and therapeutic techniques.  Students examine, assess, and provide preoperative, intraoperative, and postoperative management of their patients."}, {"summer": true, "name": "Equine Emergency and Critical Care", "prerequisites": "Prerequisite: 4th year DVM student, Third year veterinary curriculum", "spring": true, "number": "966", "fall": true, "units": " 2", "description": "An intensive course in the assessment and management of equine emergencies.  This would include evaluation of patients, surgical and medical treatment of in house and emergency critical care patients, and post-operative assessment and management.  Students will gain valuable practical experience of critically ill patients and rounds will be held daily to ensure a high level of learning."}, {"summer": "True", "name": "Clinical Veterinary Dentistry", "spring": "True", "number": "967", "fall": "True", "units": " 2", "description": "Will participate in examination, admission, diagnosis treatment, discharge, and follow-up of patients in dentistry service.  Take a clinical history, perform a physical examination, develop appropriate diagnostic plan, discuss the plan with the service's clinicians, and participate in formulation of treatment protocol.  Service treats patients Monday-Thursday, Friday reserved for overflow, emergencies, research and teaching.  Students given prepared lectures on dental procedures and diseases, and will be allowed to perform supervised procedures on cadavers.  (No animals euthanized for this purpose.)"}, {"summer": true, "name": "Equine Orthopedic Surgery and Lameness", "prerequisites": "Prerequisite: DVM student, Completion of 3rd year veterinary curriculum", "spring": false, "number": "968", "fall": true, "units": " 2", "description": "Application of problem solving skills and the art, science, and practice of equine orthopedic surgery and lameness in the veterinary teaching hospital setting."}, {"summer": false, "name": "Equine Podiatry", "prerequisites": "Prerequisite: 4th yr. standing in the veterinary curriculum at the CVM, Successful completion of 3rd yr. of Veterinary Curriculum", "spring": true, "number": "969", "fall": true, "units": " 2", "description": "Two-week clinical block in equine podiatry clinic Tuesday, Wednesday, and Thursday, with guided independent clinically applied study Monday and Friday."}, {"summer": true, "name": "Companion Animal and Special Species", "prerequisites": "Prerequisite: Fourth year student in the professional curriculum at The College of Veterinary Medicine", "spring": true, "number": "970", "fall": true, "units": " 2", "description": "Students on this rotation will have the opportunity for more direct animal experience than they have previously had.  They will be exposed to the needs of shelter animals and the care of large populations of dogs and cats.  The mobile unit will be used for the provision of off-site medical and surgical care, but will be staffed with student volunteers.  The Wake County Animal Shelter is serving as the intake facility for all relinquished animals in Wake County."}, {"summer": "True", "name": "Comp Animal Med II", "spring": "True", "number": "971", "fall": "True", "units": " 4", "description": "1.  Obtain a thorough history and perform a complete physical examination. 2. Identifying, defining, and prioritizing problems. 3. Developing and initiating rational diagnostic and therapeutic plans. 4.  Performing certain diagnostic and therapeuticprocedures.  5. Interpreting results of diagnostic tests, and determining their importance to the patient. 6. Verbal and written communication with clinicians, clients, veterinary techniques, fellow student veterinarians, and referring veterinarians. 7.  Determining the point at which it is time to refer a case to a colleague for ?another look?, or to a referral center for specialized diagnostic testing or treatment. 8. Understanding how cases management in private practice compares with referral practice.  9.  Approaching issues regarding euthanasia; your decision-making, assisting the owner."}, {"summer": true, "name": "Clinical Small Animal Veterinary Cardiology", "prerequisites": "Prerequisite: 4th yr. standing in the veterinary curriculum at the CVM, Successful completion of 3rd yr. of Veterinary Curriculum", "spring": true, "number": "972", "fall": true, "units": " 2", "description": "Two-week clinical rotation to provide senior veterinary student training in diagnostic and therapeutic aspects of veterinary small animal cardiology.  Clinical experience with patients and clents of Veterinary Teaching Hospital and topic and case review rounds."}, {"summer": true, "name": "Small Animal Surgery", "prerequisites": "Prerequisite: Completion of third year veterinary curriculum", "spring": true, "number": "973", "fall": true, "units": " 2", "description": "Clinical rotation on the small animal surgery services. Students will be assigned to one of two services, general surgery or orthopedic surgery. Students see cases and assist with care of small animal surgical patients. Students will be on-call to assist with emergency surgery cases."}, {"summer": false, "name": "Equine General Surgery", "prerequisites": "Prerequisite: DVM student, Completion of 3rd year veterinary curriculum", "spring": true, "number": "975", "fall": true, "units": " 2", "description": "Application of problem solving skills and the art, science, and practice of equine general surgery in the veterinary teaching hospital setting."}, {"summer": true, "name": "Veterinary Critical Care", "prerequisites": "Prerequisite: 4th year DVM student", "spring": true, "number": "976", "fall": true, "units": " 2", "description": "Assessment and management of companion animal emergency and critical care patients, including several 'hands on' laboratories using cadavers to learn and practice emergency and critical care techniques.  Principles of emergency and critical patient evaluation, stabilization, and organ system support are the focus of the course.  Out-rotations at area emergency clinics are required. Open only to 4th year students in the small animal focus area."}, {"summer": true, "name": "Equine Preventative Health Care", "prerequisites": "Prerequisite: Completion of 3rd year in veterinary curriculum", "spring": true, "number": "977", "fall": true, "units": " 2", "description": "Perform routine preventative health care procedures for the horse in a field setting."}, {"summer": false, "name": "Equine Lameness", "prerequisites": "Prerequisite: DVM student, Completion of the third year of the veterinary curriculum", "spring": true, "number": "978", "fall": true, "units": " 2", "description": "Development and use of problem solving skills and techniques for diagnosis, treatment, and management of lameness in horses."}, {"summer": false, "name": "Equine Medicine", "spring": true, "number": "979", "fall": true, "units": " 2", "description": "Students are responsible for all aspects of patient care and are expected to be dedicated to their patients.  Frequent and careful observation of the patients, attention to detail, diligent record keeping, accuracy in formulating and carrying out a treatment plan, and use of common sense are expected.  The earlier you note potential problems, the earlier and easier they can be resolved.  Irresponsibility, carelessness, lack of accuracy, untruthfulness, or a poor attitude will not be tolerated."}, {"summer": "True", "name": "Vet Clini Oncology", "spring": "True", "number": "980", "fall": "True", "units": " 2", "description": "This is a two-week, two credit elective rotation during the 4th year of CVM professional studies providing experience in the diagnosis and treatment of cancer in animals.  Emphasis is on development of comprehensive cancer management strategies including ethical considerations, diagnostic techniques, treatment options, and client communication skills. Students will be assigned cases being seen by the oncology service as inpatients, outpatients, and new referral appointments."}, {"summer": "True", "name": "Lab Animal Medicin", "spring": "True", "number": "981", "fall": "True", "units": " 2", "description": "The block will provide practical experience in the diagnosis, treatment and prevention of diseases of laboratory animals.  It will include special study of diseases of laboratory animals and the management of laboratory animal facilities.  Opportunity to perform surgical procedures on common laboratory animals will be provided in a series of surgical labs.  There will be field trips to other laboratory animal resource facilities within the Research Triangle Park and surrounding areas.  The student will present a seminar on a selected topic for critical appraisal by students and faculty."}, {"summer": "True", "name": "Ophthalmology", "spring": "True", "number": "982", "fall": "True", "units": " 2", "description": "The purpose of the ophthalmology course is to acquaint the student with examinations, diagnostics and therapeutic practices, and principles of clinical veterinary medicine.  There will be direct supervision by faculty and house officers.  Attendanceis required at weekly clinical rounds, general medicine rounds, and the patient rounds and mini-seminars conducted within the service.  Irregular and/or long hours may be required.  Students will be expected to be neatly dressed, well groomed, and conduct themselves in a professional manner at all times."}, {"summer": "True", "name": "Dermatology", "spring": "True", "number": "983", "fall": "True", "units": " 2", "description": "Most of the diagnostic techniques employed in dermatology are very simple and do not require expensive equipment or excessive amounts of time.  The key to successful dermatological practice is to use these tools appropriately to recognize conditions such as parasitic infestations and bacterial or yeast infections for which there is a specific course of treatment. It specializes in the diagnosis and management of chronic ear disease and immunological dermatoses such as autoimmune skin diseases, food reactions and atopic dermatitis. The good practitioner however, recognizes that cutaneous manifestations may be a reflection of internal disease and a thorough systemic evaluation is also required.  When studying the skin there is one big advantage, it is on the outside."}, {"summer": "True", "name": "Intro Clin Neuro", "spring": "True", "number": "984", "fall": "True", "units": " 2", "description": "Attendance is required at weekly clinical rounds, general medicine rounds, and the patient rounds and mini-seminars conducted within the service.  Irregular and/or long hours may be required.  Students will be expected to be neatly dressed, well groomed, and conduct themselves in a professional manner at all times."}, {"summer": true, "name": "Avian and Reptile Medicine", "prerequisites": "Prerequisite: 4th year standing in the veterinary curriculum at the CVM, VMC 953, VMF 964", "spring": true, "number": "985", "fall": true, "units": " 2", "description": " snakes) will be taught using clinical cases in the Veterinary Teaching Hospital and field service visits to avicultural and herpetological collections.  Emphasis will be on proper restraint and handling, physical examination, diagnostic sample collection and routine treatment procedures.  A problem orientated approach will be used for all clinical cases."}, {"summer": "True", "name": "Adv Com An Int Med", "spring": "True", "number": "986", "fall": "True", "units": " 2", "description": "This course provides a higher level experience to diagnosis and management of companion animals with complex medical problems.  Students may choose to concentrate on particular aspects of internal medicine.  Students are not required to participate in emergency/intensive care unit duty."}, {"summer": "True", "name": "Aquatic Medicine", "spring": "True", "number": "987", "fall": "True", "units": " 2", "description": "This course is designed as an elective clinical block rotation in field services, in the final year of the professional DVM curriculum.  Students electing the course would have successfully completed the two theoretical/laboratory courses in specialspecies medicine providing the foundation for participation in this course.  It is the only clinical course offering hands on experience with medical care delivery to aquatic species."}, {"summer": "True", "name": "Special Species MD", "spring": "True", "number": "988", "fall": "True", "units": " 2", "description": "This senior year two-week clinical course (half CVM-based, half private practice) provides practical experience in the diagnosis, treatment and prevention of disease in privately owned fish, amphibians, reptiles, birds, rodents, lagomorphs, and other small mammals. This rotation is designed to combine clinical training in avian and herptile medicine at the CVM with clinically based special species medicine and surgery in private practice.  Students will normally spend the first week at the CVM (3 days avian; 2 days herptile). During the second week students will split and visit different practices in the Triangle area. Case responsibility will be assigned to individual students by the course instructor(s) as appropriate in the practice setting. In some cases students will also be seeing pet domestic mammals, depending on the clinic and caseload for the particular day. Irregular and/or long hours are not expected but may be required in unforeseen circumstances. Weekend duties are not routinely required. Students will be expected to be neatly dressed, well groomed, and conduct themselves in a professional manner at all times."}, {"summer": true, "name": "Zoological Medicine", "prerequisites": "Prerequisite: VMC 964 or successful completion of 3 Zoological Medicine Focus Selectives; and Course Coordinator's Permission", "spring": true, "number": "989", "fall": true, "units": " 4", "description": "This course is designed to introduce the senior veterinary students to clinical zoological medicine.  Students will gain practical experience in the diagnosis, treatment, and prevention of disease in captive zoological specimens maintained in zoos.Students participate in formal rounds, autodidactic exercises, and case management at the N.C. Zoological Park."}, {"summer": false, "name": "Musculoskeletal Ultrasound in the Horse", "prerequisites": "Prerequisite: VMC 975", "spring": true, "number": "990", "fall": true, "units": " 2", "description": "Develop and use problem solving skills during management of clinical cases incorporating diagnostic ultrasound in a number of different clinical situations.  Physics of ultrasound and the resultant sound beam-tissue interactions, mainly musculoskeletal diagnostic ultrasound."}, {"summer": "True", "name": "SP Top in DOCS", "prerequisites": "Corequisite: Current enrollment in DVM program", "spring": "True", "number": "991", "fall": "True", "units": " 1", "description": "One week special topic course in the Department of Clinical Sciences"}, {"summer": "True", "name": "SP Top in DOCS", "spring": "True", "number": "992", "fall": "True", "units": " 1-4", "description": "Two week special topic course in the Department of Clinicial Sciences."}, {"summer": false, "name": "Special Problems Equine Medicine and Surgery", "spring": true, "number": "993", "fall": true, "units": " 2", "description": "This course is offered to students that have already signed up to take any two of the following courses: Preventative Health Care, Equine Medicine, Equine Surgery, or Equine Theriogenology.  The course is designed to give additional experience in equine-oriented clinical services at NCSU.  Students will not be able to participate in this block off campus, unless working directly with a NCSU faculty member.  A faculty mentor must be identified within one month of signing up for this course and awritten proposal of activities planned submitted to Dr. Gardner."}, {"summer": "True", "name": "Small Animal 4th Year Extramural Studies", "spring": "True", "number": "994", "fall": "True", "units": " 1-6", "description": "This course is a recommended rotation designed to expand opportunities for senior veterinary students to participate in small animal private practice a) enhance and learn clinical and technical skills, b) develop effectice client communication skills and time management, and c) observe elements of small business management, including personnel involved and professional financial interactions with private clients.  Students will work at a private or corporate veterinary practice under the directsupervision of a licensed veterinarian engaged in small animal practice.  Must be senior student in the DVM program."}, {"summer": true, "name": "Clinical Conference", "spring": true, "number": "995", "fall": true, "units": " 1", "description": "Each senior student is required to do a 25 minute presentation during their senior year.  The presentation may involve a case report, series of cases, or epidemiological study.  Retrospective study of a disease or syndrome including data drawn from other institutions or published findings may be used as well as topics of general interest to veterinary medicine of an innovative nature."}, {"summer": false, "name": "Advanced Avian Clinical Medicine", "prerequisites": "Prerequisite: VMC 991 Basic Avian Medicine Selective", "spring": false, "number": "996", "fall": true, "units": " 2", "description": "Students will work with teaching birds to develop skills in avian handling, diagnostic sample collection, anesthesia and radiology.  Cadavers will be used to teach orthopedic and soft tissue surgical procedures.  Students and faculty will spend approximately 5 days in the field, working with psittacine birds, waterfowl and raptors at Sylvan Heights Waterfowl park in Scotland Neck, NC and at the Carlina Raptor Center in Charlotte, NC.  Restricted to senior DVM students."}, {"summer": true, "name": "Raptor Medicine and Rehabilitation", "spring": true, "number": "997", "fall": true, "units": " 2", "description": "This elective senior year rotation allows students to obtain clinical experience in raptor medicine and rehabilitation at Carolina Raptor Center in Charlotte, N.C.  Students will develop skills with species identification, capture and handling, physical examination, bandaging, diagnostic sample collection and interpretation, emergency stabilization and treatment techniques, necropsy, anesthesia and surgery assistance, and captive management and husbandry issues.  A maximum of 2 students will be permitted in each 2-week clinical rotation.  For students enrolled in DVM Curriculum.  Will partially fulfill senior year requirement for elective clinical rotation credit in Zoo Focus Area."}, {"summer": true, "name": "Wildlife Rehabilitation Medicine", "prerequisites": "Prerequisite: VMC 964 or successful completion of 3 Zoological Medicine Focus Selectives, VMC 989, and Course Coordinator's Permission", "spring": true, "number": "998", "fall": true, "units": " 2", "description": "Wildlife rehabilitation medicine, the delivery of health care and management to free-ranging native wildlife with the goal of re-release is an important component of clinical veterinary medicine.  Students will apply practical medical and surgical techniques and methods for diagnosing disease, delivering health care, and implementing appropriate triage for injured and ill North Carolina native wildlife."}, {"summer": true, "name": "Veterinary International Field Studies", "prerequisites": "Prerequisite: DVM student", "spring": true, "number": "999", "fall": true, "units": " 2", "description": "This course will provide students with practical experience in a foreign country working on a veterinary medicine related project being conducted in that country.  Projects may focus on production medicine, occupational safety, zoological medicine, or basic research."}]