[{"summer": false, "name": "Poultry Diseases", "spring": true, "number": "401", "fall": false, "units": " 4", "description": "Concepts of factors contributing to or causing disease, disease cycle, host responses, and general approaches to prevention and control including management and biosecurity methods, immunization, and medication.  Recognition, diagnosis, prevention, control, and treatment of economically significant infectious and noninfectious diseases affecting poultry."}, {"summer": false, "name": "Disease of Farm Animals", "prerequisites": "Prerequisite: Junior standing.", "spring": true, "number": "420", "fall": false, "units": " 3", "description": "Pathology of bacterial, viral, parasitic, nutritional, thermal and mechanical disease processes for farm animals. This emphasis practices for prevention and control of each disease."}, {"summer": false, "name": "Infection and Immunity 1", "prerequisites": "Prerequisite:Admission to the DVM Curriculum", "spring": false, "number": "910", "fall": true, "units": " 3", "description": "This course is intended to familiarize the student with the pathogenic bacteria and fungi of veterinary importance.  The student will learn the properties and cultivation of these microorganisms and receive a general introduction to the diseases they can cause.  Primary emphasis will be placed on how the biology of the pathogen influences disease pathogenesis, and microbiological identification of infectious agents.  The laboratory exercises will complement the lectures and focus on standard procedures for microbial cultivation and identification."}, {"summer": false, "name": "Introduction to Clinical Problem Solving in Veterinary Practice", "spring": false, "number": "912", "fall": true, "units": " 2", "description": "Introduction to Clinical Problem Solving in Veterinary Practice is a two credit hour course which is team taught by faculty, house officers and graduate students from each of the college's three departments: Population Health and Pathobiology, Molecular and Biomedical Sciences, and Clinical Sciences."}, {"summer": "True", "name": "Health Maintenance and Animal Production I", "spring": "True", "number": "916", "fall": "True", "units": " 1", "description": "This course is part I of a series with VMP 936 and 956 designed to introduce students to procedures for health maintenance and care of horses and food-producing animals. Students learn how to prevent diseases and promote animal health in laboratories."}, {"summer": false, "name": "Infection and Immunity 2", "prerequisites": "Prerequisite:Admission to the DVM Curriculum", "spring": true, "number": "920", "fall": false, "units": " 4", "description": "This course is intended to continue the topics introduced in Infection and Immunity 1. Specific bacterial, fungal and viral pathogens will be covered including pathogenesis and strategies used to control infection and/or development of disease. The course will also cover more advanced topics in immunology including the types of hypersensitivities, autoimmunity, immunity in the newborn and fetus, immune deficiencies and vaccination."}, {"summer": false, "name": "Problem Solving for Cases in Infectious Diseases and Immunity 1", "prerequisites": "Prerequisite:Admission to the DVM Curriculum", "spring": true, "number": "921", "fall": false, "units": " 2", "description": "This course is intended to challenge first-year veterinary students to reach a diagnosis of realistic cases involving either infectious diseases or immune pathology. The first part of the course is an introduction to diagnostic laboratory procedures. The second portion of the course requires the students to develop a list of differential causes to assigned clinical cases, choose a presumptive diagnosis based on available data and ordering of diagnostic tests to confirm the presumptive diagnosis. The individual cases are discussed in a small group format with a faculty facilitator."}, {"summer": false, "name": "Infection and Immunity 3", "prerequisites": "Prerequisite:Admission to the DVM Curriculum", "spring": false, "number": "930", "fall": true, "units": " 3", "description": " 2 (first-year curriculum) for the second-year veterinary student. This course is designed to reinforce principles if infectious disease and immunity introduced in the first year of the DVM curriculum and expand upon specific groups of parasites. This course will cover the diagnosis, treatment and control of major endo and ecto parasites of domesticated animals."}, {"summer": "True", "name": "Veterinary Pathology I", "spring": "True", "number": "931", "fall": "True", "units": " 4", "description": "Introduction to the basic pathologic changes which occur in animal tissues. Developmental processes and resulting morphology observed at gross, cellular, and subcellular level emphasized."}, {"summer": "True", "name": "Veterinary Parasitology", "spring": "True", "number": "932", "fall": "True", "units": " 5", "description": "Diagnosis, treatment, and control of major ecto- and endo-parasites of domestic animals."}, {"summer": "True", "name": "Health Maintenance and Animal Production II", "prerequisites": "Prerequisite: VMP 916", "spring": "True", "number": "936", "fall": "True", "units": " 1", "description": "This course is part II of a series with VMP 916 and 956 designed to introduce students to procedures for health maintenance and care of horses and food-producing animals. Students learn how to care for animals, prevent diseases, and milk cows in laboratories."}, {"summer": "True", "name": "Veterinary Pathology II", "spring": "True", "number": "941", "fall": "True", "units": " 5", "description": "Systemic Pathology - A study of specific responses of organ systems to pathogenic influences with emphasis on the effects of the pathogenic systems on the body as a whole."}, {"summer": "True", "name": "Veterinary Clinical Pathology", "spring": "True", "number": "942", "fall": "True", "units": " 3", "description": "Introduction to the mechanisms which produce abnormal physiologic parameters within the animal during illness, with emphasis on the techniques for determining those abnormalities in the living animal."}, {"summer": false, "name": " Public Health", "prerequisites": "Prerequisite: VMP 912, DVM student", "spring": true, "number": "945", "fall": false, "units": " 3", "description": "The focus of this course is to construct a foundation for clinical medicine by acquiring a holistic view of disease, exploring optimal preventive medicine strategies while developing a critical thinking skills and quantitative reasoning techniques. The teaching/learning format of the course will include lecture, in-class exercises, discussions and case studies."}, {"summer": false, "name": "Health Maintenance and Animal Production III", "spring": false, "number": "956", "fall": true, "units": " 1", "description": "This course is part III of a series designed to instruct students in procedures for maintaining the health and well-being of horses and food-producing animals. Students learn how to prevent diseases and promote animal production, including production of safe meat and milk."}, {"summer": false, "name": "Exotic and Emerging Diseases in Veterinary Medicine", "prerequisites": "Prerequisite: VMP 945, DVM student", "spring": false, "number": "958", "fall": true, "units": " 1", "description": "This course explores a wide range of diseases not usually found in the United States but which pose a threat to agricultural and other native populations of animals. The course provides students with an overview of recent emerging diseases and the reasons behind why they occur. An overview of food safety, food hygiene and the food supply and agricultural animal populations."}, {"summer": "True", "name": " Surgery", "spring": "True", "number": "962", "fall": "True", "units": " 3", "description": "This course is a study of the clinical disorders of the integumentary, respiratory, digestive, urogenital, and musculoskeletal (including lameness) systems in food animals and horses that are corrected by surgical interventions. The laboratory sessions include the practical application of anesthesia in large animals and the performance of surgical procedures to correct common surgical lesions in large animals."}, {"summer": "True", "name": "Swine and Poultry Medicine", "spring": "True", "number": "964", "fall": "True", "units": " 3", "description": "Lecture series supplemented with projected illustration on the most economically important diseases of poultry and swine. Emphasis is placed on definition of diseases, etiology, characteristics of the disease, and diagnosis. The economics related tooccurrence, prevention, treatment, and control are presented."}, {"summer": "True", "name": "Ruminant Health Management I", "spring": "True", "number": "970", "fall": "True", "units": " 2", "description": "This is a two-week block considering health management of ruminant species. During the two-week period, students accompany faculty on visits to farms to deliver health management programs, to investigate health problems, or to consider approaches to enhance productivity. A portion of the course also involves experience in providing individual animal health management and addressing medical/surgical disorders. Restricted to fourth year veterinary students."}, {"summer": true, "name": "Food Animal Diagnostics for Disease Diagnosis, Control, and Population Surveilla", "prerequisites": "Prerequisite: Prior undergraduate coursework, summer work experiences, and/or consistent enrollment and good performance in food animal selectives.", "spring": false, "number": "971", "fall": false, "units": " 2", "description": "This course intended to instruct food animal veterinary students in: 1) underlying principles of veterinary diagnostic assays, 2) proper collection of samples, 3) effective testing approaches for diagnosis and management of disease, 4) strategies for efficient monitering of food animal population for infection by specific agent(s), and 5) analysis of data from veterinary diagnostic laboratory tests and optimal use of the results for making production management decisions.  Priority given to students in Food Animal Focus area.  Students in Mixed Animal Focus Area or special-case Epidemiology Focus Area students can enroll (if space remains) with the approval of Course Coordinator if they meet the criteria states in the above requisites."}, {"summer": false, "name": "Ruminant Health Management II", "prerequisites": "Prerequisite: VMF 970", "spring": true, "number": "972", "fall": true, "units": " 2", "description": "Senior veterinary students will experience advanced training in ruminant clinical medicine."}, {"summer": "True", "name": "Special Topics in Epidemiology", "spring": "True", "number": "973", "fall": "True", "units": " 2", "description": "The main goal of this course is to provide senior veterinary students with the opportunity for pursuing a focused research topic in the area of veterinary epidemiology and population medicine under the direction of consenting faculty. The exact direction and scope of the topic is agreed upon between the instructor, the student and the course coordinator. The course is offered only by the permission of the participating instructor(s) and the course coordinator. The instructor and the student will work out the type of project, what exact objectives are to be met and how the success of obtaining those objectives will be evaluated. The objectives and methods of evaluation of performance will be negotiated between the veterinary student and theinstructor and put into writing in the form of a Plan of Action PRIOR to course permission being granted by the course coordinator. The Plan of Action must be signed by both the instructor and the course coordinator at least 8 weeks prior to the beginning of the rotation. No one textbook is required for this course."}, {"summer": "True", "name": "Food Supply Veterinary Medicine", "prerequisites": "Prerequisite: Completion of first 3 years of veterinary curriculum; consent of instructor for any enrollment >8.", "spring": "True", "number": "974", "fall": "True", "units": " 2", "description": "This 2-week course provides exposure to the clinical principles of food supply veterinary medicine. It is primarily intended for individuals who are not in the NCSU-CVM Food Animal Focus Area. Ruminant, swine and poultry faculty provide an overview of the animal industries and production practices, as well as exposure to basic veterinary knowledge and clinical skills. Prerequisites may include consent of instructor."}, {"summer": "True", "name": "Advanced Topics in Veterinary Anatomic Pathology", "prerequisites": "Prerequisite: VMP 977", "spring": "True", "number": "975", "fall": "True", "units": " 1-6", "description": "This is a two-week senior veterinary clinical rotation that provides students with additional, focused experience in veterinary anatomic pathology.  Students have the option of rotating through necropsy service and surgical biopsy service for two weeks to gain additional experience in pathology similar to VMP 977, the prerequisite for this course.  Students have the option of designing a specialized pathology  experience with the guidance of an approved pathology faculty member.  Enrollment requires pre-approval by faculty assigned to the course."}, {"summer": false, "name": "Food Animal Pharmacology", "prerequisites": "Prerequsite: VMB 943; VMP 962; VMP 964", "spring": false, "number": "976", "fall": true, "units": " 2", "description": "This course will outline the basic principles of pharmacology and therapy of the major diseases of ruminants, swine and poultry.  Students will be expected to develop a thorough understanding of how properly to use drugs in food animal species and should be able to develop a treatment program for most major livestock diseases.  The course will be restricted to students in the food animal and mixed animal focus areas."}, {"summer": "True", "name": "Clin Lb", "spring": "True", "number": "977", "fall": "True", "units": " 2"}, {"summer": "True", "name": "Clin Path/Para/IMM", "spring": "True", "number": "978", "fall": "True", "units": " 2"}, {"summer": "True", "name": "Epidemiology", "spring": "True", "number": "979", "fall": "True", "units": " 2", "description": "The main goal is to provide senior veterinary students with the opportunity for pursuing a focused research topic in the area of veterinary epidemiology and population medicine under the direction of consenting faculty. The exact direction and scopeof the topic is agreed upon between the instructor, the student and the course coordinator. This course is offered only by the permission of the participating instructor(s) and the course coordinator. The instructor and the student will work out thetype of project, what exact objectives are to be met and how the success of obtaining those objectives will be evaluated. The objectives and methods of evaluation of performance will be negotiated between the veterinary student and the instructor and put into writing in the form of a Plan of Action PRIOR to course permission being granted by the course coordinator. No one textbook is required for this course."}, {"summer": true, "name": "Theriogenology I", "prerequisites": "Prerequisite: Enrolled in fourth year clinical rotations.", "spring": true, "number": "980", "fall": true, "units": " 2", "description": "This course is designed to instruct students in clinical Theriogenology. It will be primarily oriented toward equine and canine species, however, cases and problems from other species will be seen and included as teaching materials. The students will improve upon the skills learned in VMF 951 and will be expected to use these skills in dealing with clinical cases and laboratory type situations. Transabdominal, vaginal, and rectal examination of the reproductive tract, semen collection, and evaluation will be taught during this course. This course may be repeated as many times as a student wishes during their senior year."}, {"summer": "True", "name": "Special Topics in Theriogenology", "spring": "True", "number": "981", "fall": "True", "units": " 2", "description": "The primary objective of this course is to provide additional information and training to veterinary students that had taken the VMF 980 Clinical Theriogenology senior clinical rotation. Specifically, emphasis is directed to acquaint students with modern and current practices of clinical Theriogenology. Various aspects of assisted reproductive technology available to domestic animals will be discussed. It is expected that the majority of the information and activities offered in this course will involve equine species (80%) and, to a lesser extent, canine (10%) and bovine species (10%). Teaching and client-owned animals are available for the rotation. Although emphasis is given on hands-on activities, didactic instruction of selected topics in clinical Theriogenology will be discussed."}, {"summer": "True", "name": "Poultry Health Management I", "spring": "True", "number": "982", "fall": "True", "units": " 2", "description": "Poultry Health Management I is a clinical rotation elective for 4 th year veterinary students with an interest in poultry health management or food animal production. This two-week course is offered 4 times each year. Diseases of turkeys and chickens will be discussed. Basic concepts in poultry disease diagnosis, prevention and treatment will be emphasized. The course will consist of lectures, laboratory and field experiences."}, {"summer": "True", "name": "Poultry Health Management II", "spring": "True", "number": "983", "fall": "True", "units": " 2", "description": "Poultry Health Management II is a clinical rotation elective for 4 th year veterinary students with a commitment to pursue a career in poultry health management or food animal production. This two-week course is offered throughout the year and may be repeated with permission of the instructor. The course will consist of laboratory and/or field experiences designed to meet the student's career goals. A list of available externships in poultry health management, which may be applicable for this course can be found on the Association of Avian Pathologists web site: http://www.aaap.info/index.html, under Educational Opportunities, Senior Veterinary Student Externships approved by the Kenneth Eskelund Preceptorship Committee. Funds to help pay for travel expenses may be available through the Kenneth Eskelund Preceptorship, see information at the web site listed above."}, {"summer": "True", "name": "Swine Health Management I", "spring": "True", "number": "984", "fall": "True", "units": " 2", "description": "This course will provide senior veterinary students with techniques and expertise to approach a clinical swine problem. Students will evaluate clinical signs, analyze production records, assess facilities and management, institute a diagnostic plan and establish an economically feasible solution to the clinical problem. The outline for this course may vary slightly from year to year but the following topics will be covered: Necropsy procedures/sample techniques; Interpreting serologic/virologicresults; Farm visits - review building/equipment designs; Practical swine reproductive management; Practical bacteriology; Practical swine nutrition/rations; Swine record systems/Pig Champ."}, {"summer": "True", "name": " Production II", "spring": "True", "number": "985", "fall": "True", "units": " 2", "description": "This course will provide senior veterinary students with the opportunity to utilize the techniques and expertise gained in VMF 984. Students will evaluate clinical and production problems on a variety of swine farms. Practicum/field work and independent study will be conducted on commercial swine farms, usually with a veterinary practitioner or faculty member."}, {"summer": false, "name": "One Health: From Philosophy to Practice", "spring": true, "number": "986", "fall": true, "units": " 2", "description": "Graduate/professional seminar (with team project) addressing intersections of veterinary medicine, human medicine, and environmental health. Co-listed at UNC CH Gillings School of Global Public Health and Duke University School of Medicine. Includes participants from these three institutions, plus related private-sector members, non-governmental organizations, and governmental professionals. Its purpose is to facilitate understanding of one health as a system of systems, and promote cross-campus and cross-discipline interactions. Weekly evening course held at NC Biotechnology Center, RTP. Limit: 15 students per university. Requires current graduate standing at NCSU or professional student standing within the College of Veterinary Medicine."}, {"summer": "True", "name": "Ruminant Topics", "spring": "True", "number": "987", "fall": "True", "units": " 2", "description": "This two-week elective allows goal-directed educational enrichment in Ruminant Practice under the direction of consenting faculty. Formats include clinical experiences, clinical and applied investigations, etc. Topics and times are arranged by the student and consenting faculty. Available to 3 rd and 4 the year veterinary students only upon consent of faculty. VMF 970 may be a required prerequisite."}, {"summer": "True", "name": "Large Animal Community Classroom", "spring": "True", "number": "990", "fall": "True", "units": " 2", "description": "Senior DVM students will have the opportunity to undertake an elective rotation in an approved practice externship in a large animal practice a) food animal/rural or b) equine/mixed animal. The practice opportunity will meet the need recognized by students, CVM faculty and private practice colleagues alike to increase \"hands on\" experience in a private practice setting. Private practice experiences are available for year 1 - 3 students through the selective offerings. Presently, senior studentshave the opportunity to experience private practice by arranging an externship as an elective. However, initiating an elective course will ensure consistency between experiences, with clear expectations to achieve an approved level of learning/skills objectives with verification from the practice. Practitioners will be valuable partners in the education process in the senior year, providing access to individual animal and herd-related clinical diversity that is increasingly difficult to offer in the academic setting."}, {"summer": "True", "name": "SP Top in PHP", "spring": "True", "number": "991", "fall": "True", "units": " 1", "description": "Pathobiology Department."}, {"summer": "True", "name": "SP Top in PHP", "spring": "True", "number": "992", "fall": "True", "units": " 1-2", "description": "Pathobiology Department."}, {"summer": "True", "name": "Extramural Experience in Pathology", "spring": "True", "number": "994", "fall": "True", "units": " 1-4", "description": "This is a two-week externship experience in pathology.  The student will arrange an extramural experience in an academic, diagnostic, government, industrial, or zoological/wildlife labratory setting under the supervision of a board certified veterinary anatomical or clinical pathologist.  Fourth year DVM students only."}, {"summer": "True", "name": "Clinical Conferenc", "spring": "True", "number": "995", "fall": "True", "units": " 1"}, {"summer": false, "name": "Vet International Field Studies", "spring": true, "number": "999", "fall": true, "units": " 2", "description": "This course will provide students with practical experience in a foreign country working on a veterinary medicine related project being conducted in that country.  Projects may focus on production medicine, occupational safety, zoological medicine, or basic research."}]