[{"summer": "True", "name": "Trade and Agricultural Health", "prerequisites": "Prerequisite: Graduate standing, Upper Class Undergraduate standing", "spring": "True", "number": "554", "fall": "True", "units": " 2", "description": "This course is designed for agriculture and food safety specialists, veterinarians, and epidemiologists interested in learning about international trade and agricultural health. WTO/SPS affect all aspects of agricultural health including production,food security, public health, tourism and the environment. This introductory course will review SPS articles, GATT provisions, the associations between WTO and public health, the work of the OIE, CAC, and IPPC; the impact of TRIPS and anti-dumping measures."}, {"summer": "True", "name": "Public Health, Sustainable Development and Gender in Global Context", "prerequisites": "Prerequisite: Undergraduate biological sciences courses such as biology, zoology, neurobiology, or genetics", "spring": "True", "number": "555", "fall": "True", "units": " 3", "description": "This course will examine the complex intersections of human health, public policy, agriculture in developing world, and gender issues, drawing on theory and research from international and interdisciplinary perspectives."}, {"summer": "True", "name": "Issues in Preventive Medicine and Public Health", "prerequisites": "Prerequisite: A prior degree in veterinary medicine or public health", "spring": "True", "number": "649", "fall": "True", "units": " 1", "description": "Issues in Preventive Medicine and Public Health is a literature review course designed to assist students with their preparation for careers in public health, ecosystem health, biosecurity and public policy, disaster management, and application for Board Certification in the American College of Preventive Veterinary Medicine.  Permission by course instructor required for enrollment."}, {"summer": "True", "name": "Population Medicine Forum", "spring": "True", "number": "650", "fall": "True", "units": " 1", "description": "Population medicine forum is a seminar-based class during which current topics in population health are presented and discussed.  Topics covered include: Outbreak investigation, observational epidemiologic research, risk analysis, spatial analysis, the application of  unique diagnostic technologies and epidemiologic modeling."}, {"summer": "True", "name": "Supervised Public Health Research", "spring": "True", "number": "675", "fall": "True", "units": " 1-7", "description": "Supervised reserach focused on Public Health.  Permission by course instructor required for enrollment."}, {"summer": "True", "name": "Supervised Public Health Research", "prerequisites": "Prerequisite: VPH 580, ST 511 or equivalent", "spring": "True", "number": "693", "fall": "True", "units": " 1-5", "description": "Supervised research focused on Public Health."}, {"summer": "True", "name": "Zoonoses and Public Health", "prerequisites": "Prerequisite: VPH 580 or equivalent, ST 511 or equivalent", "spring": "True", "number": "713", "fall": "True", "units": " 3", "description": "Enrollment to graduate veterinarians, MVPH, MPH, or other graduate students.  Veterinary students will be considered for enrollment after consultation with the course coordinator."}, {"summer": "True", "name": "Epidemiology of Wildlife Diseases", "spring": "True", "number": "720", "fall": "True", "units": " 3", "description": "Concepts related to infectious disease outbreaks in free-ranging species of wildlife.  Numerous examples of wildlife diseases will be used to illustrate factors affecting host-agent-environment interactions in fish, amphibians, birds, and both aquatic and terrestrial mammals.  Enrollment in the Fisheries and Wildlife graduate program or Masters of Veterinary Public Health program; clinical residents or veterinary students at the College of Veterinary Medicine."}, {"summer": "True", "name": "Molecular Technologies for Epidemiologic Investigation", "prerequisites": "Prerequisite: An introductory epidemiology class or consent of instructor", "spring": "True", "number": "760", "fall": "True", "units": " 3", "description": "The course is designed to help students refine their ability to select and interpret molecular diagnostic technologies for epidemiologic disease surveillance and investigation."}]