[{"summer": "True", "name": "Introduction to Wood Products", "spring": "True", "number": "104", "fall": "True", "units": " 2", "description": "Introduction to College of Natural Resources and University services, including libraries, computer labs, Leadership Development Series.  Awareness of size and diversity of wood industry, career potential.  Setting career goals, educational and professional development goals."}, {"summer": "True", "name": "Sustainable Materials for Green Housing", "spring": "True", "number": "201", "fall": "True", "units": " 2", "description": "The overall goal of the class is to make the students more informed and aware consumers of materials used in housing.  The class will connect the economic and energy impacts of producing common materials with the environmental impacts, e.g., carbon, water, and pollutants.  The concepts of embodied energy, water use, and land impacts will be used to examine common building materials.  The concept of Life Cycle Analysis will be introduced and used to evaluate the use and trade-offs for different building materials.  The opportunities and trade-offs for reuse and recycling materials at the 'end of life' will also be explored."}, {"summer": "True", "name": "Wood Anatomy and Properties", "spring": "True", "number": "202", "fall": "True", "units": " 3", "description": "Formation, anatomy and properties of wood. Structural features of softwoods and hardwoods and the relationships among anatomy, physiology, physical and mechanical properties. Variability, naturally occurring defects, and wood deterioration are discussed and related to wood utilization. Techniques on hand lens and microscopic identification of wood."}, {"summer": "True", "name": "Wood Physical Properties", "spring": "True", "number": "203", "fall": "True", "units": " 4", "description": "Physical properties of wood, including specific gravity, dimensional behavior, stress and set, psychrometry, thermal, electrical and moisture relations.  Lumber drying."}, {"summer": "True", "name": "Wood Products Internship", "prerequisites": "Prerequisite: Completion of summer practicum", "spring": "True", "number": "210", "fall": "True", "units": " 1", "description": "Experience in the forest products or related industries with a departmentally selected employer."}, {"summer": "True", "name": "Sustainability, Global Trade and Forest Products", "spring": "True", "number": "230", "fall": "True", "units": " 2", "description": "This course is designed to give the participants an exposure to understanding the effects of global trade on sustainability issues.  The course will include a focus on global issues leading to a sound environment, in addition to a healthy economic base, stable employment, adequate purchasing power, and maintenance of social and cultural integrity.  Various sustainable forest products industries in the US and other countries will be used as example to explain the various concepts throughout this course."}, {"summer": "True", "name": "Sustainable Manufacturing", "spring": "True", "number": "231", "fall": "True", "units": " 2", "description": "The overall goal of the class is to make the students more informed and aware consumers of various products and how they are produced. The class will connect the economic and energy impacts of various manufacturing sectors with the environmental impacts, e.g., carbon, water, and pollutants. The concept of embodied energy, water use, and land impacts will be used will be used to examine these manufacturing sectors. The concept of Life Cycle Analysis will be introduced and used to evaluate the use and trade-offs for different manufacturing techniques. The opportunities and trade-offs for reuse and recycling materials at the \"end of life\" will also be explored for the various products and their respective manufacturing industries."}, {"summer": "True", "name": "Recycling to Create a Sustainable Environment", "spring": "True", "number": "232", "fall": "True", "units": " 2", "description": "The goal of this class is to link the impetus for recycling and recycled materials to the building of a sustainable world.  Recycling efficiencies for various materials will be examined as well as recycling practices and attitudes in other parts of the world.  This course will explore the technology, economics, markets, trade and social impacts due to the recycling of materials.  Case studies will provide an in-depth examination of the problems and potentials for the recycling of selected recycled materials.  The use of Life Cycle Analysis (LCA) to evaluate recycling alternatives will be introduced.  The economic, policy, social and resource availability drivers for recycling will be examined as well as the technological, economic, market and social barriers to recycling."}, {"summer": "True", "name": "Special Topics in Wood Products", "spring": "True", "number": "295", "fall": "True", "units": " 1-3", "description": "Special Topics in Wood Products at the 200 level for offering of courses on an experimental basis."}, {"summer": "True", "name": "Introduction to Wood Chemistry", "prerequisites": "Prerequisite: CH 101, CH 102,  and WPS 202 or 203 or permission", "spring": "True", "number": "301", "fall": "True", "units": " 4", "description": "Introduction of polymer science concepts (thermal transitions, molecular weight, viscoelasticity).  Detailed instruction on wood chemistry,including wood reactivity, wood decay, the chemical aspects of thermal treatments, the separation of wood into its individual components, the reactivity and modification of the individual components, and the conversion of wood into energy products."}, {"summer": "True", "name": "Wood Processing II", "prerequisites": "Prerequisite: WPS 202 or 203", "spring": "True", "number": "302", "fall": "True", "units": " 4", "description": "Theories and techniques of processing raw wood into useable products. Principles of operation of current industrial wood milling equipment including primary and secondary processing. Machining of reconstituted wood products."}, {"summer": "True", "name": "Wood Products Process Facilities Infrastructure", "spring": "True", "number": "308", "fall": "True", "units": " 4", "description": "Wood Products production methods-simulation, optimization, plant layout and material handling. Plant infrastructure-hydraulics, compressed air, electrical, dust extraction."}, {"summer": "True", "name": "Forest Prod Business Mktg", "spring": "True", "number": "346", "fall": "True", "units": " 3", "description": "This course will examine the business and marketing approaches in the forest products industry from a theoretical as well as an applied perspective.  Students will learn the importance of business processes and how products, price, distribution, and promotion plays a role in the purchase behavior of consumers. Students will analyze situations and cases to solve real and hypothetical business problems in the forest products industry."}, {"summer": "True", "name": "Wood Products Literature", "prerequisites": "Prerequisite: Completion of WPS 205", "spring": "True", "number": "350", "fall": "True", "units": " 2", "description": "Exploration of the wood products literature; use of library services, oral and written reports, with emphasis on independent study."}, {"summer": "True", "name": "Wood Mechanics", "prerequisites": "Prerequisite: MA 231, PY 212, WPS 203", "spring": "True", "number": "441", "fall": "True", "units": " 4", "description": "Introduction to orthotropic elasticity.  Shear effect on beam deflections.  Wood- based composite beams.  Shear and bending stress distribution in composite beams.  Elastic stability. Influence of density, moisture content, load direction,  temperature and load duration on mechanical properties of wood.  Creep and mechanosorptive creep.  Grading for structural applications.  Allowable stresses .  Structural fasteners."}, {"summer": "True", "name": "Wood Composites", "prerequisites": "Prerequisite: WPS 301 and senior standing in Wood Products", "spring": "True", "number": "444", "fall": "True", "units": " 3", "description": "Structure-property relationships of common wood adhesives, bond formation fundamentals,bond performance;manufacture, properties, and processing of wood-based composites such as plywood, particleboard, waferboard, and oriented strandboard, as well as specialty composite products."}, {"summer": "True", "name": "Wood Industry Case Studies", "prerequisites": "Prerequisite: Senior standing in WP", "spring": "True", "number": "450", "fall": "True", "units": " 2", "description": "Presentation of relevant Wood industry problems involving material selection, processing and managerial techniques. Causes of in-use failures of wood products and means of prevention."}, {"summer": "True", "name": "Projects in Wood Products", "prerequisites": "Prerequisite: Junior standing.", "spring": "True", "number": "483", "fall": "True", "units": " 3", "description": "Exploration of the wood products literature; use of library services and on-line databases, oral and written reports, with emphasis on independent study. Individual library or laboratory research projects selected and conducted with the approval and guidance of faculty."}, {"summer": "True", "name": "Special Topics in Wood and Paper Science", "spring": "True", "number": "491", "fall": "True", "units": " 1-4", "description": "Independent study of management or technology problems selected with faculty approval or the offering of experimental courses."}, {"summer": "True", "name": "Masters Research Methods in Forest Biomaterials", "spring": "True", "number": "501", "fall": "True", "units": " 2", "description": "This course is an introduction to research methods for MS students in the Forest Biomaterials Department. It will cover conduct of research by the scientific method, literature searching, rules for assigning credit for the work of others, basic research ethics, common laboratory practices including safety and etiquette, mentoring, experimental design, basic statistics, and analysis of data. Students will review research papers, write research papers with proper sections, and present research at the masters level. Credit is not allowed for both WPS 501 and 701."}, {"summer": "True", "name": "Physical and Mechanical Properties of wood", "spring": "True", "number": "504", "fall": "True", "units": " 3", "description": "Concepts involving the interaction of wood with moisture and heat and the mechanical behavior of solid wood based materials are discussed.  Students develop skills in characterization of psychrometric processes in the wood industry, formulation of solutions to moisture related wood problems, the analysis of thermal processes for wood, solving stress-strain problems in load bearing wood structures, and methods to characterize wood properties.  An undergraduate degree in engineering or science is required.  For related undergraduate degrees, the student must get approval from the instructor to enroll."}, {"summer": "True", "name": "Strategic Business Processes for the Forest Products Industry", "spring": "True", "number": "510", "fall": "True", "units": " 3", "description": "Strategic Business Processes is designed to introduce the technically trained student to organizational, management and leadership processes that drive a successful business.  The course highlights the differences between principled leadership and \"opinion poll\" leadership, the need to balance the conflicting wants of major stakeholders in the business, the importance of a unique strategy, the linkage between strategy and day-to-day implementation of the strategy and the ingredients and requirements for a successful career.  Real time illustrations are based on the Forest Products industry."}, {"summer": "True", "name": " Surfaces", "spring": "True", "number": "516", "fall": "True", "units": " 3", "description": "Surface and interfacial science as related to uses of lignocellulosic materials are covered. Fundamentals of the physical chemistry of surfaces and aqueous suspensions are brought to life with examples from such fields as paper science, biomaterials science, composites, and cellulosic liquid fuels technology. Topics include colloidal stability, flocculation, surface forces, polyelectrolyte behavior, electrokinetics, capillary forces, adhesion, surfactancy, and self-assembly. Water-cellulose interactions, including wettability, swelling, and hydrogen bonding effects will be highlighted."}, {"summer": "True", "name": "Chemical Principles for the Papermaking Process Engineer", "prerequisites": "Prerequisite: One year of chemistry courses.", "spring": "True", "number": "522", "fall": "True", "units": " 3", "description": "Chemical principles for the Papermaking Process Engineer provides a foundation in aqueous chemistry and the applications of polyelectrolytes.  The course is intended for professionals employed in the paper manufacturing industry and related industries, such as chemicals suppliers to paper manufacturers.  Topics include the papermaking process, acids and bases, polymers, water-resistance, paper strength, colorants, retention and dewatering aids, deposit control, coatings, recycling, and wastewater treatment.  Lectures are by CD or DVD.  The course-pack, quizzes, and readings are on the web.  For off-campus students.  Permission of instructor required."}, {"summer": "True", "name": "Wet-End and Colloidal Chemistry", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "527", "fall": "True", "units": " 3", "description": "The course objective is to prepare students to solve problems related to chemical usage on paper machines.  Subjects include paper machine operations, fibers, fillers, chemistry of additives, colloids, control of paper's interactions with liquids, strength, dyes,strategies to optimize retention, dewatering strategies, strategies to achieve more uniform paper, strategies to improve production rates, and wet-end chemical process control."}, {"summer": "True", "name": "Structural Design in Wood", "prerequisites": "Prerequisite: CE 325", "spring": "True", "number": "528", "fall": "True", "units": " 3", "description": "Behavior, strength and design of wood structural members subjected to moment, shear and axial forces.  Design of connections and introduction to design of wood structural systems."}, {"summer": "True", "name": "Mechatronics Design", "prerequisites": "Prerequisite: Structured Programming Experience, Senior standing or Graduate standing in WPS/MAE", "spring": "True", "number": "534", "fall": "True", "units": " 3", "description": "Principles of Mechatronics Design, review of logic gates, microprocessor architecture, sensors and actuators, A/D and D/A conversion techniques, real-time multi-tasking programming concepts, direct digital control implementation.  \"Hands-on\" experience through several laboratory assignments and final team project."}, {"summer": "True", "name": "Forest Biomaterials Physics", "spring": "True", "number": "565", "fall": "True", "units": " 3", "description": "Physical models of forest biomaterials including (1) viscosity properties of biopolymer solutions and fibrous suspensions, (2) visco-elastic and thermal properties of biopolymers, (3) elastic properties of biomaterials, and (4) fibrous network properties are covered. Focus is on the scientific aspects of these topics with special applications to materials derived from forest resources."}, {"summer": "True", "name": "Environmental Life Cycle Analysis", "spring": "True", "number": "576", "fall": "True", "units": " 3", "description": "Overview of the various aspects of conducting and interpreting an environmental life cycle analysis on a product or service.  Students will learn how to construct a life cycle analysis goal and scope, inventory, assessment and interpretation.  Skills in the critique and communication of a life cycle analysis will be developed.  Includes an overview of the following life cycle stages: raw materials, energy, transportation, production, use, and end of life.  Emphasis on systems thinking. Targeted for students in any science or engineering program.  Credit not allowed for both PSE 476 and WPS 576."}, {"summer": "True", "name": "Paper Coating and Printing", "spring": "True", "number": "577", "fall": "True", "units": " 3", "description": "Major printing processes and grades of coated paper are presented.  Coating base sheet requirements and design of coating formulation are related to end use requirements.  Coating additives and rheology are analyzed in terms of coating process requirements. The effect of application and drying systems on transport phenomena of coating into paper will be analyzed."}, {"summer": "True", "name": "Master's Seminar", "prerequisites": "Prerequisite: Senior standing or Graduate standing", "spring": "True", "number": "591", "fall": "True", "units": " 1"}, {"summer": "True", "name": "Special Topics Wood and Paper Science", "spring": "True", "number": "595", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Wood and Paper Science Problems", "prerequisites": "Prerequisite: Senior standing or Graduate standing", "spring": "True", "number": "620", "fall": "True", "units": " 1-3", "description": "Assigned or selected problems in the field of wood, paper and pulp science and technology.Credits Arranged"}, {"summer": "True", "name": "Advanced Wood and Paper Science Problems", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "625", "fall": "True", "units": " 1-6", "description": "Selected problems in the field of wood and paper science.Credits Arranged"}, {"summer": "True", "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "685", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "688", "fall": "True", "units": " 1", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc."}, {"summer": "True", "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "689", "fall": "True", "units": " 3", "description": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester."}, {"summer": "True", "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "690", "fall": "True", "units": " 1-6", "description": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam."}, {"summer": "True", "name": "Methods Of Research In Wood and Paper Science", "prerequisites": "Prerequisite: Advanced Undergraduate standing or Graduate standing", "spring": "True", "number": "691", "fall": "True", "units": " 1", "description": "Research procedures, problem outlines, presentation of results; consideration of selected studies by forest research organizations; sample plot techniques.Credits Arranged"}, {"summer": "True", "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "693", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Master Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "695", "fall": "True", "units": " 1-9", "description": "Thesis research."}, {"summer": "True", "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "696", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "699", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their theses."}, {"summer": "True", "name": "PhD Research Methods in Forest Biomaterials", "spring": "True", "number": "701", "fall": "True", "units": " 2", "description": "This course is an advanced research methods course for PhD students in the Forest Biomaterials Department. It will cover conduct of research by the scientific method, literature searching, rules for assigning credit for the work of others, basic research ethics, common laboratory practices including safety and etiquette, mentoring, experimental design, basic statistics, and analysis of data. Students will review research papers, write research papers with proper sections, and present research at the doctoral level. Credit is not allowed for both WPS 501 and 701."}, {"summer": "True", "name": "Wood Anatomy and Chemistry", "spring": "True", "number": "702", "fall": "True", "units": " 3", "description": "A materials-based approach to the fundamental anatomical and chemical characteristics of wood that make it the most important renewable biomaterial composite in the world. Covers anatomical features of wood for different regions, species and parts of the tree. Includes the chemistry of carbohydrates, lignin and extractives in wood. Overviews major chemical processing operations of wood. Provides the required tools to recognize and distinguish wood's micro-structural components and composition to properly identify a wood material for a given application."}, {"summer": "True", "name": "Timber Physics", "prerequisites": "Prerequisite: WPS 202", "spring": "True", "number": "704", "fall": "True", "units": " 3", "description": "Density, specific gravity and moisture content variation affecting physical properties; physics of drying at high and low temperatures; thermal, sound, light and electrical properties of wood."}, {"summer": "True", "name": "Chemistry Of Wood Polysaccharides", "prerequisites": "Prerequisite: CH 223 and PSE 332 or BCH 451", "spring": "True", "number": "721", "fall": "True", "units": " 3", "description": "Fundamental chemistry and physical chemistry of monosaccharides and polysaccharides with emphasis on hemicellulose and cellulose. Topics including construction and configuration, stereochemistry, solution properties, molecular weight determination and reactivity."}, {"summer": "True", "name": "Forest Biomaterials Chemistry", "spring": "True", "number": "723", "fall": "True", "units": " 3", "description": "Chemical reactivity, structure and functional background of forest-derived polymers relative to paper science and biomaterials/bioenergy are covered. An understanding for the relationships between a material's structure and its properties will be developed with respect to applications. Course includes a basics of polymers, biomacromolecules (carbohydrates and lignin), pulping and bleaching chemistry, new technologies and environmental issues."}, {"summer": "True", "name": "Wood Composites", "prerequisites": "Prerequisite: WPS 441, Graduate standing or Advanced Undergraduate standing", "spring": "True", "number": "740", "fall": "True", "units": " 3", "description": "Course designed to acquaint advanced undergraduate and graduate students with rapidly expanding field of wood composites. Presentation of production processes for particle board, plywood, hardboard, fiberboard, and other wood composites. Developmentof elastic theory for the stiffness, strength and buckling resistance of composites. Test procedures for determining mechanical properties and design procedures for glued laminated members, panel products, and built-up members, including I- and box-beams, stressed-skin panels and sandwich panels, outlined."}, {"summer": "True", "name": "Forest Products Manufacturing and Business Processes", "spring": "True", "number": "746", "fall": "True", "units": " 3", "description": "A holistic view of the production process for successful wood products manufacturing and the business fundamentals required for a successful product.  The value chain of wood products-from log to product disposal after its use is described.  Generic and specific manufacturing and business concepts and tools are discussed."}, {"summer": "True", "name": "Engineering Unit Operations for Biomass Conversion", "prerequisites": "Prerequisite: WPS 215, 216", "spring": "True", "number": "760", "fall": "True", "units": " 3", "description": "Engineering fundamentals and process technology for the production of biomaterials including paper and bioenergy are covered. These will include heat transfer, chemical kinetics, fluid mechanics, and thermodynamics. Applications include a) process technology for the production of paper b) heat and material balances in a pulping and papermaking c) process technologies for the production of bioenergy d) design of bioreactors e) recovery and purification of products f) gasification and pyrolysis reactions and g) catalytic conversion of syngas."}, {"summer": "True", "name": "Doctoral Seminar", "spring": "True", "number": "791", "fall": "True", "units": " 1"}, {"summer": "True", "name": "Advanced Special Topics", "spring": "True", "number": "795", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Special Problems", "prerequisites": "Prerequisite: Senior standing or Graduate standing", "spring": "True", "number": "820", "fall": "True", "units": " 1-3", "description": "Assigned or selected problems in the field of wood, paper and pulp science and technology."}, {"summer": "True", "name": "Advanced Wood and Paper Science Problems", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "825", "fall": "True", "units": " 1-9", "description": "Selected problems in the field of wood and paper science."}, {"summer": "True", "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "885", "fall": "True", "units": " 1-3", "description": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment and evaluate the student upon completion of the assignment."}, {"summer": "True", "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "890", "fall": "True", "units": " 1-9", "description": "For students who are preparing for and taking written and/or oral preliminary exams."}, {"summer": "True", "name": "Methods Of Research In Wood and Paper Science", "prerequisites": "Prerequisite: Graduate standing or Advanced Undergraduate standing", "spring": "True", "number": "891", "fall": "True", "units": " 1-3", "description": "Research procedures, problem outlines, presentation of results; consideration of selected studies by forest research organizations; sample plot techniques.Credits Arranged"}, {"summer": "True", "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "893", "fall": "True", "units": " 1-9", "description": "Instruction in research and research under the mentorship of a member of the Graduate Faculty."}, {"summer": "True", "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "895", "fall": "True", "units": " 1-9", "description": "Dissertation research."}, {"summer": "True", "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "896", "fall": "True", "units": " 1", "description": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research."}, {"summer": "True", "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": "True", "number": "899", "fall": "True", "units": " 1-3", "description": "For students who have completed all credit hour, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations."}]