[{"summer": false, "name": "Shop Processes and Management", "spring": true, "number": "AES  201", "descripton": "Safety practices, materials, equipment, processes, procedures, and management techniques related to operation and maintenance of a mechanized agricultural enterprise or agriculture-related industry.  Theory and practice through basic shop operationsand procedures.", "fall": true, "units": " 3"}, {"summer": false, "name": "Water Management", "prerequisites": "Prerequisite: Junior standing.", "spring": false, "number": "AES  323", "descripton": "Water management principles applied to agriculture; hydrologic cycle, runoff, surface and sub-surface drainage, soil conservation measures to reduce erosion and sedimentation, irrigation, pond construction, open channel flow, water rights and environmental laws pertaining to water management. Emphasis on problem solving", "fall": true, "units": " 3"}, {"summer": false, "name": "Management of Animal Environments", "prerequisites": "Prerequisite: PY 211 or PY 205.", "spring": true, "number": "AES  332", "descripton": "Environmental relationships,  design methods, materials and construction procedures as they relate to agricultural animal production facilities. Problem situations integrating structural design, environmental control, and waste handling.", "fall": false, "units": " 4"}, {"summer": false, "name": "Processing Agricultural Products", "prerequisites": "Prerequisite: PY 211 or PY 205.", "spring": true, "number": "AES  333", "descripton": "Application of the principles of fluid flow, heat transfer, refrigeration, psychrometrics, and materials handling to the processing of agricultural products. Pump sizing, heat exchanger selection, refrigeration analyses, fan sizing, crop drying, andselection of materials handling equipment.", "fall": false, "units": " 4"}, {"summer": false, "name": "Agricultural Electrification", "prerequisites": "Junior standing or above", "spring": false, "number": "AES  343", "descripton": "This course has a required field trip.", "fall": true, "units": " 4"}, {"summer": false, "name": "Agricultural Machinery and Power Units", "prerequisites": "Prerequisite: Ch 101, CH 102, and PY 211 or PY 205.", "spring": true, "number": "AES  411", "descripton": "Agricultural machinery principles, energy requirements, operation, calibration and environmental considerations.  Diesel engine principles and their application to engine power, efficiencies and systems.  Power trains and hydraulic systems. Application of basic machinery and power principles to mechanical needs in environmental systems.", "fall": false, "units": " 4"}, {"summer": false, "name": "Agricultural and Environmental Safety and Health", "prerequisites": "Prerequisite: Junior standing and 6 hrs CALS Group A, B or C Electives", "spring": false, "number": "AES  432", "descripton": "Safety and health issues for agricultural and environmental occupations.  Hazard recognition, injury and illness prevention, regulations, and safety and health management strategies for agricultural  production, chemical handling, and waste management.  Environmental factors which affect human health and safety.", "fall": true, "units": " 3"}, {"summer": false, "name": "Environmental Restoration Implementation", "prerequisites": "Prerequisite: AES 323 or BAE 471.", "spring": false, "number": "AES  443", "descripton": "Students will learn how to implement environmental restoration designs for streams, wetlands, and stormwater best management practices to improve ecosystem health. Topics include interpretation of construction drawings and specifications, calculating construction quantities and developing contractor bid tabs, environmental permitting and regulations, erosion and sediment control, project management and scheduling, construction oversight, specialized construction materials and equipment for environmental projects, survey stakeout, vegetation installation and management, site inspection and maintenance, and monitoring of structural and ecological conditions of restoration projects. In-class field trips are required.", "fall": true, "units": " 3"}]