[{"summer": "True", "name": "Introduction to African-American Music", "spring": "True", "number": ")  230", "descripton": "Comprehensive survey of African-American music in the United States from Colonial times to the, with emphasis on its unique features and contributions to American culture.", "fall": "True", "units": " Performing Arts, U.S. Diversity"}, {"summer": false, "name": "African Civilization", "spring": false, "number": "AFS  240", "descripton": "An interdisciplinary study of centers of African civilization from antiquity to the 1960s.  Such centers include ancient Egypt, Nubia, Axum, Ghana, Mali, Songhai, Kilwa, Malinda, Sofola, Zinzibar and Monomotapa.", "fall": false, "units": " 3"}, {"summer": true, "name": "Introduction to African-American Studies II", "spring": true, "number": "AFS  241", "descripton": "Second in a two semesters sequence in the interdisciplinary study of sub-Saharan Africa, its arts, culture, and people, and the African-American experience.", "fall": true, "units": " 3"}, {"summer": false, "name": "Survey of African-American Literature", "spring": true, "number": ")  248", "descripton": "African-American writing and its relationships to American culture and history.  Covers such writers as Wheatley, Douglass, Chesnutt, Dunbar, DuBois, Hughes, Hurston, Wright, and Morrison.", "fall": true, "units": " 3"}, {"summer": "True", "name": "History of Jazz", "spring": "True", "number": ")  260", "descripton": "History of jazz and the contributions of major artists. Emphasis of the various styles that have contributed to this American art form. Investigation of structural forms in the jazz idiom.", "fall": "True", "units": " Performing Arts, U.S. Diversity"}, {"summer": true, "name": "Introduction to History of South and East Africa", "spring": true, "number": ")  275", "descripton": "The African kingdoms (Lunda, Buganda, and Zulu); the European encroachment; the origins of colonialism and the character of colonial societies and economies, South African apartheid; African protest, nationalism and independence.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to History of West Africa", "spring": true, "number": ")  276", "descripton": "The history of Western Africa. Forest civilizations and the slave trade, trade and the expansion of Islam, colonialism in West Africa; African nationalism and the achievement of independence; and postcolonial West Africa.", "fall": true, "units": " 3"}, {"summer": true, "name": "Racial and Ethnic Relations", "prerequisites": "Prerequisite: 3 cr. in SOC, 200 level", "spring": true, "number": ")  305", "descripton": "Study of the nature of the relationships among racial and ethnic groups in societies around the world but with emphasis on the United States. Explores topics such as inequalities of wealth, power, and status, racism, conflict, and social boundaries among groups. Current trends in intergroup relations are discussed.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to the African Diaspora", "spring": true, "number": "AFS  342", "descripton": "Exploration of the global experiences of people of African descent.  Geographical areas include the Americas, Europe, Asia, and the Caribbean.  Exploration of the web of interrelated histories, social dynamics, and politico-economic processes affecting and reflecting world cultures and histories.  Foundational course for the exploration of methodological issues and theoretical concerns in the field of African Diaspora Studies.", "fall": false, "units": " 3"}, {"summer": false, "name": "African Religions", "spring": true, "number": "AFS  343", "descripton": "Examination of African Religions on the African continent and throughout the African Diaspora.  Focus on traditional religious practices, African reformulation of Islam and Christianity, New Orleans and Haitian vodun, Cuban Santeria, and Brazilian Candomble.  Designed to de-mystify African religion without divesting it of its cultural uniqueness and richness.", "fall": false, "units": " 3"}, {"summer": false, "name": "Leadership in African American Communities", "spring": true, "number": "AFS  344", "descripton": "Historical, cultural and political examination of the dynamics of leadership in African American communities.  Focus on structure of Leadership in the context of gender, ideology, and style.  Interdisciplinary examination of impact of leaders on broader American society.", "fall": true, "units": " 3"}, {"summer": false, "name": "Psychology and the African American Experience", "prerequisites": "Prerequisite: PSY 200 or PSY 201", "spring": false, "number": ")  345", "descripton": "Historical and cultural examination of the psychological experiences of African American experience from pre-American times to the present.  Focus on mental health, personality, identity development, racism, oppression, psychological empowerment andan African-centered world view.  Discussion of contemporary issues within the African American community.", "fall": true, "units": " 3"}, {"summer": true, "name": "Black Popular Culture", "spring": true, "number": ")  346", "descripton": "A multidisciplinary examination of contemporary black cultural expression in film, music, art, and the media.  Emphasis on race, class, gender, and political discourse.", "fall": true, "units": " 3"}, {"summer": false, "name": "African Literature in English", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": ")  349", "descripton": "Anglophone literature in Africa.  Emphasis on the relationship between the African world-view and literary production and the persistent trend by African writers to connect literature with politics. Writers such as Achebe, Ngugi, Soyinka, and Serote.", "fall": false, "units": " 3"}, {"summer": false, "name": "African-American History Through the Civil War, 1619-1865", "prerequisites": "Prerequisite: 3 hours of history or Sophomore standing", "spring": false, "number": ")  372", "descripton": "African background and continuity of the particular role, experience and influence of African Americans in the United States through the Civil War.", "fall": false, "units": " 3"}, {"summer": false, "name": "African-American History Since 1865", "prerequisites": "Prerequisite: 3 hours of history or Sophomore standing", "spring": false, "number": ")  373", "descripton": "The  history of African-Americans from the Reconstruction era through the Civil Rights movement of the 1950s and 1960s to the present.", "fall": false, "units": " 3"}, {"summer": false, "name": "African American Cinema", "prerequisites": "Prerequisite: ENG 101", "spring": false, "number": ")  375", "descripton": "Survey and analysis of African American film culture from 1900-present.  Examination of pre-Hollywood, classical Hollywood, and Independent filmmaking.  Particular focus on independent filmmakers' response to dominant industry representations and the work of filmmakers who seek to create a specifically African American cinematic style.", "fall": true, "units": " 3"}, {"summer": false, "name": "Black Political Participation in America", "spring": false, "number": ")  409", "descripton": "African American political participation in the United States; political culture, socialization, and mobilization, with a focus on the interaction between African Americans and actors, institutions, processes, and policies of the American political system.", "fall": true, "units": " 3"}, {"summer": false, "name": "Senior Seminar in Africana Studies", "prerequisites": "Prerequisite: AFS 342;  Africana Studies Majors or Africana Studies Minors", "spring": true, "number": "AFS  440", "descripton": "In-depth examination of Africana Studies issues. Interdisciplinary exploration of key problems and proposed solutions for African communities on the African continent and throughout the world. Requires written research project using interdisciplinary approaches and critical analyses.", "fall": false, "units": " 3"}, {"summer": false, "name": "Issues in the African Diaspora", "spring": false, "number": "AFS  442", "descripton": "Multidisciplinary exploration of the interrelated histories, social dynamics, and politico-economic processes of the experiences of people of African descent throughout the world.  Particular focus on the experiences of slavery, artistic expression,gender practices, and the impact of the nation state.", "fall": true, "units": " 3"}, {"summer": false, "name": "African-American Literature", "prerequisites": "Prerequisite: Junior standing.", "spring": true, "number": ")  448", "descripton": "Survey of African-American literature and its relationships to American culture, with an emphasis on fiction and poetry since 1945.  Writers such as Bontemps, Morrison, Huston, Baldwin, Hayden, Brooks, Naylor, Harper, and Dove.", "fall": false, "units": " 3"}, {"summer": false, "name": "History of the Civil Rights Movement", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": false, "number": ")  455", "descripton": "The black revolution; stages and leaders of the movement; successes and failures in the fight for desegregation, the vote, and economic opportunity; impact of Civil Rights movement on the United States. Credit will not be given both for HI (AFS) 455 and HI 555", "fall": false, "units": " 3"}, {"summer": false, "name": "History of the Republic of South Africa", "prerequisites": "Prerequisite: 3 hours of history", "spring": true, "number": ")  475", "descripton": "Evolution of the Republic of South Africa's society, with emphasis on the interaction of diverse peoples and cultures. Particular attention is given to the period since 1870.  Credit will not be given for both HI (AFS) 475 and HI 575.", "fall": true, "units": " 3"}, {"summer": false, "name": "Leadership in Modern Africa", "prerequisites": "Prerequisite: 3 hours of history", "spring": false, "number": ")  476", "descripton": "Recent sub-Saharan African political history (excluding South Africa).  Overview of concepts, vocabulary, historical trends. Detailed examination of specific African countries as case studies, such as Ghana, Nigeria, Zimbabwe, Tanzania. Credit will not be given for both HI (AFS) 476 and HI 576.", "fall": false, "units": " 3"}, {"summer": false, "name": "Africa (sub-Saharan) in the Twentieth Century", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": true, "number": ")  479", "descripton": "Developments in sub-Saharan Africa during the colonial period, from the end of the nineteenth century to the advent of decolonization in the early 1960s.  Interplay of political, social, economic and cultural factors in the experiences of African peoples during this period. Credit will not be given for both HI (AFS) 479 and HI 579", "fall": false, "units": " 3"}, {"summer": false, "name": "Africana Studies and Community Involvement", "prerequisites": "Prerequisite: Africana Studies Majors or Africana Studies Minors", "spring": false, "number": "AFS  490", "descripton": "First part of a two semester service-learning experience. Provides interdisciplinary and experientially based opportunity for students to engage in community and classroom-based experiences that examine issues of relevance to African American people(or communities in the African Diaspora). Students apply and examine concepts addressed in class to their own practical experience in service to others. Development of interpersonal and professional skills. Focus on the values, beliefs, attitudes, and ideas that are central to definitions of democracy, social justice, civic resiliency, self-help, and public life.", "fall": true, "units": " 3"}, {"summer": true, "name": "Study Abroad in Africana Studies", "spring": false, "number": "AFS  491", "descripton": "Specific category of revolving set of field/seminar courses involving multidisciplinary focal areas taught in foreign countries through Africana Studies.  Course includes pre-trip orientation and readings and onsite field experiences and lectures.  Additional program fees, travel costs and appropriate immunizations are required beyond registration fees.", "fall": false, "units": " 3"}, {"summer": false, "name": "Topics in African-American Studies", "prerequisites": "Prerequisite: AFS 240", "spring": true, "number": "AFS  497", "descripton": "Multidisciplinary examination of selected topics in African-American studies.", "fall": true, "units": " 3"}]