[{"summer": false, "name": " Resource Economics", "spring": true, "number": "ARE  201A", "descripton": "Introduction to economic principles of marginal benefits and costs with application to consumer and producer decisions. Functions of market exchange systems in determining prices and quantities and creation of wealth. Property rights and opportunities for exchange. Role of government in dealing with agricultural and resource problems. Macroeconomic analysis including inflation, unemployment, money and banking system.  Credit will not be given for both ARE 201 and either EC 201 or EC 205.", "fall": true, "units": " 3"}, {"summer": "True", "name": "SOC  203A", "spring": "True", "number": " 3 - Offered in Fall Spring Summer, Social Sciences, U.S. Diversity", "descripton": "Examination of social problems linked to structures of economic, political, gender and racial inequality; including poverty, disease, racism, sexism, unemployment, psychological distress, educational failure, environmental destruction and violence. Possible solutions viewed from a variety of perspectives.   Includes core sociological concepts, methods and theories.", "fall": "True", "units": "Current Social Problems"}, {"number": "Introduction to the collegiate experience; academic skills of successful students; curricula of the Agricultural Institute; career opportunities of graduates; introduction to computers."}, {"number": "Basic skills in written communication, including proper verb forms, basic sentence construction, and punctuation. Emphasis is to improve student's ability to convey thoughts and impressions."}, {"number": "Further improvement of written communication on both personal and business levels. Emphasis on mechanics of writing and construction of coherent, logical units of written expression."}, {"number": "Basic mathematical operations for addition, subtraction, multiplication, and division of whole, fractional, and decimal numbers.  Applications to agricultural production.  Introduction to percentages."}, {"number": "Prerequisite: A \"C\" or better in AGI 114", "descripton": "Applications of mathematical principles to solve problems encountered in Agricultural Institute courses.  Percentages, ratios, proportions, averages, exponents, basic algebra, graphs, basic geometry and basic trigonometry with applications."}, {"summer": false, "name": "Community Leadership and Development", "spring": true, "number": "AGI  151", "descripton": "Concentration upon preparation of students for leadership in their communities. Attention to leadership styles, social and personal factors contributing to an individual's rise to a leadership position, changing structures within communities, and social issues facing community leaders. Focus upon both urban and rural communities with primary emphasis on rural settings. DUBOSE-BLUM", "fall": true, "units": " 3"}, {"summer": false, "name": "AGI External Learning Experience", "spring": true, "number": "AGI  192", "descripton": "Learning experience in one of the eight majors in the Agricultural Institute that utilizes facilities and resources external to the campus. (Contact with professionals in the area of student's major must be initiated by student and approved by a faculty adviser and the Director of the Agricultural Institute prior to the experience).", "fall": true, "units": " 1-6"}, {"summer": false, "name": "AGI Special Problems and On-campus Learning", "spring": true, "number": "AGI  193", "descripton": "Learning experience in one of the eight majors in the Agricultural Institute that utilizes facilities and resources on the campus. (Contact with the project supervisor must be initiated by student and approved by the faculty adviser and the Director of the Agricultural Institute prior to the experience).", "fall": true, "units": " 1-6"}, {"summer": false, "name": "International Learning Experience in AGI", "spring": true, "number": "AGI  194", "descripton": "Course offered as needed for international learning experiences in the Agricultural Institute involving international travel and immersion in an international culture.  A written report is required and student must identify a faculty member to work with them.  Travel expenses may be incurred by the student. Departmental approval required.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Special Topics in the Agricultural Institute", "spring": true, "number": "AGI  195", "descripton": "Offered as needed to present material not normally available in regular departmental course offerings or for offering of new courses on a trial basis.", "fall": true, "units": " 1-4"}, {"number": "Insights into the management skills of a successful agribusiness firm manager. A topical approach to analytical and planning techniques applicable to business decisions. Managerial concepts such as financial analysis, budgeting, investment analysis, capital acquisition, financial and risk management of agribusiness firms. HENDRICKSON"}, {"number": "The application of legal principles to agribusiness. Includes a review of our legal system contracts, real property, personal property torts, business organization, estate planning, and laws affecting agribusiness. CAMPBELL"}, {"number": "Marketing concepts, techniques and management of the U.S. marketing system from agricultural production, agribusiness, and traditional business perspectives. Broad, basic knowledge of marketing objectives, the marketing environment, strategic planning, marketing information sources, consumer demographics and lifestyle characteristics, product planning, distribution planning, promotion planning, and price planning. PHILLIPS"}, {"number": "\"How To\" course in selling. Understanding customer's behavior, establishing and maintaining customer rapport, and negotiating a sale. Developing sales skills through discussion, role playing and demonstrations. Emphasis on building self-confidence through selling exercises involving class participation, special assignments, and targeted presentations. WEEMS"}, {"number": "Introduction to basic accounting principles and concepts applicable to an agribusiness firm. Exposure to journals, ledgers and financial statements. Topics of the accounting cycle, inventories, payrolls, accounts receivable, income taxes and the potential use of computers. RUSS"}, {"number": "Personnel problems of recruiting, selecting, training, paying, and motivating employees of an agribusiness firm. Improving organizational effectiveness, functioning of a production supervisor, resolution of conflicts and leadership development. PHILLIPS"}, {"number": "History of agricultural and environmental policy, policy formation, agricultural programs, effects of agricultural production on the environment, benefits and costs of agricultural and environmental policy, state of the environment, environmental regulations and their enforcement, optimal level of pollution, incentive-based environmental regulation, outlook for agricultural and environmental policy, and the sustainability of agriculture and of the environment. RUSS"}, {"prerequisites": " 3", "number": "Economic analysis of personal decisions related to consumer purchases, time value of money, taxes, financial risk management, investment strategies, retirement planning and estate planning. Relationship of an individual's life cycle to budgeting and financial goals. Background information on wise use of credit, home purchase, life insurance, property insurance, health insurance and investment fundamentals. PHILLIPS", "descripton": "Principles of operation and maintenance of powered turf, garden, and landscape equipment. Small engines, power transmission systems, equipment maintenance, and operator safety."}, {"summer": false, "name": "Agricultural Tractors and Machinery", "spring": false, "number": "BAE  133", "descripton": "Principles of tractor engines, power trains, and hydraulics. Tractor operation, service and testing. Machinery management involving tractor and implement selection based on power and field requirements and on economics of ownership and operation. Implements for crop production to include tillage, planting, chemicals and harvesting. Set-up, operation and maintenance of implements. Calibration of planting and chemical equipment. Tractor and machinery safety. VEAL", "fall": true, "units": " 4"}, {"number": "Considers how insects live, their internal and external structures and their functions, classification and identification and control when desirable. Recognition of economically important beneficial and destructive insects and mites occurring in North Carolina and neighboring states, stressing information on their life histories , damage and control."}, {"number": "Basic characterization, classification, chemical and physical properties of pesticides. Use of pesticides including environmental effects; Federal and State laws and regulations relating to their manufacture, distribution and use; safety procedures including handling and storage; and application equipment including types, calibration, use and maintenance. TOTH"}, {"number": "Insects and related arthropods found in residential and industrial buildings, nature of damage, and their control.  Identification and life history of the different pest species, methods to detect their presence, and integrated pest management strategies.  Hands-on learning of species in laboratory with emphasis on current control techniques.  Field trips required."}, {"number": "Practical course in the biology, recognition, and management of common insect and related arthropod pests that attack ornamentals and turf. WALDVOGEL"}, {"number": "Principles and practices of vertebrate pest damage control. Emphasis on integrated pest management as applied to damage caused by native wildlife and commensal rodents. WALDVOGEL"}, {"prerequisites": " 1 - Offered in Fall Only", "number": "Discussions of current topics of pest management. Topics selected by the students and instructors to include different phases of pest management. Discussions led by leaders in the various facets of the industry.", "descripton": "Introduction to the collegiate experience, academic skills of successful students, and scope, purpose, and objectives of the Agricultural Institute with an emphasis on areas related to the ornamental and landscape plants industry. Students will explore college and departmental resources, academic policies and procedure, the green industry, career opportunities, and current trends and issues in horticulture."}, {"summer": false, "name": "Plant ID", "spring": false, "number": "HS  111", "descripton": "Identification, adaptation, culture, and use of ornamental trees, shrubs, vines, ground covers and herbaceous plants.  FAIR", "fall": true, "units": " 3"}, {"summer": false, "name": "Plant Growth and Development", "spring": false, "number": "HS  115", "descripton": "Examination of how plants grow and respond to environmental and cultural stimuli. Topics include: cell growth; flower, fruit, seed, shoot, and root development and functions; anatomy of stems, roots and leaves; hormonal regulation of growth; adaptations for survival; plant responses to temperature, light and gravity; photosynthesis, transpiration, and absorption of water and nutrients. FONTENO", "fall": true, "units": " 3"}, {"summer": false, "name": "Plant Propagation", "spring": true, "number": "HS  121", "descripton": "Principles and practices involved in sexual (seed) and asexual (vegetative) propagation of a variety of plants. Methods of asexual propagation include cuttings, layering, budding and grafting, division, separation, and micropropagation (tissue culture). Emphasis on factors affecting the regeneration of species by particular techniques. BLAZICH", "fall": false, "units": " 3"}, {"summer": false, "name": "Greenhouse Crop Production", "spring": true, "number": "HS  141", "descripton": "Production of greenhouse crops. Emphasis on greenhouse construction and environmental manipulation of crop growth. Site selection, construction materials, greenhouse design. Specific flowering crops as models to demonstrate potted flowering plant, cut flower, and bedding plant production systems. Hands-on crop production experience plus trips to commercial floriculture production and marketing facilities.", "fall": false, "units": " 4"}, {"summer": false, "name": "Nursery Production", "spring": true, "number": "HS  151", "descripton": "Total aspects of field and container nursery stock production including site selection and development, propagation, growing procedures, harvesting, marketing, shipping and labor management practices. KRAUS", "fall": false, "units": " 3"}, {"summer": false, "name": "Landscape Maintenance", "spring": false, "number": "HS  162", "descripton": "A study of the maintenance of landscaped areas including plant material selection, installation, pruning, fertilization, and pest control of trees, shrubs, lawns, flower beds, and interior plants. WARREN", "fall": true, "units": " 3"}, {"number": "General introduction to nutrition, reproduction, breeding, management and description of marketing channels of animals and poultry. Equates live animal and carcass characteristics with market specifications. Factors of pre- and post-slaughter treatment are related to the shelf life of fresh and processed meats. MCCRAW/GREGORY"}, {"number": "Basics of animal nutrition and feeding. Identification and classification of common feedstuffs, including relative nutritional value for livestock and poultry. General nutrition and changes in requirements as influenced by production and the animal's life cycle. Applied aspects of feeding and nutrition of livestock and poultry. Agricultural Institute Students Only (Class= 01 or 02)."}, {"number": "Introduction to poultry science and production. Domestication of key poultry species, embryology and hatchery management, anatomy and physiology, poultry rations, housing refinements, and diseases relative to the production of poultry meats and eggs. STAFF"}, {"number": "Principles and practices of commercial market turkey, broiler, and roaster managment. Includes breeding, nutrition, housing, related production parameters, and an examination of contracts and grower-company relationships."}, {"number": "Modern poultry industry vertical integration of industry structure, breeding stock management, pest control, ventilation and environmental control, sanitation and biosecurity, waste management, processing, and financing a poultry operation"}, {"prerequisites": " 3 - Offered in Fall Only", "number": "Basic principles of disease and disease management in livestock and poultry. Disease prevention through sanitation and vaccination. Diseases of horses, pigs, ruminants, poultry, and disease prevention programs for each species", "descripton": "General principles in turfgrass weed and disease development and management programs.  Different weeds, their life cycles, management techniques, and factors affecting herbicide application performance will be covered.  Students will learn the causes, development, identification and management of turfgrass diseases.  Laboratory includes weed identification and herbicide application methods.  Certain laboratory exercises will require personal transportation to Lake Wheeler Road Turf Field Lab unless otherwise specified by the lab instructors.  The course is restricted to AGI students only."}, {"summer": false, "name": "Diseases of Ornamentals and Turfgrasses", "spring": false, "number": "PP  155", "descripton": "Causes, development, identification and management of diseases of greenhouses and landscape ornamentals and turfgrasses. WARFIELD", "fall": true, "units": " 3"}, {"prerequisites": " 3", "number": "Basic characterization, classification, chemical and physical properties of pesticides. Use of pesticides including environmental effects; Federal and State laws and regulations relating to their manufacture, distribution and use; safety procedures including handling and storage; and application equipment including types, calibration, use and maintenance. TOTH", "descripton": "Basic principles of disease and disease management in livestock and poultry. Disease prevention through sanitation and vaccination. Diseases of horses, pigs, ruminants, poultry, and disease prevention programs for each species"}, {"summer": "True", "name": ")  172", "spring": "True", "number": " 3", "descripton": "Principles and practices of vertebrate pest damage control. Emphasis on integrated pest management as applied to damage caused by native wildlife and commensal rodents. WALDVOGEL", "fall": "True", "units": "Vertebrate Pest Management"}]