[{"summer": true, "name": "Physical Anthropology", "spring": true, "number": "ANT  251", "descripton": "Study of human evolution. Processes of evolution, human variation and race, behavior  and morphology of nonhuman primates, and the fossil record. Emphasis on the  study of human biosocial adaptation, past and present, and on humans as culture-bearing  primates.", "fall": true, "units": " 3"}, {"summer": true, "name": "Cultural Anthropology", "spring": true, "number": "ANT  252", "descripton": "Comparative study of contemporary human culture, social institutions and processes that influence behavior. The range of human cultural variation shown throughout the world, including the student's own cultural system.", "fall": true, "units": " 3"}, {"summer": false, "name": "Unearthing the Past:  Introduction to World Archaeology", "spring": false, "number": "ANT  253", "descripton": "World-wide survey of origins of  human society, technology and culture in Old Stone Age, and origins of agriculture, cities,  and civilizations of the Bronze and Iron Age in Europe, Asia, Africa, and pre-Columbian Middle and South America.", "fall": false, "units": " 3"}, {"summer": true, "name": "Language and Culture", "spring": true, "number": "ANT  254", "descripton": "Focus among the aspects of human language and between aspects of language and culture. Topics such as: descriptive and comparative linguistics, structuralism, language and thought, sociolinguistics, bilingualism, culture change and linguistic changes.", "fall": true, "units": " 3"}, {"summer": false, "name": "Technology in Society and Culture", "spring": true, "number": ")  261", "descripton": "Processes of social and cultural change with a focus on role of technological innovation. Cross-cultural emphasis. Workplace changes and societal risks associated with technological innovations.  Special attention to the role of scientists and engineers in socio-cultural change.  Topical case studies apply course concepts and principles.  Core sociological and anthropological concepts, methods, theories.", "fall": true, "units": " 3"}, {"summer": true, "name": "Special Topics in Anthropology", "spring": true, "number": "ANT  295", "descripton": "Offered as needed to present 200-level subject materials not normally available in regular course offerings or for new courses on a trial basis.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Native Peoples and Cultures of North America", "prerequisites": "Prerequisite: ANT 252 or HI 365", "spring": false, "number": "ANT  310", "descripton": "Native North American peoples and cultures including Eskimos and Aleuts.  Theories of origin and selected prehistoric cultural manifestations.  People and cultures at the time of European contact and post-contact cultural change.  Contemporary problems and prospects.", "fall": false, "units": " 3"}, {"summer": false, "name": "Andean South America", "prerequisites": "Prerequisite: ANT 252 or HI 215 or HI 216", "spring": false, "number": "ANT  325", "descripton": "The societies, cultures, politics, economics and ecology of the Andean countries of South America (Peru, Bolivia, Ecuador, Chile, Colombia). Special attention to the development of pre-Columbian Andean Societies.", "fall": false, "units": " 3"}, {"summer": false, "name": "Peoples and Cultures of Africa", "prerequisites": "Prerequisite: ANT 252 or HI 275 or HI 276", "spring": true, "number": "ANT  330", "descripton": "African peoples and cultures, especially in sub-Saharan Africa; past and present social patterns of indigenous African populations from a cross-cultural perspective.", "fall": false, "units": " 3"}, {"summer": false, "name": "Peoples and Cultures of Southeast Asia", "prerequisites": "Prerequisite: ANT 252", "spring": false, "number": "ANT  346", "descripton": "Southeast Asian peoples and cultures; past and present social patterns of selected mainland and insular Southeast Asian peoples; culture change; relations between minorities and dominant ethnic groups; development of nationalism.", "fall": true, "units": " 3"}, {"summer": false, "name": "Contemporary Culture in Japan", "prerequisites": "Prerequisite: FLJ 101", "spring": true, "number": ")  351", "descripton": "Introduction to basic aspects of cultural practices in Japanese society, including education, work life, family relationships, everyday religious practices, aesthetic traditions, national identity, and gender. Students will develop an understanding of the interrelationships between language and culture.", "fall": false, "units": " 3"}, {"summer": false, "name": "Peoples and Cultures of the Pacific", "prerequisites": "Prerequisite: ANT 252", "spring": false, "number": "ANT  354", "descripton": "The Pacific Ocean contains thousands of inhabited islands. This course examines the millions of people and thousands of societies that live in the Pacific and its three subregional areas Melanesia, Micronesia and Polynesia. Course topics include the Pacific environment, peopling of the Pacific, regional cultural variation, social organization, Exchange systems, politics, conflict, modernization, globalization and global warming in the Pacific region.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Forensic Anthropology", "prerequisites": "Prerequisite: ANT 251", "spring": false, "number": "ANT  370", "descripton": "Broad overview of forensic anthropology-an applied field of biological anthropology. Application of the science of biological anthropology to the legal process and humanitarian arena.  Identification of skeletal remains to determine age, sex, ancestry, stature, and unique features of a decedent.  General identification techniques addressed but proficiency not expected.", "fall": true, "units": " 3"}, {"summer": false, "name": "Human Variation", "prerequisites": "Prerequisite: ANT 251", "spring": false, "number": "ANT  371", "descripton": "Survey of basic principles of population genetics with emphasis on mechanisms that shape human biological variation.  Geographic variation. Analysis of laws of heredity exhibited in modern human populations via microevolution and adaptation.  Historical development of concepts with specific application to physical and forensic anthropology.  Discussion of most current research.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Disease and Society", "prerequisites": "Prerequisite: ANT 251 or ANT 252", "spring": "True", "number": "ANT  374", "descripton": "Survey of diseases that affect human beings and human societies past and present.  Analysis of how diseases affect societies with different economies (gathering/hunting, pastoral, agricultural, industrial) and of different social complexity.  Impactof diseases on human evolution.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Island Archaeology", "prerequisites": "Prerequisite: ANT 253", "spring": false, "number": "ANT  385", "descripton": "Exploration of the archaeology of islands. Analysis of the conditions and phenomena surrounding human adaptation to and impact on island environments. Geographic areas include Oceania, Caribbean, Mediterranean, Japan, and the Americas.", "fall": false, "units": " 3"}, {"summer": false, "name": "Fundamentals of Archaeological Research", "prerequisites": "Prerequisite: ANT 253", "spring": false, "number": "ANT  389", "descripton": "Overview of the objectives, field strategies, basics of laboratory analysis, and interpretative approaches to the archaeological record. Analysis and classification of lithics, shell, bone, ceramics, metal, soils, and perishable materials.", "fall": false, "units": " 3"}, {"summer": true, "name": "Special Topics in Anthropology", "prerequisites": "Prerequisite: 3 credits of 200-level Anthropology", "spring": true, "number": "ANT  395", "descripton": "Offered as needed to present 300-level subject materials not normally available in regular course offerings or for new courses on a trial basis.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Overview of Anthropological Theory", "prerequisites": "Prerequisite: ANT 252 and one of the following: ANT 310,325,330 or 346", "spring": false, "number": "ANT  411", "descripton": "A detailed introduction to anthropological theory, interpretive styles and research techniques of major nineteenth and twentieth century anthropologists working within the analytic frameworks of their times, positions espoused by anthropologists in contemporary debates concerning the discipline's future.  Students cannot receive credit for both ANT 411 and ANT 511.", "fall": true, "units": " 3"}, {"summer": false, "name": "Applied Anthropology", "spring": true, "number": "ANT  412", "descripton": "History, aims, methods and ethics of applied anthropology.  Anthropological practice in government, industry, community development, education, and medicine.  Analysis of consequences of development programs for culture change.  Credit cannot be given for both 412 and 512.", "fall": false, "units": " 3"}, {"summer": false, "name": "Research Methods in Cultural Anthropology", "prerequisites": "Prerequisite: ANT 252 and one of the following: ANT 310,325,330, 346, 351, or 354", "spring": false, "number": "ANT  416", "descripton": "A systematic overview of cultural anthropological research methods including designing  research projects, research techniques, field work methods, and cross-cultural comparison. Reviews relevant ethical questions and anthropologists' reports of their own field work.", "fall": true, "units": " 3"}, {"summer": true, "name": "Ethnographic Field Methods", "prerequisites": "Prerequisite: Six hours of cultural anthropology", "spring": false, "number": "ANT  419", "descripton": "Ethnographic research methods as part of a summer field school abroad. Topics: research design, participant observation, field note writing, interviewing, sampling, coding, computers in ethnographic research, analysis and ethics.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Human Osteology", "prerequisites": "Prerequisite: ANT 251  and  any ANT 300 Level", "spring": "True", "number": "ANT  421", "descripton": "Survey of all the bones of the human skeleton from an anthropological perspective, including their names, important features useful in recognizing fragmentary specimens from an archaeological context, and techniques for determining the side of the body they come from. Skeletal development and its relationship to skeletal abnormalities. Issues relating to the study of archaeological skeletons.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Bioarchaeology", "prerequisites": "Prerequisite: ANT 421", "spring": "True", "number": "ANT  424", "descripton": "Survey of approaches used by bioarchaeologists to understand past lifeways through the study of excavated human remains. Analysis of the ways in which bioarchaeologists reconstruct health and disease patterns, mortality rates, diet, degree of interpersonal violence, and social structure in the human past.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Advanced Methods in Forensic Anthropology", "prerequisites": "Prerequisite: ANT 370, ANT 421", "spring": true, "number": "ANT  429", "descripton": "Advanced methods in forensic anthropology-an applied field of biological anthropology. Application of the science of biological anthropology to the medicolegal process. Identification of skeletal remains to determine age, sex, ancestry, stature, andunique features of a decedent. Analysis of human skeletal remains. Identification techniques addressed and proficiency expected. Students must provide their own transportation to the laboratory site.", "fall": false, "units": " 4"}, {"summer": true, "name": "Tourism, Culture and Anthropology", "prerequisites": "Prerequisite: Three hours of cultural anthropology", "spring": false, "number": "ANT  431", "descripton": "Anthropological approach to tourism studies with emphasis on cross-cultural aspects of international tourism.  Attention to impact of mass tourism as compared to alternative tourism; environmental and economic impact of tourism; impact of international tourists and tourism on local communities.  Principal theories of leisure in relation to tourism.  Theories of culture change in relation to travel and tourism. Credit not given for both ANT 431 and ANT 531.", "fall": true, "units": " 3"}, {"summer": false, "name": "Anthropology of Ecotourism and Heritage Conservation", "prerequisites": "Prerequisite: ANT 252", "spring": true, "number": "ANT  433", "descripton": "Introduction to how cultures and societies view, utilize, interpret, manage and conserve environmental and cultural heritage resources; includes examination of theory and concepts of place, identity, sacred heritage, ecotourism, wildlife management as well as the cultural politics and practices of environmentalist and heritage management.  Some limited travel to NC heritage sites required at student expense.", "fall": false, "units": " 3"}, {"summer": false, "name": "Cross-Cultural Perspectives on Women", "prerequisites": "Prerequisite: ANT 252 and one of the following: ANT 310,325,330 or 346", "spring": true, "number": ")  444", "descripton": "Comparison of women in a variety of societies: western and non-western; hunting and gathering to industrialized.  Cross-cultural perspective on the similarity and diversity of women's statuses and roles.  Effect of gender on social position", "fall": false, "units": " 3"}, {"summer": "True", "name": "Environmental Anthropology", "prerequisites": "Prerequisite: One of the following: ANT 310,325,330 or 346", "spring": "True", "number": "ANT  450", "descripton": "Examines the myriad ways that culture serves to mediate the human-environmental equation. Focus is given to different belief systems, subsistence strategies, technological achievements, and policy formulations. Topics covered include cultural ecology, gender and the environment, land tenure, development, ethnoscience and cognitive ecology, subsistence and social organization, historical and political ecology, environmentalism, and environmental policy issues.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Urban Anthropology", "prerequisites": "Prerequisite: ANT 252 and one of the following: ANT 310,325,330 or 346", "spring": false, "number": "ANT  460", "descripton": "Anthropological study of cities.  Examination of cross-cultural patterns of behavior in urban areas and adaptive strategies that urban dwellers employ. Introduction to major theoretical and methodological approaches relevant to an understanding of contemporary urbanization.", "fall": true, "units": " 3"}, {"summer": false, "name": "Anthropology of Religion", "prerequisites": "Prerequisite: ANT 252 and one of the following: ANT 310,325,330 or 346", "spring": true, "number": "ANT  464", "descripton": "Examination of various anthropological perspectives on the role of religion in social life, and discussion of theoretical and methodological issues pertaining to the study of ritual and belief.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Human Impacts on Ancient Environments", "prerequisites": "Prerequisite: ANT 253", "spring": "True", "number": "ANT  475", "descripton": "Archaeological investigation of human-environmental interactions. Focuses on various techniques archaeologists and paleoecologists use to reconstruct prehistoric environments. Topics include the analysis of animal remains (e.g., shellfish, fish, marine mammals, birds), soils, and plants, dating techniques, and stable isotopes.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Special Topics in Anthropology", "spring": "True", "number": "ANT  495", "descripton": "Detailed investigation of a topic in anthropology.  Topic and mode of study determined by faculty member(s).", "fall": "True", "units": " 3"}, {"summer": false, "name": "Anthropology Internship", "prerequisites": "Prerequisite: ANT 412, ANT 416; Senior standing in Anthropology (B.A.)", "spring": true, "number": "ANT  496", "descripton": "Supervised observation and experience in work settings appropriate to anthropological perspectives.  Study of the relationships between internship setting and relevant anthropological theory, methods and research.  Weekly seminars, individual conferences and an integrative report.  Students are responsible for arranging their own transportation to internship sites.", "fall": false, "units": " 6"}, {"summer": true, "name": "Independent Study in Anthropology", "prerequisites": "Prerequisite: Six hours of ANT", "spring": true, "number": "ANT  498", "descripton": "Independent study of a topic in anthropology.  Topic and mode of study determined by faculty member(s) and student(s).", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Overview of Anthropological Theory", "prerequisites": "Prerequisite: Graduate standing or ANT 252 and any 300-level ANT course", "spring": false, "number": "ANT  511", "descripton": "A detailed introduction to anthropological theory, interpretive styles and research techniques of major nineteenth and twentieth century anthropologists working within the analytic frameworks of their times, positions espoused by anthropologists in contemporary debates concerning the discipline's future. Students cannot receive credit for both ANT 411 and ANT 511.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Applied Anthropology", "prerequisites": "Prerequisite: ANT 252", "spring": "True", "number": "ANT  512", "descripton": "A review of historical development of applied anthropology and study of anthropology as applied in government, industry, community development, education and medicine. Analysis of processes of cultural change in terms of application of anthropological techniques to programs of developmental change.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Qualitative Research Methods", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "ANT  516", "descripton": "Systematic overview of qualitative research methods including theoretical perspectives, research techniques, research design and data management.  Reviews relevant ethical questions and social science presentation of research findings.  Credit will not be given for both ANT 416 and 516.", "fall": true, "units": " 3"}, {"summer": false, "name": "Human Osteology", "prerequisites": "Prerequisite: Graduate standing or permission of instructor, Corequisite: ANT 524, ANT 529", "spring": false, "number": "ANT  521", "descripton": "Survey of all the bones of the human skeleton from an anthropological perspective, including their names, important features useful in recognizing fragmentary specimens from an archaeological context, and techniques for determining the side of the body they come from.  Skeletal development and its relationship to skeletal abnormalities.  Issues relating to the study of archaeological skeletons.  Graduate students will be required to attend an additional one-hour weekly problem session.  Credit cannot be received for both ANT 421 and ANT 521.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Methods in Forensic Anthropology", "prerequisites": "Prerequisite: Graduate Standing", "spring": true, "number": "ANT  529", "descripton": "Advanced methods in forensic anthropology-an applied field of biological anthropology. Application of the science of biological anthropology to the medicolegal process. Identification of skeletal remains to determine age, sex, ancestry, stature, andunique features of a decedent. Analysis of human skeletal remains. Identification techniques addressed and proficiency expected. Students must provide their own transportation to the laboratory site.", "fall": false, "units": " 4"}, {"summer": false, "name": "Tourism, Culture and Anthropology", "prerequisites": "Prerequisite: Graduate Standing", "spring": false, "number": "ANT  531", "descripton": "Anthropological approach to tourism studies with emphasis on cross-cultural aspects of international tourism.  Attention to impact of mass tourism as compared to alternative tourism; environmental and economic impact of tourism; impact of international tourists and tourism on local communities.  Principal theories of leisure in relation to tourism.  Theories of culture change in relation to travel and tourism. Credit not granted for both ANT 431 and ANT 531.", "fall": true, "units": " 3"}, {"summer": false, "name": "Anthropology of Ecotourism and Heritage Conservation", "prerequisites": "Prerequisite: ANT 252", "spring": true, "number": "ANT  533", "descripton": "Introduction to how cultures and societies view, utilize, interpret, manage and conserve environmental and cultural heritage resources; includes examination of theory and concepts of place, identity, sacred heritage, ecotourism, wildlife management as well as the cultural politics and practices of environmentalist and heritage management.  Some limited travel to NC heritage sites required at student expense. Must hold Graduate standing, students cannot receive credit for both ANT 433 and ANT 533.", "fall": false, "units": " 3"}, {"summer": false, "name": "Cross-Cultural Perspective on Women", "prerequisites": "Prerequisite: 3 hours Cultural Anthropology or Graduate standing", "spring": true, "number": "ANT  544", "descripton": "Comparison of women in a variety of societies: western and non-western; hunting and gathering to industrialized.  Cross-cultural perspectives on the similarity and diversity of women's statuses and roles.  Effect of gender on social position.  Credit will not be offered for both ANT 444 and ANT 544.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Environmental Anthropology", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "ANT  550", "descripton": "Theoretical and methodological introduction to the anthropological study of humans and their environments. Students enrolled for graduate credit must complete a weekly one-hour problem session.  Credit not allowed for both ANT 450 and ANT 550.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Urban Anthropology", "prerequisites": "Prerequisite: ANT 252 or Graduate standing", "spring": false, "number": "ANT  560", "descripton": "Anthropological study of cities.  Examination of cross-cultural patterns of behavior in urban areas and adaptive strategies that urban dwellers employ. Major theoretical and methodological approaches relevant to an understanding of contemporary urbanization.  Credit will not be given for both ANT 460 and ANT 560.", "fall": true, "units": " 3"}, {"summer": false, "name": "Anthropology of Religion", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "ANT  564", "descripton": "Examines anthropology perspectives on the role of religion in social life; discussion of theoretical and methodological issues pertaining to the study of ritual and belief. Students enrolled for graduate credit must complete a weekly one hour problem session.  Credit not allowed for both ANT 464 and ANT 564.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Environmental Archaeology", "spring": "True", "number": "ANT  575", "descripton": "Archaeological investigation of human-environmental interactions.  Focuses on various techniques archaeologists and paleoecologists use to reconstruct prehistoric environments.  Topics include the analysis of animal remains (e.g., shellfish, fish, marine mammals, birds), soils, and plants, dating techniques, and stable isotopes.  Must hold graduate standing, credit not allowed for both ANT 475 and ANT 575.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Archaeological Method and Theory", "spring": "True", "number": "ANT  583", "descripton": "Methods and Theory used by archaeologists to locate and interpret material evidence about past human activities.  Topics include techniques for discovering and analyzing cultural remains, the history of archaeology as a discipline, and the major theoretical underpinnings that have guided archaeological practice and interpretation.  Course is required for students in Bioarchaeology concentration.  Graduate Standing required.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Skeletal Biology in Anthropology", "spring": "True", "number": "ANT  585", "descripton": "Skeletal biology is the study of human skeletal remains; understanding past populations' demographics, health and disease, physical activity, diet, and biological relatedness to other groups, past and present.  Must hold graduate standing.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Special Topics in Anthropology", "prerequisites": "Prerequisite: Graduate Standing", "spring": "True", "number": "ANT  595", "descripton": "In depth exploration of specialized topics in Anthropology. Also used to test and develop new courses.", "fall": "True", "units": " 1-6"}, {"summer": "True", "name": "Independent Study in ANT", "spring": "True", "number": "ANT  598", "descripton": "Independent study of a topic in anthropology.  Topic and mode of study determined by faculty member(s) and student(s).", "fall": "True", "units": " 1-6"}, {"summer": "True", "name": "Special Topics in Anthropology", "spring": "True", "number": "ANT  610", "descripton": "Provision for in-depth investigation of some particular topic in anthropology. Reflection of current student needs and interests through variations in course content and mode of study. Determination of topics by faculty member(s) and student.", "fall": "True", "units": " 1-6"}, {"summer": true, "name": "Masters Supervised Research", "prerequisites": "Prerequisite: Graduate Standing", "spring": true, "number": "ANT  693", "descripton": "Instruction in research, and research under the mentorship of a member of the Graduate Faculty.  Restricted to Masters Students in Anthropology.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Masters Research", "prerequisites": "Prerequisite: Graduate Standing", "spring": true, "number": "ANT  695", "descripton": "Thesis research conducted under the supervision of student's thesis committee chair or other graduate faculty member. Restricted to Masters Students in Anthropology.", "fall": true, "units": " 1-6"}, {"summer": "True", "name": "Summer Thesis Res", "spring": "True", "number": "ANT  696", "fall": "True", "units": " 1"}, {"summer": "True", "name": "Masters Thesis Preparation", "prerequisites": "Prerequisite: Graduate Standing", "spring": "True", "number": "ANT  699", "descripton": "For students who have completed all credit hours, full-time enrollment, and other requirements for the masters degree, and are writing and defending their thesis.  Restricted to Masters Students in Anthropology.", "fall": "True", "units": " 1-6"}, {"summer": false, "name": "Special Topics in Anthropology", "spring": true, "number": "ANT  810", "descripton": "Provision for in-depth investigation of some particular topic in anthropology. Reflection of current student needs and interests through variations in course content and mode of study. Determination of topics by faculty member(s) and student.", "fall": true, "units": " 1-6"}, {"summer": "True", "name": "Summer Thesis Res", "spring": "True", "number": "ANT  896", "fall": "True", "units": " 1"}]