[{"summer": false, "name": " Resource Economics", "prerequisites": "Credit is not allowed for both ARE 201 and EC 201 or EC 205.", "spring": true, "number": "ARE  201", "descripton": "Introduction to economic principles of marginal benefits and costs with application to consumer and producer decisions. Functions of market exchange systems in determining prices and quantities and creation of wealth. Property rights and opportunities for exchange. Role of government in dealing with agricultural and resource problems. Macroeconomic analysis including inflation, unemployment, money and banking system.  Credit will not be given for both ARE 201 and either EC 201 or EC 205.", "fall": true, "units": " 3"}, {"summer": false, "name": "Small Business Accounting", "prerequisites": "Prerequisite: ARE 201 or EC 201 or EC 205", "spring": false, "number": "ARE  215", "descripton": "Record keeping for small businesses organized as sole proprietorships, partnerships, and family held corporations.  Double entry accounting principals applied to service and merchandising businesses.  General Journals, Combination Journals, Subsidiary Journals, Ledgers, Accounts Receivable, Accounts Payable, Posting, Worksheets.  Financial Statements, Closing, Payrolls, Cost Basis, Depreciation, Section 179, Amortization, Financial Adjustments, and Income Tax Forms.  Both manual and computerized systems.  Semester project of keeping records for a business for a portion of the year.", "fall": true, "units": " 3"}, {"summer": false, "name": "Intermediate Microeconomics", "prerequisites": "Prerequisite: MA 121 or 131; ARE 201 or EC 205 or EC 201", "spring": false, "number": ")  301", "descripton": "Functioning of the market economy, role of prices in determining the allocation of resources, the functioning of the firm in the economy, forces governing the production and consumption of economic goods. Credit not allowed in more than one of EC 301, 310, 401.", "fall": false, "units": " 3"}, {"summer": false, "name": "Farm Management", "prerequisites": "Prerequisite: ARE 201 or EC 201 or EC 205", "spring": true, "number": "ARE  303", "descripton": "Analytical and planning techniques for making business decisions centered around farm business applications. Economic principles and management concepts such as budgeting, accounting, finance credit, investment analysis, business organization, risk,and taxes as related to practical problems of operating a farm business.", "fall": true, "units": " 3"}, {"summer": false, "name": "Agribusiness Management", "prerequisites": "Prerequisite: ARE 201 or EC 201 or EC 205", "spring": true, "number": "ARE  304", "descripton": "Management decision-making by food, fiber, horticulture, and forestry firms.  Emphasis on current agribusiness topics such as information utilization, strategic planning, organization structures, competitor intelligence, pricing, leadership, crisis management, ethics, and human resource management.  Business communications, agribusiness case studies, and a computerized management simulation game.", "fall": false, "units": " 3"}, {"summer": false, "name": "Agricultural Law", "prerequisites": "Prerequisite: ARE 201 or EC 201 or EC 205", "spring": true, "number": "ARE  306", "descripton": "Legal principles of practical importance in an agricultural setting: the court system; tort, contract and real and personal property law; legal aspects of organizing an agribusiness; environmental and labor regulations affecting agriculture; income and estate taxation of agriculture.  Credit for both ARE 306 and BUS 307 is not allowed", "fall": true, "units": " 3"}, {"summer": false, "name": " Economic Policy", "prerequisites": "Prerequisite: ARE 201 or EC 201 or EC 205", "spring": true, "number": "ARE  309", "descripton": "Current federal and state environmental laws and regulations and their common law foundations.  Relationship of the law and its regulatory mechanisms to economic policy issues: externalities, pollution taxes, incentives, permit trading, and cost-benefit analysis. Major environmental topics including water and wetlands, solid and hazardous wastes, pesticides, clean air, endangered species and nuisance actions. Overview of the legal system.", "fall": true, "units": " 3"}, {"summer": false, "name": "Agricultural Markets", "prerequisites": "Prerequisite: ARE 201 or EC 201 or EC 205", "spring": false, "number": "ARE  311", "descripton": "Agricultural marketing system and economic forces affecting its structure and efficiency.  Public policy issues affecting agricultural markets.  Emphasis on the analysis of current sources of agricultural market information.  Marketing and storage problems over time; futures markets and the management of risk; transportation and international trade; government agricultural programs.", "fall": true, "units": " 3"}, {"summer": false, "name": "Agribusiness Marketing", "prerequisites": "Prerequisite: ARE 201 or EC 201 or EC 205", "spring": true, "number": "ARE  312", "descripton": "Application of marketing and economic principles to decision making in contemporary agribusiness firms.  Marketing strategies, marketing research and information, segmentation and targeting, marketing mix, and market plans within food, fiber, natural resource, and production input industries.  Professional selling skills and knowledge.  Off-campus field experience and visiting lecturers from the agribusiness industry.", "fall": true, "units": " 3"}, {"summer": false, "name": "Agricultural Financial Management", "prerequisites": "Prerequisite: ARE 201 or EC 201 or EC 205", "spring": false, "number": "ARE  321", "descripton": "Fundamental concepts for financial management decision in agricultural/farm businesses.  Emphasis on financial statement analysis of profitability, efficiency, liquidity, repayment capacity, risk, leverage, growth.  Capital budgeting, investment decisions, farmland bid price determination, farm real estate appraisal.  Financial markets and credit institutions serving agriculture, lending policies, loan analysis, interest rate determination.  Financial structure, performance, condition of farm sector.", "fall": true, "units": " 3"}, {"summer": false, "name": "Human Resource Management for Agribusiness", "prerequisites": "Prerequisite: ARE 201 or EC 201 or EC 205", "spring": true, "number": "ARE  332", "descripton": "General introduction to human resource management in agribusinesses. Skills for agribusiness owners for efficient productivity from employees in a legal and ethical manner. Topics on labor economics, human resource legislation, employee planning and recruitment, and migrant labor issues. Emphasis on techniques for training, motivating, leading, and disciplining employees.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Resource and Environmental Economics", "prerequisites": "Prerequisite: ARE 201 or EC 201 or EC 205", "spring": true, "number": ")  336", "descripton": "Application of basic economic tools to understand and evaluate environmental/resource policies.  Concepts such as property rights, non-market goods, allocation over time, externalities, and public goods. Current policy issues such as global climate change, evaluating natural resource damages from oil spills, reducing the costs of regulations, protecting estuaries, and dealing with non-point source pollution.", "fall": true, "units": " 3"}, {"summer": false, "name": "Global Agribusiness Management", "prerequisites": "Prerequisite: EC 201 or 205 or ARE 201", "spring": true, "number": "ARE  345", "descripton": "Global trade is the largest growth area in American agribusiness, and knowledge of international agribusiness markets is one of the primary qualifications desired from college graduates entering the workforce. This course provides detailed knowledge of the six major regions for agribusiness trade worldwide, to prepare students to understand, speak intelligently about, and capitalize on opportunities for NC and US agribusiness products in the global marketplace. Students will be required to provide their own transportation to local markets and incidental expenses for meals representative of the six major regions connected with class assignments. Please see the Instructor for details.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Advanced Agribusiness Management", "prerequisites": "Prerequisite: (ARE 303 or ARE 304), ARE 321, and (ARE 311 or ARE 312)", "spring": "True", "number": "ARE  404", "descripton": " Resource Economics students with the remaining 20% open for all other majors.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Advanced Agribusiness Marketing", "prerequisites": "Prerequisite: ARE/EC 201 or EC 205; Pre- or Co-requisite: ARE 312 or BUS 360", "spring": false, "number": "ARE  412", "descripton": "ARE provides opportunities for undergraduates to gain experience with the practical application of Marketing principles with real and fictitious Agribusiness products through two courses taken on campus: ARE 412 and ARE 413. These opportunities are provided to students that are specifically interested in pursuing a Marketing or Sales position after graduation, especially when an internship is not an option. The practical applications often require two semesters (one full academic year) to complete, so student involved in projects are encouraged to take ARE 412 in the Fall and ARE 413 in the Spring. Projects very each year.", "fall": true, "units": " 3"}, {"summer": false, "name": "Applied Agribusiness Marketing", "prerequisites": "Prerequisite: ARE 201/EC 201 or EC 205, ARE 312, ARE 412", "spring": true, "number": "ARE  413", "descripton": "ARE provides opportunities for undergraduates to gain experience with the practical application of marketing principles with real and fictitious agribusiness products through two courses taken on campus, ARE 412 and ARE 413. These opportunities are provided to students that are specifically interested in pursuing a Marketing or Sales position after graduation, especially when an internship is not an option. The practical applications often require two semesters (one full academic year) to complete, so students involved in projects are encouraged to take ARE 412 in the Fall, and ARE 413 in the Spring. Projects vary each year. This course is an elective for ABM, BBM, and related CALS majors. Departmental approval required to enroll in course.", "fall": false, "units": " 3"}, {"summer": false, "name": "U.S. Agricultural Policy", "prerequisites": "Prerequisite: ARE(EC) 301 or ARE(EC) 401", "spring": false, "number": "ARE  433", "descripton": "Government economic policies and programs affecting agricultural inputs and farm products.  Analysis of the rationale, objectives, and major types of agricultural programs and their effects on resource allocation and income distribution within agriculture and between agriculture and the rest of the economy.", "fall": true, "units": " 3"}, {"summer": false, "name": "Environmental Economics", "prerequisites": "Prerequisite: ARE(EC) 301", "spring": true, "number": ")  436", "descripton": "Usefulness of economics in understanding pollution, congestion, conservation and other environmental problems.  Relevant economic tools such as pricing schemes, abatement cost curves, damage functions and benefit-cost analysis.  Pollution taxes, regulations, marketable permits and subsidies considered in designing alterations, in the incentive system.  Current public policy alternatives in the context of non-market decision-making.", "fall": false, "units": " 3"}, {"summer": false, "name": " Resource Economics", "prerequisites": "Prerequisite: Sophomore standing", "spring": false, "number": "ARE  490", "descripton": "Planning and preparing for career choices.  Resume writing, networking, interviewing, personality characteristics, and job searching.  Visits with employer representatives.  Employer expectations and career opportunities.  Researching firms and employment opportunities.  Oral and written presentations.", "fall": true, "units": " 1"}, {"summer": false, "name": "External Learning Experience", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "ARE  492", "descripton": "A learning experience in agriculture and life sciences within an academic framework that utilizes facilities and resources which are external to the campus.  Contact and arrangements with prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior to the experience.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Special Problems/Research Exploration", "prerequisites": "Prerequisite: ARE Sophomore standing", "spring": true, "number": "ARE  493", "descripton": "A learning experience in agriculture and life sciences within an academic framework that utilizes campus facilities and resources.  Contact and arrangements with prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior to the experience.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Agribusiness Study Abroad", "spring": true, "number": "ARE  494", "descripton": "Global trade is the largest growth area in American agribusiness, and knowledge of international agribusiness markets is a primary qualification desired from college graduates entering the workforce.  This course addresses these issues by providing opportunities for students to study abroad in various locations around the world, with different destinations offered each academic year.  Credit hours are variable based on length of travel and classroom instruction pre-and post-travel consistent with NCSU policies and practices.  Course may be repeated for credit to visit different destinations only.  Significant expenses for travel are involved.  Please see the instructor for specific program details.", "fall": false, "units": " 1-6"}, {"summer": "True", "name": "Special Topics in Agricultural and Resource Economics", "spring": "True", "number": "ARE  495", "descripton": "Presentation of material not normally available in regular course offerings or offering of new courses on a trial basis.", "fall": "True", "units": " 1-6"}]