[{"summer": "True", "name": "The Arts of a World Capital: London", "spring": "True", "number": "ARS  251", "descripton": "Multidisciplinary course introducing students to the architecture and museums and the musical, dance, and theatrical performances of London.  Historical and social context of these works of art.  The infrastructure in London that makes its unusual artistic vitality and quality possible.  Taught in London.", "fall": "True", "units": " Performing Arts, Global Knowledge"}, {"summer": "True", "name": "The Arts of Vienna 1900", "spring": "True", "number": "ARS  252", "descripton": "Interdisciplinary study of art, architecture, music and theater in turn-of-the-century Vienna and of the political and scientific thinking that surrounded these arts.  Taught in Vienna.", "fall": "True", "units": " Performing Arts, Global Knowledge"}, {"summer": "True", "name": "Arts of NC State", "spring": "True", "number": "ARS  253", "descripton": "Study of the arts in the context of the university community, utilizing university arts programs and resources. Core concepts and methods for aesthetic experience in several disciplines including dance, theater, music, visual art, and craft through performance and exhibition attendance, readings, lectures, and discussion. (Modest fees for performance tickets might be required.)", "fall": "True", "units": " Performing Arts"}, {"summer": false, "name": "Technology in the Arts", "spring": false, "number": ")  257", "descripton": "The interaction between technology and the arts with an emphasis on developments in Western art of the twentieth century.  Historical and emerging issues include: sound and film recordings, the addition of sound to films, the impact of films and television on theater, the impact of radio, computer applications to music, the visual arts, and literature.", "fall": true, "units": " 3"}, {"summer": false, "name": "Mathematics and Models in Music", "spring": true, "number": "ARS  258", "descripton": "Use of mathematics and models in the composition of western music of various time periods with an emphasis on the twentieth century.  Critical analysis of trivial and non-trivial uses of mathematics; differentiation between mathematics as an analytical tool and mathematics as a compositional tool.  Survey of models including geographical, grammatical, and graphic.", "fall": false, "units": " 3"}, {"summer": "True", "name": "The Arts and Politics", "spring": "True", "number": "ARS  259", "descripton": "Interactions between the arts and politics.  Specific instances and types of political art from the past and the present.  Patronage, censorship, propaganda, art in times of war, the artist's options and powers, aesthetics and criticism.", "fall": "True", "units": " Performing Arts"}, {"summer": "True", "name": "Music Composition with Computers", "prerequisites": "Prerequisite: Some knowledge of music or computer science (e.g. CSC 200)", "spring": "True", "number": ")  306", "descripton": "Survey of the theory and history of computer music, compositional algorithms, digital synthesis techniques, composition of at least one computer music work -- a computer-assisted composition for traditional instruments, a piece for computer music ontape, a real-time piece, or a piece that combines tape and instrument(s).", "fall": "True", "units": " Performing Arts"}, {"summer": true, "name": "Black Popular Culture", "spring": true, "number": ")  346", "descripton": "A multidisciplinary examination of contemporary black cultural expression in film, music, art, and the media.  Emphasis on race, class, gender, and political discourse.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Arts, Ideas and Values", "spring": "True", "number": "ARS  351", "descripton": "An examination of the way works of art embody a particular understanding of what is real and what is worthwhile and shape their viewers' ideas and values. Case studies approach.", "fall": "True", "units": " Performing Arts"}, {"summer": "True", "name": "Arts and Cross-Cultural Contacts", "spring": "True", "number": "ARS  353", "descripton": "Study of works of art that allude to or combine two or more traditions.  Examples from film, dance, music, theater and visual arts.  Analysis of the role of the exotic in art.  The role of arts of multiple traditions in inaugurating new artistic movements, such as Ming landscape painting. Impact of electronic media on contemporary multicultural arts, such as Nepali pop.", "fall": "True", "units": " Performing Arts, Global Knowledge"}, {"summer": "True", "name": "The Arts and the Sacred", "spring": "True", "number": "ARS  354", "descripton": "The support and critique of religion through the arts.  Study of religious symbolism embodied in works of art from a number of traditions and genres.  The interrelationship between art and religion, history, culture, spirituality, and ritual.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Interdisciplinary Arts Seminar", "spring": false, "number": "ARS  414", "descripton": "Creation and presentation of new interdisciplinary works of art.  Theory and history of such works including discussion of mixed media, multimedia and intermedia.  In-class presentations and critiques.  Eventual presentation of finished works in appropriate venues.  Additional expenses will be incurred for Arts Now Series events", "fall": true, "units": " 3"}, {"summer": false, "name": "Topics in Arts Studies", "prerequisites": "Prerequisite: Junior standing and 15 hours in either dance, design, film studies, music, theater, or visual arts.", "spring": true, "number": "ARS  494", "descripton": "Multi-arts course focusing on selected works of art in various media, related by theme, place or date. Capstone course for students with an extensive background in one of the arts. Topics may vary.", "fall": true, "units": " 3"}, {"summer": true, "name": "Independent Study in Arts Studies", "prerequisites": "Prerequisite: Nine hours of course work in Arts Studies", "spring": true, "number": "ARS  498", "descripton": "Independent study or project directed by a faculty member in the student's area of interest.", "fall": true, "units": " 1-3"}]