[{"summer": false, "name": "The Foundation of the United States Air Force I", "prerequisites": "P: Departmental Approval Required", "spring": false, "number": "AS  121", "descripton": "Part I of a survey course designed to introduce students to the United States Air Force and provides an overview of the basic characteristics, missions and organization of the Air Force.", "fall": true, "units": " 1"}, {"summer": false, "name": "The Foundations of the United States Air Force II", "spring": true, "number": "AS  122", "descripton": "Part II of a survey course designed to introduce students to the United States Air Force and provides an overview of the basic characteristics, missions and organization of the Air Force.", "fall": false, "units": " 1"}, {"summer": false, "name": "The Evolution of USAF Air and Space Power I", "spring": false, "number": "AS  221", "descripton": "Part I of a course featuring topics on Air Force heritage and leaders; introduction to air and space power through examination of competencies and functions; and continued application of communication skills.  Its purpose is to instill an appreciation of the development and employment of air power and to motivate students to transition from AFROTC cadet to Air Force ROTC officer candidate.", "fall": true, "units": " 1"}, {"summer": false, "name": "The Evolution of USAF Air and Space Power II", "spring": true, "number": "AS  222", "descripton": "Part II of a course featuring topics on Air Force heritage and leaders; introduction to air and space power through examination of competencies and functions; and continued application of communication skills.  Its purpose is to instill an appreciation of the development and employment of air power and to motivate students to transition from AFROTC cadet to Air Force ROTC officer candidate.", "fall": false, "units": " 1"}, {"summer": false, "name": "Air Force Leadership Studies I", "prerequisites": "Prerequisite: Successful completion of Field Training", "spring": false, "number": "AS  321", "descripton": "Part I of a course that teaches cadets advanced skills and knowledge in management and leadership.  Special emphasis is place on enhancing leadership skills.  Cadets have an opportunity to try out these leadership and management techniques in a supervised environment as juniors and seniors.", "fall": true, "units": " 3"}, {"summer": false, "name": "Air Force Leadership Studies II", "prerequisites": "Prerequisite: Successful completion of Field Training", "spring": true, "number": "AS  322", "descripton": "Part II of a course that teaches cadets advanced skills and knowledge in management and leadership.  Special emphasis is placed on enhancing leadership skills.  Cadets have an opportunity to try out these leadership and management techniques in a supervised environment as juniors and seniors.", "fall": false, "units": " 3"}, {"summer": false, "name": "National Security Affairs/Preparation for Active Duty I", "prerequisites": "Prerequisite: Successful completion of Field Training", "spring": false, "number": "AS  421", "descripton": "Part I of a course designed for college seniors and that gives them the foundation to understand their role as military officers in American society.  It is an overview of the complex social and political issues facing the military profession and requires a measure of sophistication commensurate with the senior college level.", "fall": true, "units": " 3"}, {"summer": false, "name": "National Security Affairs/Preparation for Active Duty II", "prerequisites": "Prerequisite: Successful completion of Field Training", "spring": true, "number": "AS  422", "descripton": "Part II of a course designed for college seniors and that gives them the foundation to understand their role as military officers in American society.  It is an overview of the complex social and political issues facing the military profession and requires a measure of sophistication commensurate with the senior college level.", "fall": false, "units": " 3"}, {"summer": false, "name": "Special Topics in Aerospace Studies", "spring": true, "number": "AS  495", "descripton": "Offered as needed to  treat new or special subject matter relating to the Department of the Air Force.", "fall": true, "units": " 2"}]