[{"summer": false, "name": "Introduction to Biological Engineering", "spring": true, "number": "BAE  100", "descripton": "Technical topics and career options in Biological Engineering with concentrations in Agricultural, Bioprocess, and Environmental Engineering are introduced.  Information is provided about career services, internships, and study abroad and co-op opportunities in these areas.  Students develop a plan of work.", "fall": false, "units": " 1"}, {"summer": false, "name": "Computer Methods in Biological Engineering", "prerequisites": "Prerequisite: MA 141 and E 115", "spring": false, "number": "BAE  200", "descripton": "Students develop computer-based problem solving techniques to solve introductory problems in Biological and Biomedical Engineering.  Emphasis is on developing solution algorithms and implementing these with spreadsheets, equation solvers, and computer programming.", "fall": true, "units": " 2"}, {"summer": false, "name": "Introduction to Biological and Agricultural Engineering Methods", "prerequisites": "Prerequisite: E 115", "spring": true, "number": "BAE  202", "descripton": "Introduction to experimental design methodology, basic engineering design and problem solving methodology for Biological Engineering. Visualization skills, computer-aided 3-D solid modeling of parts, 3-D assembly of solid part geometries, computation of mass properties, 2-D engineering drawings, engineering design process, safety, tools and fabrication processes and design, and hands-on shop fabrication of semester project.", "fall": false, "units": " 4"}, {"summer": false, "name": "Properties of Biological Engineering Materials", "prerequisites": "Prerequisite: (BIO 181 or BIO 183), and either (BAE 200, CSC 112, CSC 114 or CSC 116) and (CE 215 or MAE 208) and Corequisites: (MAE 308 or CE 382), and (MAE 314 or CE 313).", "spring": true, "number": "BAE  315", "descripton": "Physical properties of biological and non-biological engineering materials, their uniqueness and variability within systems.  Relationships between plant, animal, and human tissues, property measurement, and evaluation of dimensional, mechanical, rheological, thermal, electrical, and optical properties.", "fall": false, "units": " 3"}, {"summer": false, "name": "Introduction to Food Process Engineering", "prerequisites": "Prerequisite: BAE 302; MAE 308 or CE 382; MAE 301 or CHE 315", "spring": true, "number": "BAE  322", "descripton": "Introductory principles and practices of handling and preserving food products.  Coverage includes the design and analysis of handling systems for discrete and continuous flow material handling systems, the selection and specification of automatic controls, food preservation principles and considerations relevant to the design of food handling systems, and the principles and practices of drying and storing grain.", "fall": false, "units": " 3"}, {"summer": false, "name": "Introductory Geomatics", "prerequisites": "Prerequisite: Junior standing", "spring": false, "number": "BAE  325", "descripton": "Theory and practice of plane and satellite-based surveying.  Includes distance measurement, differential leveling, profile leveling, topographic surveying, and record keeping.  Introduction to tapes, levels, total stations, surveying software, the global positioning system, GPS receivers and methods (stand-alone, DGPS, RTK), data collection, data processing, and applications.", "fall": true, "units": " 3"}, {"summer": false, "name": "Analytical Methods in Engineering Design", "prerequisites": "Prerequisite: BAE 202, CE 215 or MAE 208, MA 341, Corequisite: MAE 314", "spring": true, "number": "BAE  361", "descripton": "Engineering problem solving through studies of topics in engineering design.  Kinematic analysis of linkages, analysis and design/selection of machine structures and power transmission components, including vibration modeling and control in lumped mass mechanical and biomechanical systems.", "fall": false, "units": " 3"}, {"summer": false, "name": "Land Resources Environmental Engineering", "prerequisites": "Prerequisite: BAE 200, CSC 112, CSC 114, CSC 116; Corequisite: SSC 200 and either (CE 382 or MAE 308)", "spring": false, "number": "BAE  371", "descripton": "Hydrology and erosion principles. Designing structures and selecting practices to control land runoff, erosion, sediment pollution and flooding.", "fall": true, "units": " 3"}, {"summer": false, "name": "Instrumentation for Biological Systems", "prerequisites": "Prerequisite: ECE 331", "spring": false, "number": "BAE  401", "descripton": "Basic concepts of instrumentation for monitoring of biological systems. Study of transducers and circuits utilized in biological and agricultural engineering applications. Demonstration of concepts of error, accuracy and precision, linearity and other instrument characteristics by electronic models. Provision of hands-on experience for reinforcing lecture concepts in laboratories.  Credit will not be given for both BAE 401 and BAE 501.", "fall": true, "units": " 3"}, {"summer": false, "name": "Transport Phenomena", "prerequisites": "Prerequisite: (BAE 200, CSC 112, CSC 114 or CSC 116), (CE 215 or MAE 208), MA 341 and MAE 301; Corequisite: CE 382 or MAE 308", "spring": false, "number": "BAE  402", "descripton": "Theory and application of heat and mass transfer in biological, food, and agricultural systems.  Topics include fluid flow, conduction, convection, radiation, psychrometrics, and refrigeration.", "fall": true, "units": " 3"}, {"summer": false, "name": "Industrial Microbiology and Bioprocessing", "prerequisites": "Prerequisite: Junior or higher standing in CALS or COE;  MB 351", "spring": true, "number": "BAE  425", "descripton": "Introduction to the structure and functions of microbial cells and their cultivation and utilization in bioprocess engineering. Fermentation systems and downstream processing methods. Enzyme kinetics, production and application. Biomanufacturing of fuels, industrial chemicals, pharmaceuticals, food additives and food products such as beer, wine, cheese and yogurt Microbial biomass production. Introduction to environmental biotechnology including waste water treatment, bioremediation and biomining. Biodeterioration and its control. Product development, regulations and safety. Field trip(s) are an essential educational component of the course and are required.  Credit will not be given for both BAE(BBS) 425 and BAE 525.", "fall": false, "units": " 3"}, {"summer": false, "name": "Precision Agriculture Technology", "prerequisites": "Prerequisite: Junior standing or Senior standing", "spring": true, "number": "BAE  435", "descripton": "Overview of technology available for implementation of a comprehensive precision agriculture program.  Topics include computers, GPS, sensors, mechanized soil sampling, variable rate control system, yield monitors, and postharvest processing controls.  Applications of precision agriculture in crop planning, tillage, planting, chemical applications, harvesting and postharvest processing. Credit may not be received for BAE/SSC 435 and BAE/SSC 535", "fall": false, "units": " 3"}, {"summer": false, "name": "Systems Approach to Agricultural and Environmental Issues", "prerequisites": "Prerequisite: ENG 331 or ENG 332 or ENG 333; Senior standing", "spring": true, "number": "BAE  442", "descripton": "Systems approach to complex agricultural and environmental issues and problematic situations including people's views.  Multiple stages of soft systems approach:  open inquiry into and description of issues, conceptual modeling, feasibility and implementation of changes.  Individual project using systems approach to a complex issue in agriculture or the environment.", "fall": false, "units": " 3"}, {"summer": false, "name": "Engineering Design I", "prerequisites": "Prerequisite: (CE 313 or MAE 314), BAE 202, 302, 315, and either (BAE 322, 361, or 371)", "spring": false, "number": "BAE  451", "descripton": "Design Concepts of engineering problems; objectives, specifications, manufacturing, prior art and analysis. Oral and written exercises in reverse engineering, national and international standards, quality control, intellectual law and engineering ethics. Team projects from agricultural, bio-processing and environmental engineering. Must be within 36 credit hours of completing the BE degree. Field trips are required. Must be within 36 credit hours of completing the BE degree.", "fall": true, "units": " 2"}, {"summer": false, "name": "Engineering Design II", "prerequisites": "Prerequisite: BAE 451", "spring": true, "number": "BAE  452", "descripton": "Continuation  of BAE 451; Project analysis, design, scheduling, construction, tests and reports.  Teamwork and the function of engineering design in society. Field trips are required. Must be within 36 hours of completing the BE degree.", "fall": false, "units": " 2"}, {"summer": false, "name": "Machinery Design and Applications", "prerequisites": "Prerequisite: BAE 361", "spring": false, "number": "BAE  462", "descripton": "Machinery design for effective use of energy and labor in agricultural production. Engine cycles, power transmission, hydraulics, traction, combined stresses, finite element analysis, computer-aided-engineering, and engineering economics.  Machinerydesign of agricultural field equipment and other agricultural machinery systems.", "fall": true, "units": " 3"}, {"summer": false, "name": "Irrigation and Drainage", "prerequisites": "Prerequisite:  BAE 471", "spring": true, "number": "BAE  472", "descripton": "Design, management and evaluation of irrigation and drainage systems; concepts and processes of system design.  Credit will not be given for both BAE 472 and BAE 572.", "fall": false, "units": " 3"}, {"summer": false, "name": "Introduction to Surface/Water Quality Modeling", "prerequisites": "Prerequisite: BAE 471", "spring": false, "number": "BAE  473", "descripton": "Concepts in basic hydrologic, erosion and chemical transport used in modeling.  Evaluation of typical hydrologic/water quality models on watershed systems.  Project examples using state-of-the-art models.  Credit will not be given for both BAE 473 and BAE 573.", "fall": true, "units": " 3"}, {"summer": false, "name": "Principles and Applications of Ecological Engineering", "prerequisites": "Prerequisite: MB 351 or SSC 332, BAE 471", "spring": true, "number": "BAE  474", "descripton": "Governing principles of ecological engineering and the advanced biological, chemical, and physical conditions that determine the design of biological systems. Emphasis on 1) stream and wetland ecosystem restoration and 2) natural treatment systems for groundwater, stormwater, and wastewater such as riparian buffers, bioretention cells, and stormwater wetlands. A class field trip is required during non-scheduled time.", "fall": false, "units": " 3"}, {"summer": false, "name": " Environment", "prerequisites": "Prerequisite: BAE 302; CE 313 or MAE 314", "spring": true, "number": "BAE  481", "descripton": "Principles of environmental control and structural analysis are combined with biological principles for the design of structures.  Topics include structural analysis, load estimation, material selection, fasteners, physiological reactions of animalsand plants to their environment, applications of heat transfer and psychrometrics in calculating ventilation requirements, heating or cooling loads.", "fall": false, "units": " 3"}, {"summer": false, "name": "External Learning Experience", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "BAE  492", "descripton": "A learning experience in agriculture and life sciences within an academic framework that utilizes  facilities and resources which are external to the campus. Contact and arrangements with  prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior to the experience.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Special Problems in Biological and Agricultural Engineering", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "BAE  493", "descripton": "A learning experience in agriculture and life sciences within an academic framework that utilizes campus facilities and resources.  Contact and arrangements with prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior to the experience.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Special Topics in Biological and Agricultural Engineering", "spring": true, "number": "BAE  495", "descripton": "Offered as needed for presenting material not normally available in regular BAE departmental courses or for new BAE courses on a trial basis.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Instrumentation for Biological Systems", "prerequisites": "Prerequisite: ECE 331", "spring": false, "number": "BAE  501", "descripton": "Basic concepts of instrumentation for monitoring biological systems. Study of transducers and circuits utilized in biological and agricultural engineering applications. Demonstration of concepts of error, accuracy and precision, linearity and other instrument characteristics by electronic models.  Provision of hands-on experience for reinforcing lecture concepts in laboratories.  Credit will not be given for both BAE 401 and BAE 501.", "fall": true, "units": " 3"}, {"summer": false, "name": "Instrumentation for Hydrologic Applications", "prerequisites": "Prerequisite: MA 341, BAE 401 or ECE 331, ST 370 or ST 511", "spring": true, "number": "BAE  502", "descripton": "Basic theory of instruments and measurements.  Physical parameters of interest, available methods and sensors for assessment.  Sensor characteristics.  Dataloggers and sensor-datalogger communications.  Data transfer, management, and processing.  Emphasis on hydrologic and water quality research applications.  Course offered by Distance Education only.", "fall": false, "units": " 3"}, {"summer": false, "name": "Industrial Microbiology and Bioprocessing", "prerequisites": "Prerequisite: MB 351", "spring": true, "number": "BAE  525", "descripton": "Introduction to the structure and functions of microbial cells and their cultivation and utilization in bioprocess engineering.  Fermentation systems and downstream processing methods.  Enzyme kinetics, production and application.  Biomanufacturing of fuels, industrial chemicals, pharmaceuticals, food additives and food products such as beer, wine, cheese, and yogurt.  Microbial biomass production. Introduction to environmental biotechnology including waste water treatment, bioremediation and biomining.  Biodeterioration and its control.  Product development, regulations and safety.  Graduate standing required.  Students cannot obtain credit for both BAE(BBS) 425 and BAE 525.", "fall": false, "units": " 3"}, {"summer": false, "name": "Biomass to Renewable Energy Processes", "prerequisites": "Prerequisite: Introductory Organic Chemistry or Biochemistry", "spring": false, "number": "BAE  528", "descripton": "This course will introduce fundamental principles and practical applications of biomass-to-renewable energy processes, including anaerobic digestion of organic wastes for biogas and hydrogen production, bioethanol production from starch and lignocellulosic materials, biodiesel production from plant oils, and thermoconversion of biomass and waste materials. Restricted to engineering seniors and graduate standing in COE, CALS, PAMS or CNR.", "fall": true, "units": " 3"}, {"summer": false, "name": "Precision Agriculture Technology", "prerequisites": "Prerequisite: Junior standing or Senior standing", "spring": true, "number": "BAE  535", "descripton": "Overview of technology available for implementation of a comprehensive precision agriculture program.  Topics include computers, GPS, sensors, mechanized soil sampling, variable rate control system, yield monitors, and postharvest processing controls.  Applications of precision agriculture in crop planning, tillage, planting, chemical applications, harvesting and postharvest processing. Credit may not be received for BAE/SSC 435 and BAE/SSC 535", "fall": false, "units": " 3"}, {"summer": false, "name": "Aerosol Science and Engineering", "prerequisites": "Prerequisite: MA 341", "spring": false, "number": "BAE  560", "descripton": "This course is designed for students who have a desire to work in the area of air quality.  It will provide students with fundamental knowledge of aerosol properties, behavior and physical principles, and with hands-on experience in applying this knowledge to aerosol/PM measurements and control.", "fall": true, "units": " 3"}, {"summer": false, "name": "Agricultural Air Quality", "prerequisites": "Prerequisite: MA 341", "spring": true, "number": "BAE  561", "descripton": "This course will prepare students to identify agricultural air pollutants and their sources, understand the on-farm and off-farm impacts of these pollutants, measure these pollutants, characterize and model the fate of these pollutants, and select and/or design cost-effective remediation measures.  This course is restricted to seniors in engineering and MEAS, and graduate students in CALS, PAMS, and CNR.", "fall": false, "units": " 3"}, {"summer": false, "name": "Irrigation and Drainage", "prerequisites": "Prerequisite: BAE 471, SSC 200", "spring": true, "number": "BAE  572", "descripton": "Design, management and evaluation of irrigation and drainage systems; concepts and processes of system design.", "fall": false, "units": " 3"}, {"summer": false, "name": "Introduction to Surface Hydrologic/Water Quality Modeling", "prerequisites": "Prerequisite: Graduate standing,  BAE 471, SSC 200", "spring": false, "number": ")  573", "descripton": "Concepts in basic hydrologic, erosion and chemical transport used in modeling. Evaluation of typical hydrologic/water quality models on watershed systems. Usage of state-of-the-art models in project examples.", "fall": true, "units": " 3"}, {"summer": false, "name": "DRAINMOD: Theory and Application", "prerequisites": "Prerequisite: One of the following: BAE 471, BAE 472, BAE 573, BAE 771, or SSC 511", "spring": true, "number": "BAE  574", "descripton": "This course presents the theory of water movement and storage in poorly drained soils and applies the drainage/water management model DRAINMOD to a wide range of problems.  Technical issues related to evaluation, design and management of drained soils and to wetland hydrology are analyzed.  A series of problem sets provides experience in using the model, and demonstrates how the model may be applied to describe the complex interactions of multiple processses affecting hydrology of shallow water table soils.", "fall": false, "units": " 3"}, {"summer": false, "name": "Design of Structural Stormwater Best Management Practices", "prerequisites": "Prerequisite: BAE 471 or CE 383", "spring": true, "number": "BAE  575", "descripton": "The design of structural stormwater Best Management Practices (BMPs) used in the urban and suburban environments is reviewed, including stormwater wetlands, bio-retention areas, sand filters, innovative wet ponds, green roofs, permeable pavement, and reinforced grass swales. The course is application oriented and includes a pair of field trips.", "fall": false, "units": " 3"}, {"summer": false, "name": "Watershed Monitoring and Assessment", "prerequisites": "Prerequisite: [AES323 (SSC323/BAE323) or BAE471 or FOR429 (NR420) or CE586, and ST311 or ST361 or ST511", "spring": false, "number": "BAE  576", "descripton": "Water measurement and structure sizing. Identification of water quality problems and water quality variable selection. Monitoring design, water quality sampling equipment, and sample collection and analysis. Statistical analysis and presentation of water quality data.", "fall": true, "units": " 3"}, {"summer": false, "name": "Agricultural Waste Management", "prerequisites": "Prerequisite: Biology or Engineering background;", "spring": false, "number": "BAE  578", "descripton": "This course covers principles of managing, handling, treating and applying animal and poultry manures and organic byproducts from an engineering perspective.  Topics include waste characterization, descriptions of systems and technology, land application principles, preparation of waste management plans, biochemical/biological processes, and potential impacts to the environment.  Assignments include homework, quizzes, projects, and discussions that emphasize problem solving and analysis.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Stream Channel Assessment and Restoration", "prerequisites": "Prerequisite: BAE 471 or CE 383", "spring": "True", "number": "BAE  579", "descripton": "Applications of fluvial geomorphology principles for assessment and restoration of natural stream channels. Topics include stream processes related to channel formation, bankfull channel dimensions, stream classification, morphological assessments, stream stability, restoration options for unstable channels, natural channel design approaches, and stream morphology monitoring. Field exercises include channel surveying using total stations, stream classification, and stability assessment. Field trips to stream restoration projects are included.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Introduction to Land and Water Engineering", "prerequisites": "Prerequisite: MA 241", "spring": false, "number": "BAE  580", "descripton": "This distance course introduces students to concepts of the hydrologic cycle, water quality, precipitation, evapotranspiration, infiltration, watershed delineation, surface runoff and open channel flow.  Students will apply these concepts to an engineering design problem.  This course is designed for non-engineering distance graduate students and lifelong education students and students from engineering disciplines outside of BAE.  It will not substitute for BAE 471.  The course is only open to students with senior standing or higher.", "fall": true, "units": " 3"}, {"summer": false, "name": "Open Channel Hydraulics for Natural Systems", "prerequisites": "Prerequisite: CE 382 or equivalent.  CE 381 recommended.", "spring": false, "number": "BAE  581", "descripton": "Theory and applications of hydraulics to open channels with an emphasis on natural streams and rivers. Course will introduce and develop principles of flow regimes (subcritical/critical/supercritical), and types (uniform flow, gradually varied and rapidly varied flow). Application will include hydraulics of flow measuring devices, step-backwater analysis and rating curve development, and flood studies using hydraulic models. A lab-scale flume will be used to illustrate concepts. Laptops will be used in class to learn and apply HEC-RAS (water surface profiles model). CE 382 or equivalent required.  CE 381 recommended.", "fall": true, "units": " 3"}, {"summer": false, "name": "Risk and Failure Assessment of Stream Restoration Structures", "prerequisites": "Prerequisite: CE 382 or MAE 308 or equivalent", "spring": true, "number": "BAE  582", "descripton": "This course defines uncertainty and risk pertaining to stream restoration structures and identifies and quantifies sources of such. Students will review various in-stream structures and, using an example study of the rock cross vane as a guide, will investigate a structure of their choice applying the concepts of risk and uncertainty. Modules include: Introduction to structures and definitions; Types and modes of failure; Uncertainty in Stream Restoration Design; Probability of failures, cost of failures; and Failure modes and effects.", "fall": false, "units": " 1"}, {"summer": false, "name": "Ecohydraulics and River Corridor Function", "prerequisites": "Prerequisite: CE 382 or MAE 308 or equivalent", "spring": true, "number": "BAE  583", "descripton": "This course provides an ecological perspective of lotic systems and introduces students to ecological processes that structure river corridors. This course defines hydraulic, hydrologic, chemical, sedimentary, and biotic influences on an aquatic ecosystem. The five modules define components of aquatic ecosystems and their interactions, and explore ecological implications of engineered designs and cause-effect  relationships from the watershed scale down to individual organisms. This course assumes students have a working knowledge of general biological and physical principles related to fluvial ecosystems.", "fall": false, "units": " 1"}, {"summer": false, "name": "Integrating AutoCAD Civil 3D and GIS", "spring": false, "number": "BAE  585", "descripton": "Basics of the AutoCAD Civil 3D user interface, drawing tools, importing and handling of survey data, generation of surfaces.  GIS data sources and formats.  Accessing and using GIS data for Civil 3D design purposes.  Creation of GIS objects within Civil 3D and exporting to GIS formats.", "fall": true, "units": " 1"}, {"summer": "True", "name": "Special Problems", "prerequisites": "Prerequisite: Senior standing or Graduate standing in Biological and Agricultural Engineering", "spring": "True", "number": "BAE  590", "descripton": "Selection of a subject by each student on which to do research and write a technical report on the results. The individual may choose a subject pertaining to his or her particular interest in any area of study in biological and agricultural engineering.", "fall": "True", "units": " 1-3"}, {"summer": false, "name": "Master's Research Methods I", "spring": false, "number": "BAE  591", "descripton": "This is the first in a series of research methods courses for MS students majoring in Biological and Agricultural Engineering.  Students will develop research questions to be answered by their thesis project and produce a literature review focusing on those questions.  Students will also observe formal seminar presentations, providing critiques and participating in discussions of proper seminar delivery.  This course is restricted to MS students majoring in BAE.", "fall": true, "units": " 1"}, {"summer": false, "name": "Master's Research Methods II", "prerequisites": "Prerequisite: BAE 591", "spring": true, "number": "BAE  592", "descripton": "This is the second in a series of research methods courses for MS students majoring in Biological and Agricultural Engineering.  Students will develop a research proposal for their thesis work and will present the proposal in both a practice and a final seminar.  This course is restricted to MS students majoring in BAE.", "fall": false, "units": " 1"}, {"summer": "True", "name": "Special Topics", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "BAE  610", "descripton": "A study of topics in the special fields of interest of graduate students under the direction of the graduate faculty.", "fall": "True", "units": " 1-4"}, {"summer": "True", "name": "Special Problems", "prerequisites": "Prerequisite: Senior standing or Graduate standing in Biological and Agricultural Engineering", "spring": "True", "number": "BAE  620", "descripton": "Selection of a subject by each student on which to do research and write a technical report on the results. The individual may choose a subject pertaining to his or her particular interest in any area of study in biological and agricultural engineering.", "fall": "True", "units": " 1-3"}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "BAE  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "BAE  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "BAE  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": true, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "BAE  690", "descripton": "For students in non-thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "BAE  693", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": false, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "BAE  695", "descripton": "Thesis research.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "BAE  696", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "BAE  699", "descripton": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Theory Of Drainage--Saturated Flow", "prerequisites": "Prerequisite: MA 301", "spring": false, "number": ")  771", "descripton": "Discussion of physical concepts and properties of fluids and porous media in relation to soil-water movement. Derivation and discussion of the fundamental laws and equations governing saturated flow in porous media. Analysis of mathematical solutions of steady-state and transient flow equations to determine their applicability to drainage problems. Consideration of analogs and models of particular drainage problems.", "fall": true, "units": " 3"}, {"summer": false, "name": "Food Rheology", "prerequisites": "Prerequisite: FS 231 or MAE 314", "spring": false, "number": ")  785", "descripton": "Principles and methods for measuring rheological properties. Theories of elastic, viscous, viscoelastic and viscoplastic behavior and relationships to food texture and commodity damage during harvest, handling and processing. Influence of time, composition and processing.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Special Topics", "spring": "True", "number": "BAE  790", "descripton": "Special topics in BAE.", "fall": "True", "units": " 1-3"}, {"summer": false, "name": "Doctoral Research Methods I", "spring": false, "number": "BAE  791", "descripton": "This is the first in a series of research methods courses for PhD students majoring in Biological and Agricultural Engineering.  Students will develop PhD level research questions to be answered in their dissertation project and will produce a PhD level literature review on those questions.  Students will also observe seminars, providing critiques and discussions of proper seminar delivery.  This course is restricted to PhD students majoring in BAE", "fall": true, "units": " 1"}, {"summer": false, "name": "Doctoral Research Methods II", "prerequisites": "Prerequisite: BAE 791", "spring": true, "number": "BAE  792", "descripton": "This is the second in a series of research methods for PhD students majoring in Biological and Agricultural Engineering.  Students will develop a research proposal appropriate for their dissertation project and will present the proposal in both a practice and final seminar.  The course is restricted to PhD students majoring in BAE.", "fall": false, "units": " 1"}, {"summer": false, "name": "Seminar", "prerequisites": "Prerequisite: Graduate standing in BAE", "spring": true, "number": "BAE  801", "descripton": "Elaboration of subject areas, techniques and methods peculiar to professional interest through presentations of personal and published works; opportunity for students to present and critically defend ideas, concepts and inferences.  Discussions to point up analytical solutions and analogies between problems in biological and agricultural engineering and other technologies, and to present relationship of biological and agricultural engineering to socio-economic enterprise.", "fall": true, "units": " 1"}, {"summer": "True", "name": "Special Topics", "spring": "True", "number": "BAE  810", "descripton": "A study of topics in the special fields of interest of graduate students under the direction of the graduate faculty.", "fall": "True", "units": " 1-4"}, {"summer": "True", "name": "Special Problems", "prerequisites": "Prerequisite: Senior standing or Graduate standing in Biological and Agricultural Engineering", "spring": "True", "number": "BAE  820", "descripton": "Selection of a subject by each student on which to do research and write a technical report on the results. The individual may choose a subject pertaining to his or her particular interest in any area of study in biological and agricultural engineering.", "fall": "True", "units": " 1-3"}, {"summer": true, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "BAE  885", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "BAE  890", "descripton": "For students who are preparing for and taking written and/or oral preliminary exams.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "BAE  893", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "BAE  895", "descripton": "Dissertation research", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "BAE  896", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "BAE  899", "descripton": "For students who have completed all credit hours, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertation.", "fall": true, "units": " 1-3"}]