[{"summer": false, "name": "Population Ecology", "prerequisites": "Co-requisite: ST 511", "spring": true, "number": ")  560", "descripton": "Dynamics of natural populations. Current work, theories and problems dealing with population growth, fluctuation, limitation and patterns of dispersion, species interactions, community structure and ecological genetics. One semester of calculus and a junior/senior level ecology course are required.", "fall": false, "units": " 3"}, {"summer": false, "name": "Modeling of Biological Systems", "prerequisites": "Prerequisite: MA 131", "spring": false, "number": "BMA  567", "descripton": "An introduction to quantitative modeling in biology. Use of Forrester diagrams, probabilistic and deterministic description of dynamic processes, development of model equations, simulation methods and criteria for model evaluation. Examination of current literature dealing with application of models and simulation in biology. Individual and class modeling projects.", "fall": false, "units": " 4"}, {"summer": false, "name": "Mathematical Modeling of Physical and Biological Processes I", "prerequisites": "Prerequisite: MA 341 and knowledge of high-level programming language.", "spring": false, "number": ")  573", "descripton": "Introduction to model development for physical and biological applications. Mathematical and statistical aspects of parameter estimation. Compartmental analysis and conservation laws, heat transfer, and population and disease models. Analytic and numerical solution techniques and experimental validation of models. Knowledge of high-level programming languages required.", "fall": true, "units": " 3"}, {"summer": false, "name": "Mathematical Modeling of Physical and Biological Processes II", "prerequisites": "Prerequisite: MA/BMA 573", "spring": true, "number": ")  574", "descripton": "Model development, using Newtonian and Hamiltonian principles, for acoustic and fluid applications, and structural systems including membranes, rods, beams, and shells. Fundamental aspects of electromagnetic theory. Analytic and numerical solution techniques and experimental validation of models.", "fall": false, "units": " 3"}, {"summer": true, "name": "Special Topics", "spring": true, "number": "BMA  590", "descripton": "Special topics in BMA.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Special Topics", "spring": true, "number": "BMA  591", "descripton": "Directed readings, problem sets, written and oral reports as dictated by need and interest of student, e.g., cellular, molecular and physiological modeling; new 500-level courses during the developmental phase.", "fall": true, "units": ""}, {"summer": true, "name": "Special Topics", "spring": true, "number": "BMA  610", "descripton": "Directed readings, problem sets, written and oral reports as dictated by need and interest of student, e.g., cellular, molecular and physiological modeling; new 500-level courses during the developmental phase.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "BMA  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "BMA  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "BMA  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": false, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "BMA  690", "descripton": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam.", "fall": true, "units": " 1-5"}, {"summer": false, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "BMA  693", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": false, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "BMA  695", "descripton": "Thesis research.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "BMA  696", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "BMA  699", "descripton": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their theses.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Biomathematics I", "prerequisites": "Prerequisite: Advanced calculus, reasonable background in biology", "spring": false, "number": ")  771", "descripton": "Role of theory construction and model building in development of experimental science. Historical development of mathematical theories and models for growth of one-species populations (logistic and off-shoots), including considerations of age distributions (matrix models, Leslie and Lopez; continuous theory, renewal equation). Some of the more elementary theories on the growth of organisms (von Bertalanffy and others; allometric theories; cultures grown in a chemostat). Mathematical theories oftwo and more species systems (predator-prey, competition, symbosis; leading up to present-day research) and discussion of some similar models for chemical kinetics. Much emphasis on scrutiny of biological concepts as well as of mathematical structureof models in order to uncover both weak and strong points of models discussed. Mathematical treatment of differential equations in models stressing qualitative and graphical aspects, as well as certain aspects of discretization. Difference equation models.", "fall": true, "units": " 3"}, {"summer": false, "name": "Biomathematics II", "prerequisites": "Prerequisite: BMA 771, elementary probability theory", "spring": true, "number": ")  772", "descripton": "Continuation of topics of BMA 771. Some more advanced mathematical techniques concerning nonlinear differential equations of types encountered in BMA 771: several concepts of stability, asymptotic directions, Liapunov functions; different time-scales. Comparison of deterministic and stochastic models for several biological problems including birth and death processes. Discussion of various other applications of mathematics to biology, some recent research.", "fall": false, "units": " 3"}, {"summer": false, "name": "Stochastic Modeling", "prerequisites": "Prerequisite: BMA 772 or ST (MA) 746", "spring": true, "number": ")  773", "descripton": "Survey of modeling approaches and analysis methods for data from continuous state random processes. Emphasis on differential and difference equations with noisy input. Doob-Meyer decomposition of process into its signal and noise components. Examples from biological and physical sciences, and engineering. Student project.", "fall": false, "units": " 3"}, {"summer": false, "name": "Partial Differential Equation Modeling in Biology", "prerequisites": "Prerequisite: BMA 771 or MA/OR 731; BMA 772 or MA 401 or MA 501", "spring": true, "number": ")  774", "descripton": "Modeling with and analysis of partial differential equations as applied to real problems in biology.  Review of diffusion and conservation laws.  Waves and pattern formation.  Chemotaxis and other forms of cell and organism movement.  Introduction to solid and fluid mechanics/dynamics.  Introductory numerical methods.  Scaling.  Perturbations, Asymptotics, Cartesian, polar and spherical geometries.  Case studies.", "fall": false, "units": " 3"}, {"number": "BMA  790", "name": "Special Topics"}, {"summer": false, "name": "Seminar", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "BMA  801", "descripton": "Graduate students in biomathematics are expected to attend through most of their residence period.", "fall": true, "units": " 1"}, {"summer": true, "name": "Advanced Special Topics", "spring": true, "number": "BMA  815", "descripton": "Directed readings, problem sets, written and oral reports as dictated by need and interest of student; new 600-level courses during the development phase (currently includes courses in stochastic modeling and biophysical theory).", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "BMA  885", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Doctoral Preliminary Exam", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "BMA  890", "descripton": "For students who are preparing for and taking written and/or oral preliminary exams.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "BMA  893", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "BMA  895", "descripton": "Dissertation research", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "BMA  896", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "BMA  899", "descripton": "For students who have completed all credit hours, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations.", "fall": true, "units": " 1-3"}]