[{"summer": false, "name": "Personal Finance", "spring": true, "number": "BUS  225", "descripton": "Economic and financial strategies used to accumulate, manage and protect personal assets.  Emphasizing income generation, expense reduction, investment selection, and wealth creation to meet future needs and goals.  Topics include investing (mutual funds, stocks, etc.), annuities, deferred savings, insurance, retirement planning, estate planning, and real estate finance.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Special Topics in Business Management", "spring": "True", "number": "BUS  295", "descripton": "Experimental course development. Special topics in Business Management at the introductory level.", "fall": "True", "units": " 1-6"}, {"summer": false, "name": "Legal and Regulatory Environment", "prerequisites": "Prerequisite: Successful completion of the Software Skills Test", "spring": true, "number": "BUS  305", "descripton": "Introduction to contract, tort, and agency law, the judicial system, common law, statutory law, and constitutional law.  Review and discussion of the major legal and regulatory issues affecting business including ethics, fiduciary duty, white collar crime, dispute resolution, intellectual property, international, and product safety laws.", "fall": true, "units": " 3"}, {"summer": false, "name": "Financial Management", "prerequisites": "Prerequisite: ACC 210 and EC 201 or ARE 201 or EC 205; and Successful Completion of the Software Skills Test", "spring": true, "number": "BUS  320", "descripton": "Financial decision making by businesses, including capital structure and dividend decisions, capital budgeting and working capital management. Basic financial concepts are covered such as  risk and return measurement, portfolio theory and the time value of money.", "fall": true, "units": " 3"}, {"summer": false, "name": "Information Systems Management", "prerequisites": "Prerequisite: Successful completion of the Software Skills Test", "spring": true, "number": ")  340", "descripton": "Fundamentals of information systems development and use in organizational setting.  Information systems (IS), concepts, hardware, software, telecommunications, database management.  IS development, applications  and management in telecommunications,database management, various business processes, global issues, security and ethical challenges.", "fall": true, "units": " 3"}, {"summer": true, "name": "Economics and Business Statistics", "prerequisites": "Prerequisite: MA 114 and Successful completion of the Software Skills Test", "spring": true, "number": ")  350", "descripton": "Introduction to statistics applied to management, accounting, and economic problems.  Emphasis on statistical estimation, inference, simple and multiple regression, and analysis of variance.  Use of computers to apply statistical methods to problems encountered in management and economics.", "fall": true, "units": " 3"}, {"summer": false, "name": "Marketing Methods", "prerequisites": "Prerequisite: MIE 201, Sophomore standing, College of Management Majors must have passed Software Applications Proficiency Requirement", "spring": true, "number": "BUS  360", "descripton": "Examination of decisions affecting marketing of goods and services in consumer, industrial and international markets. Emphasis on the role of marketing in a managerial context. Areas studied include: the activities of marketing research, identification of marketing opportunities, and the development of marketing mix strategies including the decisions concerning pricing, distribution, promotion and product design.", "fall": true, "units": " 3"}, {"summer": false, "name": "Operations Management", "spring": true, "number": "BUS  370", "descripton": "Concepts in planning, controlling, and managing the operations function of manufacturing and service firms.  Topics include operations strategy, process choice decisions, forecasting, production planning and control, and trends in operations management.  Common tools for informed decision-making in these areas.", "fall": true, "units": " 3"}, {"summer": false, "name": "Sports Law", "prerequisites": "Prerequisite: Junior standing.", "spring": false, "number": ")  406", "descripton": "Fundamental principles of law, especially tort and contract law, applied to sports situations. Analysis of liability of sports personnel in various roles including participant, coach, promoter, trainer and official.  Analysis of common law court decisions in sports contexts well as key state and federal statutory legislation such as civil rights and antitrust.", "fall": true, "units": " 3"}, {"summer": false, "name": "Financial Management of Corporations", "prerequisites": "Prerequisite: BUS 320 and (BUS/ST 350, or ST 302, or ST 361, or ST 370, or ST 372)", "spring": true, "number": "BUS  420", "descripton": "Advanced  theory and practice of corporate financial management. Techniques for evaluating alternative investment, financing, capital structure, and dividend policy decisions. International  aspects of corporate financial management. Use of personalcomputers in applying financial management theory to common financial problems.", "fall": true, "units": " 3"}, {"summer": false, "name": "Investments and Portfolio Management", "prerequisites": "Prerequisite: BUS 320 and (BUS/ST 350, or ST 302, or ST 311, or ST 361, or ST 370, or ST 372)", "spring": true, "number": "BUS  422", "descripton": "Analysis of the investment process, dichotomized into security analysis and portfolio management. Background information on financial assets, securities markets, and risk-return concepts. Analysis of valuation theory and techniques, modern portfoliotheory and portfolio performance.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Personal Financial Management", "prerequisites": "Prerequisite: BUS 320", "spring": true, "number": "BUS  425", "descripton": "Detailed economic, financial and legal analysis of risk management, retirement planning, nontraditional investments, estate planning.  Strong emphasis on professional financial planning for those interested in personal finance as a career. Directly applicable for needs of small business.", "fall": true, "units": " 3"}, {"summer": false, "name": "International Financial Management", "prerequisites": "Prerequisite: BUS 320 and (BUS/ST 350, or ST 302, or ST 361, or ST 370, or ST 372)", "spring": true, "number": "BUS  426", "descripton": "Foreign exchange markets and their implications for direct and portfolio investment abroad.  International capital markets.  Multinational company exchange rate exposure measurement and management.  Techniques and instruments of financing international trade and investment.  Multinational capital budgeting and capital cost measurement.  Techniques of international cash management. Credit for both BUS 426 and EC 449 not allowed.", "fall": false, "units": " 3"}, {"summer": false, "name": "Leadership and Management", "prerequisites": "Prerequisite: MIE 330", "spring": true, "number": ")  435", "descripton": "Development of leadership and management skills for organizational settings.  Self-awareness: interpersonal needs, attitudes toward change; cognitive styles, ethics and values; listening; communicating; interviewing; time and stress management; creativity and managing creativity.  Team building and group dynamics.  Leadership and followership: theory and case studies (Churchill, Antigone; Henry V; Machiavelli); the use of power and authority; women and leadership the use of language in leadership embodiment of leadership traits; effective traits and characteristics of great leaders.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Database Management", "prerequisites": "Prerequisite: ACC 340 or BUS 340", "spring": "True", "number": "BUS  440", "descripton": "The fundamentals of database management within business applications.  Data structures, user requirements, structured query language, query by example, application development, user interface design.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Business Data Communications and Networking", "prerequisites": "Prerequisite: ACC 340 or BUS 340", "spring": true, "number": "BUS  441", "descripton": "The fundamentals of computer networking and the use of computer networks in business applications.  Client-server networks, architecture, network hardware and software, key issues in network management, network security, and the fundamentals of datacommunications.", "fall": true, "units": " 3"}, {"summer": false, "name": "Information Systems Development", "prerequisites": "Corequisite: BUS 440", "spring": true, "number": "BUS  442", "descripton": "Concepts and skills necessary for developing information systems to aid in managerial decisions.  Hands-on experience with development theory and concepts; objected-oriented design concepts, graphical user interface design concepts, algorithm designconcepts, and data structures.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Decision Support Systems", "prerequisites": "Prerequisite: ACC 340 or BUS 340", "spring": "True", "number": "BUS  443", "descripton": "This is an introductory course in designing and building Decision Support Systmes (DSS) for business applications.  The course is directed to business school students seeking a career with a company that is a user of technology or is a member of a technology driven industry.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Systems Analysis and Design", "prerequisites": "Prerequisite: ACC 340 or BUS 340", "spring": "True", "number": "BUS  444", "descripton": "Overview of methodical approaches to developing information systems throughout the systems analysis, design and implementation processes.  Topics include SDLC, project management, feasibility studies, requirements analysis, etc.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Information Technology Capstone", "prerequisites": "Corequisite: BUS 440", "spring": true, "number": "BUS  449", "descripton": "This is a completely project-oriented course. Students will work on real applications for national or local firm(s) to solve \"live\" IT problems. Students will work in teams to develop client deliverables and present their final work to an appropriate industry-based management team. Field trips and/or outside class activities (including client/consultant work) are a major part of this course. Students who are unable to participate in these types of events should not enroll in this course.", "fall": false, "units": " 3"}, {"summer": false, "name": "Consumer Behavior", "prerequisites": "Prerequisite: BUS 360", "spring": true, "number": "BUS  460", "descripton": "The consumer decision process, with emphasis on consumer decision making, satisfaction/dissatisfaction factors, perception, learning, group influences, and marketing strategy implications. Restricted to majors within the College of Management.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Services Marketing", "prerequisites": "Prerequisite: BUS 360", "spring": "True", "number": "BUS  461", "descripton": "This course focuses on the unique challenges of managing services and delivering quality service to customers.  The attraction, retention, and building of strong customer relationships through service quality and customer satisfaction is at the heart of the course content.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Marketing Research", "prerequisites": "Prerequisite: BUS 360 and (BUS/ST 350, or ST 302, or ST 361, or ST 370, or ST 372)", "spring": true, "number": "BUS  462", "descripton": "The use, collection, organization and analysis of information pertinent to marketing decisions.  Use of qualitative and quantitative data in the solution of specific marketing problems.", "fall": true, "units": " 3"}, {"summer": false, "name": "International Marketing", "prerequisites": "Prerequisite: BUS 360", "spring": true, "number": "BUS  464", "descripton": "Explores moving from a national marketing approach to a global marketing strategy, and discusses competitive advantages and challenges in making the transition. Both traditional countries of Western Europe and emerging markets will be examined. Students will analyze culture considerations when evaluating the impact on local business strategies. In addition to learning the impact on the world's economy through globalization, emphasis will also be placed on developing necessary professional skills.", "fall": false, "units": " 3"}, {"summer": false, "name": "Integrated Marketing Communications Management", "prerequisites": "Prerequisite: BUS 360", "spring": true, "number": "BUS  465", "descripton": "Development of marketing communication theory and exploration of integrated marketing communication (IMC) practice.  Topics include: IMC planning, management and budgeting; IMC strategy development and execution; media strategy and research; advertising research; ethical and legal issues; creativity; IMC ideation, campaign development; and campaign presentation.  This is partially web-based course.", "fall": true, "units": " 3"}, {"summer": false, "name": "Personal Selling", "prerequisites": "Prerequisite: BUS 360", "spring": true, "number": "BUS  466", "descripton": "Revolves around the art of people-to-people interaction, which applies not only to the business-to-business sales environment but is also applicable to other professions. The selling process will be examined along with activities necessary to be successful in sales. With a common thread of developing and nurturing relationships, students will examine building partnerships, implications of ethical and legal issues, adapting the approach to the situation and identifying social styles with associated behaviors. Attention will also be focused on the steps involved in the sales cycle and how to be successful in their execution.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Product and Brand Management", "prerequisites": "Prerequisite: BUS 360", "spring": "True", "number": "BUS  467", "descripton": "Provides an in-depth understanding of marketing planning and implementation involved in product and brand management.  The course places emphasis on developing specific marketing strategies to support the creation and launch of new products and to successfully manage existing products and brands.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Marketing Strategy", "prerequisites": "Prerequisite: BUS 360", "spring": "True", "number": "BUS  468", "descripton": "This course is designed to build on the core marketing principles you learned in your introductory marketing course and to enhance your understanding of their strategic implications.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Operations Planning and Control Systems", "prerequisites": "Prerequisite: BUS 370", "spring": false, "number": "BUS  472", "descripton": "Design and management of operations planning and control systems for manufacturing and service firms.  Forecasting, capacity management, production and work force scheduling, project management, just-in-time and time-based competition, the impact ofinformation technologies on planning and control systems.", "fall": true, "units": " 3"}, {"summer": false, "name": "Supply Chain Management", "prerequisites": "Prerequisite: BUS 370", "spring": true, "number": "BUS  473", "descripton": "Purchasing, materials management, and logistics.  Purchasing systems, supplier-based strategies, price-cost management, value analysis.  Inventory strategies, quantity and quality decisions, materials planning. Logistics strategies for services and manufacturing.", "fall": false, "units": " 3"}, {"summer": false, "name": "Logistics Management", "prerequisites": "Prerequisite: BUS 370", "spring": true, "number": "BUS  474", "descripton": "Management of physical flows of goods between firms, management of inventories that support those flows, and assessment of the effects of freight transportation choices on these management activities. A variety of conceptual frameworks and quantitative tools are used to formulate the basis for effective logistics decision making and relate those decisions to broader issues in managing the entire supply chain and fulfilling the strategic objectives of a firm.  A nominal fee for simulation software may be required.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Purchasing and Supply Management", "prerequisites": "Prerequisite: BUS 370", "spring": "True", "number": "BUS  475", "descripton": "This course is designed to help students develop knowledge of basic principles in purchasing and supply management.  Students will be able to explain the potential contributions of these efforts of the competitiveness of the firm.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Business Process Management", "prerequisites": "Prerequisite: BUS 370 and (BUS/ST350 or ST 302 or ST 361 or ST 370 or ST 372)", "spring": false, "number": "BUS  478", "descripton": "Major tools, techniques, and strategies used for designing and improving business processes, including process mapping, process analysis, continuous process improvement tools and techniques, strategies for process design, and process reengineering.Major group project in process analysis and improvement.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Supply Chain Management Undergraduate Practicum", "prerequisites": "Prerequisite: BUS 370 and one 400-level Operations/Supply Chain Management course", "spring": "True", "number": "BUS  479", "descripton": "This course is comprised of a team-based project working on a Supply Chain Resource Consortium (SCRC) partner company's supply  chain management issues.  These projects vary in scope as are company's supply chain issues and improvement initiatives.Student groups need to provide their own transportation to off-campus sites.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Special Topics in Business Management", "spring": "True", "number": "BUS  495", "descripton": "Presentation of material not normally available in regular course offerings, or offering of new courses on a trial basis.", "fall": "True", "units": " 1-6"}, {"summer": true, "name": "Independent Study in Business Management", "spring": true, "number": "BUS  498", "descripton": "Detailed investigation of topics of particular interest to advanced undergraduates under faculty direction on a tutorial basis.  Credits and content determined by faculty member in consultation with Department Head.", "fall": true, "units": " 1-6"}, {"summer": "True", "name": "Market Research In Textiles", "prerequisites": "Prerequisite: TAM (EC) 482", "spring": "True", "number": ")  585", "descripton": "A study and analysis of quantitative methods employed in market research in the textile industry. Function of market research and its proper orientation to management and decision making.", "fall": "True", "units": " 3"}, {"summer": true, "name": "Special Topics In Business Management", "spring": true, "number": "BUS  590", "descripton": "Presentation of material not normally available in regular courses offerings or offering of new courses on a trial basis.", "fall": true, "units": " 1-6"}, {"number": "BUS  610", "name": "SP Topics Bus Mgmt"}, {"summer": true, "name": "Independent Study In Business Management", "spring": true, "number": "BUS  630", "descripton": "Detailed investigation of topics of particular interest to graduate students under faculty direction on a tutorial basis.  Determination of credits and content by faculty member in consultation with department head.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "BUS  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "BUS  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}]