[{"summer": true, "name": "Engineering Mechanics-Statics", "prerequisites": "Prerequisite: Minimum GPA =/> 2.5, C- or better in PY 205, Corequisite: MA 242", "spring": true, "number": "CE  214", "descripton": "Basic force concepts and equilibrium analysis; distributed forces; centroids; moments of inertia; application to structural elements. Credit will not be given for both CE 214 and MAE 206.", "fall": true, "units": " 3"}, {"summer": true, "name": "Engineering Mechanics-Dynamics", "prerequisites": "Prerequisite: Minimum GPA =/> 2.5,Grade of C- or better in CE 214, and MA 242", "spring": true, "number": "CE  215", "descripton": "Kinematics and kinetics of particles; mass flow; vibrations; plane kinematics and kinetics of rigid bodies; selected topics from three-dimensional rigid body dynamics, and orbital motion.", "fall": true, "units": " 3"}, {"summer": false, "name": "Construction Engineering Systems", "prerequisites": "Prerequisite: CEM Majors; Corequisite: ST 370", "spring": true, "number": "CE  261", "descripton": "Introduction to engineering economy, and principles and techniques of optimization for Construction Engineering and Management, including risk assessment. Credit may not be received for both CE 261 and CE 375.", "fall": false, "units": " 3"}, {"summer": true, "name": "Current Topics in Civil Engineering", "spring": true, "number": "CE  297", "descripton": "Presentation of material not normally available in regular course offerings, or offering of new courses on a trial basis. Credits and content determined by faculty member in consultation with Department Head.", "fall": true, "units": " 1-4"}, {"summer": false, "name": "Civil Engineering Surveying and Geomatics", "prerequisites": "Prerequisite: CEM, CE, or ENE Majors only", "spring": true, "number": "CE  301", "descripton": "Plane surveying, topographical surveying, horizontal and vertical curves, topographic surveys, construction surveys, earthwork, route surveying.  Data collection using sight-based, laser-based, and global positioning system equipment.  Methods for analysis and presentation of surveying and positioning data, including dealing with errors.  Use and applications of GPS information.  Limited to CEM, CE, ENE majors.  Credit will not be given for both BAE 325 and CE 301.", "fall": true, "units": " 3"}, {"summer": false, "name": "Traffic Engineering", "prerequisites": "Prerequisite: CE or CEM Majors and Corequisite: ST 370", "spring": true, "number": "CE  305", "descripton": "Integrated approach to planning, design, and operation of transportation systems with an emphasis on highway and  street systems. Roadway design, traffic operations and performance, and control systems.", "fall": true, "units": " 3"}, {"summer": true, "name": "Mechanics of Solids", "prerequisites": "Prerequisite: Minimum GPA =/> 2.5,Grade of C- or better in CE 214, and MA 242", "spring": true, "number": "CE  313", "descripton": "Elementary analysis of deformable solids subjected to force systems. Concepts of  stress and strain; one, two and three-dimensional stress-strain relationships for the linear elastic solid. Statically determinate and indeterminate axial force, torsion and bending members. Stress transformations, pressure vessels, combined loadings. Introduction to column buckling.", "fall": true, "units": " 3"}, {"summer": false, "name": "Structural Behavior Measurement", "prerequisites": "Prerequisite:  Grade of C- or better in CE 313", "spring": true, "number": "CE  324", "descripton": "Theory and application of strain, displacement, and acceleration measurements.  Verification of structural theories.  Error Analysis.  Bending of determinant and indeterminate beams, twisting of circular tubes, buckling of columns, and vibration of shear buildings.", "fall": true, "units": " 1"}, {"summer": false, "name": "Structural Analysis I", "prerequisites": "Prerequisite: CSC 112; Grade of C- or better in CE 313", "spring": true, "number": "CE  325", "descripton": "Analysis of determinate and indeterminate bars, trusses, beams and frames using the matrix displacement method. Qualitative deflected shapes and shear and bending moment diagrams. Computer implementation of analysis procedures using MATLAB and commercial structural analysis software.", "fall": true, "units": " 3"}, {"summer": false, "name": "Reinforced Concrete Design", "prerequisites": "Prerequisite: Grade of C- or better in CE 313; CE 332", "spring": true, "number": "CE  327", "descripton": "Behavior, strength, and design of reinforced concrete members subjected to moment, shear, and axial  forces. Introduction to the design of reinforced concrete structures.", "fall": true, "units": " 3"}, {"summer": false, "name": "Materials of Construction", "prerequisites": "Prerequisite: MSE 200 and Junior standing in CE or CEM", "spring": true, "number": "CE  332", "descripton": "Manufacture and properties of mineral and bituminous cements and mineral  aggregates. Mechanical properties and durability of portland cement concrete, bituminous  mixtures, masonry units, timber products, and miscellaneous construction materials.  Materials testing.", "fall": true, "units": " 3"}, {"summer": false, "name": "Civil Engineering Systems", "prerequisites": "Prerequisite: CSC 112 and Corequisite: MA 341 or MA 305", "spring": false, "number": "CE  339", "descripton": "A broad perspective, systematic approach to civil planning, analysis, evaluation and design for large scale projects in construction, structures, transportation, water resources and other civil engineering ares.", "fall": true, "units": " 3"}, {"summer": false, "name": "Engineering Behavior of Soils and Foundations", "prerequisites": "Prerequisite: C- or better in CE 313, Corequisite: CE 382", "spring": true, "number": "CE  342", "descripton": "Description, identification, and engineering classification of soils.  The basic principles and mechanics of flow of water through soils, deformation and strength of soils, and the processes of consolidation and compaction.  Effective stress concepts, stress and settlement analyses, and evaluation of shear strength.  Methods of analysis and geotechnical engineering design concepts.", "fall": true, "units": " 4"}, {"summer": false, "name": "Mechanical and Electrical Systems in Buildings", "prerequisites": "Prerequisite: CE 382", "spring": true, "number": "CE  367", "descripton": "Introduction to mechanical and electrical systems in building construction. Includes HVAC, lighting and electrical systems, focusing on design concepts, equipment application and design of the construction process for modern  building systems.", "fall": false, "units": " 3"}, {"summer": false, "name": "Fundamentals of Environmental Engineering", "prerequisites": "Corequisite: CHE 205 or CE 382", "spring": true, "number": "CE  373", "descripton": "Concepts of sustainability and green engineering; energy and climate; overview of contaminants in water, air and terrestrial environments; introduction to water and wastewater treatment, air pollution control, and solid waste management.", "fall": true, "units": " 3"}, {"summer": false, "name": "Environmental Chemistry and Microbiology", "prerequisites": "Prerequisite: Junior standing in Environmental Engineering, MEA 323, and C- or better in CE 373 and Corequisite: ST 370", "spring": false, "number": "CE  378", "descripton": "Principles of Environmental Chemistry and Microbiology, experimental techniques for assessing water and air quality; sampling; statistical interpretation of data.", "fall": true, "units": " 4"}, {"summer": false, "name": "Hydraulics Systems Measurements Lab", "prerequisites": "Corequisite: CE 382", "spring": true, "number": "CE  381", "descripton": "Introduction to experimental techniques for the analysis of hydraulic systems; measurement of viscosity, fluid pressures, velocity distributions, flow rates; investigations into the  friction, momentum transfer, and turbulence on fluid flow.", "fall": true, "units": " 1"}, {"summer": false, "name": "Hydraulics", "prerequisites": "Prerequisite: CE 214, Junior standing in CE, CEM, ENE, BE, or BME, Corequisite: MA 341, MA 305, or ST 370", "spring": true, "number": "CE  382", "descripton": "Fluid properties; mass, energy and  momentum conservation laws; dimensional analysis and modeling; laminar and turbulent  flows; surface and form resistance; flow in pipes and open channels; elementary hydrodynamics; fluid measurements; characteristics of hydraulic machines. Credit will not be given for both CE 382 and MAE 308.", "fall": true, "units": " 3"}, {"summer": false, "name": "Hydrology and Urban Water Systems", "prerequisites": "Prerequisite: Grade of C- or better in CE 382 ; For CE, ENE, and CEM Majors", "spring": true, "number": "CE  383", "descripton": "Study of engineering hydrology and design of elements of urban stormwater systems. Commonly encountered applications in urban stormwater  management, flood control and groundwater engineering. Familiarization with effects of watershed development onquantity and quality of streamflow.", "fall": true, "units": " 3"}, {"summer": false, "name": "Engineering Economics", "prerequisites": "Prerequisite: CSC 112 and Corequisite: MA 341 or MA 305", "spring": true, "number": "CE  390", "descripton": "Fundamental principles of engineering economics and their application to civil engineering planning and evaluation.  Time value of money, interest and equivalence, and methods for assessing the feasibility and relative economic value of alternatives.", "fall": true, "units": " 1"}, {"summer": false, "name": "Transportation Engineering Project", "prerequisites": "Prerequisite:  CE 390, C- or better in CE 305, and one of the following courses: CE 401, 402, 403, or 413", "spring": true, "number": "CE  400", "descripton": "Integrated team approach to design of major transportation engineering projects. Professional topics in transportation engineering practice.", "fall": false, "units": " 3"}, {"summer": false, "name": "Transportation Systems Engineering", "prerequisites": "Prerequisite: C- or better in CE 305", "spring": false, "number": "CE  401", "descripton": "Multi-modal  transportation systems; railroads, airports, highways, and other modes. Planning, analysis,  and design. Fundamental concepts; supply, demand, flows, impacts, and network optimization.", "fall": true, "units": " 3"}, {"summer": false, "name": "Traffic Operations", "prerequisites": "Prerequisite: C- or better in CE 305", "spring": false, "number": "CE  402", "descripton": "Highway capacity; traffic control systems; intelligent vehicle/highway systems; and other advanced topics. Credit for both CE 402 and CE 502 is not allowed.", "fall": true, "units": " 3"}, {"summer": false, "name": "Highway Design", "prerequisites": "Prerequisite: C- or better in CE 305", "spring": true, "number": "CE  403", "descripton": "Corridor selection; highway alignment; design of roadsides, intersections, and interchanges. Completion of research paper for students taking course for graduate credit.  Credit will not be given for both CE 403 and CE 503.", "fall": false, "units": " 3"}, {"summer": false, "name": "Principles of Pavement Design", "prerequisites": "Prerequisite: CE 332, and Corequisite: CE 342", "spring": false, "number": "CE  413", "descripton": "Basic principles of analysis, design and performance of highway and airport pavements with critical evaluation of current design and maintenance strategies.", "fall": true, "units": " 3"}, {"summer": false, "name": "Structural Engineering Project", "prerequisites": "Prerequisite: CE 327, CE 390, and CE 426, Corequisite: CE 425", "spring": true, "number": "CE  420", "descripton": "Planning, analysis and design of complete structural systems composed of steel and reinforced concrete. Professional topics in structural engineering practice.", "fall": false, "units": " 3"}, {"summer": false, "name": "Structural Engineering Senior Project - Bridge Design", "prerequisites": "Prerequisite: CE 327, CE 390, and CE 426, Corequisite: CE 425", "spring": false, "number": "CE  421", "descripton": "This structural engineering senior project course covers the fundamentals of bridge analysis and design including conceptual design, superstructure analysis, AASHTO-LRFD bridge specifications, flat slab bridge design, pre-stressed concrete bridge design, strut and tie modeling, column design, and foundations. A series of three bridges will be designed including a cable stay or suspension pedestrian bridge, flat slab bridge, and girder bridge. At the conclusion of the course, students will be able to analyze and design simple, but complete concrete bridge structures.", "fall": true, "units": " 3"}, {"summer": false, "name": "Structural Analysis II", "prerequisites": "Prerequisite: C- or better in CE 325", "spring": false, "number": "CE  425", "descripton": "Analysis of beam, 2D and 3D truss, 2D and 3D frame and plane strain structures using the matrix displacement method. Introduction to the finite element method of analysis by deriving the element stiffness matrices using Virtual Work. Beam and frame elements include shearing deformation and geometric stiffness effects. Computer implementation of analysis procedures using MATLAB and commercial structural analysis software. Modeling issues including convergence, symmetry and antisymmetry. Introduction to structural dynamics. Credit not given for both CE 425 and CE 525.", "fall": true, "units": " 3"}, {"summer": false, "name": "Structural Steel Design", "prerequisites": "Prerequisite: C- or better in CE 313", "spring": true, "number": "CE  426", "descripton": "Design and behavior of  structural steel members and their connections subjected to moment, shear, and axial  forces. Introduction to the design of steel structures.", "fall": true, "units": " 3"}, {"summer": false, "name": "Engineering Geology", "prerequisites": "Prerequisite: MEA 101 and Junior standing in colleges of Agriculture and Life Sciences, Engineering, Natural Resources, Physical and Mathematical Sciences or Textiles", "spring": true, "number": ")  435", "descripton": "Application of both geology and geotechnical engineering to engineering projects.  Illustrations of relevant materials properties and techniques utilized in describing subsurface conditions.", "fall": false, "units": " 3"}, {"summer": false, "name": "Civil Engineering Computing", "prerequisites": "Prerequisite: CSC 112 and Corequisite: MA 341 or MA 305", "spring": false, "number": "CE  437", "descripton": "Computational approaches to modeling with applications in construction, structures, transportation, water resources and other civil engineering areas; matrix computations, digital terrain modeling, network applications and algorithms, heuristic optimization.", "fall": true, "units": " 3"}, {"summer": false, "name": "Geotechnical Engineering Project", "prerequisites": "Prerequisite: C- or better in CE 342, CE 390", "spring": false, "number": "CE  440", "descripton": "Integrated team approach to design of building foundations involving site selection, analysis and design of shallow and deep foundations, establishment of performance criteria, economic analysis, identification of potential construction problems andmatters regarding professional practice and ethics.", "fall": true, "units": " 3"}, {"summer": false, "name": "Seepage, Earth Embankments and Retaining Structures", "prerequisites": "Prerequisite: C- or better in CE 342, CE 390", "spring": true, "number": "CE  443", "descripton": "Review of shear strength concepts; ground water hydraulics; slope stability;  lateral earth pressure problems; placement of fills.", "fall": true, "units": " 3"}, {"summer": false, "name": "Construction Estimating, Planning, and Control", "prerequisites": "Prerequisite: CE 261", "spring": false, "number": "CE  463", "descripton": "Overview of the construction industry; life cycle of construction projects, work breakdown structure, activity cost and time estimation, computerized planning and scheduling methods, resource leveling, time-cost tradeoff; computerized cost estimating, bidding and negotiation strategies; and cost/schedule control systems.", "fall": true, "units": " 3"}, {"summer": false, "name": "Legal Aspects of Contracting", "prerequisites": "Prerequisite: Senior standing in CE or CEM", "spring": false, "number": "CE  464", "descripton": "Legal aspects of contract documents, drawings and specifications; owner-engineer-constructor relationships and responsibilities; bids and contract performance, Labor laws; governmental administrative and regulatory agencies; torts; business organizations; ethics and professionalism.", "fall": true, "units": " 3"}, {"summer": false, "name": "Construction Equipment and Methods", "prerequisites": "Corequisite: CE 261 or equivalent and ST 370", "spring": true, "number": "CE  465", "descripton": "Study of construction operations as dynamic production processes.  Utilization of equipment and other resources to achieve highest levels of productivity, safety, and quality.  Covers a wide range of traditional and state-of-the-art construction methods.", "fall": false, "units": " 3"}, {"summer": false, "name": "Building Construction Engineering", "prerequisites": "Corequisite: CE 327", "spring": false, "number": "CE  466", "descripton": "Construction processes for buildings and other structures including codes and standards, structural and architectural components and systems, form work and bracing design, erection and assembly methods.", "fall": true, "units": " 3"}, {"summer": false, "name": "Construction Engineering Laboratory", "prerequisites": "Prerequisite: CE 332, Corequisite: CE 327 or CE 426", "spring": true, "number": "CE  468", "descripton": "Measurements with and calibration of measurement instruments used in construction engineering field tests for quality and safety of the construction process.  Interpretation of ANSI, ASTM, ACI and AISC specifications and standards.  Credit for both CE 468 and CE 568 is not allowed.", "fall": true, "units": " 1"}, {"summer": false, "name": "Construction Engineering Project", "prerequisites": "Prerequisite: CE 463, Last semester in CEM, Corequisite: CE 464", "spring": true, "number": "CE  469", "descripton": "Capstone course involving integrated team approach in the design of the construction process, utilizing computerized tools for cost estimation, planning, scheduling, process design, and management of two construction projects.  Each student also selects an individual project.  Lecture topics include: ethics, professionalism, marketing, bid presentations, business planning, finance, and other appropriate topics by guest speakers from industry.", "fall": true, "units": " 3"}, {"summer": false, "name": "Air Pollution Control", "prerequisites": "Prerequisite: CE 373, CE 390, MAE 301 and Corequisite: ST 370 or CHE 450 (CHE majors)", "spring": false, "number": "CE  476", "descripton": "Introduction to air pollution control fundamentals and design. Fundamentals include the physics, chemistry and thermodynamics of pollutant formation, prevention and control.  Design will include gas treatment, process modification, and feedstock modification.  Pollutants to be addressed include sulfur dioxide, nitrogen oxides, particulate matter, volatile organic compounds, hydrocarbons, and air toxics. Credit for both CE 476 and CE 576 will not be given.", "fall": true, "units": " 3"}, {"summer": false, "name": "Principles of Solid Waste Engineering", "prerequisites": "Prerequisite: CE 373, CE 390, CE 382, Corequisite: CE 342", "spring": true, "number": "CE  477", "descripton": "Solid waste management including generation, storage, transportation, processing, land disposal and regulation.  Processing alternatives including incineration and composting. Integration of policy alternatives with evaluation of engineering decisions.", "fall": false, "units": " 3"}, {"summer": false, "name": "Energy and Climate", "prerequisites": "Prerequisite: CE 390", "spring": false, "number": "CE  478", "descripton": "Interdisciplinary analysis of energy technology, natural resources, and the impact on anthropogenic climate change.  Topics include basic climate science, energetics of natural and human systems, energy in fossil-fueled civilization, the impact of greenhouse gas emissions on climate, and technology and public policy options for addressing the climate challenge.  The course is quantitative with a strong emphasis on engineering and science.", "fall": true, "units": " 3"}, {"summer": false, "name": "Air Quality", "prerequisites": "Prerequisite: CE 373,CE 382; or CHE 311(CHE Majors); or MEA 421 (MEA Majors), Corequisite: ST 370; ST 380 (MEA Majors)", "spring": true, "number": ")  479", "descripton": "Introduction to: risk assessment, health effects, and regulation of air pollutants; air pollution statistics; estimation of emissions; air quality meteorology; dispersion modeling for non-reactive pollutants; chemistry and models for tropospheric ozone formation; aqueous-phase chemistry, including the \"acid rain: problem; integrated assessment of air quality problems; and the fundamentals and practical aspects of commonly used air quality models. Credit is allowed only for one of CE/MEA 479 or CE/MEA 579", "fall": false, "units": " 3"}, {"summer": false, "name": "Water Resources Engineering Project", "prerequisites": "Prerequisite: CE 390 and Grade of C- or better in CE 382 and CE 383", "spring": true, "number": "CE  480", "descripton": "Engineering design of selected projects in water resources engineering involving interactions with other scientific and engineering disciplines.  Discussion of ethical conduct and professional engineering practice.  Projects will include site work, storm drainage, water supply, water transmission and water-quality issues.", "fall": false, "units": " 3"}, {"summer": false, "name": "Environmental Engineering Project", "prerequisites": "Prerequisite: CE 374, 390, 383, 484, Corequisite: Two of: CE 476, 477, 479, 488", "spring": true, "number": "CE  481", "descripton": "Engineering design of selected projects in environmental engineering involving interactions with other scientific and engineering disciplines.  Discussion of ethical conduct and professional engineering practice.", "fall": false, "units": " 3"}, {"summer": false, "name": "Water Supply and Waste Water Systems", "prerequisites": "Prerequisite: CE 373, CE 382", "spring": false, "number": "CE  484", "descripton": "Elements of  the design of water supply and wastewater disposal systems.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Coastal and Ocean Engineering", "prerequisites": "Prerequisite: Senior standing and CE 382", "spring": true, "number": "CE  487", "descripton": "Introduction to the analysis of civil engineering projects in the  ocean and along the coastline. Basic wave mechanics, tides, and ocean dynamics as applied  to the understanding of coastal erosion control and other marine problems. An optional two-day field trip to the North Carolina Outer Banks at a nominal student expense is a regular feature of the course.", "fall": false, "units": " 3"}, {"summer": false, "name": "Water Resources Engineering", "prerequisites": "Prerequisite: CE 339 or equivalent, Corequisite: CE 383", "spring": false, "number": "CE  488", "descripton": "Extension of the concepts of fluid mechanics and hydraulics to applications in water supply, water transmission, water distribution networks and open channels to include water-supply reservoirs, pump and pipe selection, determinate and indeterminatepipe networks, and analysis of open channels with appurtenances.", "fall": true, "units": " 3"}, {"summer": true, "name": "Current Topics in Civil Engineering", "spring": true, "number": "CE  497", "descripton": "Presentation of material not normally available in regular course offerings or offering of new courses on a trial basis. Credits and content determined by faculty member in consultation with the Department Head.", "fall": true, "units": " 1-4"}, {"summer": false, "name": "Special Problems in Civil Engineering", "prerequisites": "Prerequisite: Senior standing", "spring": true, "number": "CE  498", "descripton": "Directed reading in the literature of civil engineering, introduction to research methodology, seminar discussion dealing with special civil engineering topics of current interest.", "fall": true, "units": " 1-4"}, {"summer": false, "name": "Transportation Systems Engineering", "prerequisites": "Prerequisite: CE 305. Credit for both CE 401 and CE 501 is not allowed", "spring": false, "number": "CE  501", "descripton": "Planning and analysis of multi-modal transportation systems including railroads, airports, highways and other modes. Supply, demand, flows, impacts and network optimization. Completion of term papers and projects for students taking course for graduate credit.", "fall": true, "units": " 3"}, {"summer": false, "name": "Traffic Operations", "prerequisites": "Prerequisite: C- or better in CE 305", "spring": false, "number": "CE  502", "descripton": "Highway capacity; traffic control systems; intelligent vehicle/highway systems; and other advanced topics. Credit for both CE 402 and CE 5042 is not allowed.", "fall": true, "units": " 3"}, {"summer": false, "name": "Highway Design", "prerequisites": "Prerequisite: C- or better in CE 305", "spring": true, "number": "CE  503", "descripton": "Corridor selection; highway alignment; design of roadsides, intersections and interchanges. Completion of research paper for students taking course for graduate credit. Credit will not be given for both CE 403 and CE 503.", "fall": false, "units": " 3"}, {"summer": false, "name": "Airport Planning and Design", "prerequisites": "Prerequisite: C- or better in CE 305", "spring": false, "number": "CE  504", "descripton": "Analysis, planning and design of air transportation facilities.", "fall": true, "units": " 3"}, {"summer": false, "name": "Transportation Engineering Data Collection and Analysis", "prerequisites": "Prerequisite: CE 305, ST 370", "spring": false, "number": "CE  506", "descripton": "Broad range of transportation engineering data collection and analysis applications encompassing the modes of highway, transit and pedestrian travel and the contexts of system planning, design and operation. Proposal preparation with primary focus on methodology and work plan development for addressing important research and practice questions.", "fall": true, "units": " 3"}, {"summer": false, "name": "Highway Safety", "prerequisites": "Prerequisite: CE 305, Corequisite: ST 370 or equivalent", "spring": true, "number": "CE  509", "descripton": "Methods to reduce collisions and injuries on highways.  Identifying promising locations, choosing appropriate countermeasures, and evaluating past projects.  Understanding the institutional context and establishing appropriate highway design standards.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Strength of Materials", "prerequisites": "Prerequisite: CE 313 or MAE 314", "spring": false, "number": "CE  515", "descripton": "Stresses and strains at a point; rosette analysis; torsion and unsymmetrical bending of open and closed sections; nonlinear and curved beams; stress concentration; beams on elastic foundations; shear deformation of beams; classical plasticity; fracture mechanics.", "fall": true, "units": " 3"}, {"summer": false, "name": "Theory and Design Of Prestressed Concrete", "prerequisites": "Prerequisite: CE 327", "spring": false, "number": "CE  522", "descripton": "Principles and concepts of design in prestressed concrete including elastic and ultimate strength analyses for flexure, shear, torsion, bond and deflection. Principles of concordancy and linear transformation for indeterminate prestressed structures. Application of pre-stressing to tanks and shells.", "fall": true, "units": " 3"}, {"summer": false, "name": "Theory and Behavior Of Steel Structures", "prerequisites": "Prerequisite: CE 426", "spring": true, "number": "CE  523", "descripton": "Theory and behavior of steel structures leading to the development of design requirements contained in current specifications; flexural, torsional and flexural-torsional buckling of columns; plastic analysis of beams and frames; lateral-torsional buckling of beams; stability and strength of flat plates; beam-columns.", "fall": false, "units": " 3"}, {"summer": false, "name": "Analysis and Design Of Masonry Structures", "prerequisites": "Prerequisite: CE 327", "spring": true, "number": "CE  524", "descripton": "Theory and design of masonry arches, culverts, dams, foundations and masonry walls subjected to lateral loads.", "fall": false, "units": " 3"}, {"summer": false, "name": "Structural Analysis II", "prerequisites": "Prerequisite: C- or better in CE 325", "spring": false, "number": "CE  525", "descripton": "Analysis of beam, 2D and 3D truss, 2D and 3D frame and plane strain structures using matrix displacement methods. Introduction to the finite element method of analysis by deriving the element stiffness matrices using virtual work. Beam and frame elements with shearing deformation and geometric stiffness effects. Computer implementation of analysis procedures using MATLAB and commercial structural analysis software. Modeling issues including convergence, symmetry and antisymmetry. Introduction to structural dynamics. Advanced topics such as curved beam elements, contact elements and nonlinearities. Credit for both CE 425 and CE 525 is not allowed.", "fall": true, "units": " 3"}, {"summer": false, "name": "Finite Element Method in Structural Engineering", "prerequisites": "Prerequisite: CE 425 or CE 525", "spring": true, "number": "CE  526", "descripton": "Development of the finite element method with an emphasis on understanding the fundamental principles governing the analysis technique. Applications to two-dimensional solids with particular attention to applications in structural engineering. Typical modeling considerations are reviewed and applied to the analysis of a realistic structure.", "fall": false, "units": " 3"}, {"summer": false, "name": "Structural Dynamics", "prerequisites": "Prerequisite: CE 425 or CE 525", "spring": true, "number": "CE  527", "descripton": "Analysis of single and multi-degree-of-freedom structures subjected to various types of excitations and initial conditions. Computational aspects of dynamic analysis. Introduction to approximate methods of analysis.", "fall": false, "units": " 3"}, {"summer": false, "name": "Structural Design in Wood", "prerequisites": "Prerequisite: C- or better in CE 325", "spring": true, "number": ")  528", "descripton": "Behavior, strength and design of wood structural members subjected to moment, shear and axial forces.  Design of connections and introduction to design of wood structural systems.", "fall": false, "units": " 3"}, {"summer": false, "name": "FRP Strengthening and Repair of Concrete Structures", "prerequisites": "Prerequisite: CE 327 and CE 325", "spring": true, "number": "CE  529", "descripton": "Fundamental behavior of Fiber-Reinforced Polymer (FRP) strengthened/repaired reinforced concrete structures. Creation of sustainable and resilient civil infrastructure by extending the useful life of existing structures using advances materials. Applications to practical strengthening design of realistic reinforced concrete structures.", "fall": false, "units": " 3"}, {"summer": false, "name": "Introduction to Numerical Methods for Civil Engineers", "prerequisites": "Prerequisite: MA 302, MA 341, or MA 401", "spring": true, "number": "CE  536", "descripton": "Introduction to widely-used numerical methods through application to civil and environmental engineering problems. Emphasis will be on implementation and application rather than the mathematical theory behind the numerical methods.", "fall": false, "units": " 3"}, {"summer": false, "name": "Computer Methods and Applications", "prerequisites": "Prerequisite: CSC 112 and (MA 341 or MA 305)", "spring": false, "number": "CE  537", "descripton": "Computational approaches to support civil planning, analysis, evaluation and design. Applications to various areas of civil engineering, including construction, structures, transportation and water resources.", "fall": true, "units": " 3"}, {"summer": false, "name": "Information Technology and Modeling", "prerequisites": "Prerequisite: CE 390", "spring": true, "number": "CE  538", "descripton": "Computing research and advanced technologies of interest to civil engineers. Issues in the design and development of engineering software systems and engineering modeling of structures, assemblies, processes and phenomena. Additional topics from the most predominant and recent developments and advances in civil engineering computing.", "fall": true, "units": " 3"}, {"summer": false, "name": "Engineering Properties Of Soils I", "prerequisites": "Prerequisite: CE 342", "spring": false, "number": "CE  548", "descripton": "Significant soil properties in earthwork engineering, including soil elasticity and soil mineralogy, hydraulic conductivity, stress-strain relations and shear strength, compressibility and compaction. Laboratory work including plasticity, triaxial compression, permeability, consolidation and compaction tests.", "fall": true, "units": " 3"}, {"summer": false, "name": "Soil and Site Improvement", "prerequisites": "Prerequisite: CE 342", "spring": true, "number": "CE  549", "descripton": "Principles and design methodologies for techniques related to densification, including dynamic compaction, vibro-compaction and compaction grouting; drainage, including wick drains, horizontal drains and dewatering; physical and chemical modification, including admixtures, chemical and cement grouting, soil mixing, jet grouting and soil freezing; and use of inclusions, including stone columns, soil nailing, and meta and geosynthetic reinforcement.", "fall": false, "units": " 3"}, {"summer": false, "name": "Construction Project Management", "prerequisites": "Prerequisite: CE 463", "spring": false, "number": "CE  561", "descripton": "Construction project management and control using network based tools, time-money analysis and other quantitative and qualitative techniques.  Planning and scheduling, critical path, lead-lag, resource allocation, uncertainty, cash flow and payment scheduling, change orders, project acceleration, coordination and communication, record keeping.  Emphasis on computer-based techniques.", "fall": false, "units": " 3"}, {"summer": false, "name": "Legal Aspects Of Contracting", "prerequisites": "Prerequisite: Graduate standing, Credit for both CE 464 and CE 564 is not allowed", "spring": false, "number": "CE  564", "descripton": "Legal aspects of contract documents, drawings and specifications; owner-engineer-constructor relationship and responsibilities; bids and contract performance; labor laws; governmental administrative and regulatory agencies; torts; business organizations; ethics and professionalism; analysis of current topics and issues. Investigation of recent statute and case implications.", "fall": true, "units": " 3"}, {"summer": false, "name": "Construction Safety Management", "prerequisites": "Prerequisite: CE 465 or CE 466", "spring": true, "number": "CE  565", "descripton": "Fundamentals of safety management principles. Detailed review of OSHA regulations and standards critical to construction engineers and managers who expect to design and administer safety related systems in a construction project. Analysis and design of example minimum safety requirements for application in construction field operations. Review of OSHA Standards for the Construction Industry, a review of selected sections of OSHA Standards for General Industry, a review of general principles of construction safety management.", "fall": false, "units": " 3"}, {"summer": false, "name": "Risk and Financial Management in Construction", "prerequisites": "Prerequisite: ACC 220, CE 463", "spring": true, "number": "CE  567", "descripton": "Fundamental concepts in financial and risk analysis in construction; accounting and financial metrics in construction; risk assessment and risk management in construction including the cost of risk, decision making strategies, the role of sureties, effects of risk in project delivery methods and contract types; risk effects in project financing including a review of financing sources, considerations for financing local and international projects; and the impact of financial and risk management in strategic planning in construction.", "fall": false, "units": " 3"}, {"summer": false, "name": "Construction Engineering Laboratory", "prerequisites": "Prerequisite: CE 332, Corequisite: CE 327 or CE 426", "spring": true, "number": "CE  568", "descripton": "Measurements with and calibration of measurement instruments used in construction engineering field tests for quality and safety of the construction process.  Interpretation of ANSI, ASTM, ACI and AISC specifications and standards.  Credit for both CE 468 and CE 568 is not allowed.", "fall": true, "units": " 1"}, {"summer": false, "name": "Physical Principles of Environmental Engineering", "prerequisites": "Prerequisite: CE 382, Graduate standing", "spring": true, "number": "CE  571", "descripton": "Mass balances, equation of motion for small particles, small particle interactions, particle collision/fast coagulation, partitioning, adsorption isotherms, fluid mechanics, diffusion, interphase mass transport and resistance models, elementary/non-elementary reactions, residence time distributions.", "fall": false, "units": " 3"}, {"summer": false, "name": "Biological Principles of Environmental Engineering", "prerequisites": "Prerequisite: Graduate standing in CE, BAE, CHE, or SSC", "spring": false, "number": "CE  573", "descripton": "Concepts in environmental microbiology including cell structure and function, phylogeny, survey of environmentally relevant microbial groups, metabolism under different redox conditions, catabolism of macromolecules, methods in microbial ecology.  Relationships to engineering processes and systems will be emphasized.", "fall": true, "units": " 3"}, {"summer": false, "name": "Chemical Principles of Environmental Engineering", "prerequisites": "Prerequisite: Graduate standing in CE, CHE, BAE, NE, MEA, SSC", "spring": false, "number": "CE  574", "descripton": "Inorganic and organic environmental chemistry including acid-base equilibria, precipitation, complexation, redox reactions, and natural organic matter.  The role of these factors in controlling the fate of contaminants in engineered treatment systems and natural environments.", "fall": true, "units": " 3"}, {"summer": false, "name": "Engineering Principles Of Air Pollution Control", "prerequisites": "Prerequisite: CE 375, CE 470, CHE 315 or MAE 301, Corequisite: ST 511 or 515", "spring": false, "number": "CE  576", "descripton": "Introduction to air pollution control fundamentals and design. Fundamentals including physics, chemistry and thermodynamics of pollutant formation, prevention and control. Design including gas treatment and process and feedstock modification. Addressed pollutants including sulfur dioxide, nitrogen oxides, particulate matter, volatile organic compounds, hydrocarbons and air toxins. Investigation of current research. Credit for both CE 476 and CE 576 is not allowed.", "fall": true, "units": " 3"}, {"summer": false, "name": "Engineering Principles Of Solid Waste Management", "prerequisites": "Prerequisite: CE 373", "spring": false, "number": "CE  577", "descripton": "Solid waste management including generation, storage, transportation, processing, land disposal and regulation.  Processing alternatives including incineration and composting. Integration of policy alternatives with evaluation of engineering decisions. Investigation of current research. Credit is only allowed for one of CE 477 and CE 577.", "fall": true, "units": " 3"}, {"summer": false, "name": "Energy and Climate", "prerequisites": "Prerequisite: CE 390 or permission of instructor", "spring": false, "number": "CE  578", "descripton": "Interdisciplinary analysis of energy technology, natural resources, and the impact on anthropogenic climate change.  Topics include basic climate science, energetics of natural and human systems, energy in fossil-fueled civilization, the impact of greenhouse gas emissions on climate, and technology and public policy options for addressing the climate challenge.  The course is quantitative with a strong emphasis on engineering and science. But is open to non-engineering students.", "fall": true, "units": " 3"}, {"summer": false, "name": "Principles of Air Quality Engineering", "prerequisites": "Prerequisite: CE 373, CE 382 or CHE 311(CHE Majors), or MEA 421(MEA Majors), Corequisite: ST 370, ST 380(MEA Majors)", "spring": true, "number": "CE  579", "descripton": "Introduction to: risk assessment, health effects, and regulation of air pollutants; air pollution statistics; estimation of emissions; air quality meteorology; dispersion modeling for non-reactive pollutants; chemistry and models for tropospheric ozone formation; aqueous-phase chemistry, including the \"acid rain\" problem; integrated assessment of air quality problems; and the fundamentals and practical aspects of commonly used air quality models. Credit is allowed only for one of CE/MEA 479 or CE/MEA 579.", "fall": false, "units": " 3"}, {"summer": false, "name": "Fluid Mechanics in Natural Environments", "prerequisites": "Prerequisite: CE 382 or MEA 463 or permission of instructor", "spring": false, "number": ")  581", "descripton": "Free surface flows of water and air occurring in natural fluid systems and influencing environmental transport and mixing. Review of fundamental principles of fluids, covering the scales relevant to both engineering and geo-physical applications. Topics and examples include waves, instability, stratification, turbulent boundary layers, jets and plumes, and open channel flows. Cannot receive credit for both CE 581 and MEA 581.", "fall": true, "units": " 3"}, {"summer": false, "name": "Engineering Aspects Of Coastal Processes", "prerequisites": "Prerequisite: CE 382", "spring": true, "number": "CE  583", "descripton": "Coastal environment, engineering aspects of mechanics of sediment movement, littoral drift, beach profiles, beach stability, meteorological effects, tidal inlets, inlet stability, shoaling, deltas, beach nourishment, mixing processes, pollution of coastal waters, interaction between shore processes and man-made structures, case studies.", "fall": false, "units": " 3"}, {"summer": false, "name": "Hydraulics Of Ground Water", "prerequisites": "Prerequisite: CE  382", "spring": false, "number": "CE  584", "descripton": "Introduction to ground water hydraulics and hydrology. Hydrologic cycle, basic ground water hydraulics, numerical solution of governing equations, ground water hydrology of North Carolina, well design and construction, flow net development, and ground water contamination sources.", "fall": true, "units": " 3"}, {"summer": false, "name": "Engineering Hydrology", "prerequisites": "Prerequisite: CE 383", "spring": true, "number": "CE  586", "descripton": "Hydrologic principles underlying procedures for surface water modeling; applications of common hydrologic models to actual watersheds.", "fall": false, "units": " 3"}, {"summer": false, "name": "Water Resources Engineering", "prerequisites": "Prerequisite: CE 382", "spring": false, "number": "CE  588", "descripton": "Extension of concepts of fluid mechanics and hydraulics to applications in water supply, water transmission, water distribution networks and open channels to include water-supply reservoirs, pump and pipe selection, determinate and indeterminate pipe networks, and analysis of open channels with appurtenances.", "fall": true, "units": " 3"}, {"summer": false, "name": "Special Topics In Civil Engineering", "spring": true, "number": "CE  590", "descripton": "New or special course on recent developments in some phase of civil engineering. Specific topics and prerequisites identified for each section and varied from term to term.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Special Topics in Civil Engineering Computing", "spring": true, "number": "CE  591", "descripton": "New or special course on recent developments in some phase of civil engineering. Specific topics and prerequisites identified for each section and varied from term to term.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Special Topics in Construction Engineering", "spring": true, "number": "CE  592", "descripton": "New or special course on recent developments in some phase of civil engineering. Specific topics and prerequisites identified for each section and varied from term to term.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Special Topics in Geotechnical Engineering", "spring": true, "number": "CE  593", "descripton": "New or special course on recent developments in some phase of civil engineering. Specific topics and prerequisites identified for each section and varied from term to term.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Special Topics in Structures and Mechanics", "spring": true, "number": "CE  594", "descripton": "New or special course on recent developments in some phase of civil engineering. Specific topics and prerequisites identified for each section and varied from term to term.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Special Topics in Transportation Engineering", "spring": true, "number": "CE  595", "descripton": "New or special course on recent developments in some phase of civil engineering. Specific topics and prerequisites identified for each section and varied from term to term.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Special Topics in Water Resource and Environmental Engineering", "spring": true, "number": "CE  596", "descripton": "New or special course on recent developments in some phase of civil engineering. Specific topics and prerequisites identified for each section and varied from term to term.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Construction Engineering Seminar", "spring": true, "number": "CE  603", "descripton": "Discussions and reports of subjects in civil engineering and allied fields.", "fall": true, "units": " 1"}, {"summer": false, "name": "Structures and Mechanics Seminar", "spring": true, "number": "CE  605", "descripton": "Discussions and reports of subjects in civil engineering and allied fields.", "fall": true, "units": " 1"}, {"summer": false, "name": "Water Resource and Environmental Engineering Seminar", "spring": true, "number": "CE  607", "descripton": "Discussions and reports of subjects in civil engineering and allied fields.", "fall": true, "units": " 1"}, {"summer": "True", "name": "Special Topics CE", "spring": "True", "number": "CE  610", "fall": "True", "units": " 1-3"}, {"summer": false, "name": "Advanced Reading In Civil Engineering", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "CE  635", "descripton": "Directed reading of advanced topics in some phase of civil engineering.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Civil Engineering Projects", "spring": true, "number": "CE  675", "descripton": "Research- or design-oriented independent study and investigation of a specific civil engineering topic, culminating in final written report.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "CE  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "CE  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "CE  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": true, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "CE  693", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "CE  695", "descripton": "Thesis research.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "CE  696", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "CE  699", "descripton": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Urban Transportation Planning", "prerequisites": "Prerequisite: CE 501", "spring": true, "number": "CE  701", "descripton": "Planning and design of urban transportation systems as related to comprehensive urban planning; principles of land use planning, urban thoroughfare planning and regional planning", "fall": false, "units": " 3"}, {"summer": false, "name": "Traffic Flow Theory", "prerequisites": "Prerequisite: CE 502, Corequisite: ST 370", "spring": false, "number": "CE  702", "descripton": "Stream flow, shock wave, queuing, and other macroscopic theories;car following, gap acceptance, and other microscopic theories; distributions of traffic stream parameters; building traffic simulation models.", "fall": true, "units": " 3"}, {"summer": false, "name": "Intelligent Transportation Systems", "prerequisites": "Prerequisite: CE 501 and CE 502", "spring": false, "number": "CE  705", "descripton": "Intelligent Transportation Systems (ITS) planning and human factor elements; application of monitoring, communications and information dissemination technologies to transportation systems; advanced traffic management for freeway and arterial systems; traveler information and public transportation systems; automated vehicle and highway systems.  ITS evaluation methods and models.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Traffic Control", "prerequisites": "Prerequisite: CE 502", "spring": true, "number": "CE  706", "descripton": "Advanced signalized traffic control methods at intersections, arterials and networks.  Applications of mathematical optimization techniques to signal timing and coordination.  Use of traffic simulation and optimization models for signal evaluation and design.  Roundabout analysis and design.", "fall": false, "units": " 3"}, {"summer": false, "name": "Transportation Policy and Funding", "prerequisites": "Prerequisite: CE 501 or graduating in Economics or Public Administration", "spring": true, "number": "CE  707", "descripton": "Understanding and debating important current transportation policy issues in the U.S.  Raising and allocating funds for building and maintaining the transportation system.  Highway, public transit, rail, air, and other modes.", "fall": false, "units": " 3"}, {"summer": false, "name": "Stress Waves", "prerequisites": "Prerequisite: MA 341; CE 313 or PY 411 or MA 401", "spring": false, "number": "CE  714", "descripton": "Theory of stress waves in solids. Origins and nature of longitudinal transverse and surface waves originating at an impact site or from other transient disturbances. Determination of stresses, particle velocities, wave velocities. Wave interaction with other waves and with boundaries and dissimilar materials. Modern instrumentation and seismic refraction exploration.", "fall": true, "units": " 3"}, {"summer": false, "name": "Constitutive Modeling of Engineering Materials", "prerequisites": "Prerequisite: CE 515 (old CE 715)", "spring": true, "number": "CE  718", "descripton": "Stresses and strains (vectors, tensors and indicial notations), general theorems for elastic-plastic solids, constitutive modeling of metals and concrete, numerical implementations of plasticity models.", "fall": false, "units": " 3"}, {"summer": false, "name": "Matrix and Finite Element Structural Analysis", "prerequisites": "Prerequisite: CE 526", "spring": true, "number": "CE  721", "descripton": "Advanced topics in matrix structural analysis and finite element method. Introductory review of the method, isoparametric quadrilateral element and three-dimensional elements. Energy methods and convergence criteria. Higher order elements. Isoparametric beam and plant elements, shear locking. Isoparametric curved beam and shell elements. Axisymmetric elements, Fourier series load and displacement representation. Analysis of systems with geometric and material nonlinearities.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Structural Dynamics", "prerequisites": "Prerequisite: CE 527", "spring": false, "number": "CE  723", "descripton": "Finite element formulation of equations of motion; advanced analysis techniques for discrete parameter systems; investigation of damping; analysis of continuous systems; applications to civil engineering structures.", "fall": true, "units": " 3"}, {"summer": false, "name": "Probabilistic Methods Of Structural Engineering", "prerequisites": "Prerequisite: MA 421", "spring": false, "number": "CE  724", "descripton": "Application of probability theory and stochastic processes to study safety of structures. Fundamentals of probability theory and stochastic processes; probabilistic modelings of structural loadings, material properties and risk. Reliability analysisof structures; reliability-based design criteria. Random vibration of simple structures; safety analysis of structures under dynamic loads.", "fall": true, "units": " 3"}, {"summer": false, "name": "Earthquake Structural Engineering", "prerequisites": "Prerequisite: CE 527", "spring": true, "number": "CE  725", "descripton": "Effects of earthquakes on structures and of design of structures to resist earthquake motions; earthquake mechanisms and ground motions; response of structures to earthquake motions; behavior of materials, structural elements and assemblages subjected to earthquakes; principles of earthquake-resistant design practice; soil-structure interaction; and special topics.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Theory Of Concrete Structures", "prerequisites": "Prerequisite: CE 522", "spring": true, "number": "CE  726", "descripton": "Inelastic theory of structural concrete members under flexure, axial load, combined flexure and axial compression, shear and torsion. Yield line theory of slabs. Limit analysis of beams and frames of reinforced and prestressed concrete.", "fall": false, "units": " 3"}, {"summer": false, "name": "Computer-Aided Engineering Systems", "prerequisites": "Prerequisite: CE 537 or 538", "spring": true, "number": "CE  737", "descripton": "Design and implementation issues for building real-world computer-aided engineering systems. Engineering data modeling; data definition, query and manipulation methodologies; application program interfaces; problem-oriented languages and software supervisors; and knowledge-based systems to support engineering design and decision making.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Geomechanics of Stress Deformation", "prerequisites": "Prerequisite: CE 440, or CE 443 or CE 548", "spring": "True", "number": "CE  741", "descripton": "Concepts of volume change and effective stress, stress-strain behavior of clays and sands, stress path and failure conidtions; mechanistic interaction between solids and water, problems in elasticity  and plasticity pertaining to stress distribution, elstic, consolidation and secondary settlements, and tolerance limits to deformation levels.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Deformation and Instability of Soils", "prerequisites": "Prerequisite: CE 440, or CE 443 or CE 548", "spring": "True", "number": "CE  742", "descripton": "Deformation and failure of soils.  Limit equilibrium analyses for: slope stability, lateral earth pressure, bearing capacity of shallow foundations.  Constitutive models for soils.  Linear elasticity and theory of plasticity.  Critical state model for soil behavior.  Limit analysis.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Foundation Engineering", "prerequisites": "Prerequisite: CE 342", "spring": true, "number": "CE  744", "descripton": "Subsoil investigations; excavations; design of sheeting and bracing systems; control of water; footing, grillage and pile foundations; caisson and cofferdam methods of construction.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Soil Dynamics and Earthquake Engineering", "prerequisites": "Prerequisite: CE 440, or CE 443 or CE 548", "spring": "True", "number": "CE  746", "descripton": "Dynamics of discrete and continuous systems with application to soil dynamics: dynamic soil properties, analysis of foundation vibration, construction-induced vibration, dynamic soil-structure interaction.  Geotechnical earthquake engineering: ground motion characteristics, dynamic response of soil sites, effect of local site conditions on design ground motion, liquefaction of soils.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Geosynthetics in Geotechnical Engineering", "prerequisites": "Prerequisite: CE 548", "spring": true, "number": "CE  747", "descripton": "Introduction to use, manufacturing techniques, design and construction of geosynthetics in geotechnical engineering applications; design and analysis of geotextiles, geonets, geogrids and geomembranes in pavements base and subbase reinforcement, reinforced walls, slopes, moisture barriers, dams and hazardous impoundment, landfill liners and covers.", "fall": false, "units": " 3"}, {"summer": false, "name": "Theory Of Concrete Mixtures", "prerequisites": "Prerequisite: CE 332", "spring": false, "number": "CE  751", "descripton": "In-depth study of theory of portland cement concrete mixtures including types and properties of portland special cements; chemical reactions; brief examination of history of mixture design; detailed study of current design methods; properties of fresh and hardened concretes; strength-age-curing relationships; durability; admixtures; special concretes; production and quality control.", "fall": true, "units": " 3"}, {"summer": false, "name": "Highway Pavement Design", "prerequisites": "Prerequisite: CE 342", "spring": false, "number": "CE  755", "descripton": "Theoretical analysis and design of highway pavements with critical evaluation of current design practices.  Pavement materials characterization; stresses and strains in pavements; traffic consideration; pavement performance models; and actual thickness design of pavements using different methodologies.", "fall": true, "units": " 3"}, {"summer": false, "name": "Pavement Management Systems", "prerequisites": "Prerequisite: CE 755", "spring": true, "number": "CE  757", "descripton": "Fundamental concepts in process of pavement management at both network level and project level. Distress identification and evaluation; concepts and methods for rehabilitation and maintenance techniques; nondestructive testing of pavements; performance prediction models; and principles of prioritization/optimization.", "fall": false, "units": " 3"}, {"summer": false, "name": "Inelastic Behavior Of Construction Materials", "prerequisites": "Prerequisite: CE 515", "spring": true, "number": "CE  759", "descripton": "Application of principles of linear and nonlinear viscoelasticity, fracture mechanics and damage mechanics to modeling inelastic behavior of construction materials. Mechanical analog of time-dependent response; linear and nonlinear elastic-viscoelastic correspondence principles; time-temperature superposition; stress intensity factor; energy release rate; J-integral; and continuum damage mechanics.", "fall": false, "units": " 3"}, {"summer": false, "name": "Design Of Temporary Structures in Construction", "prerequisites": "Prerequisite: CE 522 or CE 744 or CE 766", "spring": true, "number": "CE  761", "descripton": "Computer-based analysis of temporary structures in construction and their design, safety and control.  Emphasis on concrete formwork, falsework, earth support, cofferdams, underpinning, lifting and rigging.", "fall": false, "units": " 3"}, {"summer": false, "name": "Construction Productivity", "prerequisites": "Prerequisite: CE 463", "spring": true, "number": "CE  762", "descripton": "Methods of collecting, assembling and analyzing construction productivity data in order to increase construction productivity. Applications of methods improvement techniques such as time-lapse photography, flow charts, process charts and time standards to improvement of construction productivity. Safety and human factors in construction and their relation to construction productivity.", "fall": true, "units": " 3"}, {"summer": false, "name": "Materials Management In Construction", "prerequisites": "Prerequisite: CE 463, CE 465", "spring": false, "number": "CE  763", "descripton": "Fundamental concepts and methods; construction specific models for integrated materials management; computer usage; vendor analysis and \"best-buy;\" materials requirement planning and control; management of material waste; automated materials tracking; materials handling; study of current issues; development of  practical solution to a real-world problem.", "fall": false, "units": " 3"}, {"summer": false, "name": "Construction Equipment Systems", "prerequisites": "Prerequisite: CE 761 or 762", "spring": true, "number": "CE  765", "descripton": "Analysis of heavy construction processes as systems in order to optimize the selection and employment of construction equipment. Considerations in system design, cost and productivity estimation, operational procedures, safety and maintenance. Computer applications utilizing analytical and simulation techniques.", "fall": false, "units": " 3"}, {"summer": false, "name": "Building Construction Systems", "prerequisites": "Prerequisite: CE 466 or CE 327 or Graduate standing in ARC", "spring": true, "number": "CE  766", "descripton": "Construction engineering of conventional and industrialized building systems. Emphasis in areas of structural systems utilizing cast-in-place concrete, precast concrete, prestressed concrete, structural steel, cold-formed steel, masonry, timber, composite and mixed materials. Mechanisms for resisting and transmitting loads, detailing, fabrication, transportation, erection, stability, shoring, quality control and integration of service systems.", "fall": true, "units": " 3"}, {"summer": false, "name": "Physical-Chemical Water Treatment Processes", "prerequisites": "Prerequisite: CE 574, Corequisite: CE 571", "spring": true, "number": "CE  771", "descripton": "Physical-chemical treatment processes for the treatment of water, including sedimentation, flotation, filtration, coagulation, oxidation, disinfection, precipitation, adsorption, and membrane treatment processes.  Current issues in drinking water quality and treatment are discussed.", "fall": false, "units": " 3"}, {"summer": false, "name": "Environmental Exposure and Risk Analysis", "prerequisites": "Prerequisite: ST 511 or 515", "spring": true, "number": ")  772", "descripton": "Course covers the identification, transport, and fate of hazardious substances in the environment; quantification of human exposures to such substances; dose-response analysis; and uncertainty and variability analysis.  The general risk assessment framework, study design aspects for exposure assessment, and quantitative methods for estimating the consequences and probablity of adverse health outcomes are emphasized.", "fall": false, "units": " 3"}, {"summer": false, "name": "Environmental Bioprocess Technology", "prerequisites": "Prerequisite: CE 573, CE 574", "spring": true, "number": "CE  774", "descripton": "Principles of microbiological, biochemical, and biophysical processes used in environmental waste treatment and remediation processes, with particular emphasis on water quality control processes.", "fall": false, "units": " 3"}, {"summer": false, "name": "Modeling and Analysis Of Environmental Systems", "prerequisites": "Prerequisite: CE 339 and CE 382", "spring": false, "number": "CE  775", "descripton": "Movement and fate of pollutant discharges. Development and application of analytical solutions and numerical models. Role of these models in planning and management. Mathematical programming models. Alternative management strategies: direct regulation, charges and transferable discharge permits. Multiple objectives: cost, equity and certainty of outcome.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Water Management Systems", "prerequisites": "Prerequisite: CE 339, CE 775", "spring": true, "number": "CE  776", "descripton": "Application of systems analysis methods to design, analysis and management of water resources and environmental engineering.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Air Quality", "prerequisites": "Prerequisite: CH 201 and MEA(CE) 479", "spring": true, "number": "CE  779", "descripton": "Local, regional and global scale chemical interactions, transport and behavior of trace gases (sulfur carbon, nitrogen, hydrocarbon, and photo-chemical oxidants) in the atmosphere.  covers three primary elements of air quality: anthropogenic and natural emissions of trace gases; interactions of the pollutants in the atmosphere; and monitoring and sampling of gaseous and particulate pollutants.", "fall": false, "units": " 3"}, {"summer": false, "name": "Ground Water Contaminant Transport", "prerequisites": "Prerequisite: CE 584 and 574", "spring": true, "number": "CE  784", "descripton": "Introduction to movement and attenuation of contaminants in the subsurface. Common contaminant sources; advection and dispersion; numerical modeling of contaminant transport; chemical and biological processes in the subsurface; and ground water restoration technology.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Topics In Civil Engineering", "spring": true, "number": "CE  790", "descripton": "New or special course on advanced developments in some phase of civil engineering. Specific topics and prerequisites identified for each section and varied from term to term.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Advanced Topics in Civil Engineering Computing", "spring": true, "number": "CE  791", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Advanced Topics in Construction Engineering", "spring": true, "number": "CE  792", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Advanced Topics in Geotechnical Engineering", "spring": true, "number": "CE  793", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Advanced Topics in Structures and Mechanics", "spring": true, "number": "CE  794", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Advanced Topics in Transportation Engineering", "spring": true, "number": "CE  795", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Advanced Topics in Water Resource and Environmental Engineering", "spring": true, "number": "CE  796", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Advanced Construction Engineering Seminar", "spring": true, "number": "CE  803", "fall": true, "units": " 1"}, {"summer": false, "name": "Advanced Structures and Mechanics Seminar", "spring": true, "number": "CE  805", "fall": true, "units": " 1"}, {"summer": false, "name": "Advanced Water Resource and Environmental Engineering Seminar", "spring": true, "number": "CE  807", "fall": true, "units": " 1"}, {"summer": true, "name": "Advanced Reading In Civil Engineering", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "CE  839", "descripton": "Directed reading of advanced topics in some phase of civil engineering.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "CE  885", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "CE  890", "descripton": "For studentsd who are preparing for and taking written and/or oral preliminary exams.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "CE  893", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "CE  895", "descripton": "Dissertation research.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "CE  896", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Doctoral Thesis Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "CE  899", "descripton": "For students who have completed all credit hour, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations.", "fall": true, "units": " 1-3"}]