[{"summer": true, "name": "Chemistry and Society", "spring": true, "number": "CH  100", "descripton": "Awareness and understanding of chemistry in everyday life for the non-science student.  Non-mathematical treatment of essential fundamental concepts.  Emphasis on practical applications of chemistry to consumer affairs, energy, medicine, food, sports, and pollution. Credit is not allowed for CH 100 if student has prior credit for CH 101.", "fall": true, "units": " 4"}, {"summer": true, "name": "Chemistry - A Molecular Science", "prerequisites": "Prerequisite: One year of high school chemistry and successful completion of the Chemistry Placement Examination or completion of CH 111 with grade of C- or better; and eligibility for MA 107. Corequisite: CH 102", "spring": true, "number": "CH  101", "descripton": "A fundamental study of molecular bonding, structure, and reactivity.  Principles of atomic structure, ionic and covalent bonding, reaction energetics, intermolecular forces, precipitation reactions, acid/base reactions, oxidation/reduction processes, and introductions to organic and inorganic chemistry.", "fall": true, "units": " 3"}, {"summer": true, "name": "General Chemistry Laboratory", "prerequisites": "Corequisite: CH 101", "spring": true, "number": "CH  102", "descripton": "Laboratory experience to accompany CH 101.  Introduction to basic laboratory equipment and skills.", "fall": true, "units": " 1"}, {"summer": false, "name": "Preparatory Chemistry", "spring": true, "number": "CH  111", "descripton": "Preparation for CH101.  Review of main topics from high school emphasizing nomenclature, vocabulary, the periodic table and problem solving.  Emphasis on mathematical skills, data handling, reaction types, stoichiometry and solutions. Credit for CH 111 is not allowed if a student has prior credit in CH 101.  Credit for CH 111 does not count towards graduation for students in curricula that require CH 101.", "fall": true, "units": " 3"}, {"summer": true, "name": "Chemistry - A Quantitative Science", "prerequisites": "Prerequisite: CH 101 with grade C- or better and eligibility for MA 121 or higher, Corequisite: CH 202", "spring": true, "number": "CH  201", "descripton": "Detailed quantitative aspects of solutions, solution stoichiometry, thermodynamics, chemical equilibrium, acid-base equilibria, solubility equilibria, electrochemistry, chemical kinetics, and nuclear chemistry.", "fall": true, "units": " 3"}, {"summer": true, "name": "Quantitative Chemistry Laboratory", "prerequisites": "Prerequisite: CH 101, CH 102, Corequisite: CH 201", "spring": true, "number": "CH  202", "descripton": "Laboratory experience to complement CH 201.  Experimental exploration of thermodynamic, kinetic, and electrochemical behavior.", "fall": true, "units": " 1"}, {"summer": false, "name": "Analytical Chemistry I", "prerequisites": "Prerequisite: CH 108, Corequisite: CH 212 and PY 208", "spring": true, "number": "CH  211", "descripton": "Methods of quantitative analysis based on solution chemistry, potentiometry, coulometry, chromatography, and molecular absorption and fluorescence spectroscopy.  Statistics of measurement precision. Credit not allowed for both CH 211 and CH 315.", "fall": false, "units": " 3"}, {"summer": false, "name": "Analytical Chemistry Laboratory I", "prerequisites": "Corequisite: CH 211", "spring": true, "number": "CH  212", "descripton": "Laboratory experiments in volumetric analysis, ion selective electrodes, potentiometry, molecular absorption and fluorescence spectroscopy, acid/base chemistry, and computer applications.  Precision, accuracy, and statistical analysis emphasized.", "fall": false, "units": " 1"}, {"summer": true, "name": "Introductory Organic Chemistry", "prerequisites": "Prerequisite: CH 101", "spring": true, "number": "CH  220", "descripton": "A one-semester  course in the fundamental principles of organic chemistry. Preparation, reactions, and  physical properties of alkanes, cycloalkanes, alcohols, alkyl halides, aromatic compounds,  aldehydes, ketones, organic acids, acid derivatives, and amines. Credit is not allowed for both CH 220 and CH 221.", "fall": true, "units": " 4"}, {"summer": "True", "name": "Organic Chemistry I", "prerequisites": "Prerequisite: CH 101 and CH 102; Corequisite: CH 222", "spring": "True", "number": "CH  221", "descripton": "First half of two-semester sequence in the fundamentals of modern organic chemistry. Structure and bonding, stereochemistry, reactivity and synthesis of carbon compounds. Detailed coverage of aliphatic hydrocarbons, alcohols, ethers, and alkyl halides. Introduction to spectral techniques of IR, UV-vis, and NMR.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Organic Chemistry I Lab", "prerequisites": "Prerequisite: CH 101 and CH 102; Corequisite: CH 221", "spring": "True", "number": "CH  222", "descripton": "Laboratory experience to accompany CH 221.  Introduction to basic organic laboratory equipment and techniques.", "fall": "True", "units": " 1"}, {"summer": "True", "name": "Organic Chemistry II", "prerequisites": "Prerequisite: CH 221 and CH222 and a Corequisite of CH 224", "spring": "True", "number": "CH  223", "descripton": "Second half of two-semester sequence in the fundamentals of modern organic chemistry.  Structure and bonding, stereochemistry, reactivity  and synthesis of carbon compounds.  Detailed coverage of aromatic hydrocarbons, condensation reagents, and selected biological chemistry topics such as carbohydrates, lipids, and amino acids.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Organic Chemistry II Lab", "prerequisites": "Prerequisite: CH 221 and CH 222; Corequisite: CH 223", "spring": "True", "number": "CH  224", "descripton": "Laboratory experience to accompany CH 223.  Introduction to basic organic laboratory equipment and techniques.", "fall": "True", "units": " 1"}, {"summer": false, "name": "Computational Chemistry Lab I", "prerequisites": "Prerequisite: CH 221, Corequisite: MA 242", "spring": false, "number": "CH  230", "descripton": "An introduction to computational methods in the chemical sciences. A quantitative introduction to inter- and intramolecular forces in gas and condensed phases. Potential energy surfaces of molecules and chemical reactions. First of a two-semester sequence.", "fall": true, "units": " 1"}, {"summer": false, "name": "Computational Chemistry Lab II", "prerequisites": "Prerequisite: CH 221, Corequisite: MA 241", "spring": true, "number": "CH  232", "descripton": "An introduction to computational methods in the chemical sciences. A computer-based introduction to quantum mechanics, including atomic and molecular orbitals and molecular orbital theory with applications to inorganic chemistry.", "fall": false, "units": " 1"}, {"summer": true, "name": "Special Problems in Chemistry", "spring": true, "number": "CH  295", "descripton": "Special  topics in chemistry at the early undergraduate level. Trial offerings of new or experimental  courses in chemistry. Enrollment requires permission of the department.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Quantitative Analysis", "prerequisites": "Prerequisite: CH 201", "spring": true, "number": "CH  315", "descripton": "Fundamental principles and modern  techniques of chemical analyses: spectrochemical, electrochemical, volumetric and chromatographic methods of analysis, modern chemical instrumentation, and interpretation of data. Credit is not allowed for both CH 211 and CH 315.", "fall": true, "units": " 4"}, {"summer": true, "name": "Introductory Physical Chemistry", "prerequisites": "Prerequisite: CH 201/202; MA  231 or 241, PY 205 or PY 211", "spring": true, "number": "CH  331", "descripton": "Fundamental physiochemical principles including chemical thermodynamics, physical and chemical equilibrium, electrochemistry and reaction kinetics.  For students requiring only a single semester of physical chemistry.", "fall": true, "units": " 4"}, {"summer": true, "name": "Systematic Inorganic Chemistry I", "prerequisites": "Prerequisite: CH 201", "spring": true, "number": "CH  401", "descripton": "Descriptive chemistry of the elements with particular attention to their reactions in aqueous  solution. Emphasis on the chemistry of the main group elements and the periodicity of their  chemical properties. Introduction to transition element and coordination chemistry.  Major paper required.", "fall": true, "units": " 3"}, {"summer": false, "name": "Systematic Inorganic Chemistry II", "prerequisites": "Prerequisite: CH 401, CH 431", "spring": true, "number": "CH  403", "descripton": "Development and application of theoretical principles to the structure and energies of inorganic substances.  Particular attention to the chemistry of coordination compounds of the transition elements. Special applications to bioinorganic chemistry,organometallic chemistry, and inorganic solid state chemistry.", "fall": true, "units": " 3"}, {"summer": false, "name": "Analytical Chemistry II", "prerequisites": "Prerequisite: CH 211 or CH 315 or TC 412, Corequisite: CH 416, CH 433", "spring": false, "number": "CH  415", "descripton": "Methods of quantitative analysis based on electronic instrumentation. Signal processing and electronics, spectroscopy (atomic, x-ray fluorescence, infrared/Raman, surface), voltammetry, chromatography (gas, liquid), mass spectrometry as well as chemical transducers and statistical methods of data handling.", "fall": true, "units": " 3"}, {"summer": false, "name": "Analytical Chemistry Laboratory", "prerequisites": "Corequisite: CH 415", "spring": false, "number": "CH  416", "descripton": "Experiments in spectroscopy, electrochemistry, chromatography and electronics; computer applications to  experimental design and data smoothing.", "fall": true, "units": " 1"}, {"summer": true, "name": "Physical Chemistry I", "prerequisites": "Prerequisite: CH 201, MA 242, PY 203 or 208, Corequisite: MA 341", "spring": true, "number": "CH  431", "descripton": "An intensive study of physical chemical principles including states of matter, classical thermodynamics, physical and chemical equilibria, and electrochemistry.", "fall": true, "units": " 3"}, {"summer": true, "name": "Physical Chemistry II", "prerequisites": "Prerequisite: CH 431, MA 341", "spring": true, "number": "CH  433", "descripton": "An intensive study of physical chemical principles including molecular spectroscopy, statistical thermodynamics, reaction kinetics, kinetic  theory, and transport properties. Credit may not be claimed for both CH 433 and CH 437.", "fall": true, "units": " 3"}, {"summer": false, "name": "Physical Chemistry Laboratory", "prerequisites": "Prerequisite: CH 211 or CH 315 or TC412 ; CH 431, Corequisite: CH 433", "spring": true, "number": "CH  434", "descripton": "A project-oriented course to acquaint students with modern physical chemistry laboratory techniques. Experiments in chemical thermodynamics, kinetics, molecular structure and spectra.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Quantum Chemistry", "prerequisites": "Prerequisite: CH 431", "spring": true, "number": "CH  435", "descripton": "An introduction to the basic principles of quantum theory and its application to atomic and molecular structure and spectroscopy.", "fall": true, "units": " 3"}, {"summer": false, "name": "Physical Chemistry for Engineers", "prerequisites": "Prerequisite: PY 208, CHE 315, MA 341", "spring": true, "number": "CH  437", "descripton": "Selected physiochemical principles including quantum theory, spectroscopy, statistical thermodynamics, and rates of chemical reactions. Credit may not be claimed for both CH 433 and CH 437.", "fall": true, "units": " 4"}, {"summer": false, "name": "Forensic Chemistry", "prerequisites": "Prerequisite: CH 223, CH 201", "spring": true, "number": "CH  441", "descripton": "Chemical identification (recognition), and chemical separation techniques (identification) used to demarcate class and individual characteristics relevant in legal claims.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Synthetic Techniques", "prerequisites": "Prerequisite: CH 223, Corequisite: CH 401", "spring": true, "number": "CH  442", "descripton": "An advanced laboratory class in the synthesis, separation and characterization of organic, inorganic, and polymeric materials. Techniques include reactions under inert atmosphere, column chromatography, fractional distillations, NMR spectroscopy, and other advanced procedures. Scientific writing is emphasized.", "fall": true, "units": " 4"}, {"summer": false, "name": "Advanced Synthetic Techniques II", "prerequisites": "Prerequisite: CH 442", "spring": false, "number": "CH  444", "descripton": "An advanced laboratory class in the synthesis, separation and characterization of organic, inorganic, polymer and materials compounds. Techniques include literature searches, reactions, under inert atmosphere, column chromatography, fractional distillations, NMR spectroscopy, and other advanced procedures. This course builds upon the skills acquired in CH 442 and has significant independent work.", "fall": true, "units": " 4"}, {"summer": "True", "name": "Advanced Measurement Techniques I", "prerequisites": "Prerequisite: CH 431", "spring": "True", "number": "CH  452", "descripton": "Modern analytical and physical chemistry laboratory techniques.  Emphasis on statistical methods, chemical thermodynamics, chromatography, atomic and molecular spectroscopy, report writing, scientific methodology, and laboratory safety.", "fall": "True", "units": " 4"}, {"summer": false, "name": "Advanced Measurement Techniques II", "prerequisites": "Prerequisite: CH 311 or CH 315", "spring": true, "number": "CH  454", "descripton": "Laboratory course designed on systematic method development in practical applications for the separation and analysis of environmental, pharmaceutical and biologically important samples. Isocratic and gradient elution HPLC separations and temperature programming in GC are covered. In addition to GC, the three major HPLC modes of Reversed Phase, Ion Exchange, and Hydrophilic Interaction will be studied for separations of mixtures of small organic molecules and biologically important molecules such as peptides and carbohydrates.", "fall": false, "units": " 4"}, {"summer": false, "name": "Molecular Origins of Life", "prerequisites": "Prerequisite: BCH 351 or BCH 451 or Permission of Instructor", "spring": false, "number": "CH  463", "descripton": "Survey of the present state of understanding of the molecular mechanisms leading to the emergence of sustainable self-replicating systems in the prebiotic era on the early Earth, including historical context, experimental studies, and theoretical foundation. The course will include a focus on the fundamental chemistry of and mechanisms for the plausible prebiotic formation of diverse biomolecules (including amino acids, sugars, nucleotides, lipids, tetrapyrroles) and self-organizing chemistry leading to protocells, the proposed early progenitors of living cells. Credit will not be given for both CH 463 and CH 563.", "fall": true, "units": " 3"}, {"summer": false, "name": "Honors Chemistry", "prerequisites": "Prerequisite: CH 223, Admission to Honors Program", "spring": true, "number": "CH  491", "descripton": "Independent study and research projects in chemistry.", "fall": true, "units": " 1-4"}, {"summer": true, "name": "Undergraduate Research in Chemistry", "prerequisites": "Prerequisite: Two years of chemistry", "spring": true, "number": "CH  499", "descripton": "Independent investigation of a research problem under the supervision of a chemistry faculty member.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Molecular Origins of Life", "prerequisites": "Prerequisite: CH 201, CH 221, CH 223, and BCH 451/equivalent.", "spring": false, "number": "CH  563", "descripton": "Survey of the present state of understanding of the molecular mechanisms leading to the emergence of sustainable self-replicating systems in the prebiotic era on the early Earth, including historical context, experimental studies, and theoretical foundation. The course will include a focus on the fundamental chemistry of and mechanisms for the plausible prebiotic formation of diverse biomolecules (including amino acids, sugars, nucleotides, lipids, tetrapyrroles) and self-organizing chemistry leading to protocells, the proposed early progenitors of living cells. Credit for both CH 463 and CH 563 will not be allowed.", "fall": true, "units": " 3"}, {"summer": false, "name": "Proteomics", "prerequisites": "Prerequisite: BIT 410 or BIT 510 or BCH 454", "spring": true, "number": ")  572", "descripton": "Introduction and history of the field of proteomics followed by the principles and applications of proteomics technology to understand protein expression and protein post-transitional modifications. Laboratory sessions include growing yeast with stable-isotope labeled amino acids, protein purification, Western blots, protein identification and quantification, and protein bioinformatic analysis. This is a half-semester course.", "fall": false, "units": " 3"}, {"summer": false, "name": "Seminar", "prerequisites": "Prerequisite: Graduate standing in CH", "spring": true, "number": "CH  601", "descripton": "Review and discussion of scientific articles, progress reports on research and special problems of interest to chemists.", "fall": true, "units": " 1"}, {"summer": false, "name": "Special Topics In Chemistry", "spring": true, "number": "CH  610", "descripton": "Detailed study of a particular problem or technique pertaining to chemistry.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Advanced Chemistry Projects", "prerequisites": "Prerequisite: Graduate standing in CH", "spring": true, "number": "CH  677", "descripton": "Independent literature study of a current subject in chemistry. Required written critical review paper of selected subject.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "CH  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "CH  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "CH  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": true, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "CH  690", "descripton": "For students in non-thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "CH  693", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "CH  695", "descripton": "Thesis research.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "CH  696", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": false, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "CH  699", "descripton": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Advanced Inorganic Chemistry I: Structure and Bonding", "spring": false, "number": "CH  701", "descripton": "Study of periodic table/trends, symmetry and molecular orbital theory of small molecules and extended structures, transition-metal coordination complexes, acid/base and redox reactivity of polyatomic ions, solid-state structures, and selected special topics.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Inorganic Chemistry II: Applications of Group Theory to Bonding and Spectroscopy", "prerequisites": "Prerequisite: CH 701 or equivalent", "spring": true, "number": "CH  703", "descripton": "This course uses group theory as the basis for developing molecular orbital theory, vibrational spectroscopy, and electronic spectroscopy. Together, these methods are used to discuss topics of current research interest in inorganic chemistry.", "fall": false, "units": " 3"}, {"summer": false, "name": "Organometallic and Inorganic Reaction Mechanism", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "CH  705", "descripton": "Coverage of concepts of bonding and structure of transition metal complexes with emphasis on the interaction of transition metal fragements with organic ligands; study of experimental methods of mechanistic study; treatment of inorganic and organometallic reactions including metal-mediated organic synthesis, metal-catalyzed polymer synthesis, and models of bioinorganic systems.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Analytical Chemistry I", "prerequisites": "Prerequisite: CH 433; CH 415", "spring": true, "number": "CH  711", "descripton": "First semester of two-semester integrated sequence covering advanced methods for extraction and interpretation of chemical information from electronic/optical signals in chemical analysis. Digital and analog electronics, signal acquisition and processing, chemometrics, and instrumentation.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Analytical Chemistry II", "prerequisites": "Prerequisite: CH 711", "spring": true, "number": "CH  713", "descripton": "Second semester of two-semester integrated sequence covering advanced methods for extracting and interpreting chemical information from electronic/optical signals in chemical analysis. Digital and analog electronics, signal acquisition and processing, chemometrics, and instrumentation.", "fall": false, "units": " 2"}, {"summer": false, "name": "Electronics and Instrumentation Laboratory", "prerequisites": "Prerequisite: CH 711, Corequisite: CH 713", "spring": true, "number": "CH  714", "descripton": "Laboratory course covering operation and application of analog and digital electronics in context of chemical instrumentation. Circuit elements, integrated circuits, microprocessors and computers, data acquisition systems, and signal processing.", "fall": false, "units": " 1"}, {"summer": false, "name": "Advanced Organic Chemistry I", "prerequisites": "Prerequisite: CH 223, 433 or 435", "spring": false, "number": "CH  721", "descripton": "Structure stereochemistry and reactions of various classes of hydrocarbons.  Molecular orbital treatment of bonding and reactivity of alkenes, conformational interpretation of cycloaklene and cycloaklene reactivity and application of optical isomerism to study of reaction mechanisms.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Organic Chemistry II", "prerequisites": "Prerequisite: CH 721", "spring": true, "number": "CH  723", "descripton": "Introduction to acid-base theory and mechanistic organic chemistry as applied to synthetically useful organic reactions.", "fall": false, "units": " 3"}, {"summer": false, "name": "Physical Methods in Organic Chemistry", "prerequisites": "Prerequisite: CH 223 and CH 433 or CH 435", "spring": false, "number": "CH  725", "descripton": "Application of physical methods to the solution of structural problems in organic chemistry.  Methods discussed include electronic absorption spectroscopy, vibrational spectroscopy, nuclear magnetic resonance, and mass spectrometry.", "fall": true, "units": " 3"}, {"summer": false, "name": "Mass Spectometry", "prerequisites": "Prerequisite: CH 223", "spring": false, "number": "CH  727", "descripton": "Interpretation of mass spectra emphasizing characterization of organic molecules. Instrumentation topics: types of mass analyzers such as magnetic sector, quadrupole and time-of-flight; hybrid instruments such as GC/MS, LC/MS and MS/MS; and ionization methods including EI, CI, laser desorption and fast atom bombardment. Applications: quantitation, environmental analysis, and peptide and DNA sequencing.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Physical Chemistry", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "CH  730", "descripton": "Survey of chemical thermodynamics and kinetics, with emphasis on reactions in liquid phase. Problem solving an important part of course. Designed for review and expansion on materials usually covered in a one-year undergraduate physical chemistry course.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Physical Chemistry in Biological Applications", "prerequisites": "Prerequisite: CH 431 and CH 433 and BCH 453 or equivalent.", "spring": false, "number": "CH  732", "descripton": "Modern views on structure, function, and thermodynamic stability of biological macromolecules including proteins, nucleic acids, and biological membranes; theories and models of protein folding, high resolution experimental methods for structure determination of soluble and membrane proteins including solution and solid-state NMR spectroscopy.", "fall": false, "units": " 3"}, {"summer": false, "name": "Spectroscopic Methods in Chemical Biology", "prerequisites": "Prerequisite: CH 331 or CH 431, CH 433 or equivalent", "spring": false, "number": "CH  734", "descripton": "Physical principles underlying the experimental spectroscopic methods used to study structure and dynamics of biological macromolecules.  Detailed discussion of experimental techniques include high-resolution solution Nuclear Magnetic Resonance, Electron Paramagnetic Resonance in combination with spin labeling and spin trapping methods, and fluorescence spectroscopy, including single molecule methods and fluorescence microscopy. This course is offered every third semester from Spring 2010.", "fall": false, "units": " 3"}, {"summer": false, "name": "Magnetic Resonance in Chemistry", "prerequisites": "Prerequisite: CH 331 or CH 431, CH 433 or equivalent", "spring": false, "number": "CH  735", "descripton": "This course is focused on physical and quantum mechanical principles that make magnetic resonance the most important spectroscopic technique in chemistry. Detailed discussion of description of magnetic resonance phenomena and NMR and EPR experimental techniques covers both classical and quantum mechanical treatments. Students of diverse backgrounds will gain in-depth knowledge of modern magnetic resonance as applied to problems in chemistry, materials, and nano-science, and biophysics.", "fall": false, "units": " 3"}, {"summer": false, "name": "Chemical Spectroscopy", "prerequisites": "Prerequisite: CH 435", "spring": true, "number": "CH  736", "descripton": "Introduction to rotational, vibrational and electronic molecular spectroscopy from a quantum mechanical viewpoint. Emphasis on the elucidation of structure, bonding and excited state properties of organic and inorganic molecules.", "fall": false, "units": " 3"}, {"summer": false, "name": "Quantum Chemistry", "prerequisites": "Prerequisite: MA 301, CH 435 or PY 407", "spring": true, "number": "CH  737", "descripton": "Elements of wave mechanics applied to stationary energy states and time-dependent phenomena. Applications of quantum theory to chemistry, particularly chemical bonds.", "fall": false, "units": " 3"}, {"summer": false, "name": "Electrochemistry", "prerequisites": "Prerequisite: CH 431 or CH 433", "spring": true, "number": "CH  743", "descripton": "Thermodynamics and kinetics of electrode reactions presented as well as experimental methods for studying them. Particular emphasis on measurement of standard potential and establishing number of electrons transferred. Applications of electrochemistry in production/storage of energy and in chemical analysis.", "fall": false, "units": " 3"}, {"summer": false, "name": "Chemical Separation", "prerequisites": "Prerequisite: CH 415, CH 416, Corequisite: CH 610 or 810", "spring": false, "number": "CH  745", "descripton": "Basic principles of methods in chemical separation including gas chromatography, liquid chromatography, etc. Theory, instrumentation and applications of various chromatographic and electrophoretic techniques.", "fall": true, "units": " 3"}, {"summer": false, "name": "Nanobiotechnology", "prerequisites": "Prerequisite: CH 415", "spring": true, "number": "CH  747", "descripton": "An introduction to nanobiotechnology, with a focus on biological applications such as bioimaging and biosensing. Principles underlying methods of nanomaterials fabrication and characterization will be introduced, and major characterization techniques will be discussed. Au nanoparticles, quantum dots, and carbon nanotubes will be used as representative examples of novel nanomaterials with unique properties. The strengths and weaknesses of various nanomaterials in biological applications will be compared through in-class discussions.", "fall": false, "units": " 3"}, {"summer": false, "name": "Organic Reaction Mechanisms", "prerequisites": "Prerequisite: CH 723, CH 433", "spring": true, "number": "CH  755", "descripton": "Effects of structure and substituents on direction and rates of organic reactions.", "fall": false, "units": " 3"}, {"summer": false, "name": "Combinatorial Bioorganic Synthetic Chemistry", "prerequisites": "Prerequisite: BCH 453 or equivalent", "spring": true, "number": "CH  757", "descripton": "Modern topics in synthetic chemistry that underpin bioorganic chemistry including peptide synthesis, nucleic acid synthesis, and diverse methods for combinatorial syntheses of such biomolecules and analogues.", "fall": false, "units": " 3"}, {"summer": false, "name": "Natural Products", "prerequisites": "Prerequisite: CH 723 and CH 725", "spring": false, "number": "CH  759", "descripton": "Illustrative studies of structure determination, synthesis and biosynthesis of natural substances. Stress upon modern physical methods and fundamental chemical concepts. Examples from such classes as alkaloids, terpenes, steroids and antibiotics.", "fall": true, "units": " 3"}, {"summer": false, "name": "Chemistry of Materials", "prerequisites": "Prerequisite: CH 201 or equivalent", "spring": true, "number": "CH  765", "descripton": "Detailed examination of the relationship between chemical structure and physical properties of materials with potential use in applications.  Different classes of molecules and materials requirements for several applications will be emphasized.", "fall": false, "units": " 3"}, {"summer": false, "name": "Bioinorganic Chemistry", "prerequisites": "Prerequisite: CH 401", "spring": true, "number": "CH  770", "descripton": "The interface between inorganic and biological chemistry will be explored, focusing on the catalytic processes in metalloenzymes, and with an emphasis on the diverse roles of transition metals in biology. The physical methods required for the study of bioinorganic systems will be introduced, with application toward determining enzymatic mechanisms. Selected topics will include heme chemistry, nitrogen fixation, C-H bond activation, electron transfer, oxygen transport, metal ion uptake and toxicity, drug activation and/or metabolism by metalloenzymes, and metallodrugs.", "fall": false, "units": " 3"}, {"summer": false, "name": "Solid State Chemistry", "prerequisites": "Prerequisite: CH 701 or equivalent", "spring": true, "number": "CH  772", "descripton": "Selected topics in solid-state chemistry including: extended symmetry, structure, bonding, characterizations, and special topics. Graduate standing in Chemistry required.", "fall": false, "units": " 3"}, {"summer": false, "name": "Special Topics in Chemistry", "spring": true, "number": "CH  795", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Seminar", "prerequisites": "Prerequisite: Graduate standing in CH", "spring": true, "number": "CH  801", "descripton": "Review and discussion of scientific articles, progress reports on research and special problems of interest to chemists.", "fall": true, "units": " 1"}, {"summer": false, "name": "Special Topics In Chemistry", "spring": true, "number": "CH  810", "descripton": "Detailed study of a particular problem or technique pertaining to chemistry.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Advanced Topics In Chemistry", "spring": true, "number": "CH  815", "descripton": "Critical study in one of branches of chemistry.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Advanced Chemistry Projects", "prerequisites": "Prerequisite: Graduate standing in CH. 1-3", "spring": true, "number": "CH  877", "descripton": "Independent literature study of a current subject in chemistry. Required written critical review paper of selected subject.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "CH  885", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning but the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "CH  890", "descripton": "For students who are preparing for and taking written and/or oral preliminary exams.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "CH  893", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "CH  895", "descripton": "Dissertation research.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "CH  896", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "CH  899", "descripton": "For students who have completed all credit hour, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations.", "fall": true, "units": " 1-3"}]