[{"summer": false, "name": "Design Thinking I", "spring": false, "number": "D  100", "descripton": "Design topics including: processes, methods, philosophies, theories and special topics such as making choices in a consensus driven organization or in a collaborative venture.  A companion course to the second semester discipline specific Fundamental Studios.", "fall": true, "units": " 2"}, {"summer": false, "name": "Design Thinking II", "prerequisites": "Prerequisite: D100", "spring": true, "number": "D  101", "descripton": "This course evolves from the direct application of design thinking principles in the various design disciplines. It is intended to give a variety of perspectives from which to proceed into the design process. Students are expected to write reflections on the material presented in class, to develop a personal philosophy of design statement and to conclude with the construction of a design thought model that represents each student's thinking process. A review of relevant films and invited lecturers from the design disciplines.", "fall": false, "units": " 2"}, {"summer": true, "name": "Design Culture and Context I", "spring": false, "number": "D  102", "descripton": "Design Culture and Context I is an interdisciplinary survey of the impact of culture on the ideas, styles and expressions of art and design during the 19th and 20th centuries. With a focus on the United State and societies around the globe, a variety and material references from architecture, industrial design, textile and clothing manufacture, the arts, graphic design, film and new media will be used to explore the \"big picture\" of the things people create--material culture-- within a frame of significance, utility and public need.", "fall": true, "units": " 3"}, {"summer": true, "name": "Design Culture and Context II", "prerequisites": "Prerequisite: D 102", "spring": true, "number": "D  103", "descripton": "Design Culture and Context II examines design action and the relationships between design and other systems, chiefly the natural and built environment, society and culture, and technology and economics. Case studies presented by affiliate College of Design faculty, professionals and principle investigators in Universal Design, Natural Learning and Museum Practice will introduce students to the cultural implications eof crafting wmeaningful solutions to current challenges and public needs.", "fall": false, "units": " 3"}, {"summer": false, "name": "First Year Studio I", "prerequisites": "Prerequisite: D 100 and D 102; restricted to Design majors only", "spring": false, "number": "D  104", "descripton": "First Year Studio I provides College of Design freshman with a comprehensive introduction to foundational design concepts and methods representative of creative thought and activity across design and artistic disciplines. An integral component of the larger interdisciplinary curricular framework that is a \"First Year Experience.\" This 4-credit Fall semester course encourages entering freshman to think creatively through design and art, and the world around them, as they secure a skillful level of craftsmanship in the development and making of all studio-based work.", "fall": true, "units": " 4"}, {"summer": false, "name": "First Year Studio II", "prerequisites": "Prerequisite: D 101 and D 103; restricted to Design majors only", "spring": true, "number": "D  105", "descripton": "First Year Studio II is the continuation of the comprehensive introduction to foundational design concepts and methods representative of creative thought and activity across design and artistic disciplines, started in First Year Studio I. Spring semester is an integral component to the larger interdisciplinary curricular framework that is a \"First Year Experience\". This four credit Spring semester course encourages First Year Students to think critically about phenomena such as Light Effects, Mechanics and Motion and Human Measurements and Scale. The topics are related to design and students are guided and encouraged to act creatively through design as they secure a skillful level of craftsmanship in the development and making of all studio-based work. In this second semester studio, the students will further exercise their design thinking abilities,and improving their skills, methods and knowledge of design practice through assignments related to more focused and smaller scale than the first semester. The students will have a larger scope of context understanding and a practice designing small projects. Students will reaffirm a personal commitment to the development of design thinking and skills, and students are expected to purchase design materials.", "fall": false, "units": " 4"}, {"summer": "True", "name": "Design History for Engineers and Scientists", "spring": "True", "number": "D  231", "descripton": "Study of historical connections among various disciplines and across cultures from prehistory to the present, with an emphasis on design.  Students develop visual timelines of events to better understand how seemingly disparate disciplines affect one another.  Special attention paid to scientific, artistic, and philosophical \"revolutions\" and their impact upon each other and upon other intellectual and practical endeavors.", "fall": "True", "units": " Performing Arts"}, {"summer": true, "name": "Special Topics in Design", "spring": true, "number": "D  292", "descripton": "Topics of current interest in the college of Design.  Used to develop new courses.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Special Topics in Design", "spring": true, "number": "D  492", "descripton": "Topics of current interest in the College of Design.  Used to develop new courses.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Special Topics in Design", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "D  592", "descripton": "Topics of current interest in the College of Design. Used to develop new courses.", "fall": true, "units": " 1-6"}]