[{"summer": "True", "name": "History of Design I, From Before the Apple to Xia Gui", "spring": "True", "number": "DS  101", "descripton": "DS 101 covers the history of design from caves and 'rude stone monuments' through the Renaissance. It covers both western or European history, as well as the design history of Asia, India, and the Americas. The course will provide students a way of seeing the parallel development of the arts in these various cultures, while providing insight into the impact of early design on later periods of art and design.  Required for all Design Studies majors. 15 seats per year will be reserved for Design Studies majors.", "fall": "True", "units": " Performing Arts"}, {"summer": false, "name": "Design Studies Senior Research Seminar", "prerequisites": "Prerequisite: Completion of all course work in DS through junior year ; Design Studies Majors", "spring": false, "number": "DS  481", "descripton": "Each student in Design Studies will develop a topic for his or her Senior Capstone Research Paper to be done during the Spring term. During the Research semester, each student will develop a comprehensive bibliography for the topic and an outline ofthe paper. One paper will be written before the end of the term that addresses issues directly related to the Capstone Research paper. Throughout the term, students will share their research with others in the seminar.", "fall": true, "units": " 3"}, {"summer": false, "name": "Design Studies Capstone Seminar", "prerequisites": "Prerequisite: DS 481 ; Design Studies Majors", "spring": true, "number": "DS  482", "descripton": "Students will meet on a weekly basis to discuss their individual research papers. Drafts of papers will be due at the end of the eighth week of class. Drafts will be read by the instructor, other instructors of the student's choosing, and by two other members of the class for critical analysis.", "fall": false, "units": " 1"}, {"summer": false, "name": "Design Studies Capstone Research Paper", "prerequisites": "Prerequisite: DS 481 ; Design Studies Majors", "spring": true, "number": "DS  483", "descripton": "Course consists of guided independent study resulting in a serious research paper. Students will work on their own, with meetings with faculty advisor(s) at weekly intervals.", "fall": false, "units": " 3"}, {"summer": true, "name": "Design Studies Internship", "prerequisites": "Prerequisite: Junior or Senior Standing in Design Studies Program ; Design Studies Majors", "spring": true, "number": "DS  494", "descripton": "Supervised internships in museums, galleries, schools, or other approved venues, in which students are engaged in activities related to Design Studies. Students are responsible for transportation to and from internship.", "fall": true, "units": " 1-6"}]