[{"summer": false, "name": "Introduction to Leadership Fundamentals", "prerequisites": "Prerequisite: Sophomore standing, Junior standing, or Senior standing", "spring": true, "number": "EAC  301", "descripton": "This course will provide basic understandings of the components of leadership that can be applied to their current and future leadership experiences on campus or in their individual communities, and to provide a model of critical reflection for those applications.", "fall": true, "units": " 3"}, {"summer": false, "name": "Special Topics in Adult Learning and Leadership", "spring": false, "number": "EAC  496", "descripton": "Exploration of specialized areas and topics of current interest in adult learning and leadership.", "fall": false, "units": " 1-6"}, {"summer": "True", "name": "Current Issues in Higher Education", "spring": "True", "number": "EAC  517", "descripton": "Examination of important social, political and economic issues affecting present and future operation of colleges and universities in America.  Graduate standing or PBS status required.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Foundations of Adult Education", "spring": false, "number": "EAC  522", "descripton": "Introduction to the field of adult education as an area of graduate study and practice.  It is intended for those who have experience or desire to work with adult learners or with organizations that serve adult learner populations.", "fall": true, "units": " 3"}, {"summer": true, "name": "Health Care Delivery Systems and Environments", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "EAC  532", "descripton": "Organization of health care delivery system, services and recourses. Focus on major social, economic, political and professional factors contributing to shaping the system and influencing change. Analysis of organizations and environments in regard to demand for health personnel and the implications for health occupations education.", "fall": false, "units": " 3"}, {"summer": false, "name": "Issues and Trends In Education For the Health Professions", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "EAC  536", "descripton": "An analysis of educational and social factors influencing change in health professions education. Problems of student selection and program articulation, and implications for health occupations education and health services of recent legislation impacting health care.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Instructional Strategies In Adult and Higher Education", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": "True", "number": "EAC  538", "descripton": "Forms of instruction appropriate for the teaching of adults. Special emphasis upon methods for maximum involvement of the adult learner.  Relevant concepts, theories and principles for selection, utilization and evaluation of instructional strategies with focus on integration of theory into practice. Development of student proficiency in use of applicable teaching techniques for adult and community college education through participation in classroom exercises.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Teaching in the Online Environment", "spring": true, "number": "EAC  539", "descripton": "The course focuses on exploring the issues and considerations in online teaching and introduce students to some of the tools involved in the process.  Students will develop strategies for teaching online and for managing the online classroom.  \t", "fall": false, "units": " 3"}, {"summer": false, "name": "Foundations of Student Affairs", "spring": false, "number": "EAC  540", "descripton": "Examination of knowledge that guides professional practice in student affairs: student development theories, program planning models, student characteristics, group process, and helping and advising skills.  Programmatic applications emphasized through class assignments.", "fall": true, "units": " 3"}, {"summer": false, "name": "Administration and Finance of Student Affairs", "prerequisites": "Prerequisite: EAC 540", "spring": true, "number": "EAC  541", "descripton": "Examination of the role of student affairs in higher education institutions to include: organizational structures, leadership and decision-making, planning and budgeting, staffing and supervision.", "fall": false, "units": " 3"}, {"summer": false, "name": "Student Characteristics and the College Environment", "spring": false, "number": "EAC  542", "descripton": "Study of the history and philosophy of student affairs, the impact of college on students and current issues of concern to students and student affairs professionals.  Good practices of student affairs in the context of student learning are identified and current literature is reviewed.", "fall": true, "units": " 3"}, {"summer": false, "name": "Student Development Theory", "prerequisites": "Prerequisite: EAC 540", "spring": true, "number": "EAC  543", "descripton": "Gain an understanding of the major student development theories and emerging professional literatures in this area. Provide opportunities for students to develop skills in applying student developmental theory to specific student affairs settings, issues, and populations.", "fall": false, "units": " 3"}, {"summer": "True", "name": "History of the College Student Experience in the United States", "spring": "True", "number": "EAC  544", "descripton": "This course will review the history of higher education in the United States from the colonial period to the present with particular attention to the ways in which shifting policies and practices in higher education institutions have affected the college student experience and the student affairs profession.  Graduate standing or PBS status required.", "fall": "True", "units": " 3"}, {"summer": false, "name": " Higher Education", "prerequisites": "Prerequisite: Master's students in ACCE", "spring": false, "number": "EAC  551", "descripton": "Introduces master's students studying adult learning and higher education to two major research paradigms in education, quantitative and qualitative research, and to the research literature of disciplines related to the education of adults. Students will learn how to distinguish between research and non-research materials, and how to evaluate quantitative and qualitative research studies on the basis of their research merit.", "fall": true, "units": " 3"}, {"summer": false, "name": "College Student Retention", "spring": true, "number": "EAC  552", "descripton": "Exploration of college student retention theories, relevant research, and exemplary retention programs.  Examines student retention and completion within four-year colleges and universities as well as student persistence within and transfer from community colleges.", "fall": false, "units": " 3"}, {"summer": false, "name": "Ethics in the Workplace and Education", "spring": false, "number": "EAC  555", "descripton": "Introduction to ethics and social responsibility in adult education, training, higher education and other work and educational environments in a global setting.  Emphasis on addressing moral and ethical issues in the workplace and education by applying critical thinking and analysis processes to ethical dilemmas.  Graduate standing or PBS status required.", "fall": true, "units": " 3"}, {"summer": false, "name": " Practice", "spring": true, "number": "EAC  556", "descripton": "Organization Change in Human Resource Development provides an introduction to the theory and practice of change within the context of adult education programs, other organizations, communities and societies.  Graduate standing or PBS status required.", "fall": false, "units": " 3"}, {"summer": false, "name": "The Adult Learner", "spring": true, "number": "EAC  559", "descripton": "An inquiry into the characteristics and background, learning processes, motivation and participation of adult learners in a variety of educational contexts.  Emphasis on adult learning theories, models, principles and their application to educational design and delivery.", "fall": true, "units": " 3"}, {"summer": false, "name": " Higher Education", "spring": true, "number": "EAC  560", "descripton": "Introduces students to assessment and evaluation principles and practices from a range of perspectives.  Covers uses and limitations of a broad range of assessment and evaluation approaches in adult education settings, with particular focus on college and university teaching.", "fall": false, "units": " 3"}, {"summer": false, "name": "Designing Instructional Systems in Training and Development", "spring": false, "number": "EAC  580", "descripton": "Introduction to instructional design models including needs assessment, systematic training design and development techniques and proactive strategies for evaluating training programs.  Instructional design issues of work-based training, learner characteristics and effects of technology on instructional design, implementation and evaluation processes.  Graduate standing or PBS status required.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Instructional Design in Training and Development", "spring": true, "number": "EAC  581", "descripton": "In-depth analysis of instructional systems design (ISD) theory and practice using professional competency models.  Organizational training requirements, development of performance objectives and measures, design of instructional materials, and address of evaluation issues in training programs in business and industry.  Research and development of instructional design projects relating to ISD process and model.  Graduate standing or PBS status required.", "fall": false, "units": " 3"}, {"summer": false, "name": "Organization and Operation Of Training and Development Programs", "spring": true, "number": "EAC  582", "descripton": "Overview of occupational education practice in business and industrial settings. Presentation of roles common to training and development specialists, including managerial concerns related to organization, operation and financial training and development programs.", "fall": true, "units": " 3"}, {"summer": false, "name": "Needs Assessment and Task Analysis in Training and Development", "spring": true, "number": "EAC  583", "descripton": "Current needs assessment and task analysis methods and techniques used in business and industrial settings.  Development of comprehensive needs assessment plans for diagnosing and documenting human performance deficiencies/improvement opportunities through training programs in business settings.  Graduate standing or PBS status required.", "fall": false, "units": " 3"}, {"summer": false, "name": "Evaluating Training Transfer and Effectiveness", "spring": false, "number": "EAC  584", "descripton": "Philosophy, strategies, and procedures for evaluating effectiveness of training programs.  Development of multi-level evaluation plan for use with training program to study outcomes and process of training from perception to organizational impact.  Design of evaluation methods and instruments, data collection, analysis, and interpretation for each level of evaluation emphasizing transfer of training.  Graduate standing or PBS status required.", "fall": true, "units": " 3"}, {"summer": false, "name": "Integrating Technology into Training Program", "spring": true, "number": "EAC  585", "descripton": "Appropriate technologies for design and delivery of effective training programs.  Performance-based training models for distance and individualized learning through audio, video, computer-based, and multimedia technologies.  Planning devisions for selecting/developing appropriate technologies to support specific training outcomes, adult learner characteristics, and organizational training resources.  Graduate standing or PBS status required.", "fall": false, "units": " 3"}, {"summer": false, "name": "Methods and Techniques Of Training and Development", "spring": true, "number": "EAC  586", "descripton": "Methods and techniques common to model occupational education programs in business and industrial settings.  Focus on design and evaluation of effective learning programs and instructional methodologies.  Graduate standing or PBS status required.", "fall": true, "units": " 3"}, {"summer": false, "name": "Marketing for Education and Training Programs", "spring": true, "number": "EAC  587", "descripton": "Strategic marketing in education and training.  Identifying and understanding targeted organization and audience for education or training program. Design of basic marketing strategy for education or training program incorporating elements of marketing mix and formulating marketing plan to guide implementation of strategy.", "fall": false, "units": " 3"}, {"summer": true, "name": "Special Topics", "spring": true, "number": "EAC  595", "fall": true, "units": " 3"}, {"summer": "True", "name": "Seminar In Adult and Higher Education", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "EAC  602", "descripton": "Identification and scientific analysis of major issues and problems relevant to adult education or higher education. Course credit at the master's level through active student participation in a formal seminar and scientific appraisal and solution of a selected problem. Student acquisition of a broad perspective of issues confronting adult educators and experiences in scientific analysis and solution of specific issues.", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Topical Problems In Adult and Community College Education", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": "True", "number": "EAC  624", "descripton": "Study and scientific analysis of problems in adult education and preparation of a scholarly research type of paper. Credits Arranged.", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Independent Study in Adult and Community College Education", "spring": "True", "number": "EAC  630", "descripton": "Independent study for master's students in Adult and community College Education.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Internship In Adult and Community College Education", "prerequisites": "Prerequisite: Nine hrs. in graduate level courses", "spring": "True", "number": "EAC  651", "descripton": "Utilization of the participant-observer role with required participation in selected educational situations. Emphasis upon observational skills' development, the recording of relevant observations through written journals, analysis of experiences identifying critical incidents and projection of events and consequences. Student development and selection of possible alternative courses of action in various situations and evaluation of the consequences of the selected course of action.", "fall": "True", "units": " 1-9"}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "EAC  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "EAC  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "EAC  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": true, "name": "Research Projects In Education", "prerequisites": "Prerequisite: EAC 732", "spring": true, "number": "EAC  692", "descripton": "A project or problem in research in education for graduate students, supervised by members of graduate faculty. Choice of research on basis of individual students' interests and not to be part of thesis or dissertation research.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "EAC  693", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "EAC  695", "descripton": "Thesis research.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "EAC  696", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": false, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": ")  699", "descripton": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their theses.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Community College and Two-Year Postsecondary Education", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": true, "number": "EAC  700", "descripton": "Comprehensive community colleges and technical institutes and the state systems of which they are part: underlying concepts, design of educational needs to be serve, role in meeting these needs, historical development, issues in establishment and operation of state systems and individual institutions, unresolved issues and emerging trends.", "fall": true, "units": " 3"}, {"summer": false, "name": "Administrative Concepts and Theories Applied To Adult and Community College Educ", "prerequisites": "Prerequisite: EAC 787 or a comparable course(s) on organizational theory", "spring": true, "number": "EAC  701", "descripton": "For persons interested in building more consistent philosophy of educational administration, extension and strengthening of understanding of administrative concepts and processes, improved comprehension of theoretical and research foundations upon which administrative processes predicated, and increased ability for application of administrative concepts, theories and principles to management of complex education system.", "fall": false, "units": " 3"}, {"summer": false, "name": "The Programming Process In Adult and Community College Education", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "EAC  703", "descripton": "Principles and processes in programming, including basic theories and support of concepts in  programming process. Attention to general programming framework, organizational needs and program roles of both professional and lay leaders.", "fall": true, "units": " 3"}, {"summer": false, "name": "Leadership In Higher and Community College Education", "spring": true, "number": "EAC  704", "descripton": "Issues and concepts of leadership development and practice in two- and four-year colleges and universities; interpretation and communication of institutional values and understanding of organizational processes. Attention to role of organizational culture in management improvement and institutional performance in higher education institutions.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Group Process In Adult and Higher Education", "spring": "True", "number": "EAC  705", "descripton": "Application of research and theory in small group behavior to administration and teaching in adult and higher education settings. Opportunities for participant experience of various aspects of group behavior and practice of group leadership skills applicable to various group situations.", "fall": "True", "units": " 3"}, {"summer": false, "name": "The College and University Presidency", "prerequisites": "Prerequisite: EAC 700 or EAC 716", "spring": true, "number": "EAC  706", "descripton": "Promotion of understanding of many facets of the college and university presidency. Investigation and analysis of college and university from the perspective of students's own careers and from the literature on the presidency. The president as institutional leader.", "fall": false, "units": " 3"}, {"summer": "True", "name": "The Politics Of Higher Education", "prerequisites": "Prerequisite: Graduate standing or Management Development Certificate Program and six sem. hrs. of 500-level course work", "spring": "True", "number": "EAC  707", "descripton": "Differing and changing perceptions of role of higher education in American society; politics of competition for priority of attention and resources; organizational alternatives in its control; relevant elements in structure and processes of government. References to other societies.", "fall": "True", "units": " 3"}, {"summer": true, "name": "Continuing Education for the Professions", "prerequisites": "Prerequisite: EAC 703, 759", "spring": false, "number": "EAC  708", "descripton": "Theoretical and research literature related to continuing education for the professions.  Examination of role of educator in providing and managing continuing professional education.", "fall": false, "units": " 3"}, {"summer": false, "name": "Adult Education: History, Philosophy, Contemporary Nature", "prerequisites": "Prerequisite: Advanced Undergraduate standing", "spring": true, "number": "EAC  710", "descripton": "Historical and philosophical foundations of adult education from ancient times to present, with attention to key figures, issues, institutions, movements and programs, including consideration of relationship between adult education's historical development and prevailing intellectual, social, economic and political conditions. Consideration of adult education's contemporary nature, present-day schools of thought on its objectives and trends.", "fall": true, "units": " 3"}, {"summer": false, "name": "Reflective Practice and Research Inquiry", "spring": false, "number": "EAC  711", "descripton": "Initial doctoral seminar to enhance understanding of critically reflective practice, doctoral scholarly inquiry and current issues and debates in adult education scholarship and research.", "fall": true, "units": " 3"}, {"summer": false, "name": "The Change Process in Adult Education", "prerequisites": "Prerequisite: Adult Education Doctoral student", "spring": true, "number": "EAC  712", "descripton": "Provides an introduction to theory and practice of change within the context of adult education organizations, communities, and societies. Emphasis on theory and practice of change in adult education and training and developmental contexts.", "fall": false, "units": " 3"}, {"summer": false, "name": "History Of Higher Education In the United States", "prerequisites": "Prerequisite: Six hrs. of grad. ED courses", "spring": true, "number": "EAC  716", "descripton": "History of higher education from colonial period to the present. Emphasis on influence of  philosophic, political, social and economic forces upon function and structure of higher education.", "fall": false, "units": " 3"}, {"summer": false, "name": "Foundations of Adult, Higher, and Human Res Education", "spring": false, "number": "EAC  730", "descripton": "An inquiry into the characteristics and background, learning processes, motivation and participation of adult learners in a variety of educational contexts.  Emphasis on adult learning theories, models, principles and their application to educational design and delivery.  Doctoral status required.", "fall": true, "units": " 3"}, {"summer": false, "name": "Technology in Adult, Higher, and Human Resource Education", "spring": false, "number": "EAC  731", "descripton": "Introduces the students to the role of technology in education.  Positive and critical aspects will be addressed.  Draws on theory and practice from numerous disciplines, including: adult education; distance education; educational, instructional and communication technologies; and, the teaching and learning sciences.  Analysis of how education in the workplace, higher education and adult/community contexts is being transformed by technology.  Evaluation of the complex interrelationships among education, learning and technology.  Doctoral status required.", "fall": true, "units": " 3"}, {"summer": false, "name": "Globalization Intl Issues Adult Higher Hum Res Ed", "spring": true, "number": "EAC  732", "descripton": "This core course focuses on globalization and its implications for the study and practice of adult, higher, and human resource education, as well as the evolution and increase of diverse international perspectives in the scholarship and policy arenas viewed from an interdisciplinary perspective.  Doctoral status required.", "fall": false, "units": " 3"}, {"summer": false, "name": "The Extension and Public Service Function In Higher Education", "prerequisites": "Prerequisite: EAC 710", "spring": true, "number": "EAC  737", "descripton": "Examination of background, history, philosophy and contemporary nature of extension and public service function of institutions of higher education in U.S. Emphasis on adult education role of public and private universities and colleges. Specific focus on: general extension, industrial extension, engineering extension, cooperative extension and continuing education.\t", "fall": false, "units": " 3"}, {"summer": false, "name": "Adult Development and Learning", "prerequisites": "Prerequisite: EAC 739", "spring": true, "number": "EAC  743", "descripton": "This course examines key theories and research on the physical, and related socio-cultural changes across the adult lifespan. Special emphasis in this course will be on the intellectual and psycho-social aspects of adult development. Key implications for educational programs and services, as well as research investigations of adults in learning environments, will be explored.", "fall": false, "units": " 3"}, {"summer": true, "name": "Death and Dying: A Lifespan Issue", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": false, "number": "EAC  745", "descripton": "Examination of issues associated with dying process, death itself and bereavement. Perceptions and responses to these issues at various stages of the lifespan. Implications for students' fields of practice.", "fall": false, "units": " 3"}, {"summer": false, "name": "Finance in Higher Education", "spring": false, "number": "EAC  749", "descripton": "Examination of theory, research, practices and issues in development and management of financial resources in higher education.", "fall": true, "units": " 3"}, {"summer": "True", "name": "The Environment for Learning In Adult and Higher Education", "prerequisites": "Prerequisite: EAC 700 and Graduate standing or PBS status", "spring": "True", "number": "EAC  750", "descripton": "Planning and management of the physical environment for effective adult learning. Applicability of concepts and theories of learning and teaching environment to needs analysis, planning, resource development, cooperation with professional designers,and construction, operations, conservation and maintenance of educational facilities, equipment and grounds.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Adult Learning Theory", "prerequisites": "Prerequisite: Six semester hours in ED", "spring": true, "number": "EAC  759", "descripton": "Requisite involvement and undergirding of principles in adult education programs including theories and concepts. Emphasis on interrelationship of nature of adult learning, the nature of the subject matter and setting for learning occurrence. Applicability of relevant principles and pertinent research findings to adult learning.", "fall": false, "units": " 3"}, {"summer": false, "name": "Current Issues in Adult Education", "prerequisites": "Prerequisite: 15 Semester hours of graduate credit in the Department of Adult and Community College Education, including 3 semester hours of either quantative or qualitative research methods.", "spring": true, "number": "EAC  765", "descripton": "Analysis of social, political, economic, and ethical issues influencing effective practice of adult education.  Participant formulation and analysis of problems, issues, and challenges relevant to their practice and advanced graduate study.", "fall": false, "units": " 3"}, {"summer": true, "name": "Education Of Special Adult Populations", "spring": true, "number": "EAC  767", "descripton": "Analysis and development of adult education responses to needs and characteristics of special adult populations such as nonliterate, unemployed, handicapped and older adults.", "fall": false, "units": " 3"}, {"summer": false, "name": "Law and Higher Education", "prerequisites": "Prerequisite: Six hrs. graduate credit", "spring": true, "number": "EAC  778", "descripton": "Constitutional, statutory and case law in relationship to higher education. Emphasis on faculty, student and staff rights and tort liability.", "fall": false, "units": " 3"}, {"summer": false, "name": "Concepts and Principles Of Evaluation Applied To Non-Formal Adult Education Prog", "prerequisites": "Prerequisite: EAC 703", "spring": true, "number": "EAC  779", "descripton": "Introduction to evaluation of non-formal adult educational programs; course topics include purposes of evaluation, alternative concepts and techniques, stake holders and their concerns, specification of evidence, selection of standards for making judgments, gathering and analysis of data, use and dissemination of results and handling problems in evaluation.", "fall": false, "units": " 3"}, {"summer": true, "name": "Teaching in College", "spring": false, "number": ")  786", "descripton": "Focus on development of competencies to perform fundamental tasks of a college teacher as well as consideration of more long-range tasks such as course development and university responsibilities of a professor. In addition to attending lectures andother types of presentations, students make video tapes of their teaching, develop tests, design introductory courses in their teaching fields and consider current issues related to university and college teaching.", "fall": true, "units": " 3"}, {"summer": false, "name": "Organizational Theories and Concepts in Higher Education", "spring": false, "number": "EAC  787", "descripton": "For present and potential administrators interested in increasing their understanding of organizational theories as a basis for administration of effective higher education programs.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Applied Qualitative Data Analysis", "prerequisites": "Prerequisite: EAC 785", "spring": "True", "number": "EAC  788", "descripton": "Intermediate graduate level course in applied qualitative methodology following an introductory course in qualitative methods.  Focuses on analytical approaches and tools used with qualitative data, with particular emphasis on adult and higher education and human resource development.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Advanced Qualitative Research Methods", "prerequisites": "Prerequisite: EAC 785", "spring": false, "number": "EAC  790", "descripton": "Advanced guidance for students designing or preparing for qualitative study. Emphasis on developing deeper understanding of theoretical issues informing qualitative research, including assessing validity of data and justifying design. Student development of a research proposal.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Topical Problems in Adult and Community College Education", "spring": "True", "number": "EAC  795", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Seminar In Adult and Higher Education", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "EAC  802", "descripton": "Identification and scientific analysis of major issues and problems relevant to adult education or higher education. Course credit at the doctoral level through active student participation in a formal seminar and scientific appraisal and solution of a selected problem. Student acquisition of a broad perspective of issues confronting adult educators and experiences in scientific analysis and solution of specific issues.", "fall": "True", "units": " 1-3"}, {"summer": false, "name": "Research Seminar in Adult and Higher Education", "prerequisites": "Prerequisite: 6 semester hours of course work in research methodology/analysis", "spring": true, "number": "EAC  803", "descripton": "Examination and application of frameworks, processes and compositional approaches in developing research proposals focusing on problems in adult education and higher education.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Topical Problems In Adult and Higher Education", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": "True", "number": "EAC  824", "descripton": "Study and scientific analysis of problems in adult and higher education at the doctoral level and preparation of a scholarly research paper or project. Credits Arranged.", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Independent Study in Adult and Higher Education", "spring": "True", "number": "EAC  830", "descripton": "Independent study for master's students in Adult and Higher Education.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Internship In Adult and Higher Education", "prerequisites": "Prerequisite: Nine hrs. in graduate level courses", "spring": "True", "number": "EAC  851", "descripton": "Utilization of the participant-observer role with required participation in selected educational situations. Emphasis upon observational skills development, the recording of relevant observations through written journals, analysis of experiences identifying critical incidents and projection of events and consequences. Student development and selection of possible alternative courses of action in various situations and evaluation of the consequences of the selected course of action.", "fall": "True", "units": " 1-9"}, {"summer": true, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "EAC  885", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Doctoral Preliminary Exam", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "EAC  890", "descripton": "For students who are preparing for and taking written and/or oral preliminary exams.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Research Project", "prerequisites": "Prerequisite: EAC 732", "spring": true, "number": "EAC  892", "descripton": "A project or problem in research in education for graduate students, supervised by members of graduate faculty. Choice of research on basis of individual students' interests and not to be part of thesis or dissertation research.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "EAC  893", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "EAC  895", "descripton": "Dissertation research.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "EAC  896", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "EAC  899", "descripton": "For students who have completed all credit hour, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations.", "fall": true, "units": " 1-3"}]