[{"summer": false, "name": "College Student Development and Peer Counseling", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "ECD  220", "descripton": "Developmental issues of young adulthood with opportunity for the acquisition of paraprofessional counseling skills and crisis intervention skills.  Major consideration is given to self-awareness and values clarification through utilization of personality inventories and self-assessment instruments.  Priority will be given to resident advisors and students active in student organizations or volunteer programs.", "fall": true, "units": " 2"}, {"summer": false, "name": "Career Planning and Personal Development", "spring": true, "number": "ECD  221", "descripton": "Knowledge, attitudes, self-understanding, and skills needed to enhance career planning and foster personal development. Study of self-understanding, self-talk, goal setting, the environment, and decision making as ways to adapt more effectively to the challenges of life.", "fall": true, "units": " 3"}, {"summer": false, "name": "Sexual Violence Prevention for Peer Educators", "spring": false, "number": "ECD  222", "descripton": "This course trains students to educate their peers about sexual and relationship violence and stalking.  Students will explore how this violence impacts people of varying cultures including people of color and the gay, lesbian, bisexual, and transgender community.  They are taught to be social activists and learn skills to be confident and active bystanders as well as knowledgeable and effective facilitators.  Topics include learning about the objectification of women and men in the media, masculinity and patriarchy, pornography, and how these all contribute to a rape culture.  Upon successful completion, students will be ready to be a Movement peer educator.  Student must complete application and interview process and have been approved by the instructor prior to registration in the course.", "fall": true, "units": " 3"}, {"summer": false, "name": "Student Development and Peer Mentoring", "prerequisites": "Prerequisite: Selection as a Peer Mentor", "spring": false, "number": "ECD  224", "descripton": "For new student peer mentors of primarily African American freshmen.  Relevant student development, psychology and counseling research and theory as well as shared professional experiences are presented.  Class discussion, group activities, role playing, relevant readings and video are employed.  Reaction papers and project are required.", "fall": true, "units": " 2"}, {"summer": true, "name": "Special Topics in Education: Counselor Education", "spring": true, "number": "ECD  296", "descripton": "Individual or group study of special topics in professional education. The topic and mode of study are determined by the faculty member after discussion with the student.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Introduction To Counseling", "prerequisites": "Prerequisite: Six hrs. in ED or PSY", "spring": true, "number": "ECD  510", "descripton": "Introduction to counseling with a focus on three settings: schools, college and community agencies. Exploration of issues of theory, practice and research with regard to children, adolescents, college students and adults. Personal and professional exploration encouraged through use of psychological tests.", "fall": false, "units": " 3"}, {"summer": true, "name": "Career Counseling and Development", "prerequisites": "Prerequisite: Six hrs. in ED or PSY", "spring": true, "number": "ECD  524", "descripton": "Knowledge and skills needed to: (a) provide professional career counseling to individuals and (b) design, implement and evaluate career development programs for particular groups. Theories of career development and decision making; career guidance programs in educational, agency and industrial setting; career information sources and delivery systems; and assessment in career counseling.", "fall": false, "units": " 3"}, {"summer": true, "name": "Cross Cultural Counseling", "prerequisites": "Prerequisite: Six hrs. in ED or PSY, Corequisite: ECD 530", "spring": true, "number": "ECD  525", "descripton": "Theory and practice of counseling culturally different clients. Client populations include African Americans, Asian-Americans, American Indians and Hispanics.  Cultural assumptions, cultural values, counselor credibility, prejudice and racism in context of counseling.", "fall": false, "units": " 3"}, {"summer": true, "name": "Theories and Techniques Of Counseling", "prerequisites": "Prerequisite: Six hrs. in ED or PSY", "spring": true, "number": "ECD  530", "descripton": "Theory, philosophy with techniques of counseling. Behavioral approaches, psychoanalytic approaches, client-centered counseling, existential counseling and relationship models, and their relation to counseling. Presentation of techniques related to each theory.  Basic counseling skills taught in laboratory setting, including attending, listening and challenging.", "fall": true, "units": " 4"}, {"summer": false, "name": "Int Sch Counseling", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "ECD  533", "descripton": "An examination of the conceptual framework for the role and functions of school counselors, prevention and treatment strategies, program development and evaluation.  Focus is on the school-college-community collaboration model, preparing counselors who can work effectively across different counseling settings by collaborating with other counselors and mental health professionals.  Graduate standing required.", "fall": true, "units": " 4"}, {"summer": false, "name": "Guidance and Counseling In Elementary and Middle Schools", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "ECD  534", "descripton": "Examination of (1) theoretical framework for roles and functions of elementary and middle school counselors, (2) primary and secondary prevention strategies and (3) evaluation and administration procedures to develop and implement model programs forelementary and middle schools.", "fall": true, "units": " 4"}, {"summer": false, "name": "Student Development In Higher Education", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": false, "number": "ECD  535", "descripton": "Student development theory, research and practice as well as overview of profession. Three main professional roles of counselor, administrator and student development educator.  Discussion of cognitive, psychosocial, topological and person-environment theories and various functions in student affairs.  Instruction in and design of structured group work in laboratory.", "fall": true, "units": " 4"}, {"summer": false, "name": "Community Service Agencies", "prerequisites": "Prerequisite: Graduate Standing", "spring": false, "number": "ECD  536", "descripton": "Issues, functions and scope of work being done in various human service agency programs; overview of helping approaches with selected client populations; related professional concerns.  Instruction in and design of structured group work in laboratory.", "fall": true, "units": " 4"}, {"summer": true, "name": "Group Counseling", "prerequisites": "Prerequisite: ECD 530 and one of the following: ECD 510, 534, 535 or 536", "spring": false, "number": "ECD  539", "descripton": "Theory and practice of group counseling. Theoretical positions include client-centered, behavioral and rational-emotive. Aspects of group process include group leadership, group membership, establishing and maintaining a group.", "fall": true, "units": " 3"}, {"summer": true, "name": "Gender Issues In Counseling", "prerequisites": "Prerequisite: Graduate standing or Six hrs. in ED or PSY", "spring": true, "number": ")  540", "descripton": "Exploration of gender as primary identity and social construct. Emphasis on gender dynamics in counseling, client empowerment and preventive approaches.", "fall": false, "units": " 3"}, {"summer": false, "name": "The American College Student", "prerequisites": "Prerequisite: ECD 535 or Doctoral student", "spring": true, "number": "ECD  543", "descripton": "Advanced-level course designed for investigation of five main families of theories of college student development as presented by Chickering, Perry, R. Heath, Myers-Briggs, Holland and D. Heath. Assessment and research in student development and students design and implement a developmental intervention based on Knefelkamp and Wells' Practice-to-Theory-to-Practice model.", "fall": false, "units": " 3"}, {"summer": true, "name": "Research and Assessment In Counseling", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "ECD  560", "descripton": "Research and assessment issues in counseling. Emphasis on writing research proposals in counseling and critiquing articles in counseling research. Exploration of meaning and importance of assessment in counseling. Examination of research designs in counseling.", "fall": false, "units": " 3"}, {"summer": false, "name": "Special Problems In Guidance", "prerequisites": "Prerequisite: Six hrs. grad. work in dept.", "spring": true, "number": "ECD  590", "descripton": "For individual or group studies of one or more of major problems in guidance and personnel work. Problems selected to meet interests of individuals. Workshop procedure used whereby special projects, reports and research developed by individuals and by groups.\r", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Special Problems In Guidance", "prerequisites": "Prerequisite: Six hrs. grad. work in dept.", "spring": true, "number": "ECD  620", "descripton": "For individual or group studies of one or more of major problems in guidance and personnel work. Problems selected to meet interests of individuals. Workshop procedure used whereby special projects, reports and research developed by individuals and by groups.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Introductory Practicum in Counseling", "prerequisites": "Prerequisite: ECD 530, 525", "spring": true, "number": "ECD  641", "descripton": "Student participation in introductory supervised individual and group counseling experiences in laboratory setting.", "fall": false, "units": " 1"}, {"summer": false, "name": "Practicum In Counseling", "prerequisites": "Prerequisite: ECD 641", "spring": false, "number": "ECD  642", "descripton": "Student participation in individual and group counseling and consultation experiences under supervision in a school, college or agency setting.", "fall": true, "units": " 6"}, {"summer": true, "name": "Internship in School Counseling", "prerequisites": "Prerequisite: ECD 642", "spring": true, "number": "ECD  651", "descripton": "A 600-hour internship for school counselors in training in a school setting under the supervision of qualified professionals.  Students perform a variety of activities expected fo school counselors.  Weekly meetings with faculty and on-site supervisors.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Internship In College Student Development", "prerequisites": "Prerequisite: ECD 642", "spring": true, "number": "ECD  652", "descripton": "A 600-hour internship.  Professional experience in  student affairs department with on-site supervision from  qualified professional. Expectations including employment of broad repertoire of skills in roles of counselor, student development educatorand administrator. Weekly student meetings with faculty and on-site supervisors.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Internship In Agency Counseling", "prerequisites": "Prerequisite: ECD 642", "spring": true, "number": "ECD  653", "descripton": "A 600-hour internship for community agency counselors in agency counseling setting under supervision of qualified professional.  Employment of broad repertoire of primary and secondary prevention approaches to individual and group techniques, workshop leadership skills, consultation techniques and advocacy methods.  Weekly meetings with faculty and on-site supervisors.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ECD  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ECD  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": true, "name": "Research Projects in Counselor Education", "prerequisites": "Prerequisite: ELP 532", "spring": true, "number": "ECD  692", "descripton": "Project or problem in research in education for graduate students, supervised by members of graduate faculty.  Research chosen on basis of individual students' interests and not to be part of thesis or dissertation research.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ECD  693", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ECD  695", "descripton": "Thesis research.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "ECD  696", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": false, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": ")  699", "descripton": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their theses.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Career Development Theory and Research", "prerequisites": "Prerequisite: ECD 524, ELP 532 and PSY 535", "spring": true, "number": "ECD  731", "descripton": "Analysis of theory and research in career development and work adjustment as basis for intervention (career counseling, curricular, organizational) as research.", "fall": true, "units": " 3"}, {"summer": false, "name": "Cognitive-Behavioral Theory, Research, and Practice", "prerequisites": "Prerequisite: ECD 737, Corequisite: ST 700", "spring": true, "number": "ECD  733", "descripton": "Behavioral and cognitive behavioral change methods and research supporting their efficacy in counselor education.  Major focus on synthesis of cognitive-developmental and cognitive-behavioral methods.", "fall": false, "units": " 3"}, {"summer": false, "name": "Counseling Supervision: Theory and Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "ECD  735", "descripton": "Examination of conceptual and methodological issues relating to supervision and evaluation of novice counselors.  Special emphasis on developmental supervision approaches.", "fall": false, "units": " 3"}, {"summer": false, "name": "Cognitive Developmental Theory, Research and Practice", "prerequisites": "Prerequisite: Doctoral student : PSY 535, ST 507, Corequisite: ST 508", "spring": false, "number": "ECD  737", "descripton": "Review of contemporary cognitive-developmental theories and literature describing their application.  Theories by Piaget, Kohlberg, Hunt, Erikson, Loevinger, and Perry.  Measurement of developmental constructs and their psychometric properties.  Reviews of studies employing deliberate psychological education as method of primary prevention.", "fall": true, "units": " 3"}, {"summer": false, "name": "Research in Counselor Education", "prerequisites": "Prerequisite: Doctoral student : ST 507; PSY 535, Corequisite: ST 508", "spring": true, "number": "ECD  738", "descripton": "Instruction in required skills and knowledge to conduct research in counselor education, including narrative and quantitative integration of research, experimental and quasi-experimental designs, analogue and process research, single subject and descriptive designs, and qualitative research. Preparation of narrative and meta-analytic research review and research proposal with oral presentation.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Psycho-Social Identity Development: Race, Gender, and Culture", "prerequisites": "Prerequisite: ECD 540; ECD 525 ; Post-master's degree students", "spring": true, "number": "ECD  740", "descripton": "Meansings and intersections of gender, race and culture.  Advanced theories and research related to counseling practice.  Sexuality, disability and class and implications for counseling.  Case study, personal narratives and video segments expand on course readings.", "fall": true, "units": " 3"}, {"summer": true, "name": "Special Problems In Guidance", "prerequisites": "Prerequisite: Six hrs. grad. work in dept.", "spring": true, "number": "ECD  790", "descripton": "For individual or group studies of one or more of major problems in guidance and personnel work. Problems selected to meet interests of individuals. Workshop procedure used whereby special projects, reports and research developed by individuals and by groups.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Special Problems In Guidance", "prerequisites": "Prerequisite: Six hrs. grad. work in dept.", "spring": true, "number": "ECD  820", "descripton": "For individual or group studies of one or more of major problems in guidance and personnel work. Problems selected to meet interests of individuals. Workshop procedure used whereby special projects, reports and research developed by individuals and by groups.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Advanced Counseling Practicum", "prerequisites": "Prerequisite: Doctoral student,  ECD 642", "spring": true, "number": "ECD  843", "descripton": "Participation of doctoral-level students with previous counseling experience in advanced, supervised counseling experience.", "fall": false, "units": " 3"}, {"summer": false, "name": "Counseling Supervision: Practicum", "prerequisites": "Prerequisite: ECD 735", "spring": false, "number": "ECD  847", "descripton": "A supervised practicum for doctoral students in assisting with the supervision of first-year students in laboratory and practicum experiences in individual and group counseling and consultation.", "fall": true, "units": " 3"}, {"summer": true, "name": "Doctoral Internship", "prerequisites": "Prerequisite: Nine hrs. in grad. level courses", "spring": true, "number": "ECD  850", "descripton": "Utilizing participant-observer role, participation required in selected educational situations with emphasis upon development of observational skills, ability to record relevant observations by means of written journals, skills in analyzing experiences identifying critical incidents and projection of events and consequences.  Student required to develop possible alternative courses of action in various situations, select one of the alternatives and evaluate consequences.", "fall": true, "units": " 1-9"}, {"summer": false, "name": "Professional Issues In Counseling", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "ECD  860", "descripton": "Consideration of contemporary issues, trends and recent research in field of counseling.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Supervised Practice Teaching in Counselor Education", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "ECD  886", "descripton": "Participation of doctoral students in Counselor Education in teaching of approved master's level or undergraduate courses with graduate faculty members serving as mentors.", "fall": true, "units": " 3"}, {"summer": true, "name": "Doctoral Research Projects", "spring": true, "number": "ECD  892", "descripton": "Project or problem in research in education for graduate students, supervised by members of graduate faculty.  Research chosen on basis of individual students' interests and not to be part of thesis or dissertation research.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "ECD  893", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "ECD  895", "descripton": "Dissertation research.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "ECD  896", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "ECD  899", "descripton": "For students who have completed all credit hour, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations.", "fall": true, "units": " 1-3"}]