[{"summer": true, "name": "Introduction to Computer Systems", "spring": true, "number": "ECE  109", "descripton": "Introduction to key concepts in computer systems. Number representations, switching circuits, logic design, microprocessor design, assembly language programming, input/output, interrupts and traps.", "fall": true, "units": " 3"}, {"summer": true, "name": "Introduction to Signals, Circuits and Systems", "prerequisites": "Prerequisite: Cumulative GPA 2.5 or above, C- or better in MA 241 and PY 205.", "spring": true, "number": "ECE  200", "descripton": "Ohm's law and Kirchoff's laws; circuits with resistors, photocells, diodes and LEDs; rectifier circuits; first order RC circuits; periodic signals in time and frequency domains, instantaneous, real and apparent power; DC and RMS value; magnitude andpower spectra, dB, dBW, operational amplifier circuits, analog signal processing systems including amplification, clipping, filtering, addition, multiplication, AM modulation sampling and reconstruction.  Weekly hardware laboratory utilizing multimeter, function generator, oscilloscope and spectrum analyzer and custom hardware for experiments on various circuits and systems.", "fall": true, "units": " 4"}, {"summer": true, "name": "Computer Systems Programming", "prerequisites": "Prerequisite: Grade of C- or better in ECE 109", "spring": true, "number": "ECE  209", "descripton": "Computer systems programming using the C language. Translation of C into assembly language. Introduction to fundamental data structures: array, list, tree, hash table.", "fall": true, "units": " 3"}, {"summer": true, "name": "Electric Circuits", "prerequisites": "Prerequisite: C- or better in ECE 200 and Corequisite: ECE 220", "spring": true, "number": "ECE  211", "descripton": "Introduction to theory, analysis and design of electric circuits. Voltage, current, power, energy, resistance, capacitance, inductance. Kirchhoff's laws node analysis, mesh analysis, Thevenin's  theorem, Norton's theorem, steady state and transient analysis, AC, DC, phasors, operational amplifiers, transfer functions.", "fall": true, "units": " 4"}, {"summer": true, "name": "Fundamentals of Logic Design", "prerequisites": "Prerequisite: C- or better in ECE 109", "spring": true, "number": "ECE  212", "descripton": "Introduction to digital logic design.  Boolean algebra, switching functions, Karnaugh maps, modular combinational circuit design, latches, flip-flops, finite state machines, synchronous sequential circuit design, datapaths, memory technologies, caches, and memory hierarchies. Use of several CAD tools for simulation, logic minimization, synthesis, state assignment, and technology mapping.", "fall": true, "units": " 3"}, {"summer": true, "name": "Analytical Foundations of Electrical and Computer Engineering", "prerequisites": "Prerequisite: C- or better in ECE 200", "spring": true, "number": "ECE  220", "descripton": "This course is designed to acquaint you with the basic mathematical tools used in electrical and computer engineering.  The concepts covered in this course will be used in higher level courses and, more importantly, throughout your career as an engineer.  Major topics of the course include complex numbers, real and complex functions, signal representation, elementary matrix algebra, solutions to linear systems of equations, linear differential equations, laplace transforms used for solving linear differential equations, fourier series and transforms and their uses in solving ECE problems.  EE and CPE Majors Only.", "fall": true, "units": " 3"}, {"summer": true, "name": "Special Topics in Electrical and Computer Engineering", "spring": true, "number": "ECE  292", "descripton": "Special topics in electrical and computer engineering at the early undergraduate level.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Linear Systems", "prerequisites": "Prerequisite: C- or better in ECE 211 and ECE 220.", "spring": true, "number": "ECE  301", "descripton": "Representation and analysis of linear systems using differential equations: impulse response and convolution, Fourier series, and Fourier and Laplace transformations for discrete time and continuous time signals. Emphasis on interpreting system descriptions in terms of transient and steady-state response. Digital signal processing.", "fall": true, "units": " 3"}, {"summer": true, "name": "Microelectronics", "prerequisites": "Prerequisite: A grade of C- or better in ECE 211", "spring": true, "number": "ECE  302", "descripton": "Introduction to the physics of semiconductors, PN Junctions, BJT and MOS field Effect Transistors: Physics of operation, IV characteristics, load line, quiescent point of operation, PSPICE analysis; diode circuit analysis; voltage regulation; Single Stage Transistor Amplifiers: Common Emitter and Common Source configurations, biasing, inverting and non-inverting amplifiers; follower circuits; calculation of small signal voltage gain, current gain, coupling and bypass capacitors; Multistage ac-coupled amplifiers; small signal modeling; input resistance and output resistance; logic inverters.", "fall": true, "units": " 4"}, {"summer": true, "name": "Electromagnetic Fields", "prerequisites": "Prerequisite: A grade of C- of better in ECE 211 and ECE 220", "spring": true, "number": "ECE  303", "descripton": "This course prepared the students to formulate and solve electromagnetic problems relevant to all fields of electrical and computer engineering and that will find application in subsequent courses in RF circuits, photonics, microwaves, wireless networks, computers, bioengineering, and nanoelectronics.  Primary topics include static electric and magnetic fields, Maxwell's equations and force laws, wave propagation, reflection and refraction of plane waves, transient and steady-state behavior of waves on transmission lines. Restriction: EE and CPE Majors Only.", "fall": true, "units": " 3"}, {"summer": false, "name": "Electric Power Systems", "prerequisites": "Prerequisite: C- or better in ECE 211", "spring": true, "number": "ECE  305", "descripton": "Principles, performance and characteristics of power-system components, including direct-current and alternating-current machinery, transformer banks and  transmission lines. Principles and analysis of system power flow.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Embedded Systems", "prerequisites": "Prerequisite: C- or better in ECE 209 and ECE 212", "spring": true, "number": "ECE  306", "descripton": "Introduction to designing microcontroller-based embedded computer systems using assembly and C programs to control input/output peripherals.  Use of embedded operating system.", "fall": true, "units": " 3"}, {"summer": false, "name": "Object-Oriented Programming for Electrical and Computer Engineers", "prerequisites": "Prerequisite: C- or better in ECE 209", "spring": true, "number": "ECE  309", "descripton": "Object-oriented design and programming of complex software. Java programming. Data abstraction and data structures. Programming by contract. Software testing. Interacting classes and interface design. Stream input/output, exceptions. Iterators, recursion, analysis of running time.", "fall": true, "units": " 3"}, {"summer": true, "name": "Principles of Electrical Engineering", "prerequisites": "Prerequisite: MA 241, PY 208", "spring": true, "number": "ECE  331", "descripton": "Concepts, units and methods of analysis in electrical engineering. Analysis of d-c and a-c circuits, characteristics of linear and non-linear electrical devices; principles of operational amplifiers; transformers; motors; and filters.", "fall": true, "units": " 3"}, {"summer": false, "name": "Engineering Profession for Electrical Engineers", "prerequisites": "Prerequisite: ECE 212, ECE 301, and ECE 302", "spring": true, "number": "ECE  380", "descripton": "Introduction to engineering as a profession including issues surrounding electrical engineering. Topics include professional and ethical responsibilities, risks and liabilities, intellectual property, and privacy. Economic issues including entrepreneurship and globalization.", "fall": true, "units": " 1"}, {"summer": false, "name": "Engineering Profession for Computer Engineers", "prerequisites": "Prerequisite: ECE 212, ECE 301, and ECE 302", "spring": true, "number": "ECE  381", "descripton": "Introduction to engineering as a profession including issues surrounding computer engineering. Topics include professional and ethical responsibilities, risks and liabilities, intellectual property, and privacy. Economic issues including entrepreneurship and globalization.", "fall": true, "units": " 1"}, {"summer": false, "name": "Introduction to Entrepreneurship and New Product Development", "spring": true, "number": "ECE  383", "descripton": "This course is part of the Engineering Entrepreneurs Program.  Students work as team members on projects being led by seniors completing their senior capstone design.  Students will be exposed to many areas of product development and will assist in the design and implementation of the prototype product.", "fall": true, "units": " 1"}, {"summer": true, "name": "Communications Engineering", "prerequisites": "Prerequisite: ECE 301, ST 371", "spring": true, "number": "ECE  402", "descripton": "An overview of digital communications for wireline and wireless channels which focuses on reliable data transmission in the presence of bandwidth constraints and noise. The emphasis is on the unifying principles common to all communications systems. Examples include digital telephony, compact discs, high-speed modems and satellite communications.", "fall": true, "units": " 3"}, {"summer": false, "name": "Electronics Engineering", "prerequisites": "Prerequisite: ECE 301, ECE 302", "spring": true, "number": "ECE  403", "descripton": "Design and analysis of discrete and integrated electronic circuits, from single-transistor stages to operational amplifiers, using bipolar and MOS devices. Feedback in operational amplifier circuits, compensation and stability. Laboratory design projects.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Solid-State Devices", "prerequisites": "Prerequisite: ECE 302", "spring": true, "number": "ECE  404", "descripton": "Basic principles required to understand the operation of solid-state devices. Semiconductor  device equations developed from fundamental concepts. P-N junction theory developed and  applied to the analysis of devices such as varactors, detectors, solar cells, bipolar transistors, field-effect transistors. Emphasis on device physics rather than circuit applications.", "fall": true, "units": " 3"}, {"summer": false, "name": "Design of Complex Digital Systems", "prerequisites": "Prerequisite: A grade of C- or better in ECE 212", "spring": true, "number": "ECE  406", "descripton": "Design principles for complex digital systems: Iteration, top-down/bottom-up, divide and conquer, and decomposition. Descriptive techniques, including block diagrams, timing diagrams, register transfer, and hardware-description languages. Consideration of transmission-line effects on digital systems.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Computer Communications", "prerequisites": "Prerequisite: ECE 301", "spring": true, "number": "ECE  407", "descripton": "Engineering principles of computer communications: summary of digital transmission, media and switching; error control, layering concept, overview of protocols; architectures for local, metropolitan, and wide-area networks; emerging issues in digital communications systems.", "fall": true, "units": " 3"}, {"summer": false, "name": "Wireless Communication Systems", "prerequisites": "Prerequisite: ECE 402", "spring": true, "number": "ECE  420", "descripton": "A study of applications of communication theory and signal processing to wireless systems. Topics include an introduction to information theory and coding, basics and channel models for wireless communications, and some important wireless communication techniques including spread-spectrum and OFDM, MATLAB exercises expose students to engineering considerations.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Signal Processing", "prerequisites": "Prerequisite: ECE 301", "spring": true, "number": "ECE  421", "descripton": "Concepts of electrical digital signal processing: Discrete-Time Signals and Systems, Z-Transform, Frequency Analysis of Signals and Systems, Digital Filter Design. Analog-to Digital-to-Analog Conversion, Discrete Fourier Transform. To major design projects.", "fall": true, "units": " 3"}, {"summer": false, "name": "Transmission Lines and Antennas for Wireless", "prerequisites": "Prerequisite: ECE 303", "spring": false, "number": "ECE  422", "descripton": "Review of time-varying electromagnetic theory.  A study of the analytical techniques and the characteristics of several useful transmission lines and antennas.  Examples are coaxial lines, waveguides, microstrip, optical fibers and dipole, monopole and array antennas.", "fall": true, "units": " 3"}, {"summer": false, "name": "Elements of Control", "prerequisites": "Prerequisite: ECE 301", "spring": true, "number": "ECE  435", "descripton": "Analog system dynamics, open- and closed-loop control, block diagrams and signal flow graphs, input-output block diagrams and signal flow graphs, input-output relationships, stability analyses using Routh-Hurwitz, root-locus and Nyquist, time- and frequency-domain analysis and design of analog control systems.  Use of computer-aided analysis and design tools.  Class project.", "fall": true, "units": " 3"}, {"summer": false, "name": "Digital Control Systems", "prerequisites": "Prerequisite: ECE 435", "spring": true, "number": "ECE  436", "descripton": "Discrete systems dynamics, sampled-data systems, mathematical representations of analog/digital and digital/analog conversions, open- and closed-loop systems, input-output relationships, state-space and stability analyses, time- and frequency-domainanalyses. Design and implementation of digital controllers.", "fall": false, "units": " 3"}, {"summer": false, "name": "Integrated Circuit Technology and Fabrication", "prerequisites": "Prerequisite: ECE 404", "spring": false, "number": "ECE  442", "descripton": "Semiconductor device and integrated-circuit processing and technology. Wafer specification and preparation, oxidation, diffusion, ion implantation, photolithography, design rules and measurement techniques.", "fall": true, "units": " 3"}, {"summer": false, "name": "Frontiers of Nanoelectronics", "prerequisites": "Prerequisite: ECE 302", "spring": false, "number": "ECE  445", "descripton": "This course will discuss frontiers of nanoelectronics including fundamentals of silicon based devices and their impact on scaled logic and memory devices as well as organic based devices such as carbon nanotubes and molecular electronics.  Additional topics include recent uses of polymer films for memory and photovoltaic applications, quantum confinements in 1D, 2D, and 3D, quantum dots, nanowires and resonant tunneling devices.  Included are methods to create and measure nanostructures.", "fall": true, "units": " 3"}, {"summer": false, "name": "Power System Analysis", "prerequisites": "Prerequisite: ECE 305", "spring": false, "number": "ECE  451", "descripton": "Long-distance transmission of electric power with emphasis on load flow, economic dispatch, fault calculations and system stability. Applications of digital computers to power-system problems. Major design project.", "fall": true, "units": " 3"}, {"summer": false, "name": "Renewable Electric Energy Systems", "prerequisites": "Prequisite: ECE 305 or ECE 331", "spring": true, "number": "ECE  452", "descripton": "Principles and characteristics of renewable energy based electric power generation technologies such as photovoltaic systems, wind turbines, and fuel cells. Main system design issues. Integration of these energy sources into the power grid. Economics of distributed generation.", "fall": false, "units": " 3"}, {"summer": false, "name": "Electric Motor Drives", "prerequisites": "Prerequisite: A grade of C or better in ECE 305.", "spring": false, "number": "ECE  453", "descripton": "Principles of electromechanical energy conversion; analysis, modeling, and control of electric machinery; steady state performance characteristics of direct-current, induction, synchronous and reluctance machines; scalar control of induction machines; introduction to direct- and quadrature-axis theory; dynamic models of induction and synchronous motors; vector control of induction and synchronous motors.", "fall": true, "units": " 3"}, {"summer": false, "name": "Computer Control of Robots", "prerequisites": "Prerequisite: ECE 435", "spring": true, "number": "ECE  455", "descripton": "Techniques of computer control of industrial robots: interfacing with synchronous hardware including analog/digital and digital/analog converters, interfacing noise problems, control of electric and hydraulic actuators, kinematics and kinetics of  robots, path control, force control, sensing including vision. Major design project.", "fall": false, "units": " 3"}, {"summer": false, "name": "Mechatronics", "prerequisites": "Prerequisite: ECE 435", "spring": false, "number": "ECE  456", "descripton": "The study of electro-mechanical systems controlled by microcomputer technology. The theory, design and construction of smart systems; closely coupled and fully integrated products and systems. The synergistic integration of mechanisms, materials, sensors, interfaces, actuators, microcomputers, controllers, and information technology.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Digital Systems Interfacing", "prerequisites": "Prerequisite: ECE 406", "spring": "True", "number": ")  460", "descripton": "Concepts of microcomputer system architecture and applications to fundamental computer hardware.  Theoretical and practical aspects of interfacing and a variety of microprocessor peripheral chips with specific microprocessor/microcomputer systems from both hardware and software points of view.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Embedded System Design", "prerequisites": "Prerequisite: Grade of C- or better in ECE 306.", "spring": true, "number": "ECE  461", "descripton": "Design and implementation of software for embedded computer systems. The students will learn to design systems using microcontrollers, C and assembly programming, real-time methods, computer architecture, interfacing system development and communication networks. System performance is measured in terms of power consumption, speed and reliability. Efficient methods for project development and testing are emphasized. Credit will not be awarded for both ECE 461 and ECE 561. Restricted to CPE and EE Majors.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Microprocessor Systems Design", "prerequisites": "Prerequisite: ECE 406", "spring": true, "number": "ECE  463", "descripton": "Advanced topics in microprocessor systems design, including processor architectures, virtual-memory systems, multiprocessor systems, and single-chip microcomputers. Architectural examples include a variety of processors of current interest, both commercial and  experimental. Major design project.", "fall": true, "units": " 3"}, {"summer": false, "name": "ASIC Design", "prerequisites": "Prerequisite: ECE 406, ECE 302", "spring": true, "number": "ECE  464", "descripton": "Design of digital application specific integrated circuits (ASICs) based on hardware description languages (Verilog, VHDL) and CAD tools.  Emphasis on design practices and underlying algorithms.  Introduction to deep sub-micron design issues like interconnections and low power and to modern applications  including multi-media, wireless.  Telecommunications and computing.  Required design project.", "fall": false, "units": " 3"}, {"summer": false, "name": "Compiler Optimization and Scheduling", "prerequisites": "Prerequisite: ECE 306 and either ECE 309 or CSC 316", "spring": false, "number": "ECE  466", "descripton": "Provide insight into current compiler designs dealing with present and future generations of high performance processors and embedded systems. Investigate dataflow analysis and memory disambiguation, classical and parallelism enhancing optimizations, scheduling and speculative execution, and register allocation.  Review of techniques used in current research compilers.", "fall": true, "units": " 3"}, {"summer": false, "name": "Internetworking", "prerequisites": "Prerequisite: ECE 407 or CSC 401", "spring": true, "number": "ECE  470", "descripton": "Introduction, Planning and Managing networking projects, networking elements-hardware, software, protocols, applications; TCP/IP, ATM, LAN emulation.  Design and implementation of networks, measuring and assuring network and application performance;metrics, tools, quality of service.  Network-based applications, Network management and security.", "fall": true, "units": " 3"}, {"summer": false, "name": "Senior Design Project in Electrical Engineering", "prerequisites": "Prerequisite: ECE 301, ECE 302, ECE 303, ECE 380, and any two ECE specialization Courses", "spring": true, "number": "ECE  480", "descripton": "Applications of engineering and basic sciences to the total design of electrical engineering circuits and systems. Consideration of the design process including feasibility study, preliminary design detail, cost  effectiveness, along with development and evaluation of a prototype accomplished through  design-team project activity. Complete written and oral engineering report required.", "fall": true, "units": " 3"}, {"summer": false, "name": "Senior Design Project in Computer Engineering", "prerequisites": "Prerequisite: ECE 381, ECE 301, ECE 302, ECE 303, ECE 406 and an ECE specialization elective", "spring": true, "number": "ECE  481", "descripton": "Application of engineering and basic sciences to the total design of computer engineering circuits and systems. Consideration of the design process including feasibility study, preliminary design detail, cost effectiveness, along with development and evaluation of a prototype accomplished through design-team project activity. Complete written and oral engineering report required.", "fall": true, "units": " 3"}, {"summer": false, "name": "Engineering Entrepreneurship and New Product Development I", "spring": true, "number": "ECE  482", "descripton": "Applications of engineering, mathematics, basic sciences, finance, and business to the design and development of prototype engineering products.  This course requires a complete written report and an end-of-course presentation.  This is the first course in a two semester sequence.  Students taking this course will implement their designed prototype in ECE 483: Senior Design Project in Electrical Engineering and Computer Engineering II-Engineering Entrepreneurs.  Departmental approval required.", "fall": true, "units": " 3"}, {"summer": false, "name": "Engineering Entrepreneurship and New Product Development II", "prerequisites": "Prerequisite: ECE 301, ECE 302, ECE 303, and any two ECE specialization courses", "spring": true, "number": "ECE  483", "descripton": "Applications of engineering, science, management and entrepreneurship to the design, development and prototyping of new product ideas.  Based on their own new product ideas, or those of others, students form and lead entrepreneurship teams (eTeams) to prototype these ideas.  The students run their eTeams as 'virtual' startup companies where the seniors take on the executive roles.  Joining them are students from other grade levels and disciplines throughout the university that agree to participate as eTeam members.  Departmental approval required.", "fall": true, "units": " 3"}, {"summer": false, "name": "Special Topics in Electrical and Computer Engineering", "spring": true, "number": "ECE  492", "descripton": "Offered as needed for development of new courses in electrical and computer engineering.", "fall": true, "units": " 1-4"}, {"summer": false, "name": "Architecture Of Parallel Computers", "prerequisites": "Prerequisite: ECE 406", "spring": true, "number": ")  506", "descripton": "The need for parallel and massively parallel computers.  Taxonomy of parallel computer architecture, and programming models for parallel architectures.  Example parallel algorithms.  Shared-memory vs. distributed-memory architectures.  Correctness and performance issues.  Cache coherence and memory consistency.  Bus-based and scalable directory-based multiprocessors.  Interconnection-network topologies and switch design.  Brief overview of advanced topics such as multiprocessor prefetching and speculative parallel execution.", "fall": true, "units": " 3"}, {"summer": false, "name": "Analog Electronics", "prerequisites": "Prerequisite: ECE403", "spring": false, "number": "ECE  511", "descripton": "Analog integrated circuits and analog integrated circuit design techniques. Review of basic device and technology issues Comprehensive coverage of MOS and Bipolar operational amplifiers. Brief coverage of analog-to-digital conversion techniques and switched-capacitor filters. Strong emphasis on use of computer modeling and simulation as design tool. Students required to complete an independent design project.", "fall": true, "units": " 3"}, {"summer": false, "name": "Digital Signal Processing", "prerequisites": "Prerequisite: ECE 421, B average in ECE and MA; Signals and Linear Systems", "spring": false, "number": "ECE  513", "descripton": "Digital processing of analog signals. Offline and real-time processing for parameter, waveshape and spectrum estimation. Digital filtering and applications in speech, sonar, radar, data processing and two-dimensional filtering and image processing.", "fall": true, "units": " 3"}, {"summer": false, "name": "Random Processes", "prerequisites": "Prerequisite: Statistics 371; Signals and Linear Systems; Linear Algebra; Calculus", "spring": false, "number": "ECE  514", "descripton": "Probabilistic descriptions of signals and noise, including joint, marginal and conditional densities, autocorrelation, cross-correlation and power spectral density. Linear and nonlinear transformations. Linear least-squares estimation. Signal detection.", "fall": true, "units": " 3"}, {"summer": false, "name": "Digital Communications", "prerequisites": "Prerequisite: ECE 514, ST 371, Signals and Linear Systems; Linear Algebra", "spring": true, "number": "ECE  515", "descripton": "This course is a first graduate-level course in digital communications.  Functions and interdependence of various components of digital communication systems will be discussed.  Statistical channel modeling, modulation and demodulation techniques, optimal receiver design, performance analysis methods, source coding, quantization, and fundamentals of information theory will be covered in this course.", "fall": false, "units": " 3"}, {"summer": false, "name": "System Control Engineering", "prerequisites": "Prerequisite: ECE 435 or ECE 301", "spring": false, "number": "ECE  516", "descripton": "Introduction to analysis and design of continuous and discrete-time dynamical control systems. Emphasis on linear, single-input, single-output systems using state variable and transfer function methods. Open and closed-loop representation; analog and digital simulation; time and frequency response; stability by Routh-Hurwitz, Nyquist and Liapunov methods; performance specifications; cascade and state variable compensation. Assignments utilize computer-aided analysis and design programs.", "fall": true, "units": " 3"}, {"summer": false, "name": "Object-Oriented Languages and Systems", "prerequisites": "Prerequisite: CSC 316, Data Structures for Computer Scientists.", "spring": false, "number": ")  517", "descripton": "Object-oriented languages and systems built with object-oriented software components. Object-oriented design methodologies, such as CRC cards and the Unified Modeling Language (UML).  Requirement analysis.  Design patterns.  Agile methods.  Object-oriented programming environments, such as the Eclipse platform.  Platforms for Web services, such as J2EE.  Project required.", "fall": true, "units": " 3"}, {"summer": false, "name": "Digital Asic Design", "prerequisites": "Prerequisite: ECE 212 and Senior or Graduate standing", "spring": true, "number": "ECE  520", "descripton": "Design of digital Application Specific Integrated Circuits (ASICs) based on Hardware Description Languages (Verilog, VHDL) and CAD tools, particularly login synthesis. Emphasis on design practices and underlying algorithms. Introduction to timing-driven design, low-power design, design-for-test and ASIC applications. Project.", "fall": false, "units": " 3"}, {"summer": false, "name": "Computer Design and Technology", "prerequisites": "Prerequisite: ECE 306", "spring": true, "number": "ECE  521", "descripton": "Design of general-purpose computers through cost-performance analysis. Emphasis on making design decisions regarding the instruction set architecture and organization of single-processor computer. Discussion of design choices, role of compiler and techniques for analysis, simulation and implementation. Consideration of relationships between architecture, organization and technology", "fall": false, "units": " 3"}, {"summer": false, "name": "Medical Instrumentation", "spring": false, "number": ")  522", "descripton": "Fundamentals of medical instrumentation systems, sensors, and biomedical signal processing. Example instruments for cardiovascular and respiratory assessment. Clinical laboratory measurements, theraputic and prosthetic devices, and electrical safetyrequirements. Students should have background in electronics design using operational amplifiers.", "fall": true, "units": " 3"}, {"summer": false, "name": "Photonics and Optical Communications", "prerequisites": "Prerequisite: Graduate standing or Senior standing ; Engineering Majors or Physics Majors", "spring": true, "number": "ECE  523", "descripton": "This course investigates photonic devices at the component level and examines the generation, propagation and detection of light in the context of optical communication systems. Topics include planar and cylindrical optical waveguides, LEDs, lasers,optical amplifiers, integrated optical and photodetectors, design tradeoffs for optical systems, passive optical networks, and wavelength division multiplexed systems.", "fall": false, "units": " 3"}, {"summer": false, "name": "Physical Electronics", "prerequisites": "Prerequisite: ECE 303, B average in ECE and MA", "spring": false, "number": "ECE  530", "descripton": "Properties of charged particles under influence of fields and in solid materials. Quantum mechanics, particle statistics, semi-conductor properties, fundamental particle transport properties, p-n junctions.", "fall": true, "units": " 3"}, {"summer": false, "name": "Principles Of Transistor Devices", "prerequisites": "Prerequisite: ECE 404", "spring": true, "number": "ECE  531", "descripton": "Analysis of operating principles of transistor structures. Basic semi-conductor physics reviewed and used to provide explanation of transistor characteristics. Development and usage of device-equivalent circuits to interpret semi-conductor-imposed limitations on device performance. Devices analyzed include MISFIT'S, HEMT'S, Bipolar transistors, PBT'S, heterojunction BJT'S and SIT's.", "fall": false, "units": " 3"}, {"summer": false, "name": "Principles Of Microwave Circuits", "prerequisites": "Prerequisite: ECE 422", "spring": false, "number": "ECE  532", "descripton": "Principles required to understand behavior of electronic circuits operating at microwave frequencies. Review of elector-magnetic theory and establishing an understanding of techniques required for working with electronic circuits at microwave and millimeter-wave frequencies. Discussion of circuit components operating at these frequencies.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Power Electronics", "prerequisites": "Prerequisite: ECE 302", "spring": "True", "number": "ECE  534", "descripton": "DC and AC analysis of isolated and non-isolated switch mode power supply.  Basic converter topologies covered include: buck, boost and buck/boost and their transformer-couples derivatives.  Design of close loop of these DC/DC converters.  Power devices and their applications in DC/DC converters.  Inductor and transformer design.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Design of Electromechanical Systems", "prerequisites": "Prerequisite: MA 341", "spring": false, "number": ")  535", "descripton": "A practical introduction to electromechanical systems with emphasis on modeling, analysis, design, and control techniques.  Provides theory and practical tools for the design of electric machines (standard motors, linear actuators, magnetic bearings, etc).  Involves some self-directed laboratory work and culuminates in an industrial design project.  Topics include Maxwell's equations, electromechanical energy conversion, finite element analysis, design and control techniques.", "fall": true, "units": " 3"}, {"summer": false, "name": "Digital Control Systems", "prerequisites": "Prerequisite: ECE 435 and Graduate Standing in Engineering", "spring": false, "number": ")  536", "descripton": "Discrete system dynamics, sampled-data systems, mathematical representations of analog/digital and digital/analog conversions, open- and -closed-loop systems, input-output relationships, state-space and stability analyses, time and frequency domain analysis with emphasis on time domain.  Design and implementation of digital controllers.  Design project including hardware implementation.", "fall": true, "units": " 3"}, {"summer": false, "name": "Integrated Circuits Technology and Fabrication", "prerequisites": "Prerequisite: ECE 404", "spring": false, "number": "ECE  538", "descripton": "Processes used in fabrication of modern integrated circuits. Process steps for crystal growth, oxidation, diffusion, ion implantation, lithography, chemical vapor deposition, etching, metallization, layout and packaging. Process integration for MOS and biopolar processes. Characterization techniques, simulation, yield and reliability.", "fall": true, "units": " 3"}, {"summer": false, "name": "Electromagnetic Fields", "prerequisites": "Prerequisite: ECE 422", "spring": true, "number": "ECE  540", "descripton": "Brief review of Maxwell's Equations, constitutive relations and boundary conditions. Reflection and refraction of plane waves; power and energy relations in isotropic media. Potential functions, Green's functions and their applications to radiation and scattering. Antenna fundamentals: linear antennas, uniform linear arrays and aperture antennas, microstrip antennas.  Fundamentals of numerical methods for electromagnetic simulation and antenna design.", "fall": false, "units": " 3"}, {"summer": false, "name": "Neural Networks", "spring": true, "number": "ECE  542", "descripton": "Introduction to neural networks and other basic machine learning methods including radial basis functions, kernel methods, support vector machines. The course introduces regularization theory and principle component analysis. The relationships to filtering, pattern recognition and estimation theory are emphasized.", "fall": false, "units": " 3"}, {"summer": false, "name": "Design Of Electronic Packaging and Interconnects", "prerequisites": "Prerequisite: ECE 302", "spring": true, "number": "ECE  544", "descripton": "A study of the design of digital and mixed signal interconnect and packaging.  Topics covered include: Single chip (surface mount and through-hole) and multi-chip module packaging thecnology; packaging techology selection; thermal design; electricaldesign of printed circuit board, backplane and multi-chip module interconnect; receiver and driver selection; EMI control; CAD tools; and measurement issues.", "fall": false, "units": " 3"}, {"summer": false, "name": "VLSI Systems Design", "prerequisites": "Prerequisite: ECE 302", "spring": false, "number": "ECE  546", "descripton": "Digital systems design in CMOS VLSI technology: CMOS devise physics, fabrication, primitive components, design and layout methodology, integrated system architectures, timing, testing future trends of VLSI technology.", "fall": true, "units": " 3"}, {"summer": false, "name": "RF Design for Wireless", "prerequisites": "Prerequisite: ECE 303, ECE 302", "spring": true, "number": "ECE  549", "descripton": "Design of the hardware aspects of wireless systems with principle emphasis on design of radio frequency (RF) and microwave circuitry.  Introduction of system concepts then functional block design of a wireless system.  RF and microwave transistors, noise, power ampliefiers, CAE, linearization and antennas.", "fall": false, "units": " 3"}, {"summer": false, "name": "Power System Operation and Control", "prerequisites": "Prerequisite: ECE 305, ECE 435", "spring": false, "number": "ECE  550", "descripton": "Fundamental concepts of economic operation and control of power systems. Real and reactive power balance. System components, characteristics and operation. Steady state and dynamic analysis of interconnected systems. Tieline power and load-frequencycontrol with integrated economic dispatch.", "fall": true, "units": " 3"}, {"summer": false, "name": "Renewable Electric Energy Systems", "prerequisites": "Prequisite: ECE 305 or ECE 331", "spring": true, "number": "ECE  552", "descripton": "Principles and characteristics of renewable energy based electric power generation technologies such as photovoltaic systems, wind turbines, and fuel cells. Main system design issues. Integration of these energy sources into the power grid. Economics of distributed generation.", "fall": false, "units": " 3"}, {"summer": false, "name": "Semiconductor Power Devices", "prerequisites": "Prerequisite: ECE 404", "spring": true, "number": "ECE  553", "descripton": "The operational physics and design concepts for power semiconductor devices.  Relevant transport properties of semiconductors.  Design of breakdown voltage and edge terminations.  Analysis of Schottky rectifiers, P-i-N rectifiers, Power MOSFETs, Bipolar Transistors, Thyristors and Insulated Gate Bipolar Transistors.", "fall": false, "units": " 3"}, {"summer": false, "name": "Computer Control of Robots", "prerequisites": "Prerequisite: ECE 435; ECE 436; ECE 456", "spring": true, "number": "ECE  555", "descripton": "An introduction to robotics: history and background, design, industrial applications and usage.  Manipulator sensors, actuators and control, linear, non-linear, and force control.  Manipulator kinematics: position and orientation, frame assignment, transformations, forward and inverse kinematics.  Jacobian: velocities and static forces.  Manipulator Kinetics: velocity, acceleration, force.  Trajectory generation.  Programming languages: manipulator level, task level, and object level.  Introduction to advanced robotics. Credit not allowed for both ECE 455 and 555.", "fall": false, "units": " 3"}, {"summer": false, "name": "Agent-based Mechatronics Systems", "prerequisites": "Prerequisite: ECE 301", "spring": false, "number": "ECE  556", "descripton": "Agent and systems concepts to study sensors, actuators, controllers and communication networks, as well as their interactions. Theory, design and control of the integration of sensors, interfaces, actuators, microcontrollers. Use of computer networks as communication media in the mechatronics systems integration and control. Use of unmanned vehicle path tracking and teleoperation to illustrate the mechatronics agent and system concept and integration. Students can either take ECE 456 or ECE 556, but not both. These two courses are piggy-backed and cover similar material, yet ECE 556 has more demanding homeworks, project, and an exam that are at the graduate level.", "fall": true, "units": " 3"}, {"summer": false, "name": "Principles Of MOS Transistors", "prerequisites": "Prerequisite: ECE 404", "spring": false, "number": "ECE  557", "descripton": "MOS capacitor and transistor regions of operation.  Depletion and enhancement mode MOSFETs.  MOSFET scaling, short and narrow channel effects.  MOSFETs with ion-implanted channels.  High field effects in MOSFETs with emphasis on recent advances in design of hit carrier suppressed structures.  Small and large signal MOSFET models.  State of the art in MOS process integration.", "fall": true, "units": " 3"}, {"summer": false, "name": "Digital Imaging Systems", "prerequisites": "Prerequisites: ECE 301 and ST 372", "spring": false, "number": "ECE  558", "descripton": "Foundation for designing and using digital devices to accurately capture and display color images, spatial sampling, frequency analysis, quantization and noise characterization of images. Basics of color science are presented and applied to image capture and output devices.", "fall": true, "units": " 3"}, {"summer": false, "name": "Embedded System Design", "prerequisites": "Prerequisite: ECE 306", "spring": true, "number": "ECE  561", "descripton": "Design and implementation of embedded computer systems.  The student will extend previous knowledge of the use of microcontrollers, C and assembly programming, real-time methods, computer architecture, simulation, interfacing, system development andcommunication networks.  System performance is measured in terms of power consumption, speed and reliabiity.  Efficient methods for project development and testing are emphasized.", "fall": false, "units": " 3"}, {"summer": false, "name": "Code Generation and Optimization", "prerequisites": "Prerequisite: ECE 306 and CSC 316", "spring": true, "number": "ECE  566", "descripton": "Provide insight into current compiler designs dealing with present and future generations of high performance processors and embedded systems. Investigate dataflow analysis and memory disambiguation, classical and parallelism enhancing optimizations, scheduling and speculative execution, and register allocation. Review of techniques used in current research compilers. Students may not take both 466 and 566 for credit.", "fall": false, "units": " 3"}, {"summer": false, "name": "Computer Networks", "prerequisites": "Prerequisite: ECE 206 or CSC 312, ST 371, CSC 258 and Senior standing or Graduate standing", "spring": true, "number": ")  570", "descripton": "General introduction to computer networks.  Discussion of protocol principles, local area and wide area networking, OSI stack, TCP/IP and quality of service principles.  Detailed discussion of topics in medium access control, error control coding, and flow control mechanisms.  Introduction to networking simulation, security, wireless and optical networking.", "fall": true, "units": " 3"}, {"summer": false, "name": "Internet Protocols", "prerequisites": "Prerequisite: CSC/ECE 570", "spring": false, "number": ")  573", "descripton": "Principles and issues underlying provision of wide area connectivity through interconnection of autonomous networks.  Internet architecture and protocols today and likely evolution in future.  Case studies of particular protocols to demonstrate how fundamental principles applied in practice.  Selected examples of networked clinet/server applications to motivate the functional requirements of internetworking.  Project required.", "fall": true, "units": " 3"}, {"summer": false, "name": "Computer and Network Security", "prerequisites": "Prerequisite: (CSC 316) and (CSC 401 or CSC/ECE 570)", "spring": true, "number": ")  574", "descripton": "Security policies, models, and mechanisms for secrecy, integrity, and availability. Basic cryptography and its applications; operating system models and mechanisms for mandatory and discretionary controls; introduction to database security; securityin distributed systems; network security (firewalls, IPsec, and SSL); and control and prevention of viruses and other rogue programs.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Wireless Networking", "prerequisites": "Prerequisite: ECE/CSC 570", "spring": true, "number": ")  575", "descripton": "Introduction to cellular communications, wireless local area networks, ad-hoc and IP infrastructures. Topics include: cellular networks, mobility mannagement, connection admission control algorithms, mobility models, wireless IP networks, ad-hoc routing, sensor networks, quality of service, and wireless security.", "fall": false, "units": " 3"}, {"summer": false, "name": "Networking Services: QoS, Signaling, Processes", "prerequisites": "Prerequisite: CSC/ECE 570", "spring": true, "number": ")  576", "descripton": "Topics related to networking services, signaling for setting up networking services, such as SIP and IMS, networking architectures for providing QoS for networking services, such as MPLS, DiffServ and RAC, signaling protocols for setting up QoS connections in the transport stratum, such as LDP and RSVP-TE, video-based communications, and capacity planning models for dimensioning services.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Computer Performance Modeling", "prerequisites": "Prerequisite: CSC 312 and MA 421", "spring": false, "number": ")  579", "descripton": "Workload characterization, collection and analysis of performance data, instrumentation, tuning, analytic models including queuing network models and operational analysis, economic considerations.", "fall": true, "units": " 3"}, {"summer": false, "name": "Wireless Communication Systems", "prerequisites": "Prerequisite: Senior level digital communications course, e.g., ECE402, Corequisite: ECE 714", "spring": false, "number": "ECE  582", "descripton": "Theory and analysis of wireless portable communication systems.  Provides a fundamental understanding of the unique characteristics of these systems.  Topics include: Code Division Multiple Access (CDMA), mobile radio propagation, characterization of a Rayleigh fading multipathchannel, diversity techniques, adaptive equalization, channel coding, and modulation/demodulation techniques.  Although contemporary cellular and personal communication services(PCS) standards are covered, the course stresses fundamental theoretical concepts that are not tied to a particular standard.", "fall": true, "units": " 3"}, {"summer": false, "name": "Special Topics In Electrical Engineering", "prerequisites": "Prerequisite: B average in technical subjects", "spring": true, "number": "ECE  591", "descripton": "Two-semester sequence to develop new courses and to allow qualified students to explore areas of special interest.", "fall": true, "units": " 3"}, {"summer": false, "name": "Special Topics In Electrical Engineering", "prerequisites": "Prerequisite: B average in technical subjects", "spring": true, "number": "ECE  592", "descripton": "Two-semester sequence to develop new courses and to allow qualified students to explore areas of special interest.", "fall": true, "units": " 3"}, {"summer": false, "name": "ECE Graduate Orientation", "spring": false, "number": "ECE  600", "descripton": "Introduction of the Electrical and Computer Engineering Department graduate program.  Introduction to computing and library facilities; Review of NC State student code of conduct and ethics.  Structure of the ECE department.  General information forstarting graduate studies.  Overview of on-going research projects by faculty members.  Must hold graduate standing.", "fall": true, "units": " 1"}, {"summer": false, "name": "Individual Topics In Electrical Engineering", "prerequisites": "Prerequisite: B average in technical subjects", "spring": true, "number": "ECE  633", "descripton": "Provision of opportunity for individual students to explore topics of special interest under direction of a member of faculty.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Individual Studies In Electrical Engineering", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "ECE  634", "descripton": "The study of advanced topics of special interest to individual students under direction of faculty members.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ECE  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ECE  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ECE  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Master's Exam", "spring": "True", "number": "ECE  690", "fall": "True", "units": " 1-6"}, {"summer": false, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ECE  693", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ECE  695", "descripton": "Thesis research.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "ECE  696", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ECE  699", "descripton": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Integrated Bioelectronic Circuits", "prerequisites": "Prerequisite: ECE 511, ECE 546", "spring": false, "number": "ECE  703", "descripton": "Analog and mixed-signal integrated circuits in design of biomedical applications; detailed discussion of circuit blocks such as voltage and current references, current sources, amplifiers, regulators, filters, switched capacitor circuits, A/D, and D/A converters, as well as low-power, low-noise, and wireless circuit design techniques with emphasis on biomedical applications. Research project and presentation required.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Memory Systems", "prerequisites": "Prerequisite: ECE 521, Computer Design and Technology", "spring": "True", "number": "ECE  705", "descripton": "Covers recent research on overcoming the problem of memory access and memory speed, two major limitations on the speed of computers. Overview of the current state of memory technologies, novel cache structures and management techniques, prefetching,memory compression, and parallelism at the instruction and thread levels. Research papers required.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Advanced Parallel Computer Architecture", "prerequisites": "Prerequisite: ECE/CSC 506, ECE 521", "spring": true, "number": "ECE  706", "descripton": "Advanced topics in parallel computer architecture. Hardware mechanisms for scalable cache coherence, synchronization, and speculation.  Scalable systems and interconnection networks.  Design or research project required.", "fall": false, "units": " 3"}, {"summer": false, "name": "Integrated Circuit Design for Wireless Communications", "prerequisites": "Prerequisite: ECE 511", "spring": true, "number": "ECE  712", "descripton": "Analysis, simulation, and design of the key building blocks of an integrated radio: amplifiers, mixers, and oscillators.  Topics include detailed noise optimization and linearity performance of high frequency integrated circuits for receivers and transmitters.  Introduction to several important topics of radio design such as phase-locked loops, filters and large-signal amplifiers.  Use of advanced RF integrated circuit simulation tools such as SpectreRF or ADS for class assignments.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Computer-Aided Circuit Analysis", "prerequisites": "Prerequisite: ECE 511", "spring": "True", "number": "ECE  718", "descripton": "Steady state and transient analysis of circuits with emphasis on circuit theory and computer methods. Consideration of many analysis techniques, including linear nodal, signal flow graph, state equation, time-domain and functional simulation and analysis of sampled data systems. Sensitivity and tolerance analysis, macromodeling of large circuits and nonlinear circuit theory.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Microwave Circuit Design Using Scattering Parameters", "prerequisites": "Prerequisite: ECE 540, ECE 549", "spring": true, "number": "ECE  719", "descripton": "Development and examination of techniques for design of microwave and millimeterwave components and systems. Specific topics include mixer, oscillator and amplifier performance and design.  This course will focus on the use of S-parameters to aid inthe design of circuits used in mm-wave and microwave circuits.  Emphasis will be made on the microwave/mm-wave properties of transistors, matching networks and how these properties are utlized for design for noise, power, mixer or oscillator performance.  Computer aided design techniques will be addressed.", "fall": false, "units": " 3"}, {"summer": false, "name": "Electronic System Level and Physical Design", "prerequisites": "Prerequisite: ECE 520", "spring": true, "number": "ECE  720", "descripton": "Study of transaction-level modeling of digital systems-on-chip using SystemC.  Simulation and analysis of performance in systems with distributed control.  Synthesis of digital hardware from high-level descriptions.  Physical design methodologies, including placement, routing, clock-tree insertion, timing, and power analysis.  Significant project to design a core at system and physical levels.  Knowledge of object-oriented programming with C and register-transfer-level design with verilog or VHDL is required.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Microarchitecture", "prerequisites": "Prerequisite: ECE 521", "spring": false, "number": "ECE  721", "descripton": "Survey of advanced computer microarchitecture concepts.  Modern superscalar microarchitecture, complexity-effective processors, multithreading, advanced speculation techniques, fault-tolerant microarchitectures, power and energy management, impact of new technology on microarchitecture.  Students build on a complex simulator which is the basis for independent research projects.", "fall": true, "units": " 3"}, {"summer": false, "name": "Electronic Properties of Solid-State Materials", "prerequisites": "Prerequisite: ECE 530", "spring": false, "number": "ECE  722", "descripton": "Materials and device-related electronic properties of semiconductors. Included topics: energy band structure, electrical and thermal transport phenomena, scattering processes, localized energy states, equilibrium and non-equilibrium semiconductor statistics.", "fall": true, "units": " 3"}, {"summer": false, "name": "Optical Properties Of Semiconductors", "prerequisites": "Prerequisite: ECE 530", "spring": true, "number": "ECE  723", "descripton": "Materials and device-related properties of compound optical semiconductors. Included topics: band structure, heterojunctions and quantum wells, optical constants, waveguides and optical cavities, absorption and emission processes in semiconductors, photodetectors, light emitting diodes, semiconductor lasers.", "fall": false, "units": " 3"}, {"summer": false, "name": "Electronic Properties Of Solid-State Devices", "prerequisites": "Prerequisite: ECE 530", "spring": true, "number": "ECE  724", "descripton": "Basic physical phenomena responsible for operation of solids-state devices. Examination and utilization of semiconductor transport equations to explain principles of device operation. Various solid-state electronics devices studied in detail.", "fall": false, "units": " 3"}, {"summer": false, "name": "Quantum Engineering", "prerequisites": "Prerequisite: ECE 530, and PY 401", "spring": true, "number": "ECE  725", "descripton": "Development of advanced engineering concepts at the quantum level relevant to nanoscience, nanoelectronics, and quantum photonics.  Topics include tunneling phenomena, specifics of time dependent and time independent perturbation methodology for addressing applications under consideration, including the WKB approach, and an introduction to second quantization for engineers.  Applications include, but are not limited to, tunneling in a two-level system, molecular rotation through excitation, field emission, van der Waal interactions, optical absorption in quantum wells, and electron transport through model molecules.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Feedback Control", "prerequisites": "Prerequisite: ECE 516", "spring": true, "number": "ECE  726", "descripton": "Advanced topics in dynamical systems and multivariable control. Current research and recent developments in the field.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Semiconductor Thin Film Technology", "prerequisites": "Prerequisite: ECE 404", "spring": "True", "number": ")  727", "descripton": "Techniques and processes encountered in growth and characterization of epitaxial semiconductor thin films. Interactions of gases at solid interfaces and gas phase dynamics related to epitaxial processes. Example of growth techniques are: solution growth, molecular beam epitaxy and chemical vapor deposition. Film characterization includes electrical, structural, optical, and chemical techniques. Issues involved in epitaxial growth such as: lattice match, critical layer thickness, heterostructures, superlattices and quantum wells.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Dynamics and Control of Electric Machines", "prerequisites": "Prerequisite: (ECE 453 or 592) and MA 501", "spring": false, "number": "ECE  732", "descripton": "Dynamic behavior of AC electric machines and drive systems; theory of field orientation and vector control for high performance induction and synchronous machines; permanent magnet and reluctance machines and their control; principles of voltage source and current source inverters, and voltage and current regulation methods.", "fall": true, "units": " 3"}, {"summer": false, "name": "Digital Electronics", "prerequisites": "Prerequisite: ECE 546", "spring": true, "number": "ECE  733", "descripton": "In-depth study of digital circuits at the transistor level.  Topics include fundamentals; high speed circuit design; low-power design; RAM; digital transceivers; clock distribution; clock and data recovery; circuits based on emergining devices. Project.", "fall": false, "units": " 3"}, {"summer": false, "name": "Power Management Integrated Circuits", "prerequisites": "Prerequisite: ECE 511 and ECE 534", "spring": true, "number": "ECE  734", "descripton": "Review of modern power management converters and circuits; Review modeling and control of converters; Detail discussion of voltage and current mode controllers; Understanding of power converter losses and optimization method, as well as management of power; Integrated circuit design of various power management chips.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Power System Stability and Control", "prerequisites": "Prerequisite: ECE 451 and ECE 750", "spring": "True", "number": "ECE  736", "descripton": "Principles of FACTS (flexible AC transmission systems) and their applications.  Power transmission on an AC system.  Power system models for steady-state and dynamic analysis.  Power system transient analysis for stability assessment.  Voltage phenomena and methods for assessment.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Integrated Circuits Technology and Fabrication Laboratory", "prerequisites": "Prerequisite: ECE 538", "spring": true, "number": "ECE  739", "descripton": "An integrated circuit laboratory to serve as a companion to ECE 538. Hands-on experience in semiconductor fabrication laboratory. Topics include: techniques used to fabricate and electrically test discrete semiconductor devices, the effects of process variations on measurable parameters.", "fall": false, "units": " 3"}, {"summer": false, "name": "High Performance Multicomputer Architecture", "prerequisites": "Prerequisite: ECE 506", "spring": false, "number": "ECE  743", "descripton": "Cray T3D, nCUBE3, VPP500, Paragon, Cenju-3, SP2, Dataflow, K-2, DASH, Reconfigurable Mesh, Superpipeline-Superscalar, Hierarchical MIN, Cache for Vector Oricessubgm generalized hypercube, Hierarchical networks, Wormhole routing, neurocomputers, earth and space applications, seminars.", "fall": true, "units": " 3"}, {"summer": false, "name": "ASIC Verification", "prerequisites": "Prerequisite: ECE 520", "spring": false, "number": "ECE  745", "descripton": "This course covers the verification process used in validating the functional correctness in today's complex ASICs (application specific integrated circuits). Topics include the fundamentals of simulation based functional verification, stimulus generation, results checking, coverage, debug, and formal verification. Provides the students with real world verification problems to allow them to apply what they learn.", "fall": true, "units": " 3"}, {"summer": false, "name": "Digital Signal Processing Architecture", "prerequisites": "Prerequisite: ECE 513, Corequisite: ECE 520", "spring": true, "number": "ECE  747", "descripton": "Design of parallel algorithms and special purpose architectures for digital signal and image processing applications with emphasis on high-speed communications and computational engineering. Mapping digital signal and image processing algorithms to pipeline arrays, systolic arrays, wave-front arrays and other parallel architectures. Register transfer level design of application-specific and special-purpose digital processing systems.", "fall": false, "units": " 3"}, {"summer": false, "name": "Detection and Estimation Theory", "prerequisites": "Prerequisite: ECE 514, ECE 421", "spring": true, "number": "ECE  751", "descripton": "Methods of detection and estimation theory as applied to communications, speech and image processing. Statistical description of signals and representation in time, spatial and frequency domains; Baysian methods, including Wiener, Kalman and MAP filters; performance measures; applications to both continuous and discrete systems.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Information Theory", "prerequisites": "Prerequisite: ECE 514: Random Processes", "spring": "True", "number": "ECE  752", "descripton": "An overview of Shannon's theory of information, which establishes fundamental limits on the performance of data compression and quantization algorithms, communication systems, and detection and estimation algorithms. Topics include information measures and their properties, information source models, lossless data compression, channel coding and capacity, information theory and statistics, and rate-distortion theory. Applications of information theory will also be discussed, including Lempel-Ziv data compression, vector quantization, error-correcting codes, satellite communications and high-speed modems.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Advanced Robotics", "prerequisites": "Prerequisite: ECE 555; MAE 544", "spring": false, "number": "ECE  755", "descripton": "Advanced robotics at its highest level of abstraction; the level of synthesizing human reasoning and behavior.  Advanced tobotics deals with the intelligent connection of perception to action.  At this level the subject requires knowledge of sensing(computer vision, tactile, sonar), and reasoning (artifical intelligence: machine learning, planning, world modeling).  The advanced robotics course will be valuable for students who wish to work in the area.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Mechatronics", "prerequisites": "Prerequisite: ECE 556", "spring": true, "number": "ECE  756", "descripton": "A project-oriented course focusin on the design, analysis, and implementation of advanced mechatronics technologies, including large-scale distributed sensors, distributed-actuators, and distributed-controllers connected via communication networks.Will use unmanned vehicles as the project platform, with applications from sensors, actuators, network-based controllers, cameras, and microcontrollers.  ECE 516 is recommended.", "fall": false, "units": " 3"}, {"summer": false, "name": "Pattern Recognition", "prerequisites": "Prerequisite: ECE(CSC) 514, ST 371, B average in ECE and MA", "spring": true, "number": "ECE  759", "descripton": "Image pattern recognition techniques and computer-based methods for scene analysis, including discriminate functions, fixture extraction, classification strategies, clustering and discriminant analysis. Coverage of applications and current research results.", "fall": false, "units": " 3"}, {"summer": false, "name": "Design Automation For VLSI", "prerequisites": "Prerequisite: ECE 546 VLSI Systems Design", "spring": true, "number": "ECE  761", "descripton": "VLSI CAD (computer-aids-to-design) tools research: physical design automation--layout, module generator, silicon compiler; optimization techniques: graph theory, simulated evolution, simulated annealing.  Projects required.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Digital Communications Systems", "prerequisites": "Prerequisite: ECE 515", "spring": false, "number": "ECE  762", "descripton": "An advanced graduate-level course in digital communications.  Topics include signal design, equalization methods and synchronization techniques for realistic communication channels.  Projects concentrate on literature review and computer simulations.", "fall": true, "units": " 3"}, {"summer": false, "name": "Computer Vision", "prerequisites": "Prerequisite: ECE 558 and ECE 514", "spring": true, "number": "ECE  763", "descripton": "Analysis of images by computers. Specific attention given to analysis of the geometric features of objects in images, such as region size, connectedness and topology. Topics include: segmentation, template matching, motion analysis, boundary detection, region growing, shape representation, 3-D object recognition including graph matching.", "fall": false, "units": " 3"}, {"summer": false, "name": "Wireless Communications: Signal Processing Principles", "prerequisites": "Prerequisite: ECE 514, ECE 515", "spring": true, "number": "ECE  766", "descripton": "This course will treat the signal processing principles that underlie the advances in new wireless systems. Topics include: basic principles of radio communications (digital modulation; compression of speech; images and video; physical channel characteristics, multiple-access techniques and wireless networking); current and emerging wireless technologies (3G wideband CDMA, OFDM, wireless LANs, etc.); multiuser detection and interference supression; transmit diversity and beamforming; smart antennas and turbo space-time multiuser detection; and topics in MIMO systems.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Error-Control Coding", "prerequisites": "Prerequisite: ECE 514 Random Processes; linear algebra at the undergraduate level is strongly recommended", "spring": "True", "number": "ECE  767", "descripton": "An introduction to the theory and practice of codes for detecting and correcting errors in digital data communication and storage systems. Topics include linear block codes, cyclic codes, cyclic redundancy checksums, BCH and Reed-Solomon codes, convolutional codes, trellis-coded modulation, LDPC and turbo codes, Viterbi and sequential decoding, and encoder and decoder architecture. Applications include the design of computer memories, local-area networks, compact disc digital audio, NASA's deepspace network, high-speed modems, communication satellites, and cellular telephony.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Survivable Networks", "spring": true, "number": "ECE  772", "descripton": "Principles of network and service continuity and related metrics; the theory of network availability, survivability, and restoration; a comprehensive coverage of network architectures, protocols, algorithms, and related technology for survivability; advanced topics in network survivability; hands-on experience in the implementation of protocols and software for survivable systems and the operation of survivable networks.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Topics in Internet Protocols", "prerequisites": "Prerequisite: CSC/ECE 573", "spring": true, "number": ")  773", "descripton": "Cutting-edge concepts and technologies to support internetworking in general and to optimize the performance of the TCP/IP protocol suite in particular. Challenges facing and likely evolution for next generation intenetworking technologies. This course investigates topics that include, but may be not limited to: Internet traffic measurement, characteriztion and modeling, traffic engineering, network-aware applications, quality of service, peer-to-peer systems, content-distribution networks, sensor networks, reliable multicast, and congestion control.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Network Security", "prerequisites": "Prerequisite: CSC/ECE 570, CSC/ECE 574", "spring": true, "number": ")  774", "descripton": "A study of network security policies, models, and mechanisms. Topics include: network security models; review of cryptographic techniques; internet key management protocols; electronic payments protocols and systems; intrusion detection and correlation; broadcast authentication; group key management; security in mobile ad-hoc networks; security in sensor networks.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Topics in Wireless Networking", "prerequisites": "Prerequisite: ECE/CSC 575", "spring": false, "number": ")  775", "descripton": "Reviews the current state of research in wireless networks, network architectures, and applications of wireless technologies; students will design, organize, and implement or simulate systems in a full-semester research project.  For students with background in networking and communications who wish to explore research and development topics.", "fall": true, "units": " 3"}, {"summer": false, "name": "Design and Performance Evaluation of Network Systems and Services", "prerequisites": "Prerequisite: CSC(ECE) 570 and CSC(ECE) 579", "spring": true, "number": ")  776", "descripton": "Introduction to the design and performance evaluation of network services.  Topics include top-down network design based on requirements, end-to-end services and network system architecture, service level agreements, quantitative performance evaluation techniques.  Provides quantitative skills on network service traffic and workload modeling, as well as, service applications such as triple play, internet (IPTV), Peer-to-peer (P2P), voice over IP (VoIP), storage, network management, and access services.", "fall": false, "units": " 3"}, {"summer": false, "name": "Telecommunications Network Design", "prerequisites": "Prerequisite: ECE 570, ECE 579", "spring": true, "number": ")  777", "descripton": "Analytic modeling and topological design of telecommunications networks, including centralized polling networks, packet switched networks, T1 networks, concentrator location problems, routing strategies, teletraffic engineering and network reliability.", "fall": false, "units": " 3"}, {"summer": false, "name": "Optical Networks", "prerequisites": "Prerequisite: CSC/ECE 573, CSC/ECE 576, CSC/ECE 579, CSC/ECE 570", "spring": false, "number": ")  778", "descripton": "A study of optical networks with wavelength division multiplexing (WDM) technology.  Topics include: optical fiber and transmission technology; first generation optical networks (SONET); optical access networks; wavelength routing networks; related protocols and standards.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Computer Performance Modeling", "prerequisites": "Prerequisite: CSC, ECE or OR 761", "spring": true, "number": ")  779", "descripton": "In-depth study of computer performance modeling techniques such as exact and approximate analysis of queuing networks and direct and iterative numerical solutions of queuing systems.", "fall": false, "units": " 3"}, {"summer": false, "name": "Special Studies In Electrical Engineering", "spring": true, "number": "ECE  781", "descripton": "Opportunity for small groups of advanced graduate students to study topics in their special fields of interest under direction of members of graduate faculty.", "fall": true, "units": " 3"}, {"summer": false, "name": "Special Studies In Electrical Engineering", "spring": true, "number": "ECE  782", "descripton": "Opportunity for small groups of advanced graduate students to study topics in their special fields of interest under direction of members of graduate faculty.", "fall": true, "units": " 3"}, {"summer": false, "name": "Computer Engineering Research Presentation", "prerequisites": "Prerequisite: Two semesters of ECE 803.", "spring": true, "number": "ECE  783", "descripton": "Students work with instructor to prepare and give a technical research presentation at the level similar to those given at an international research symposium. Students may not be enrolled in both 783 and 803 in the same semester.", "fall": true, "units": " 1"}, {"summer": false, "name": "Topics in Advanced Computer Design", "prerequisites": "Prerequisite: ECE 520, ECE 521", "spring": false, "number": "ECE  785", "descripton": "In depth study of topics in computer design; advantages and disadvantages of various designs and design methodologies; technology shifts, trends, and constraints; hardware/software tradeoffs and co-design methodologies.", "fall": true, "units": " 3"}, {"summer": false, "name": "Topics in Advanced Computer Architecture", "prerequisites": "Prerequisite: ECE 521, ECE/CSC 506", "spring": true, "number": "ECE  786", "descripton": "In-depth study of research topics in computer architecture; mechanisms and their implementations; advantages and disadvantages of various mechanisms; technology shifts, trends, and constraints.", "fall": false, "units": " 3"}, {"summer": false, "name": "Special Topics In Electrical Engineering", "prerequisites": "Prerequisite: B average in technical subjects", "spring": true, "number": "ECE  791", "descripton": "Two-semester sequence to develop new courses and to allow qualified students to explore areas of special interest.", "fall": true, "units": " 3"}, {"summer": false, "name": "Special Topics In Electrical Engineering", "prerequisites": "Prerequisite: B average in technical subjects", "spring": true, "number": "ECE  792", "descripton": "Two-semester sequence to develop new courses and to allow qualified students to explore areas of special interest.", "fall": true, "units": " 3"}, {"summer": false, "name": "Seminar in Electrical and Computer Engineering", "spring": true, "number": "ECE  801", "fall": true, "units": " 1-3"}, {"summer": "True", "name": "Seminar in Computer Engineering", "spring": "True", "number": "ECE  803", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Seminar in Comm/Sig PR", "spring": "True", "number": "ECE  804", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Seminar in Solid State", "spring": "True", "number": "ECE  805", "fall": "True", "units": " 1-3"}, {"summer": false, "name": "Individual Topics In Electrical Engineering", "prerequisites": "Prerequisite: B average in technical subjects", "spring": true, "number": "ECE  833", "descripton": "Provision of opportunity for individual students to explore topics of special interest under direction of a member of faculty.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Individual Studies In Electrical Engineering", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "ECE  834", "descripton": "The study of advanced topics of special interest to individual students under direction of faculty members.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "ECE  885", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "ECE  890", "descripton": "For students who are preparing for and taking writte and/or oral preliminary exams.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "ECE  893", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "ECE  895", "descripton": "Dissertation research.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "ECE  896", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "ECE  899", "descripton": "For students who have completed all credit hour, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations.", "fall": true, "units": " 1-3"}]