[{"summer": false, "name": "Applied Microeconomic Analysis", "prerequisites": "Prerequisite: EC 301 and MA 121", "spring": true, "number": "ECG  505", "descripton": "Applied course in microeconomic analysis of public policy issues and management problems.  Theory of consumer and producer behavior in a market economy.  The roles of incentives, price determination incompetitive markets, cost analysis, pricing in noncompetitive markets, factor markets, general equilibrium, economic and social welfare, regulation, externalities, and public goods.", "fall": true, "units": " 3"}, {"summer": false, "name": "Applied Macroeconomic Analysis", "prerequisites": "Prerequisite: EC 302 and MA 121", "spring": false, "number": "ECG  506", "descripton": "Applied course in aggregate economics. Analysis of aggregate economic fluctuations and stabilization policy; inflation and disinflation; the Federal budget and international balance of trade; and economic growth. Capital markets, monetary and fiscalpolicy, banking system, foreign exchange markets and their effects on business conditions. Development of standard macroeconomic model in context of specific applications.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Law and Economics", "prerequisites": "Prerequisite: EC(ARE) 301 or EC(ARE) 401", "spring": "True", "number": "ECG  512", "descripton": "Economic analysis of sources and effects of law, including common law, statutory law and regulation. Property rights and contracts, liability rules, crime and punishment, statutory enactment, bureaucratic behavior and institutional reform.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Environmental and Resource Policy", "prerequisites": "Prerequisite: EC(ARE) 301 or 401", "spring": false, "number": "ECG  515", "descripton": "Application of price theory and benefit-cost analysis to public decisions related to resources and environment. Emphasis on evaluation of water supply and recreation investments, water quality management alternatives, public-sector pricing, common property resources and optimum management of forest and energy resources.", "fall": true, "units": " 3"}, {"summer": false, "name": "Asset Pricing", "prerequisites": "Prerequisite: MA 301, MA 305 and MA 421", "spring": false, "number": "ECG  528", "descripton": "Introduction to major fundamental assets (stocks and bonds), interest rates, and derivative assets, such as put and call options.  Arbitrage theorem, present value, risk aversion, hedging, duration, properties of derivative assets, binomial trees, elementary stochastic calculus, Black-Scholes option pricing formula, implied volatility, capital asset pricing model.  Emphasis on mathematical methods used to price derivative assets.", "fall": true, "units": " 3"}, {"summer": false, "name": "Health Economics", "prerequisites": "Prerequisite: EC(ARE) 401 or ECG 700", "spring": false, "number": "ECG  537", "descripton": "Microeconomic analysis of public and private policy issues concerning health care financing and delivery in United States including: choice under conditions of asymmetric information; health insurance; performance of physician, hospital, long-term care and pharmaceutical markets.", "fall": true, "units": " 3"}, {"summer": false, "name": "Economic Development", "prerequisites": "Prerequisite: EC(ARE) 301 or 401", "spring": false, "number": "ECG  540", "descripton": "Examination of problems encountered in promoting regional and national economic development. Consideration given to structural changes required for raising standards of living. Some basic principles of economics applied to suggest ways of achieving development goals. Planning strategies, policies and external assistance.", "fall": false, "units": " 3"}, {"summer": false, "name": "International Economics", "prerequisites": "Prerequisite: EC 301", "spring": false, "number": "ECG  548", "descripton": "This course covers the determinants of international trade, migration, and investment and their connection with economic growth. It also covers macro/monetary issues, including exchange rates, financial markets and monetary-fiscal policy in open economies.", "fall": true, "units": " 3"}, {"summer": false, "name": "Intermediate Econometrics", "prerequisites": "Prerequisite: ST 514", "spring": true, "number": ")  561", "descripton": "Formalization of economic hypotheses into testable relationships and application of appropriate statistical techniques. Major attention to procedures applicable for single equation stochastic models expressing microeconomic and macroeconomic relation-ships. Statistical considerations relevant in working with time series and cross sectional data in economic investigations. Survey of simultaneous equation models and the available estimation techniques.", "fall": false, "units": " 3"}, {"summer": false, "name": "Topics In Applied Econometrics", "prerequisites": "Prerequisite: ECG(ST) 561", "spring": false, "number": "ECG  562", "descripton": "Application of advanced econometric techniques to selected issues in economics. Practice in presenting econometrics results in professional fashion, in written or oral form.", "fall": true, "units": " 3"}, {"summer": false, "name": "Writing in Economics", "prerequisites": "Corequisite: ECG 505 or ECG 700; ECG 506 or ECG 703; and ECG 561", "spring": true, "number": "ECG  580", "descripton": "Developing, writing and presenting economic analyses of empirical issues chosen by each student.", "fall": false, "units": " 3"}, {"summer": true, "name": "Special Economics Topics", "spring": true, "number": "ECG  590", "descripton": "Examination of current problems on a lecture-discussion basis. Course content varies as changing conditions require new approaches to deal with emerging problems.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Independent Study", "spring": true, "number": "ECG  630", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ECG  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ECG  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ECG  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": true, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ECG  690", "descripton": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ECG  695", "descripton": "Thesis research.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "ECG  696", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ECG  699", "descripton": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their theses.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Fundamentals of Microeconomics", "prerequisites": "Prerequisite: MA 131 and EC(ARE)301", "spring": false, "number": "ECG  700", "descripton": "Preparatory course for ECG701-702, intended for those lacking sufficient background to go directly into those courses Economic theory with extensive use of calculus. Consumer and producer optimization. Price and output determination in competitive markets, monopoly, and imperfectly competitive markets. Factor Markets. General equilibrium, externalities and public goods.", "fall": true, "units": " 3"}, {"summer": false, "name": "Microeconomics I", "prerequisites": "Prerequisite: ECG 700, MA 231", "spring": false, "number": "ECG  701", "descripton": "Theory of consumer behavior. Primal-dual relationships in consumer theory including indirect utility functions and consumer expenditure functions. Properties of consumer demand functions. Consumer welfare measurement. Production technology and the theory of the firm including cost minimization and profit maximization. Dual relationships in producer theory including cost functions and profit functions. Properties of firm output supply and input demand equations. Long-run market equilibrium in a competitive market environment. Market equilibrium with upward sloping input supply equations. The theory of monopoly.", "fall": true, "units": " 3"}, {"summer": false, "name": "Microeconomics II", "prerequisites": "Prerequisite: ECG 701", "spring": true, "number": "ECG  702", "descripton": "General equilibrium. Economics of information and uncertainty. Game theory. Mechanism design and social choice. Contract theory.", "fall": false, "units": " 3"}, {"summer": false, "name": "Fundamentals of Macroeconomics", "prerequisites": "Prerequisite: EC(ARE) 301,EC 302,BUS(ST)350,MA 131", "spring": true, "number": "ECG  703", "descripton": "Fundamental topics in macroeconomics, including consumption, investment, government purchases, taxation, government debt, output supply, money and inflation, unemployment, elementary economic growth. Emphasis is on the microeconomic foundations of macroeconomics. Economic intuition is stressed.", "fall": false, "units": " 3"}, {"summer": false, "name": "Macroeconomics I", "prerequisites": "Prerequisite: ECG 561, ECG 703, MA 242", "spring": false, "number": "ECG  704", "descripton": "Rigorous examination of basic macroeconomic theory, including household choice of consumption demand and labor supply, capital accumulation and economic growth, government purchases, taxation, government debt, investment, consumption and investment under uncertainty, real business cycle models. Throughout the course, the connection between economic intuition and formal mathematical analysis is emphasized. The level of mathematical rigor is high.", "fall": true, "units": " 3"}, {"summer": false, "name": "Macroeconomics II", "prerequisites": "Prerequisite: ECG 704", "spring": true, "number": "ECG  705", "descripton": "Continuation of ECG 704. Topics include, but are not limited to, money demand and supply; money and growth; inflation; term structure of interest rates; money and fluctuations, including real and New Keynesian models; theories of unemployment; conduct of policy and problems of time consistency; asset pricing; introduction to open economy models.", "fall": false, "units": " 3"}, {"summer": false, "name": "Industrial Organization", "prerequisites": "Prerequisite: ECG 700", "spring": false, "number": "ECG  706", "descripton": "Survey of microeconomic literature on industrial organization: internal structure of the firm, number and sizes of firms in an industry, pricing and output behavior of firms. Public policy, including antitrust laws, patent and copyright laws, and government regulation of industry.", "fall": true, "units": " 3"}, {"summer": false, "name": "Topics In Industrial Organization", "prerequisites": "Prerequisite: ECG 700", "spring": true, "number": "ECG  707", "descripton": "Advanced study of selected topics such as oligopoly theory, empirical models of industry, principal-agent contracts, economic theories of firm organization, antitrust issues, economic theories of regulation and economics of property rights.", "fall": false, "units": " 3"}, {"summer": false, "name": "Environmental and Resource Economics", "prerequisites": "Prerequisite: ECG 700", "spring": false, "number": "ECG  715", "descripton": "Theoretical tools and empirical techniques necessary for understanding of resource and environmental economics, developed in both static and dynamic framework. Discussions of causes of environmental problems, possible policies and approaches to nonmarket valuation. Analysis of resource use over time using control theory for both renewable and exhaustible resources.", "fall": true, "units": " 3"}, {"summer": false, "name": "Topics In Environmental and Resource Economics", "prerequisites": "Prerequisite: ECG 715", "spring": true, "number": "ECG  716", "descripton": "Advanced study of selected topics in environmental and resource economics. Topics vary with interests of instructor and students.", "fall": false, "units": " 3"}, {"summer": false, "name": "Labor Economics", "prerequisites": "Prerequisite: ECG 700 and one of the following: ECG(ST) 561, ST 422, ST 512, ST 708", "spring": false, "number": "ECG  730", "descripton": "Application of microeconomic theory and econometric methods to labor market behavior in both static and dynamic contexts. Labor demand analysis, labor force participation, hours of work, household production, human capital, distribution of earnings,information and search, and mobility.", "fall": true, "units": " 3"}, {"summer": false, "name": "Policy and Research Issues In Labor Economics", "prerequisites": "Prerequisite: ECG 700 and one of the following: ECG(ST) 561, ST 422, ST 512, ST 708 policy-related issues in labor economics, including trade union behavior,", "spring": true, "number": "ECG  731", "descripton": "Survey of current literature on policy-related issues in labor economics, including trade union behavior, unemployment, macroeconomic aspects of labor market adjustment, discrimination, regulation of wages and benefits and public-sector labor markets. Examples from labor markets in U. S. and developing countries. Recent research developments in labor economics; topics vary according to interests and needs of students.", "fall": false, "units": " 3"}, {"summer": false, "name": "Economics Growth and Development I", "prerequisites": "Prerequisite: ECG 701 and ECG 705, Corequisite: ECG 751", "spring": false, "number": "ECG  739", "descripton": "Macroeconomic issues of economic development, principally the economics of growth.  Review of neoclassical growth theory, followed by extensive study of endogenous growth models.  two-sector models, models with intermediate inputs (both variety and quality-ladder models), endogenous labor and population, trade and growth, and the diffusion of technology across countries.  Approximately equal time devoted to theory and evidence.", "fall": true, "units": " 3"}, {"summer": false, "name": "Economic Growth and Development II", "prerequisites": "Prerequisite: ECG 701 and ECG 705, Corequisite: ECG 751", "spring": true, "number": "ECG  740", "descripton": "Microeconomic issues of growth. Technology adoption and the distributional effects of technical change; the role of agriculture in economic development; land tenure and tenancy arrangements; the role of agrarian institutions in the development process; and poverty, inequality and economic growth in developing countries. Approximately equal time devoted to theory and evidence.", "fall": false, "units": " 3"}, {"summer": false, "name": "Agricultural Production and Supply", "prerequisites": "Prerequisite: ECG 700", "spring": false, "number": "ECG  741", "descripton": "Advanced study in logic of, and empirical inquiry into, producer behavior and choice among combinations of factors and kinds and qualities of output; aggregative consequences of individuals' and firms' decisions in terms of product supply and factordemand; factor markets and income distribution; and general interdependency among economic variables.", "fall": true, "units": " 3"}, {"summer": false, "name": "Consumption, Demand and Market Interdependency", "prerequisites": "Prerequisite: ECG 700", "spring": true, "number": "ECG  742", "descripton": "Analysis of behavior of individual households and of consumers in aggregate with respect to consumption of agricultural products; impact of these decisions on demand for agricultural resources, competition among agricultural regions and for markets;and interdependence between agriculture and other sectors of the economy.", "fall": false, "units": " 3"}, {"summer": false, "name": "Theory Of International Trade", "prerequisites": "Prerequisite: ECG 700, 703", "spring": false, "number": "ECG  748", "descripton": "Consideration of specialized body of economic theory dealing with international movement of goods, services, capital and payments. A theoretically oriented consideration of policy.", "fall": true, "units": " 3"}, {"summer": false, "name": "Monetary Aspects Of International Trade", "prerequisites": "Prerequisite: ECG 703", "spring": true, "number": "ECG  749", "descripton": "Macroeconomic problems of an open economy including balance of payments adjustment mechanism, alternative exchange rate systems, external effects of monetary and fiscal policy, optimum currency areas and international monetary reform.", "fall": false, "units": " 3"}, {"summer": false, "name": "Introduction to Econometric Methods", "prerequisites": "Prerequisite: ST 421; Corequisite: ST 422", "spring": true, "number": ")  750", "descripton": "Introduction to principles of estimation of linear regression models, such as ordinary least squares and generalized least squares.  Extensions to time series and panel data.  Consideration of endogeneity and instrumental variables estimation.  Limited dependent variable and sample selection models.  Attention to implementation of econometric methods using a statistical package and microeconomic and macroeconomic data sets.", "fall": false, "units": " 3"}, {"summer": false, "name": "Econometric Methods", "prerequisites": "Prerequisite: ST 421, ST 422", "spring": false, "number": ")  751", "descripton": "Introduction to important econometric methods of estimation such as Least Squares, instrumentatl Variables, Maximum Likelihood, and Generalized Method of Moments and their application to the estimation of linear models for cross-sectional ecomomic data. Discussion of important concepts in the asymptotic statistical analysis of vector process with application to the inference procedures based on the aforementioned estimation methods.", "fall": true, "units": " 3"}, {"summer": false, "name": "Time Series Econometrics", "prerequisites": "Prerequisite: ECG(ST) 751", "spring": true, "number": ")  752", "descripton": "The characteristics of macroeconomic and financial time series data. Discussion of stationarity and non-stationarity as they relate to economic time series. Linear models for stationary economic time series: autoregressive moving average (ARMA) models; vector autoregressive (VAR) models. Linear models for nonstationary data: deterministic and stochastic trends; cointegration. Methods for capturing volatility of financial time series such as autoregressive conditional heteroscedasticity (ARCH) models. Generalized Method of Moments estimation of nonlinear dynamic models.", "fall": false, "units": " 3"}, {"summer": false, "name": "Microeconometrics", "prerequisites": "Prerequisite: ECG 751", "spring": true, "number": ")  753", "descripton": "The characteristics of microeconomic data. Limited dependent variable models for cross-sectional microeconomic data: logit/probit models; tobit models; methods for accounting for sample selection; count data models; duration analysis; non-parametricmethods. Panel data models: balanced and unbalanced panels; fixed and random effects; dynamic panel data models; limited dependent variables and panel data analysis.", "fall": false, "units": " 3"}, {"summer": false, "name": "Mathematical Methods For Economics", "prerequisites": "Prerequisite: MA 231 , introductory course in linear algebra", "spring": true, "number": "ECG  765", "descripton": "Linear algebra and matrices, optimization with equality and inequality constraints, comparative statistics, differential and difference equations, intertemporal optimization. Economic applications to utility and profit maximization, national income determination, economic growth, business cycles.", "fall": false, "units": " 3"}, {"summer": false, "name": "Computational Methods in Economics and Finance", "prerequisites": "Prerequisite: (MA 305 or MA 405) and MA 341 and EC 301 and EC 302 and (CSC 112 or 114) or equivalents.", "spring": true, "number": "ECG  766", "descripton": "Fundamental methods for forumlating and solving economic models numerically will be developed. Emphasis on defining the mathematical structure of problems and practical computer methods for obtaining model solutions. Major topics include solution of systems of equations, complementarity relationships and optimization. Finite and infinite dimensional problems will be addressed, the latter through the use of finite dimensional approximation techniques. Particular emphasis placed on solving dynamic asset pricing, optimization and equilibrium problems. MS in Financial Mathematics Program required.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Macroeconomics", "prerequisites": "Prerequisite: ECG 704", "spring": false, "number": "ECG  784", "descripton": "Advanced study of macro-economics. Emphasis on business cycles and behavior of real variables. Real, incomplete information and disequilibrium theories of the business cycle; rational expectations; contract theory and indexation; investment; and effects of government expenditure, taxes and debt.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Monetary Economics", "prerequisites": "Prerequisite: ECG 705", "spring": "True", "number": "ECG  785", "descripton": "Field course for students desiring a specialization in monetary economics or macroeconomics. Survey of current topics in monetary theory and policy.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Avanced Special Topics", "spring": true, "number": "ECG  790", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Independent Study", "spring": true, "number": "ECG  830", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "ECG  885", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "ECG  890", "descripton": "For students who are preparing for and taking written and/or oral preliminary exams.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "ECG  895", "descripton": "Dissertation research.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "ECG  896", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "ECG  899", "descripton": "For students who have completed all credit hour, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations.", "fall": true, "units": " 1-3"}]