[{"summer": false, "name": "Orientation to Mathematics and Science Education", "spring": true, "number": "EMS  101", "descripton": "Overview of departmental expectations and procedures and introduction to practical aspects of academic life. Opportunity for interaction of students with advisors and with other undergraduates who are nearing completion of programs.Open only to students in Math and Science Education", "fall": true, "units": " 0"}, {"summer": false, "name": "Introduction to Middle Grades Education", "spring": true, "number": ")  102", "descripton": "Introduction to the Middle Grades Academy and middle school teaching from the perspective of \"What do I bring to teaching?\"  Students will formulate an initial teaching philosophy as well as engage in an introspective examination of their beliefs, attitudes, talents, strengths, and weaknesses in relation to teaching early adolescents.  Students are required to provide their own transportation.", "fall": true, "units": " 2"}, {"summer": false, "name": "Introduction to Teaching Mathematics and Science", "spring": true, "number": "EMS  203", "descripton": "Introduces prospective teachers to the teaching of mathematics and science in the middle school and high school. As an important part of the course, students serve as teacher assistants to a classroom teacher. Ideas and questions arising from this experience provide an integral part of the classroom instruction on campus.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Mathematics Education", "prerequisites": "Prerequisite: ED 100; Corequisite: ED 204", "spring": true, "number": "EMS  204", "descripton": " Risk Managemnt for details on acquiring the insurance and the current charge.  This course is restricted to Teacher Education majors.", "fall": true, "units": " 2"}, {"summer": false, "name": "Introduction to Teaching Science", "prerequisites": "Prerequisite: Sophomore standing; Corequisite: ED 204", "spring": true, "number": "EMS  205", "descripton": "Introduces perspective teachers to the teaching of science in the middle school and high school. Topics include nature of the science learner, common alternative conceptions in science, introduction to science teaching strategies, and the science curriculum in middle and high school. Sophomore status or higher is required. Sophomore status or higher is required.", "fall": true, "units": " 2"}, {"summer": "True", "name": "Special Topics in Education", "spring": "True", "number": "EMS  296", "descripton": "Individual or group study of particular areas of education at the freshman and sophomore levels. Specific topics will vary from semester to semester.", "fall": "True", "units": " 1-3"}, {"summer": false, "name": "Instructional Materials in Science", "prerequisites": "Prerequisite or Corequisite: EMS 205 and ED 204", "spring": false, "number": "EMS  373", "descripton": "Development and selection of teaching materials that reflect concepts of content and emphasis in middle and secondary school science.  Experimental and laboratory approaches, including use of microcomputer and video technologies.2 lecture hours and 6 lab hours per week for 7 weeks", "fall": true, "units": " 3"}, {"summer": false, "name": "Methods of Teaching Science I", "prerequisites": "Prerequisite: EMS 205, ED 204", "spring": true, "number": "EMS  375", "descripton": "Classroom, laboratory, and internship experiences for pre-service teachers to effectively prepare, plan and assess learning environments in the middle and secondary science classroom and instructional laboratory.  Emphasis placed on knowledge, skills, and dispositions for inquire-based learning environments.", "fall": false, "units": " 3"}, {"summer": false, "name": "Methods and Materials for Teaching Mathematics", "prerequisites": "Prerequisite: Admission to professional semester", "spring": false, "number": "EMS  470", "descripton": "Purposes, methods, curricula and evaluation practices for teaching mathematics in middle school and high school.Taught during the first seven weeks of the semester", "fall": true, "units": " 3"}, {"summer": false, "name": "Student Teaching in Mathematics", "prerequisites": "Prerequisite: Admission to professional semester, Corequisite: EMS 470", "spring": true, "number": "EMS  471", "descripton": "Supervised experience in a selected middle or secondary school for the semester, to develop and practice the skills and techniques for teaching mathematics.  Students are required to provide their own transportation.  MED, MSM and MSD majors only.", "fall": true, "units": " 1-12"}, {"summer": false, "name": "Teaching Mathematics Topics in Senior High School", "prerequisites": "Prerequisite: EMS 204 passed with a B- or better", "spring": true, "number": "EMS  472", "descripton": "Preparation for teaching mathematics from both the college repertoire (algebra, geometry, trigonometry, advanced mathematics) and general courses (pre-algebra, technical and consumer mathematics) offered in grades 9-12. This course includes a school-based field experience.  Students are required to provide their own transportation.  MED Majors only.", "fall": true, "units": " 3"}, {"summer": false, "name": "Teaching Mathematics Topics in the Middle Grades", "prerequisites": "Prerequisite: EMS 204 passed with a B- or better", "spring": true, "number": "EMS  474", "descripton": "Methods of teaching arithmetic, geometry, algebra, and pre-algebra topics in grades 6-9. Emphasizes approaches that actively involve learners and relate operations on concrete and pictorial representations to mathematical symbols.  This course includes a school-based field experience.  Students are required to provide their own transportation.  MSM Majors only.", "fall": false, "units": " 3"}, {"summer": false, "name": "Methods of Teaching Science II", "prerequisites": "Prerequisite: EMS 375", "spring": false, "number": "EMS  475", "descripton": "Goals, methods, curricula, and  evaluation practices in teaching the physical and biological sciences at the middle and secondary school levels.Taught during the first seven weeks of the semester", "fall": true, "units": " 3"}, {"summer": false, "name": "Student Teaching in Science", "prerequisites": "Prerequisite: EMS 475; and Corequisite: EMS 495", "spring": true, "number": "EMS  476", "descripton": " Risk Management for details on acquiring the insurance and the current charge.", "fall": false, "units": " 1-12"}, {"summer": false, "name": "Teaching Mathematics with Technology", "prerequisites": "Prerequisite: EMS 203; MA 131 or 141", "spring": true, "number": "EMS  480", "descripton": "Prepares prospective mathematics teachers to use technology in their classrooms to assist students in formulating and solving math problems in the middle and high school mathematics curricula.", "fall": true, "units": " 3"}, {"summer": false, "name": "School Mathematics from an Advanced Perspective", "prerequisites": "Prerequisite: MA 403 or MA 407, MA 308 or MA 408, MA 205 or MA 305 or MA 405", "spring": true, "number": "EMS  490", "descripton": "This course will serve as a culminating experience for all students majoring in mathematics education and intending to become high school mathematics teachers.  Course content includes functions in both secondary and collegiate mathematics, development of euclidean geometry from euclid's elements, and historical overview of albebra, and other mathematics subject matter, a trigonometry review from both triangle basis and funtion basis, connections between linear algebra and the high school presentation of matrices, and other topics. For Math Education majors only.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Senior Seminar in Mathematics and Science Education", "prerequisites": "Prerequisite: Advanced Undergraduate standing", "spring": "True", "number": "EMS  495", "descripton": "In-depth investigation of one or  more teaching areas in mathematics or science education.", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Special Topics in Education", "prerequisites": "Prerequisite: Junior or senior standing", "spring": "True", "number": "EMS  496", "descripton": "Individual or group study of special topics in professional education. The topic and mode of study are determined by the faculty member after discussion with the student.", "fall": "True", "units": " 1-3"}, {"summer": false, "name": "Readings in Science Education I", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "EMS  501", "descripton": "Explores the evolution of science education and science education research with special emphasis on current trends. Reviews latest national reports on trends and standards in science education. Develops research support for best science teaching practices and examines recent innovations in science teacher education programs.", "fall": true, "units": " 1"}, {"summer": false, "name": "Readings in Science Education II", "prerequisites": "Prerequisite: Graduate standing, EMS 501", "spring": false, "number": "EMS  502", "descripton": "Historical overview of science education practices and research and illustrations of the forces which influenced changes in these fields through seminal papers. Studies the changing goals of science instruction through the 20th and into the 21st century. Examines historical trends in how students learn, role of the teacher, goals for learning science and the dynamic interactions between these factors.", "fall": true, "units": " 1"}, {"summer": "True", "name": "Methods of Teaching Science I", "spring": "True", "number": "EMS  505", "descripton": "Graduate students new to science teaching will read current research literature that defines best practices and incorporate these practices to lesson planning that enhances student learning.  Classroom, laboratory, and school-based experiences in middle and secondary science classrooms and instructional laboratories will help students to effectively prepare, plan, and assess learning environments.  Emphasis placed on the development of knowledge, skills, and dispositions for inquiry-based learning environments.  Underlying theoretical framework is constructivism, and experiences will be discussed using current learning theory.  PBS or Graduate Standing.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Methods of Teaching Science II", "spring": "True", "number": "EMS  506", "descripton": "Second course in the MAT science series.  Students will plan units of instruction for student teaching, and an emphasis is placed on planning for classroom management and student diversity.  Current theoretical frameworks are emphasized in the context of practical field experiences.  PBS or Graduate Standing.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Interactions In the Mathematics Classroom", "spring": false, "number": "EMS  510", "descripton": "This course focuses on interactions between students and teachers in the mathematics classroom. Topics studied will include: whole class instruction, small group activity, questioning and facilitating classroom discussion. This course will include a field experience in the schools for which students will be required to provide their own transportation. Course restricted to mathematics education students in the MED, MS or MAT programs.", "fall": true, "units": " 3"}, {"summer": false, "name": "Teaching and Learning Elementary and Middle Grades", "prerequisites": "Prerequisite: EMS 471", "spring": true, "number": "EMS  512", "descripton": "Focus on theory, research, and methodology of teaching and learning mathematics in elementary and middle grades.  Emphasizes the development of a foundation for understanding and assessing mathematical growth and learning through historical and psychological sources, research, and reflective practice.  Emphasis is placed upon understanding how children come to learn elementary mathematics meaningfully and what this necessarily implies about the way mathematics is taught and how elementary and middle grades education can be improved.", "fall": false, "units": " 3"}, {"summer": false, "name": "Teaching and Learning of Algebraic Thinking", "prerequisites": "Prerequisite: EMS 471 or equivalent teaching experience.", "spring": false, "number": "EMS  513", "descripton": "Teaching and learning of algebra from a developmental perspective; research-based methods for developing students' algebraic thinking; structure and processes used in algebra.  Focus on how students develop algebraic ideas from upper elementary grades through Algebra I.", "fall": true, "units": " 3"}, {"summer": false, "name": "Teaching and Learning of Geometric Thinking", "prerequisites": "Prerequisite: EMS 471 and either MA 308 or MA 408", "spring": false, "number": "EMS  514", "descripton": "Focus will be on the development of geometric thinking in grades K-12 using multiple instructional approaches, including technology, and considered using different theories of learning and frameworks (e.g., Van Hiele, SOLO taxonomy).  Topics may include: measurement, similarity, congruence, properties of 2 and 3 dimensional figures, circles, non-Euclidean geometries.  Synthetic, analytic and transformational, formal and informal approaches will be highlighted.", "fall": true, "units": " 3"}, {"summer": false, "name": "Teaching and Learning of Statistical Thinking", "prerequisites": "Prerequisite: ST 507 or ST 511", "spring": true, "number": ")  519", "descripton": "This course is designed to bridge theory and practice on how students develop understandings of key concepts in data analysis, statistics, and probability. Discussion of students' understandings, teaching strategies and the use of manipulatives and technology tools. Topics include distribution, measures of center and spread, sampling, sampling distribution, randomness, and law of large numbers. Must complete a first level graduate statistics course ( ST 507, ST 511, or equivalent) before enrolling.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Methods in Science Education I", "prerequisites": "Prerequisite: Graduate standing in Science Education", "spring": true, "number": "EMS  521", "descripton": "Current research literature will guide the development of plans to improve classroom teaching practices.  Action research used to evaluate instructional impact of modifications to classroom strategies.  What it means to teach science, what it means to teach a diverse population of students and how to develop, interpret, and implement alternative assessment.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Methods in Science Education II", "prerequisites": "Prerequisite: EMS 521 and graduate standing in Science Education", "spring": true, "number": "EMS  522", "descripton": "Examines science instruction through analysis of curriculu, instructional practices, current research on science learning and teaching.  Five areas of interest: curriculum, instruction, assessment, diversity, learning environments and technology in science education.", "fall": false, "units": " 3"}, {"summer": false, "name": "Introduction to Research in Science Education", "prerequisites": "Prerequisite: Graduate standing in Science Education", "spring": false, "number": "EMS  531", "descripton": "Introduction to techniques and designs specific to and/or in the context of science education research.  Analyze and critique findings of other science education researchers in current science education research literature.  Perform and interpret quantitative and qualitative analyses commonly used in science education research.  Carry out research project focusing on an aspect of science ducation, communicate research findings in both oral and written form.", "fall": true, "units": " 3"}, {"summer": false, "name": "Methods and Materials for Teaching Mathematics", "spring": true, "number": "EMS  570", "descripton": "Purposes, methods, curricula and evaluation practices for teaching mathematics in middle school and high school.  Taught during the first seven weeks of the semester.  Credit for both EMS 470 and EMS 570 is not allowed.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Teaching Mathematics Topics in Senior High School", "spring": "True", "number": "EMS  572", "descripton": "Preparation for teaching mathematics from both the college preparatory (algebra, geometry, trigonometry, advanced mathematics) and general courses (pre-algebra, technical and consumer mathematics) in grades 9-12.  Credit for both EMS 472 and EMS 472not allowed.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Technology Tools for Science Teaching", "prerequisites": "Prerequisite: Graduate standing or alternative license program", "spring": true, "number": "EMS  573", "descripton": "Project-based course to improve the understanding and use of technology tools useful in science teaching. Computer and calculator based laboratory probeware and software, imaging and presentation technologies. Research-based evaluation of tool use in the science laboratory and classroom.", "fall": false, "units": " 3"}, {"summer": false, "name": "Foundations Of Science Education", "prerequisites": "Prerequisite: EMS 475", "spring": true, "number": "EMS  575", "descripton": "Study and analysis of philosophical, historical, sociological, political and economic factors affecting science education in schools of the U.S. Implications for science education of various learning theories along with models for curriculum development and program planning. Critical analysis of current trends, issues and problems in science education in terms of multiple perspectives.", "fall": false, "units": " 3"}, {"summer": false, "name": "Improving Classroom Instruction In Science", "prerequisites": "Prerequisite: EMS 475", "spring": true, "number": "EMS  577", "descripton": "Application of major principles of education and psychology to improvement of science teaching in elementary, middle and secondary schools. Emphasis on critical analysis of research and the development of research-based classroom applications. Goalsand objectives of science teaching, instructional strategies, development or selection of science materials, evaluation of achievement and elements of a desirable classroom climate.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Teaching Mathematics with Technology", "spring": "True", "number": "EMS  580", "descripton": "Prepares mathematics teachers to use technology in their classrooms to assist students in formulating and solving math problems in the middle and high school mathematics curricula.  Credit not allowed for both EMS 480 and EMS 580.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Advanced Applications of Technology in Mathematics Education", "spring": "True", "number": "EMS  581", "descripton": "Research-based applications of technology tools in secondary and middle school mathematics.  Advanced use of various technology tools for learning and teaching mathematics, including design of technology environments, appropriate investigation tasks, and professional development.", "fall": "True", "units": " 3"}, {"summer": true, "name": "Special Problems In Mathematics Teaching", "prerequisites": "Prerequisite: EMS 471", "spring": true, "number": "EMS  592", "descripton": "In-depth investigation of topical problems in mathematics teaching chosen from areas of curriculum, methodology, technology, supervision and research.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Special Problems In Science Teaching", "prerequisites": "Prerequisite: EMS 476", "spring": true, "number": "EMS  594", "descripton": "In-depth investigation of topics in science education not covered in existing courses. Includes critical analysis of research and may include field work. May be offered on individual basis or as a class.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Special Problems in Teaching", "spring": true, "number": "EMS  605", "descripton": "In-depth study of topical problems in teaching from areas of current concern to K-12 teachers.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Special Problems In Mathematics Teaching", "prerequisites": "Prerequisite: EMS 471", "spring": true, "number": "EMS  621", "descripton": "In-depth investigation of topical problems in mathematics teaching chosen from areas of curriculum, methodology, technology, supervision and research.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Special Problems In Science Teaching", "prerequisites": "Prerequisite: EMS 476", "spring": true, "number": "EMS  622", "descripton": "In-depth investigation of topics in science education not covered in existing courses. Includes critical analysis of research and may include field work. May be offered on individual basis or as a class.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Practicum In Science and Mathematics Education", "prerequisites": "Prerequisite: EMS 770 or EMS 775", "spring": true, "number": "EMS  641", "descripton": "Supervised practicum in appropriate settings both on- and off-campus. Provision for opportunity for development, implementation and evaluation in science and mathematics in clinical environment under faculty supervision.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Internship In Mathematics And Science Education", "prerequisites": "Prerequisite: Nine hrs. in grad. level courses", "spring": true, "number": "EMS  651", "descripton": "Utilizing the participant-observed role, required participation in selected educational situations with emphasis upon development of observational skills, ability to record relevant observations by means of written journals, skills in analyzing experiences identifying critical incidents and projection of events and consequences.  Student required to develop possible alternative courses of action in various situations, select one of the alternatives and evaluate consequences of selected course of action.", "fall": true, "units": " 1-9"}, {"summer": false, "name": "Portfolio Development", "spring": false, "number": "EMS  675", "descripton": "Techniques of portfolio construction for documenting attainment of advanced competencies in science training.For students in the last or next to last semester of coursework in the Science Education Masters Program.", "fall": true, "units": " 1"}, {"summer": false, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "EMS  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-4"}, {"summer": true, "name": "Teaching In College", "spring": false, "number": "EMS  686", "descripton": "Focus on development of competencies to perform fundamental tasks of a college teacher as well as consideration of more long-range tasks such as course development and university responsibilities of a professor. In addition to attending lectures andother types of presentations, students make video tapes of their teaching, develop tests, design introductory courses in their teaching fields and consider current issues related to university and college teaching.", "fall": false, "units": " 3"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "EMS  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "EMS  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": false, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "EMS  690", "descripton": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Research Projects In Mathematics and Science Education", "prerequisites": "Prerequisite: ELP 532", "spring": true, "number": "EMS  692", "descripton": "A project or problem in research in education for graduate students, supervised by members of the graduate faculty. The research chosen on basis of individual students' interests and not to be part of thesis or dissertation research.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "EMS  693", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": false, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "EMS  695", "descripton": "Thesis research.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "EMS  696", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": false, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": ")  699", "descripton": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their theses.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Teaching Mathematics and Science In Higher Education", "prerequisites": "Prerequisite: EMS 770, 621 or 622, Graduate standing", "spring": true, "number": "EMS  703", "descripton": "Examination of collegiate mathematics and science instruction with respect to goals and objectives, design of courses and curricula, innovative programs and facilities, and methods and materials for instruction.", "fall": false, "units": " 3"}, {"summer": false, "name": "Curriculum Development and Evaluation In Science and Mathematics", "prerequisites": "Prerequisite: 500-level statistics, PSY 535", "spring": true, "number": "EMS  704", "descripton": "Critical study of elements of curriculum design and theory in mathematics education and science education and examination of evaluation procedures for assessing educational innovations.", "fall": false, "units": " 3"}, {"summer": false, "name": "Education and Supervision Of Teachers Of Mathematics and Science", "prerequisites": "Prerequisite: EMS 770 or 621 or 622", "spring": true, "number": "EMS  705", "descripton": "Critical analysis of theories, programs and techniques designed to promote interpersonal interactions leading to more effective teaching of science and mathematics.", "fall": false, "units": " 3"}, {"summer": true, "name": "Teaching Mathematics In Elementary and Junior High School", "prerequisites": "Prerequisite: EMS 471", "spring": true, "number": "EMS  712", "descripton": "Comprehensive study of teaching mathematics in elementary and junior high schools. Major emphasis on building skills in teaching arithmetic, elementary algebra and intuitive geometry. Thorough search of literature relative to mathematics curricula conducted, designing and sequencing of learning activities, teaching mathematical concepts and relationships, building skill in computation, reading mathematics, problem solving and measurement.", "fall": false, "units": " 3"}, {"summer": false, "name": "Trends and Issues in Science Education", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "EMS  730", "descripton": "Provides an in-depth examination and analysis of literature and research in science education as well as current trends in science education reform.  Emphasis is placed on the analysis of theoretical models of inquiry.  Course includes the development of a review of literature and the formation of research questions specific to science education.", "fall": true, "units": " 3"}, {"summer": false, "name": "Fundamentals of Research in Science Education: Qualitative and Quantitative Inqu", "prerequisites": "Prerequisite: Graduate standing and ST 507 or 511, Corequisite: ST 508 or 512", "spring": true, "number": "EMS  731", "descripton": "Analyze the range of research designs currently utilized by science education reseachers.  Develop an understanding of the assumptions and frameworks of different types of inquiry in science education.  A brief history of research in science education is examined as a means to orient students to the trends that have taken place.  Read, comprehend, and critically analyze qualitative and quantitative designs in science education.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Theoretical and Critical Perspectives of Science Education", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "EMS  732", "descripton": "Examines current theoretical and critical perspectives of science education.  Examines a variety of approaches which re-assess cultural notions of meaning, identity, power, and representation in the sciences and science education.  Applies research theory to reform in science education.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Foundations Of Mathematics Education", "prerequisites": "Prerequisite: EMS 471", "spring": true, "number": "EMS  770", "descripton": "The current status of mathematics education with special emphasis on study and critical analysis of current practices in mathematics instruction from elementary school through college.", "fall": false, "units": " 3"}, {"summer": false, "name": "Foundations Of Science Education", "prerequisites": "Prerequisite: EMS 475", "spring": true, "number": "EMS  775", "descripton": "Study and analysis of philosophical, historical, sociological, political and economic factors affecting science education in schools of the U.S. Implications for science education of various learning theories along with models for curriculum development and program planning. Critical analysis of current trends, issues and problems in science education in terms of multiple perspectives.", "fall": false, "units": " 3"}, {"summer": false, "name": "Improving Classroom Instruction In Science", "prerequisites": "Prerequisite: EMS 475", "spring": true, "number": "EMS  777", "descripton": "Application of major principles of education and psychology to improvement of science teaching in elementary, middle and secondary schools. Emphasis on critical analysis of research and the development of research-based classroom applications. Goalsand objectives of science teaching, instructional strategies, development or selection of science materials, evaluation of achievement and elements of a desirable classroom climate.", "fall": false, "units": " 3"}, {"summer": true, "name": "Teaching in College", "spring": false, "number": ")  786", "descripton": "Focus on development of competencies to perform fundamental tasks of a college teacher as well as consideration of more long-range tasks such as course development and university responsibilities of a professor. In addition to attending lectures andother types of presentations, students make video tapes of their teaching, develop tests, design introductory courses in their teaching fields and consider current issues related to university and college teaching.", "fall": true, "units": " 3"}, {"summer": true, "name": "Special Problems in Math Teaching", "prerequisites": "Prerequisite: EMS 471", "spring": true, "number": "EMS  792", "descripton": "In-depth investigation of topical problems in mathematics teaching chosen from areas of curriculum, methodology, technology, supervision and research.", "fall": true, "units": " 3"}, {"summer": true, "name": "Special Problems in Science Teaching", "prerequisites": "Prerequisite: EMS 476", "spring": true, "number": "EMS  794", "descripton": "In-depth investigation of topics in science education not covered in existing courses. Includes critical analysis of research and may include field work. May be offered on individual basis or as a class.", "fall": true, "units": " 3"}, {"summer": false, "name": "Seminar In Mathematics Education", "prerequisites": "Prerequisite: Departmental Majors", "spring": true, "number": "EMS  802", "descripton": "In-depth examination and analysis of literature and research in a particular topic(s) in mathematics education.", "fall": true, "units": ""}, {"summer": false, "name": "Seminar In Science Education", "prerequisites": "Prerequisite: Department Majors", "spring": true, "number": "EMS  803", "descripton": "In-depth examination and analysis of literature and research in a particular topic(s) in science education.", "fall": true, "units": " 2"}, {"summer": true, "name": "Special Problems In Mathematics Teaching", "prerequisites": "Prerequisite: EMS 471", "spring": true, "number": "EMS  821", "descripton": "In-depth investigation of topical problems in mathematics teaching chosen from areas of curriculum, methodology, technology, supervision and research.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Special Problems In Science Teaching", "prerequisites": "Prerequisite: EMS 476", "spring": true, "number": "EMS  822", "descripton": "In-depth investigation of topics in science education not covered in existing courses. Includes critical analysis of research and may include field work. May be offered on individual basis or as a class.", "fall": true, "units": " 1-6"}, {"summer": "True", "name": "Research Applications in Science Education", "prerequisites": "Prerequisite: EMS 730, EMS 731, ST 508", "spring": "True", "number": "EMS  832", "descripton": "Provides students with the opportunity to design science education research including formulating research questions, designing the methodologies to be used in the study, selecting assessments and protocols, and identifying appropriate analyses.  Theoretical frameworks and associated assumptions are identified and critiqued.  Develop advanced skills in reviewing different types of science education research and identifying issues of validity and reliability.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Practicum In Science and Mathematics Education", "prerequisites": "Prerequisite: EMS 770 or EMS 775", "spring": true, "number": "EMS  841", "descripton": "Supervised practicum in appropriate settings both on- and off-campus. Provision for opportunity for development, implementation and evaluation in science and mathematics in clinical environment under faculty supervision.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Internship In Mathematics and Science Education", "prerequisites": "Prerequisite: Nine hrs. in grad. level courses", "spring": true, "number": "EMS  851", "descripton": "Utilizing the participant-observer role, required participation in selected educational situations with emphasis upon development of observational skills, ability to record relevant observations by means of written journals, skills in analyzing experiences identifying critical incidents and projection of events and consequences. Student required to develop possible alternative courses of action in various situations, select one of the alternatives and evaluate consequences of selected course ofaction.", "fall": true, "units": " 1-9"}, {"summer": false, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "EMS  885", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Doctoral Preliminary Exam", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "EMS  890", "descripton": "For students who are preparing for and taking written and/or oral preliminary exams.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Research Projects In Mathematics and Science Education", "prerequisites": "Prerequisite: ELP 532", "spring": true, "number": "EMS  892", "descripton": "A project or problem in research in education for graduate students, supervised by members of the graduate faculty. The research chosen on basis of individual students' interests and not to be part of thesis or dissertation research.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "EMS  893", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": false, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "EMS  895", "descripton": "Dissertation research.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "EMS  896", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": false, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "EMS  899", "descripton": "For students who have completed all credit hour, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations.", "fall": true, "units": " 1-3"}]