[{"summer": true, "name": "Introduction to Academic Writing", "spring": true, "number": "ENG  100", "descripton": "Intensive introduction to critical writing and reading in academic contexts.  Exploration of writing processes and academic literacy skills: interpreting assignments; comprehending, analyzing, and evaluating college-level texts; inventing, drafting,and revising; seeking, providing, and responding to constructive feedback; collaborating effectively under varied learning models.  Extensive writing practice and individualized coaching.  Attention to grammar and conventions of standard written English.  Intended as preparation for ENG 101. Credit for ENG 100 is not allowed if student has prior credit for ENG 101.", "fall": true, "units": " 4"}, {"summer": false, "name": "Academic Writing and Research", "prerequisites": "Prerequisite: Placement via English Department guidelines", "spring": true, "number": "ENG  101", "descripton": "Intensive instruction in academic writing and research. Basic principles of rhetoric and strategies for academic inquiry and argument. Instruction and practice in critical reading, including the generative and responsible use of print and electronic sources for academic research. Exploration of literate practices across a range of academic domains, laying the foundation for further writing development in college. Continued attention to grammar and conventions of standard written English. Successful completion of  ENG 101 requires a C- or better. Credit for ENG 101 is not allowed if the student has already fulfilled the first-year writing requirement.", "fall": true, "units": " 4"}, {"summer": true, "name": "Writing Literary Analysis", "spring": true, "number": "ENG  201", "descripton": "Writing about literature for a variety of audiences.  Strategies for writing close textual analysis - including attention to versification, narrative technique, and dramatic structure - and for articulating biographical, literary-historical, and cultural-historical contexts.  Conventional genres of literary analysis, including \"close readings,\" reviews, and editorial introductions; conventions of organization and prose style in both academic and professional literary discourse; MLA conventions for prose style and documentation.", "fall": true, "units": " 3"}, {"summer": false, "name": "Studies In Drama", "spring": true, "number": "ENG  206", "descripton": "Selected drama from the classical period to the present.  Emphasis on reading for enjoyment as well as understanding theory and development of tragedy, comedy, and other modes of dramatic expression.  Writers such as Sophocles, Euripides, Shakespeare, Ibsen, and Shaw, and contemporary playwrights.", "fall": true, "units": " 3"}, {"summer": false, "name": "Studies in Poetry", "spring": true, "number": "ENG  207", "descripton": "Main features of poetry such as tone, voice, form, diction, figurative language, and sound patterns.  Reading of poetry from different periods with the goal of learning how to understand, appreciate, and analyze different kinds of poems.", "fall": true, "units": " 3"}, {"summer": true, "name": "Studies In Fiction", "spring": true, "number": "ENG  208", "descripton": "Representative examples of novels and short stories from different periods, emphasizing understanding and appreciation of fiction as a genre, a knowledge of the features and techniques of fiction, and a sense of the development of the genre.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Shakespeare", "spring": true, "number": "ENG  209", "descripton": "Shakespeare for non-English majors. Seven to ten major plays, including representative comedies, such as The Taming of the Shrew; histories, such as Richard III; tragedies, such as Hamlet; and romances, such as The Tempest.Does not satisfy requirements for English major.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Language and Linguistics", "prerequisites": "Prerequisite: ENG 101", "spring": true, "number": "ENG  210", "descripton": "Linguistics theory and method.  Topics include the English sound system, morphology, syntactic structure, semantics, and historical and contemporary dialect variation.  Language acquisition, language and the brain, and computer processing and human language.", "fall": true, "units": " 3"}, {"summer": true, "name": "Introduction to Editing", "prerequisites": "Prerequisite: ENG 101", "spring": true, "number": "ENG  214", "descripton": "Basic editorial skills with a wide range of publications. Stylistic editing (conventions of written English, consistency, effectiveness of syntax, appropriateness of diction), substantive editing (accuracy, legal issues, ethics), and production editing (layout, typography, electronic publication processing). Introduction to resources such as standard reference works and professional organizations.", "fall": true, "units": " 3"}, {"summer": false, "name": "Technologies for Texts", "prerequisites": "Prerequisite: ENG 101", "spring": true, "number": "ENG  216", "descripton": "Uses of computers for creating, designing, analyzing, and disseminating texts, both on desktops and on the Internet.  Overview of technologies that facilitate reading, writing, and communication; development of skill with various applications and understanding of their capabilities, limitations, and historical analogues.  Recommended for students in journalism and technical writing.", "fall": false, "units": " 3"}, {"summer": false, "name": "Studies in Great Works of Non-Western Literature", "spring": false, "number": ")  219", "descripton": "Readings, in English translation, or non-Western literary masterpieces from the beginnings of literacy in the Middle East, Asia, and Africa to the modern period, including excerpts from texts such as the Upanishads, the Ramayana, the Sundiata, Gilgamesh, A Thousand and One Nights, and the Quran and such authors as Confucius, Oe Kenzaburo, Omar Khayyam, Rumi, and Amos Oz.", "fall": false, "units": " 3"}, {"summer": true, "name": "Studies in Great Works of Western Literature", "prerequisites": "Credit is not allowed for both ENG 220 and ENG 221 or ENG 222.", "spring": true, "number": ")  220", "descripton": "Readings, in English translation, of Western literary masterpieces, from the beginnings of literacy in the Middle East and Europe towards the present, including such authors as Homer, Sophocles, Virgil, Ovid, Augustine, Danta, Machiavelli, Shakespeare, Cervantes, Moliere, Voltaire, Goethe, Austen, Flaubert, Dickinson, Tolstoy, Kafka, and Woolf.Credit will not be given for both ENG/FL 220 and either ENG/FL 221 or ENG/FL 222.", "fall": true, "units": " 3"}, {"summer": false, "name": "Literature of the Western World I", "prerequisites": "Credit is not allowed for both ENG 221 and ENG 220.", "spring": false, "number": ")  221", "descripton": "Readings from English translations of Biblical, Classical, Medieval, and Early Renaissance literature, including works by such authors as Homer, Plato, Virgil, Ovid, St. Paul, St. Augustine, Marie de France, and Dante.", "fall": true, "units": " 3"}, {"summer": false, "name": "Literature of the Western World II", "prerequisites": "Credit is not allowed for both ENG 222 and ENG 220.", "spring": true, "number": "ENG  222", "descripton": "Readings from English translations of Renaissance, Neo-Classical, Romantic, and Early Modern literature, emphasizing the cultures of continental Europe from the Renaissance to 1900, and including such authors as Petrarch, Erasmus, Rabelais, Machiavelli, Shakespeare, Moliere, Voltaire, Rousseau, Goethe, Flaubert, and Tolstoy.", "fall": false, "units": " 3"}, {"summer": false, "name": "Contemporary World Literature I", "spring": false, "number": ")  223", "descripton": "Twentieth-century literature of some of the following cultures:  Russian, Eastern European, Western European, Latin American, Canadian, Australian.", "fall": true, "units": " 3"}, {"summer": false, "name": "Contemporary World Literature II", "spring": true, "number": ")  224", "descripton": "Twentieth-century literature of some of the following cultures:  Asian, Arabian, African, Caribbean, Native-American.", "fall": false, "units": " 3"}, {"summer": false, "name": "Literature and Medicine", "spring": true, "number": "ENG  232", "descripton": "Study of literature about illness, epidemics, and the science and practice of medicine.  Readings will include works by authors such as Boccaccio, Defoe, George Eliot, Kafka, William Carlos Williams, Susan Sontag, and Tony Kushner.", "fall": true, "units": " 3"}, {"summer": false, "name": "The Literature of Agriculture", "spring": true, "number": "ENG  233", "descripton": "A study of writings on the role of farming in the creation of culture and on the connection between the attention to words necessary for good writing and the attention to the land necessary for good farming.  Readings may include ancient and modern texts from a variety of cultures and genres.  Possible authors include Virgil, Jefferson, Hardy, Cather.", "fall": false, "units": " 3"}, {"summer": false, "name": "Literature of the Holocaust", "spring": true, "number": ")  246", "descripton": "Fictional and nonfictional versions of the Holocaust, focusing on themes of survival, justice, theology, and the limits of human endurance.", "fall": false, "units": " 3"}, {"summer": false, "name": "Survey of African-American Literature", "spring": true, "number": ")  248", "descripton": "African-American writing and its relationships to American culture and history.  Covers such writers as Wheatley, Douglass, Chesnutt, Dunbar, DuBois, Hughes, Hurston, Wright, and Morrison.", "fall": true, "units": " 3"}, {"summer": false, "name": "Native American Literature", "spring": false, "number": "ENG  249", "descripton": "A survey of Native American literatures from before contact with Europeans to contemporary culture.  Writers may include: Apess (Pequot), Ridge (Cherokee), Silko (Laguna Pueblo), Momaday (Kiowa), Power (Sioux) Gunn Allen (Laguna-Sioux), Harjo (Creek), and Erdrich (Anishinaabe).", "fall": false, "units": " 3"}, {"summer": true, "name": "Major British Writers", "prerequisites": "Credit is not allowed for ENG 251 and ENG 261 or ENG 262.", "spring": true, "number": "ENG  251", "descripton": "Significant British authors chosen from among such figures as Chaucer, Shakespeare, Milton, Swift, Pope, Austen, Wordsworth, Coleridge, Tennyson, Browning, Bronte, Dickens, Joyce, Eliot, Woolf, and Yeats.Credit will not be given for both ENG 251 andeither ENG 261 or 262.", "fall": true, "units": " 3"}, {"summer": true, "name": "Major American Writers", "prerequisites": "Credit is not allowed for both ENG 252 and ENG 265 or ENG 266.", "spring": true, "number": "ENG  252", "descripton": "Significant American authors chosen from among such figures as Franklin, Emerson, Thoreau, Hawthorne, Melville, Douglass, Stowe, Whitman,  Dickinson, Twain, James, Frost, Faulkner, Hemingway, and Morrison.Credit will not be given for both ENG 252 and either ENG 265 or 266.", "fall": true, "units": " 3"}, {"summer": true, "name": "Introduction to Literary Study", "prerequisites": "Prerequisite: ENG 101", "spring": true, "number": "ENG  260", "descripton": "Introduces fundamental questions in literary history and critical theory.  Emphasizes critical reading skills and prepares students for the kinds of courses--surveys, genre courses, author courses, problem-based courses--that are part of the Englishmajor.  Papers prepared using standard word processing programs.", "fall": true, "units": " 3"}, {"summer": true, "name": "English Literature I", "prerequisites": "Credit is not allowed for both ENG 261 and ENG 251.", "spring": true, "number": "ENG  261", "descripton": "A survey of English literature to 1660, including Old English, Middle English, and Renaissance writing, focusing on such central authors as Chaucer, Spenser, Marlowe, Shakespeare, Jonson, Donne, and Milton. Credit will not be given for both ENG 261 and ENG 251.", "fall": true, "units": " 3"}, {"summer": true, "name": "English Literature II", "prerequisites": "Credit is not allowed for both ENG 262 and ENG 251.", "spring": true, "number": "ENG  262", "descripton": "A survey of English literature from 1660 to the present. Poetry, fiction, drama and intellectual prose by such central writers as Dryden, Pope, Swift, Johnson, Wollstonecraft, Wordsworth, Keats, Shelley, Bronte, Carlyle, Tennyson, Browning, Yeats, Woolf, Joyce and Eliot.  Credit will not be given for both ENG 262 and ENG 251.", "fall": true, "units": " 3"}, {"summer": true, "name": "American Literature I", "prerequisites": "Credit is not allowed for ENG 265 and ENG 252.", "spring": true, "number": "ENG  265", "descripton": "A survey of American literature from the beginnings to the Civil War, including such central authors as Edwards, Franklin, Irving, Emerson, Hawthorne,  Melville, Poe, Stowe, Douglass, Thoreau, and Whitman. Credit will not be given for both ENG 265 and ENG 252.", "fall": true, "units": " 3"}, {"summer": true, "name": "American Literature II", "prerequisites": "Credit is not allowed for both ENG 266 and ENG 252.", "spring": true, "number": "ENG  266", "descripton": "A survey of American literature from the Civil War to the present, including such central authors as Whitman, Dickinson, Twain, James, Crane, Wharton, Frost, Eliot, Hemingway, Hurston, Faulkner, Wright, O'Connor, and Morrison.  Credit will not be given for both ENG 266 and ENG 252.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Introduction to Film", "spring": "True", "number": "ENG  282", "descripton": "Examination of basic film techniques and methods of film analysis. Emphasis on understanding and appreciating film as a major US and international art form and industry operating in various national, cultural, and historical contexts.", "fall": "True", "units": " Performing Arts, Global Knowledge"}, {"summer": false, "name": "Introduction to American Folklore", "spring": true, "number": "ENG  283", "descripton": "Principal types of folklore; field work in collecting and assimilating material from various cultural traditions.  Emphasis on American folklore and its origins.", "fall": false, "units": " 3"}, {"summer": false, "name": "Explorations in Creative Writing", "prerequisites": "Prerequisite: ENG 101", "spring": true, "number": "ENG  287", "descripton": "Introduction to the basic elements and principles of three genres of creative writing: poetry, fiction and drama.  Reading and class discussion of student work.  Recommended for students with no prior experience in creative writing.", "fall": true, "units": " 3"}, {"summer": false, "name": "Fiction Writing", "prerequisites": "Prerequisite: ENG 101", "spring": true, "number": "ENG  288", "descripton": "Experience in writing short prose fiction. Class critiquing of student work and instruction in techniques of fiction.", "fall": true, "units": " 3"}, {"summer": false, "name": "Poetry Writing", "prerequisites": "Prerequisite: ENG 101", "spring": true, "number": "ENG  289", "descripton": "Experience in writing poetry. Class critiquing of student work and instruction in techniques of poetry.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Writing About Film", "prerequisites": "Prerequisite: ENG 101", "spring": "True", "number": "ENG  292", "descripton": "Comprehensive study of various approaches to writing about film.  Primary focus is on the critical and evaluative practice involved in writing film criticism for non-academic audiences.  Film screenings, discussion of assigned readings, and in-classwriting workshops aid students in preparing a portfolio of film writing that includes film reviews of various lengths.", "fall": "True", "units": " Performing Arts"}, {"summer": true, "name": "Special Projects in English", "spring": true, "number": "ENG  298", "descripton": "Faculty-guided independent study, or courses on special topics determined by departmental interest or need.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Women and Literature", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": true, "number": ")  305", "descripton": "Nineteenth- and twentieth-century womens' literature, as shaped by the intersecting and competing claims of gender, race, sexuality, and culture.  Focus on fiction, accompanied by critical readings from American studies, feminist literary criticism,and postmodern theory.", "fall": false, "units": " 3"}, {"summer": false, "name": "Technical Document Design and Editing", "prerequisites": "Prerequisite: ENG 214", "spring": false, "number": "ENG  314", "descripton": "Layout and design principles for written documents; desktop building; legibility, readability testing; conventions of proposals, instructions, and reports; basics of technical editing:  usage, vocabulary,  style manuals, editing mathematical equations, graphs, tables.", "fall": true, "units": " 3"}, {"summer": true, "name": "Principles of News and Article Writing", "prerequisites": "Prerequisite: ENG 101", "spring": true, "number": "ENG  316", "descripton": "Techniques of writing news stories and feature articles. Components of newsworthiness, examination of evidence, interview techniques, varied writing styles.  Role of newspapers and journalism in America.", "fall": true, "units": " 3"}, {"summer": false, "name": "Designing Web Communication", "prerequisites": "Prerequisite: ENG 214, or ENG 216, or ENG 314", "spring": true, "number": "ENG  317", "descripton": "A course in the layout, design, and composition of web-based communication.  Students will learn to analyze audiences and their uses of information in order to plan, compose, and critically evaluate web-based communication.  Students will acquire skill with HTML coding, screen design, and multimedia authoring and will apply those skills to the composition of a variety of web texts (i.e. websites).  Course work will require students to become proficient with commercially available HTML and photoeditors.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Survey of Rhetorical Theory", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": "True", "number": ")  321", "descripton": "Principles of rhetorical theory from its classical origins through the modern period to the present time.  Key concepts and theories that provide a critical understanding of the processes of persuasive symbol use.", "fall": "True", "units": " 3"}, {"summer": true, "name": "Writing in the Rhetorical Tradition", "prerequisites": "Prerequisite: ENG 101", "spring": true, "number": "ENG  323", "descripton": "A writing course based on the study of rhetoric.  Readings on the principles of invention, arrangement, and style; analysis of written texts; writing of persuasive texts for a variety of audiences and purposes.", "fall": true, "units": " 3"}, {"summer": false, "name": "Modern English Syntax", "prerequisites": "Prerequisite: ENG 101", "spring": true, "number": "ENG  324", "descripton": "Study of Modern English at the sentence level. Analysis of grammatical structure. Consideration of language variation in English.", "fall": true, "units": " 3"}, {"summer": false, "name": "Spoken and Written Traditions of American English Dialects", "prerequisites": "Prerequisite: ENG 101", "spring": true, "number": "ENG  325", "descripton": "Basic issues in the study of language; linguistic terminology and categories; grammatical traditions and topics such as prescriptivism and descriptivism, standard and non-standard, orality and literacy; language acquisition and awareness; language aesthetics and ethics.", "fall": false, "units": " 3"}, {"summer": false, "name": "History of the English Language", "prerequisites": "Prerequisite: ENG 101", "spring": true, "number": "ENG  326", "descripton": "Development of the English language from its Indo-European origins to the present. Emphasis on historical and comparative linguistic methodology and on changes in sound, syntax, and  meaning.", "fall": true, "units": " 3"}, {"summer": false, "name": "Language and Gender", "prerequisites": "Prerequisite: ENG 101", "spring": false, "number": ")  327", "descripton": "Introduction to the use of language by men and women.  Research in Linguistics and Women's Studies addressing issues such as the acquisition of gender-differentiated language, gender and conversational interaction, sexism in language, gender issues in society, and the relationship between language, gender, and other social constructs (e.g., class, culture, and ethnicity).", "fall": true, "units": " 3"}, {"summer": false, "name": "Language and Writing", "prerequisites": "Prerequisite: ENG 101", "spring": true, "number": "ENG  328", "descripton": "Study of language structure; specific attention to differences between spoken and written language; print conventions; error analysis; and the application of linguistics to rhetoric and composition.  Analysis of a variety of grammatical approaches; how to evaluate grammar textbooks and compositions.  Intended for English Education majors.Credit will not be awarded for both ENG 328 and ENG 324.", "fall": false, "units": " 3"}, {"summer": false, "name": "Screenwriting", "prerequisites": "Prerequisite: 6 credit hours from courses in writing for media, creative writing, or Film Studies", "spring": true, "number": "ENG  330", "descripton": "Writing for films, story planning, character development, communicating information, building scenes, relationships between script and cinematic dimensions, working with studios and editors.", "fall": true, "units": " 3"}, {"summer": true, "name": "Communication for Engineering and Technology", "prerequisites": "Prerequisite: Junior standing. Credit is not allowed for both ENG 331 and ENG 332 or ENG 333.", "spring": true, "number": "ENG  331", "descripton": "Written communication in industrial and technical organizations, emphasizing internal  communication with managers and technical personnel and including external communication with regulators, vendors, and clients. Intensive practice in writing; relationship of writing to oral and visual communication. For students in engineering and other primarily technological curricula.Credit is not allowed for more than one of ENG 331, ENG 332, and ENG 333.", "fall": true, "units": " 3"}, {"summer": true, "name": "Communication for Business and Management", "prerequisites": "Prerequisite: Junior standing. Credit is not allowed for both ENG 332 and ENG 331 or ENG 333.", "spring": true, "number": "ENG  332", "descripton": "Written communication in business and public organizations, including both internal communication (such as instructions, policies, management reports) and external communication with clients, vendors, and publics. Intensive practice in writing; relationship of writing to oral and visual communication. For students in business and management-related programs.Credit is not allowed for more than one of ENG 331, ENG 332, and ENG 333.", "fall": true, "units": " 3"}, {"summer": false, "name": "Communication for Science and Research", "prerequisites": "Prerequisite: Junior standing. Credit is not allowed for both ENG 333 and ENG 331 or ENG 332.", "spring": true, "number": "ENG  333", "descripton": "Written communication in scientific and research contexts, emphasizing relationship between research and writing in problem formulation, interpretation of results, and support and acceptance of research.  Intensive practice in writing; relationship of writing to oral and visual communication. For students who plan careers in scientific research.Credit is not allowed for more than one of ENG 331, 332, and 333.", "fall": true, "units": " 3"}, {"summer": false, "name": "African Literature in English", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": true, "number": ")  349", "descripton": "Anglophone literature in Africa.  Emphasis on the relationship between the African world-view and literary production and the persistent trend by African writers to connect literature with politics. Writers such as Achebe, Ngugi, Soyinka, and Serote.", "fall": false, "units": " 3"}, {"summer": false, "name": "Professional Internships", "spring": true, "number": "ENG  350", "descripton": "Directed work for CHASS majors including work-site mentoring and evaluation. Department supervision includes a course work directed toward designing employment application materials, developing a portfolio of professional work or relevant research paper, considering a variety of career options, and reading literature on workplace socialization. students must provide their own transportation to the internship site. Modest liability insurance fee required. Students must have at least a 2.5 overall GPA and at least a 3.0 GPA in the major, be a junior or senior CHASS major or minor, and must complete the application process outlined on the Internship Program Website or provide the internship coordinator with contact information for your supervisor at an internship you obtained independently.", "fall": true, "units": " 3"}, {"summer": false, "name": "Topics in Film Studies", "spring": true, "number": "ENG  359", "descripton": "Critical approaches to focused film topics involving film genres, directorial styles, or trends within a national cinema. Topics will vary from semester to semester.", "fall": false, "units": " 3"}, {"summer": false, "name": "The British Novel of the 18th Century", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": true, "number": "ENG  362", "descripton": "Emphasizes major novelists such as Defoe, Richardson, Fielding, Sterne, and Austen.", "fall": false, "units": " 3"}, {"summer": false, "name": "The British Novel of the 19th Century", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": false, "number": "ENG  363", "descripton": "Emphasizes major novelists such as Dickens, Trollope, the Brontes, Eliot, and Hardy.", "fall": true, "units": " 3"}, {"summer": "True", "name": "History of Film to 1940", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": "True", "number": "ENG  364", "descripton": "Technological developments and aesthetic movements that shaped international cinema production from the beginning of the industry to 1940.  Formal evolution in camera movement, editing, sound, narrative form, and the documentary.  The rise to prominence of Hollywood and international cinemas in historical, economic, and cultural contexts.", "fall": "True", "units": " Performing Arts, Global Knowledge"}, {"summer": false, "name": "American Poetry to 1900", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": true, "number": "ENG  368", "descripton": "American poetry written in English from the colonial period to 1900.  Development of styles and themes in relation to historical context.  Emphasis on poets such as Bradstreet, Taylor, Wheatley, Poe, Sigourney, Emerson, Longfellow, Whitman, Dickinson, and Robinson.", "fall": false, "units": " 3"}, {"summer": false, "name": "The American Novel of the 19th Century", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": false, "number": "ENG  369", "descripton": "Major novels illustrating the  development of American fiction from Romanticism to Realism and Naturalism. Works by such writers as Brown, Cooper, Hawthorne, Stowe, Melville, Twain, Howells, James, Norris, Crane, Chopin, and Dreiser.", "fall": true, "units": " 3"}, {"summer": false, "name": "Early Twentieth-Century Fiction", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": true, "number": "ENG  370", "descripton": "Study of narrative fiction written during the first half of the twentieth century.  Typical subjects: James, Conrad, Stein, Hemingway, Woolf, Faulkner, Hurston, Wright, Beckett.", "fall": false, "units": " 3"}, {"summer": false, "name": "Late Twentieth-Century Fiction", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": true, "number": "ENG  371", "descripton": "Study of narrative fiction written during the second half of the twentieth century.  Typical subjects: Beckett, O'Brien, Welty, O'Connor, Naipaul, Lessing, Gordimer, Morrison, Rushdie, DeLillo, Pynchon, McCarthy.", "fall": false, "units": " 3"}, {"summer": false, "name": "Early Twentieth-Century Poetry", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": false, "number": "ENG  372", "descripton": "Study of poetry written in English during the first half of the twentieth century.  Typical subjects: Hardy, Robinson, Yeats, Eliot, Pound, H.D., Williams, Hughes, Moore, Stevens.", "fall": true, "units": " 3"}, {"summer": false, "name": "Late Twentieth-Century Poetry", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": false, "number": "ENG  373", "descripton": "Study of poetry written in English during the second half of the twentieth century.  Typical subjects: Auden, Lowell, Larkin, Olson, Heaney, Plath, Ginsberg, Smith, Ashbery, Rich, Brooks, Walcott, Lorde.", "fall": true, "units": " 3"}, {"summer": "True", "name": "History of Film From 1940", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": "True", "number": "ENG  374", "descripton": "Technological developments and aesthetic movements that have shaped international cinema production from 1940 to the present.  Evolution in camera movement, editing, sound, narrative form, and the documentary.  Post-war Hollywood cinema and international film industries (both established and emerging) in historical, economic and cultural context.", "fall": "True", "units": " Performing Arts, Global Knowledge"}, {"summer": false, "name": "African American Cinema", "spring": false, "number": ")  375", "descripton": "Survey and analysis of African American film culture from 1900-present.  Examination of pre-Hollywood, classical Hollywood, and Independent filmmaking.  Particular focus on independent filmmakers' response to dominant industry representations and the work of filmmakers who seek to create a specifically African American cinematic style.", "fall": true, "units": " 3"}, {"summer": false, "name": "Science Fiction", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": true, "number": "ENG  376", "descripton": "Representative works of science fiction. Emphasis on works written in the twentieth century, with some attention to the history and development of the genre.", "fall": true, "units": " 3"}, {"summer": false, "name": "Fantasy", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": true, "number": "ENG  377", "descripton": "Representative works in the genre of fantasy.  Emphasis on works of 19th and 20th centuries.  Authors such as Carroll, Lewis, Tolkien, Borges, LeGuin, and Gardner.", "fall": true, "units": " 3"}, {"summer": "True", "name": " Film", "spring": "True", "number": ")  378", "descripton": "This course will introduce students to the rich international history of women's participation in the motion picture industry. Course includes readings, screenings, discussions, and a final examination.", "fall": "True", "units": " Performing Arts, Global Knowledge"}, {"summer": false, "name": "Modern Drama", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": false, "number": "ENG  380", "descripton": "Major plays and playwrights from Ibsen to Pinter, including at least some of the following: Strindberg, Chekhov, Shaw, O'Neill, Hellman, Pirandello, Brecht, Williams, Miller, Albee.", "fall": true, "units": " 3"}, {"summer": false, "name": "Creative Nonfiction Writing Workshop", "prerequisites": "Prerequisite: ENG 215, 287, 288, or 289", "spring": true, "number": "ENG  381", "descripton": "A workshop in creative nonfiction (literary or magazine journalism) for the student with demonstrated understanding of the basic techniques of creative writing and journalism.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Film and Literature", "spring": "True", "number": "ENG  382", "descripton": "Ways of adapting literary works to film form.  Similarities and differences between these two media. Emphasis on the practical art of transforming literature into film. Attention to the impact of film upon literature.", "fall": "True", "units": " Performing Arts"}, {"summer": "True", "name": "Introduction to Film Theory", "prerequisites": "Prerequisite: ENG 282", "spring": "True", "number": "ENG  384", "descripton": "Survey of critical approaches to film art.  Application of theoretical paradigms--formalist, realist, psychoanalytic, feminist, poststructuralist--to individual films, genres, national cinemas and directors.", "fall": "True", "units": " Performing Arts"}, {"summer": false, "name": "Biblical Backgrounds of English Literature", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": false, "number": "ENG  385", "descripton": "Influences of the Bible-principal forms, genres, and texts-on major English and American writers  such as Milton, Spenser, Melville, Eliot, and Faulkner.", "fall": true, "units": " 3"}, {"summer": false, "name": "Intermediate Fiction Writing Workshop", "prerequisites": "Prerequisite: ENG 288;Students must have earned a \"B\" or better in ENG 288.", "spring": true, "number": "ENG  388", "descripton": "An intermediate workshop in creative writing for students with demonstrated understanding of the basic techniques of writing prose fiction.", "fall": true, "units": " 3"}, {"summer": false, "name": "Intermediate Poetry Writing Workshop", "prerequisites": "Prerequisite: ENG 289;Students must have earned a \"B\" or better in ENG 289.", "spring": true, "number": "ENG  389", "descripton": "An intermediate workshop in creative writing for students with demonstrated understanding of the basic techniques of writing poetry.", "fall": true, "units": " 3"}, {"summer": false, "name": "Classical Backgrounds of English Literature", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": true, "number": "ENG  390", "descripton": "Literature of the ancient Western world and its influence on English and American writing.  Emphasis on the connections between the two bodies of literature.  Covers such writers as Plato, Horace, Virgil, and St. Augustine.", "fall": false, "units": " 3"}, {"summer": false, "name": "Special Topics in Modern Drama", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": false, "number": "ENG  391", "descripton": "Various topics in modern drama covering different cultures, issues, and theatrical practices within the last 100 years.  Modern American drama, modern British drama, modern World Drama, and European theatre from World War II to the present.", "fall": true, "units": " 3"}, {"summer": false, "name": "Major World Author", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": true, "number": ")  392", "descripton": "Intensive study in English, of the writings of one (or two) author(s) from outside the English and American traditions.  Sample subjects: Homer, Virgil and Ovid, Lady Murasaki, Marie de France and Christine de Pizan, Dante, Cervantes, Goethe, Balzacand Flaubert, Kafka, Proust, Lessing and Gordimer, Borges and Marquez, Neruda, Achebe, Soyinka, Calvino, Walcott and Naipaul.  Topics will vary from semester to semester.May be repeated for credit with new topic.", "fall": true, "units": " 3"}, {"summer": false, "name": "Studies in Literary Genre", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": true, "number": ")  393", "descripton": "Concentrated treatment of one literary genre, such as the epic, the lyric, the drama, satire, romance, autobiography, the essay, the novel, or the short story.  Treatment of materials from several national or ethnic cultures and several periods.  All readings in English.  Course may be taken three times for credit.Course may be taken 3 times in different genres.", "fall": true, "units": " 3"}, {"summer": false, "name": "Studies in World Literature", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": true, "number": ")  394", "descripton": "Study of a subject in world literature: for example, African literature, Asian literature, Hispanic literature, East European literature, Comedy, the Epic, the Lyric, Autobiography, the Faust legend, or Metamorphosis.  Subjects vary according to availability of faculty.  Readings in English translation.", "fall": true, "units": " 3"}, {"summer": false, "name": "Studies in Rhetoric and Digital Media", "prerequisites": "Prerequisite: ENG 101", "spring": true, "number": ")  395", "descripton": "Study of the influence of emerging technologies on rhetorical theory and practice. Rhetorical analysis of texts, including visual and audio texts.  Invention and construction of digital media texts as a means of engaging rhetorical theory and analysis.  Topics vary to adapt to emerging technologies and changing vernacular practices.", "fall": true, "units": " 3"}, {"summer": false, "name": "Contemporary Literature I (1900 to 1940)", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": false, "number": "ENG  398", "descripton": "British and American literature from 1900 to World War II, with representative authors such as Conrad, Yeats, Eliot, Joyce, Woolf, Faulkner, Shaw, Stein, O'Neill, and Wright. For comparative purposes, continental authors such as Kafka and Mann.", "fall": false, "units": " 3"}, {"summer": false, "name": "Contemporary Literature II (1940 to Present)", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": true, "number": "ENG  399", "descripton": "Literature from World War II to the present, with representative authors such as Murdoch, Beckett, Nabokov, Ginsberg, Achebe, Fuentes, Kundera, Naipaul, and Morrison.", "fall": false, "units": " 3"}, {"summer": false, "name": "Applied Criticism", "prerequisites": "Prerequisite: LTN Majors, Senior standing, formal admission to  the methods courses, Corequisite: ECI 450", "spring": false, "number": "ENG  400", "descripton": "Types and methods of literary criticism designed specifically for students intending to teach English in high school.", "fall": true, "units": " 3"}, {"summer": false, "name": "Literature for Adolescents", "prerequisites": "Prerequisite: Junior standing.", "spring": false, "number": ")  405", "descripton": "The history, types, and characteristics of literature for adolescents. Emphasizes reading and analyzing the literature by exploring the themes, literary elements, and rationale for teaching literature for adolescents. Addresses ways in which this literature can be integrated and implemented in English/Language Arts curriculum.", "fall": true, "units": " 3"}, {"summer": false, "name": "Modernism", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": false, "number": ")  406", "descripton": "International Modernist movement in literature, from its nineteenth-century origins to its culmination in the early twentieth century.  Definitions of modernity, as embodied in a variety of genres.  Placement of Modernist texts within a variety of cultures that produced them.", "fall": true, "units": " 3"}, {"summer": false, "name": "Postmodernism", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": true, "number": ")  407", "descripton": "Literary expressions of Postmodernism, from its origins in the Modernist movement through its culmination in the later decades of the twentieth century.  Definitions of post modernity, as embodied in a variety of genres.  Placement of Postmodernist texts within a variety of cultures that have produced them.", "fall": false, "units": " 3"}, {"summer": false, "name": "Studies in Gender and Genre", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": false, "number": ")  410", "descripton": "This course examines the ways in which writers have revised the literary genres to include gendered experience.  It will focus on a different generic area, such as poetry, fiction, drama or autobiography, depending on its instructor.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Rhetorical Criticism", "prerequisites": "Prerequisite: Junior standing", "spring": "True", "number": ")  411", "descripton": "Rhetorical analysis of public speeches, social movements, political campaigns, popular music, advertising, and religious communication. Neo-Aristotelian criticism, movement studies, genre criticism, dramatistic analysis, content analysis, fantasy theme analysis.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Advanced News and Article Writing", "prerequisites": "Prerequisite: ENG 316", "spring": false, "number": "ENG  416", "descripton": "Advanced work in writing news stories, profiles, features, and investigative stories.  Includes analysis and critical reading of print media.  Assumes thorough knowledge of AP style and rudiments of news and feature writing.", "fall": true, "units": " 3"}, {"summer": false, "name": "Editorial and Opinion Writing", "prerequisites": "Prerequisite: ENG 214, ENG 316", "spring": true, "number": "ENG  417", "descripton": "Discussing and writing newspaper and magazine editorials, with added attention to other forms of opinion in print, such as columns and books and music reviews.", "fall": false, "units": " 3"}, {"summer": false, "name": "Major American Author", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": false, "number": "ENG  420", "descripton": "Intensive study of the writings of one (or two) American author(s).  Developments across the career, relationships between the writing and the life, the writer's participation in a culture and an historical moment.  Sample subjects: Emerson and Thoreau, Melville, Whitman, Stowe and Douglass, Dickinson, Twain, James and Wharton, Frost, O'Neill, Fitzgerald and Hemingway, Faulkner, Hurston and Wright, O'Conner, Morrison.", "fall": true, "units": " 3"}, {"summer": false, "name": "Computer Documentation Design", "prerequisites": "Prerequisite: ENG 314, 331, 332 or ENG 333", "spring": true, "number": "ENG  421", "descripton": "Theory and design of documentation for computer hardware and software, including user guides, reference manuals, quick reference guides, tutorials, online documentation, and CD-based media delivery.  Training in alternative documentation testing procedures, usability testing, and collaborative revision.", "fall": false, "units": " 3"}, {"summer": false, "name": "Writing Theory and the Writing Process", "prerequisites": "Prerequisite: ENG 101", "spring": true, "number": "ENG  422", "descripton": "Theory and research on the processes and contexts of written discourse; cognitive, socio-cultural, educational perspectives; reflective and research-based accounts of the writing process; analysis of discourse contexts and communities.", "fall": true, "units": " 3"}, {"summer": false, "name": "Analysis of Scientific and Technical Writing", "prerequisites": "Prerequisite: ENG 314, 331, 332, or 333", "spring": true, "number": "ENG  425", "descripton": "The role of communication in the creation of scientific knowledge and technical designs and artifacts; methods of analyzing texts and of studying their creation and use; relationships between writing and other forms of communication. Field research in a scientific or technological setting.", "fall": false, "units": " 3"}, {"summer": false, "name": "Analyzing Style", "prerequisites": "Prerequisite: ENG 101", "spring": true, "number": "ENG  426", "descripton": "Development of a greater understanding of and facility with style in written discourse.  Theories of style, stylistic features; methods of analysis, imitation.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Screenwriting", "prerequisites": "Prerequisite: ENG 330", "spring": true, "number": "ENG  430", "descripton": "Advanced Screenwriting students will complete ready-to-sell screenplays over the course of the semester. Workload includes taking home two 100-page scripts each week and giving a thorough critique both in writing and in class discussion. Course included pitch sessions, opening scene workshops, intensive reading and writing.", "fall": false, "units": " 3"}, {"summer": false, "name": "17th-Century English Literature", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": true, "number": "ENG  439", "descripton": "Works of major nondramatic literary figures in England during the period 1600-1700, such as Donne, Jonson, Herbert, Marvell, Bacon, and Browne.", "fall": false, "units": " 3"}, {"summer": false, "name": "African-American Literature", "prerequisites": "Prerequisite: Junior standing.", "spring": true, "number": ")  448", "descripton": "Survey of African-American literature and its relationships to American culture, with an emphasis on fiction and poetry since 1945.  Writers such as Bontemps, Morrison, Huston, Baldwin, Hayden, Brooks, Naylor, Harper, and Dove.", "fall": false, "units": " 3"}, {"summer": false, "name": "16th-Century English Literature", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": false, "number": "ENG  449", "descripton": "Nondramatic prose and poetry of  the sixteenth century, with consideration of literary types and movements. Emphasis on major authors, including Sidney and Spenser.", "fall": true, "units": " 3"}, {"summer": false, "name": "Chaucer", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": true, "number": "ENG  451", "descripton": "Introduction to the study of Chaucer through an intensive reading of The Canterbury Tales.", "fall": true, "units": " 3"}, {"summer": false, "name": "Medieval British Literature", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": true, "number": "ENG  452", "descripton": "Readings in the rich poetic, thematic, and generic diversity of Medieval British literature.  Representative selections from romance, dream-vision, allegory, fabliau, lyric, chronicle, saint's life, satire, in historical and cultural contexts. Priorknowledge of Middle English unnecessary.", "fall": false, "units": " 3"}, {"summer": false, "name": "The Romantic Period", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": false, "number": "ENG  453", "descripton": "Emphasis on the major poetry of Blake, Wordsworth, Coleridge, Byron, Shelley, and Keats, with selected readings from other poets, prose writers, and dramatists of the period.", "fall": true, "units": " 3"}, {"summer": false, "name": "Literacy in the U.S.", "prerequisites": "Prerequisite: ENG 101; Junior or senior standing.", "spring": true, "number": "ENG  455", "descripton": "Academic study of the nature, functions, acquisition, institutionalization, and present state of literacy in the U.S., with special focus on issues of cultural diversity and social inequity. Three contexts for literacy - personal, academic, and home/community - provide a range of readings, investigations, and opportunities for reflection and further study. Service-learning component links this academic study to required tutoring (2 hours per week) of children and adults in local community service agencies in addition to attending class. Students will need to provide their own transportation.", "fall": false, "units": " 3"}, {"summer": false, "name": "Seminar in Film Studies", "prerequisites": "Prerequisite: ENG 282, ENG 384 and Junior or Senior standing", "spring": true, "number": ")  459", "descripton": "Advanced critical approaches to focused film topics involving film genres, directories styles, or trends within a national cinema. This seminar-style course will include screenings, readings, regular discussions, and a substantive final research paper. Topics will vary from semester to semester. Junior or senior standing or permission of instructor required.", "fall": false, "units": " 3"}, {"summer": false, "name": "Major British Author", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": true, "number": "ENG  460", "descripton": "In-depth study of the works of one (or two) British author(s) within their historical and literary-historical context.  Sample authors might include; Spencer and Sidney, Swift and Pope, Austen, Wordsworth and Coleridge, Keats and Shelley, the Brontes, the Brownings, Dickens, George Eliot, Hardy, Joyce, Woolf.", "fall": false, "units": " 3"}, {"summer": false, "name": "18th-Century English Literature", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": false, "number": "ENG  462", "descripton": "Major figures in English literature between 1660 and 1790.  Works studied in relation to social, cultural, political, and religious developments.  Emphasis on writers such as Dryden, Swift, Pope, Johnson.", "fall": true, "units": " 3"}, {"summer": false, "name": "The Victorian Period", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": true, "number": "ENG  463", "descripton": "Significant British poets, writers of prose non-fiction, and novelists studied in the social, economic, scientific, intellectual, and theological contexts of the Victorian era.", "fall": false, "units": " 3"}, {"summer": false, "name": "British Literature, 1900-1945", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": true, "number": "ENG  464", "descripton": "Variety of writings by British authors between the death of Queen Victoria and the end of World War II.  Typical subjects: Hardy, Conrad, Shaw, Yeats, Forster, Joyce, Lawrence, Eliot, Woolf, Beckett.", "fall": false, "units": " 3"}, {"summer": false, "name": "British Literature, Since 1945", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": true, "number": "ENG  465", "descripton": "Study of a variety of writings by British authors since World War II.  Typical subjects: Beckett, O'Brien, Orwell, Lessing, Murdoch, Rhys, Auden, Larkin, Osborne, Rushdie.", "fall": false, "units": " 3"}, {"summer": false, "name": "American Colonial Literature", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": true, "number": "ENG  467", "descripton": "Survey of American literature and thought from its beginnings to the adoption of the Constitution.  Representative works such as travel and exploration reports, Indian captivity narratives, diaries, journals, autobiographies, sermons, and poetry.", "fall": false, "units": " 3"}, {"summer": false, "name": "American Romantics", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": false, "number": "ENG  468", "descripton": "Major American writers from 1825 to 1865.  Relationship between literary developments and social change.  Emphasis on such writers as Emerson, Hawthorne, Cooper, Poe, Melville, Douglass, Stowe, Thoreau, and Whitman.", "fall": true, "units": " 3"}, {"summer": false, "name": "American Realism and Naturalism", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": true, "number": "ENG  469", "descripton": "Major American writers from 1865 to 1914, with emphasis on novelists such as Twain, James, Howells, Chopin, and Dreiser.", "fall": false, "units": " 3"}, {"summer": false, "name": "American Literature, 1914-1945", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": false, "number": "ENG  470", "descripton": "Variety of writings by U.S. authors from World War I to World War II.  Typical subjects: Stein, Adams, Anderson, Williams, Cullen, Hilda Doolittle, Faulkner, Hurston, Hemingway, Fitzgerald, Frost, O'Neill.", "fall": true, "units": " 3"}, {"summer": false, "name": "American Literature, Since 1945", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": false, "number": "ENG  471", "descripton": "Study of a variety of writings by U.S. authors since World War II.  Typical subjects: Ellison, Lowell, Williams, Welty, Bellow, Baldwin, O'Conner, Barthelme, Albee, Mailer, Ashbery, Morrison, McDermott, DeLillo.", "fall": true, "units": " 3"}, {"summer": false, "name": "Literature, the Arts, and Mass Culture", "spring": true, "number": "ENG  475", "descripton": "A review of the debate regarding art and mass culture, with attention to recent developments in cultural theory and practice.", "fall": true, "units": " 3"}, {"summer": false, "name": "Southern Literature", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": false, "number": "ENG  476", "descripton": "Literary traditions of the Southeastern United States from colonization through the present, including study of such major writers as Byrd, Jefferson, Simms, Poe, Douglass, Twain, Chesnutt, Glasgow, Hurston, Tate, Wolfe, Faulkner, Warren, Wright, Welty, Williams, O'Conner, Percy, and Lee Smith.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Modern Drama", "spring": "True", "number": "ENG  480", "fall": "True", "units": " 3"}, {"summer": false, "name": "Shakespeare, The Earlier Plays", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": false, "number": "ENG  486", "descripton": "Shakespeare's major works before 1600 with emphasis on his development as a playwright.", "fall": true, "units": " 3"}, {"summer": false, "name": "Shakespeare, The Later Plays", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": true, "number": "ENG  487", "descripton": "Shakespeare's major works after 1600 with emphasis on his tragedies and the late romances.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Fiction Writing Workshop", "prerequisites": "Prerequisite: ENG 388", "spring": true, "number": "ENG  488", "descripton": "An advanced workshop in creative writing for students with demonstrated understanding and accomplishment in the techniques of writing prose fiction.This course is restricted to juniors and seniors. Departmental approval required.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Poetry Writing Workshop", "prerequisites": "Prerequisite: ENG 389", "spring": true, "number": "ENG  489", "descripton": "An advanced workshop in creative writing for the students with demonstrated understanding and accomplishment in the techniques of writing poetry.This course is restricted to juniors and seniors. Departmental approval required.", "fall": false, "units": " 3"}, {"summer": false, "name": "Studies in Medieval Literature", "prerequisites": "Prerequisite: Sophomore standing and above", "spring": false, "number": "ENG  490", "descripton": "Topics (in rotation) in medieval English and continental literature, such as Arthurian legend and literature; women in medieval society and literature; the self in the late Middle Ages.  Focus on special areas of interest, with attention to culturaland historical backgrounds and contemporary scholarship.  Some texts in Middle English, some in translation; no prior knowledge of Middle English needed.", "fall": true, "units": " 3"}, {"summer": false, "name": "Honors in English", "prerequisites": "Requisite: English Majors Only", "spring": true, "number": "ENG  491", "descripton": "Intensive course or independent study project designed as one portion of the Honors Program in English. Subject varies.", "fall": true, "units": " 3"}, {"summer": false, "name": "Special Topics in Film Styles and Genres", "spring": true, "number": "ENG  492", "descripton": "Critical approaches to focused film topics involving film genres, directorial styles, or trends within a national cinema. Topics will vary from semester to semester.", "fall": true, "units": " 3"}, {"summer": false, "name": "Special Topics in Folklore", "spring": true, "number": "ENG  493", "descripton": "Topics and genres in folklore, such as Folktale and Legend, Folklore and Religion, African-American Folklore.  Topics will vary from semester to semester.", "fall": false, "units": " 3"}, {"summer": false, "name": "Special Topics in Linguistics", "prerequisites": "Prerequisite: ENG 101", "spring": true, "number": "ENG  494", "descripton": "(May be repeated for credit with new topic.) Methodology and analysis within various branches of linguistics, e.g. syntax, semantics, computational linguistics, phonology, dialectology, historical linguistics, discourse analysis.  Examination of topic's basic methods, controversial issues, analysis of linguistic data.  Projects may include novel analyses of English constructions, parsing programs, field work reports.", "fall": false, "units": " 3"}, {"summer": false, "name": "Seminar in Literary Criticism", "prerequisites": "Prerequisite: 9 hours of literature at the 300 level or above", "spring": true, "number": "ENG  496", "descripton": "Introduction to theoretical and applied criticism of literature, primarily for English majors and minors. May include traditional theory from Plato and Aristotle to New  Criticism, as well as contemporary psychoanalytical, social, historical, and linguistic approaches to literature.", "fall": true, "units": " 3"}, {"summer": false, "name": "Senior Seminar in World Literature", "prerequisites": "Prerequisite: Junior standing or Senior standing", "spring": true, "number": ")  497", "descripton": "Rotating topics in world literature, including treatment of materials from more than one culture and including consideration of the subject's theoretical or methodological framework.  Readings in English (original languages encouraged but not required).", "fall": false, "units": " 3"}, {"summer": true, "name": "Special Topics in English", "prerequisites": "Prerequisite: Six hours in ENG above the 100 level", "spring": true, "number": "ENG  498", "descripton": "Directed individual study or experimental course offerings in language or literature. Individual study arranged through consultation with faculty member and Director of Undergraduate Studies.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Special Topics in Creative Writing", "prerequisites": "Prerequisite: ENG 288 or ENG 289 ; Students must have earned a grade of \"B\" or better in 288 or 289 or they must have demonstrated competence in creative writing as determined by instructor.", "spring": true, "number": "ENG  499", "descripton": "Techniques and practice in writing a particular form within the traditional genres of poetry, prose, or drama, such as \"Creative Non-Fiction,\" \"Science Fiction,\" \"The Novella,\" or \"The Satirical Poem.\" Topics vary from semester to semester.", "fall": true, "units": " 3"}, {"summer": false, "name": "Verbal Data Analysis", "prerequisites": "Prerequisite: ENG 513 or ENG 527 or COM 541 or COM 542", "spring": false, "number": ")  506", "descripton": "Research strategies for understanding how spoken and written language shapes activities (e.g., design, instruction, counseling, gaming interactions, e-commerce, etc.). Tracking patterned uses of language as verbal data (e.g., grammatically topically, thematically), formulating research questions, and designing studies to answer those questions through quantitative descriptive means. Sampling, collecting and managing data, developing coding schemes, achieving reliability, using descriptive statistical measures, and reporting the results.", "fall": true, "units": " 3"}, {"summer": false, "name": "Writing for Health and Environmental Sciences", "prerequisites": "Prerequisite: Graduate standing, Doctoral student, Master's student", "spring": false, "number": "ENG  507", "descripton": "Readings, on-site research, document gathering, and analysis of writing in health and environmental science fields.  Students study, practice, and present major forms of writing in their profession.  Professional portfolio due at the end of the semester.  Intended for students interested in exploring or pursuing writing careers in medicine, pharmaceuticals, nutrition, agriculture, ecology, or other health and environmental science-related industries, or professionals who wish to improve knowledge and skills.", "fall": true, "units": " 3"}, {"summer": false, "name": "Usability Studies for Technical Communication", "prerequisites": "Prerequisite: ENG 517", "spring": true, "number": "ENG  508", "descripton": "Advanced study of usability inspection, inquiry, and testing theories and practices related to instrumental and instructive texts (i.e., computer-related, legal, medical, pharmaceutical, financial, etc.).  Practical experience testing a variety of texts using several testing methods, including completion of a substantial, lab-based usability test.  For students planning careers in technical communication, human factors, software design, and multimedia design.", "fall": false, "units": " 3"}, {"summer": false, "name": "Old English Literature", "spring": true, "number": "ENG  509", "descripton": "Study of Old English language with selections from important poems including Beowulf.  Examination of the poetry in the light of various modern critical approaches.", "fall": false, "units": " 3"}, {"summer": false, "name": "Middle English Literature", "spring": true, "number": "ENG  510", "descripton": "Study of major works of medieval English literature (exclusive of Chaucer's Canterbury Tales) in historical context, as reflections of and influences on social and cultural change.  Includes works such as Sir Gawain and the Green Knight, Pearl, Langland's Piers Plowman and Malory's Morte d'Arthur.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Theory and Research In Composition", "spring": "True", "number": "ENG  511", "descripton": "Research and scholarship in composition and the teaching of writing. Major theoretical perspectives (such as expressive, social, cognitive, feminist), current issues (such as audience, invention, revision, evaluation) and various research methods.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Theory and Research In Professional Writing", "prerequisites": "Corequisite: ENG 666", "spring": false, "number": "ENG  512", "descripton": "Introduction to research and scholarship in professional writing and writing in the workplace. Major theoretical perspectives for studying writing; current issues (such as usability, readability, collaboration, gender, authorship); and various research methods.", "fall": true, "units": " 3"}, {"summer": false, "name": "Empirical Research In Composition", "spring": true, "number": "ENG  513", "descripton": "Reading and evaluation of empirical research in written composition; guided practice in qualitative and quantitative methods.  Basic principles of research; problem definition, research design and statistical analysis, description and assessment of written products and processes.", "fall": false, "units": " 3"}, {"summer": false, "name": "History Of Rhetoric", "spring": false, "number": ")  514", "descripton": "Historical development of rhetorical theory with attention to contemporaneous rhetorical practice and philosophical trends. Major focus on the classical period with briefer coverage of medieval, Renaissance, 18th-century, and 19th-century developments. Implications for contemporary theory and practice, including pedagogical practice.", "fall": true, "units": " 3"}, {"summer": false, "name": "Rhetoric Of Science and Technology", "spring": true, "number": "ENG  515", "descripton": "The relationships among rhetoric, scientific knowledge and technological development and of changes in how these relationships understood historically. Practice in critical analysis of scientific and technical discourse. Consideration of scientific and technical language and of public controversy concerning science and technology.", "fall": false, "units": " 3"}, {"summer": false, "name": "Rhetorical Criticism:  Theory and Practice", "prerequisites": "Prerequisite: Graduate Standing or the equivalent of COM/ENG 321 or COM/ENG 411", "spring": false, "number": ")  516", "descripton": "Development, achievements, limitation of major critical methods in the 20th century, including neo-Aristotelian, generic, metaphoric, dramatistic, feminist, social-movement, fantasy-theme and postmodern approaches.  Criticism of political discourse,institutional discourse, discourses of law, medicine, religion, education, science, the media.  Relations between rhetorical and literary criticism and other forms of cultural analysis.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Technical Writing, Editing and Document Design", "prerequisites": "Prerequisite: ENG 314", "spring": false, "number": "ENG  517", "descripton": "Advanced study of document design, technical editing and usability.  For students planning careers as technical communicators.", "fall": true, "units": " 3"}, {"summer": false, "name": "Publication Management for Technical Communicators", "prerequisites": "Prerequisite: ENG 517", "spring": true, "number": "ENG  518", "descripton": "Advanced study of publication and team management issues such as staffing, scheduling, cost-reduction and subcontracting.  For students planning careers as technical communicators.", "fall": false, "units": " 3"}, {"summer": false, "name": "Online Information Design and Evaluation", "prerequisites": "Prerequisite: ENG 517", "spring": true, "number": "ENG  519", "descripton": "Concepts and practices related to multimedia information design, information architectures, human-computer interaction, and genre for complex websites.", "fall": false, "units": " 3"}, {"summer": false, "name": "Science Writing for the Media", "spring": false, "number": "ENG  520", "descripton": "Coverage of three areas: how to write science articles for a variety of mass media, how to think critically about how mass media cover science, and how to think critically about science itself.  Preparation for careers not only in mass media, but also in scientific and technological organizations.", "fall": true, "units": " 3"}, {"summer": false, "name": "Modern English Usage", "prerequisites": "Prerequisite: ENG 524", "spring": false, "number": "ENG  521", "descripton": "Analysis of what \"usage\" means, a look at the shaping of attitudes about English in the twentieth century and the service of language during that period to form social groups.  Attention to the transmission of these attitudes and to the role of the schools in that transmission.", "fall": true, "units": " 3"}, {"summer": false, "name": "Writing in Nonacademic Settings", "spring": true, "number": "ENG  522", "descripton": "Directed work experience for English Department graduate students including work-site mentoring and evaluation and concurrent academic assignments.  Academic component includes reading and discussing articles relevant to the day-to-day practice of writing in nonacademic settings and completion of a project that connects academic and nonacademic components.  Graduate Standing in an English Department graduate program required.  Modest liability insurance fee required.  Students must provide their own transportation to the practicum site.", "fall": false, "units": " 3"}, {"summer": false, "name": "Writing in Nonacademic Settings", "spring": true, "number": "ENG  522", "descripton": "Directed work experience for English Department graduate students including work-site mentoring and evaluation and concurrent academic assignments.  Academic component includes reading and discussing articles relevant to the day-to-day practice of writing in nonacademic settings and completion of a project that connects academic and nonacademic components.  Graduate Standing in an English Department graduate program required.  Modest liability insurance fee required.  Students must provide their own transportation to the practicum site.", "fall": false, "units": " 3"}, {"summer": false, "name": "Language Variation Research Seminar", "prerequisites": "Prerequisite: ENG 525", "spring": true, "number": "ENG  523", "descripton": "Field-initiated research.  Group and individual research topics focused on current sociolinguistic issues related to language variation and changes.  Ethnographic and quantitative methods of analysis.", "fall": false, "units": " 3"}, {"summer": false, "name": "Introduction to Linguistics", "prerequisites": "Prerequisite: Graduate standing or 12 hrs. in ENG", "spring": false, "number": "ENG  524", "descripton": "Introduction to theoretical linguistics, especially for students in language, writing and literature curricula. Phonology, syntax, semantics, history of linguistics; relation of linguistics to philosophy, sociology and psychology; application of theory to analysis of texts.", "fall": true, "units": " 3"}, {"summer": false, "name": "Variety In Language", "prerequisites": "Prerequisite: Graduate standing or 12 hrs. in ENG", "spring": true, "number": "ENG  525", "descripton": "Language variation description, theory, method and application; focus on regional, social, ethnic and gender varieties; sociolinguistic analysis, basic discourse analysis.", "fall": false, "units": " 3"}, {"summer": false, "name": "History Of the English Language", "spring": false, "number": "ENG  526", "descripton": "A survey of the growth and development of the language from its Indo-European beginnings to the present.", "fall": true, "units": " 3"}, {"summer": false, "name": "Discourse Analysis", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "ENG  527", "descripton": "Overview of major issues, theories, and research methods in contemporary discourse analysis.  It explores how language as a form of social practice regulates social actions, relations and identities; how ways of speaking construct and are constructed by social order, cultural practice, and individual agency.  Texts/discourses are analyzed to examine how speakers create meaning through formal linguistic choices; what the micro-organization of talk reveals about social order; how critical understanding of discourse helps to interpret complex processes of social life.", "fall": false, "units": " 3"}, {"summer": false, "name": "Language Change Research Seminar", "spring": true, "number": "ENG  528", "descripton": "Study of English development and English dialects; processes of language change; historical linguistic methodology; field research; language variation and change. Graduate standing.", "fall": false, "units": " 3"}, {"summer": false, "name": "16th-Century Non-Dramatic English Literature", "spring": false, "number": "ENG  529", "descripton": "Prose and poetry of the English Renaissance, excluding drama. Special attention to major authors, including Spenser and Sidney, and to intellectual, cultural and literary backgrounds and developments. Introduction to pertinent methods and issues of scholarly inquiry and critical interpretation.", "fall": true, "units": " 3"}, {"summer": false, "name": "17th-Century English Literature", "spring": true, "number": "ENG  530", "descripton": "A close examination of the literature of England from 1600 to 1660 with emphasis on major literary figures and movements, development of important literary forms and genres and relationship between literary texts of this period and their philosophical, political and theological contexts.  Some bibliographical and textural assignments.  Content and focus varies according to instructor's emphasis, but writers covered usually include Donne, Herbert, Crashaw, Marvell and Browne.", "fall": false, "units": " 3"}, {"summer": false, "name": "American Colonial Literature", "spring": true, "number": "ENG  531", "descripton": "Survey of American literature and thought from the beginning to adoption of the constitution. Representative works such as travel and exploration reports, Indian captivity narratives, diaries, journals, auto biographies, sermons and poetry.", "fall": false, "units": " 3"}, {"summer": false, "name": "Narrative Analysis", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "ENG  532", "descripton": "Introduction to theories concerning the structure, use, and interpretation of narratively organized discourse; application of methods of narrative analysis to both spoken and written narratives.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Bilingualism and Language Contact", "spring": "True", "number": "ENG  533", "descripton": "Linguistic, cultural and socio-political aspects of bi- and mulitlingualism in a global context.  Issues and implications of bilingualism from both theoretical and practical perspectives.  Topics inlcude: language maintenance and shift; child and adult bilingualism; relationship between language, culture and identity in bi- and multilingual situations; psycholinguistic aspects and lingustic outcomes of bilingual contact, such as code-switching, convergence and language attrition; language ideology, the politics of language choice and language policy; globalization and intercultural communication.  Must hold graduate standing or get consent of instructor for advanced undergraduate students.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Quantitative Analysis om Sociolinguistics", "prerequisites": "Prerequisite: ENG 523", "spring": false, "number": "ENG  534", "descripton": "The quantitative methods specific to sociolinguistic variation are examined in detail, focusing both on gaining experience using quantitative analysis software and on understanding fundamental concepts underlying the quantitative analysis of language variation.  This course takes students beyond the basic familiarity with quantitative analysis gained in ENG 523, both in depth of investigation and in attention to the link between method and theory.", "fall": true, "units": " 3"}, {"summer": false, "name": "Sociolinguistic Methods", "spring": false, "number": "ENG  535", "descripton": "This course introduces students to the fundamental methodology of sociolinguistics.  Students will learn about interviewing techniques, IRB regulations, and both quantitative and qualitative data analysis techniques.", "fall": true, "units": " 3"}, {"summer": false, "name": "Seminar In World Literature", "spring": true, "number": ")  539", "descripton": "Rotating topics in world literature, including treatment of the subject's theoretical or methodological framework. Possible subjects:  colonialism and literature; orality and literature; the Renaissance; the Enlightenment; translation; comparison ofNorth and South American literatures; African literary traditions; post-modernism and gender. Readings in English (original languages encouraged but not required).", "fall": false, "units": " 3"}, {"summer": false, "name": "History Of Literary Criticism", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": false, "number": "ENG  540", "descripton": "Survey of the history of literary criticism from Antiquity to early Modern period. Introduction to major theoretical definitions of literature and modes of practical criticism. Close study of Aristotle's Poetics, Sidney's Apology for Poetry, Pope's Essay on Criticism, Coleridge's Biographia Literaria, Eliot's essays and other landmark works in development of literary criticism.", "fall": true, "units": " 3"}, {"summer": false, "name": "Literary and Cultural Theory", "spring": false, "number": ")  541", "descripton": "A survey of literary theory in the 20th century from New Criticism to postmodernism. Examines the virtues and pitfalls of these approaches to the study of culture and literature. A course on issues, concepts, theorists and the sociohistorical and political context in which the theorists are writing. Taught in English.  No formal pre-requisites. However, students who have not had advanced literature will be disadvantaged.", "fall": true, "units": " 3"}, {"summer": false, "name": "African-American Literature", "prerequisites": "Prerequisite: Grad. standing", "spring": false, "number": "ENG  548", "descripton": "Advanced study of critical theories of African-American literature, the contexts of cultural criticism and 20th-century novels of African-American writers within these frames.", "fall": true, "units": " 3"}, {"summer": false, "name": "Modern African Literature", "spring": true, "number": "ENG  549", "descripton": "The works of the most important writers shaping modern African literature in English (and English translation).  Selections from East, West, North and South Africa, spanning colonial through post-colonial Africa--from literature of protest and culture conflict to that of disillusionment, reappraisal and feminism.", "fall": false, "units": " 3"}, {"summer": false, "name": "English Romantic Period", "spring": false, "number": "ENG  550", "descripton": "A detailed study of the six major romantic poets--Blake, Wordsworth, Coleridge, Byron, Shelley, and Keats; some attention as well to the political, social and literary background and to a few minor writers and critics.", "fall": true, "units": " 3"}, {"summer": false, "name": "Chaucer", "prerequisites": "Prerequisite: ENG 451, Graduate standing", "spring": false, "number": "ENG  551", "descripton": "Intensive study of the works of Chaucer in the light of medieval literary traditions, medieval history and a variety of medieval and modern critical approaches.", "fall": true, "units": " 3"}, {"summer": false, "name": "Contemporary Rhetorical Theory", "spring": true, "number": ")  554", "descripton": "Contemporary rhetorical theory covering the 20th and 21st centuries. Conceptual connections with and disruptions of the classical tradition and its, successors; relationship between rhetorical  theory and philosophical trends, institutional histories, socioeconomic circumstances, and pedagogical needs. Attention to current issues such as the revival of invention, rhetorical agency, and ethics.", "fall": false, "units": " 3"}, {"summer": false, "name": "American Romantic Period", "spring": false, "number": "ENG  555", "descripton": "The literary culture of the United States from 1820s through 1860s, setting works of transcendentalists and other romantic writers within sociohistorical contexts.  Consideration of writing by women, slave narratives and popular fiction as well as such major figures as Emerson, Hawthorne, Thoreau and Melville.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Studies In Shakespeare", "spring": "True", "number": "ENG  558", "descripton": "An intensive study of a particular phase of the Shakespeare canon.  Emphasis will normally be on one dramatic genre (tragedy, comedy, history), but occasionally the focus may be more limited.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Seminar in Film Studies", "spring": true, "number": ")  559", "descripton": "Advanced critical approaches to focused film topics involving film genres, directories styles, or trends within a national cinema. This seminar-style course will include screenings, readings, regular discussions, and a substantive final research paper. Topics will vary from semester to semester. Junior or senior standing or permission of instructor required.", "fall": false, "units": " 3"}, {"summer": false, "name": "Victorian Poetry and Critical Prose", "spring": true, "number": "ENG  560", "descripton": "The literature of Victorian England: 1837-1901; the major poets and essayists, movements and questions in their historical contexts, religious, political and aesthetic.", "fall": false, "units": " 3"}, {"summer": false, "name": "Milton", "spring": true, "number": "ENG  561", "descripton": "An intensive reading of Milton with attention to background materials in history and culture of seventeenth-century England.", "fall": false, "units": " 3"}, {"summer": false, "name": "18TH-Century English Literature", "spring": false, "number": "ENG  562", "descripton": "British writers of the period 1600-1790 studied in historical and cultural contexts.  Usually includes works by Dryden, Swift, Pope, Defoe, Mandeville, Boswell and Johnson, but addition of other significant writers possible.", "fall": true, "units": " 3"}, {"summer": false, "name": "18TH-Century English Novel", "spring": true, "number": "ENG  563", "descripton": "Selected British novels of the Restoration and eighteenth century from a variety of contemporary critical perspectives. Such writers as Fielding, Richardson, Sterne, Burney, Smollett and Austen.", "fall": false, "units": " 3"}, {"summer": false, "name": "Victorian Novel", "spring": false, "number": "ENG  564", "descripton": "Study of selected British novels published between 1837 and 1901 in contexts of the development of the genre, historical period and current literary theory.  Such writers as Dickens, Thackeray, Bronte, Trollope, Eliot, Meredith and Hardy.", "fall": true, "units": " 3"}, {"summer": false, "name": "American Realism and Naturalism", "spring": true, "number": "ENG  565", "descripton": "Study of literary culture of United States from 1860s to early 1900s with emphasis on fiction by such realists and naturalists as Twain, Howells, Chesnutt, James, Crane, Wharton, Dreiser and Norris. Inclusion of prose of writers such as Adams and DuBois possible.", "fall": false, "units": " 3"}, {"summer": false, "name": "20TH-Century British Prose", "spring": false, "number": "ENG  570", "descripton": "Examination of British fiction of this century and relationship of significant intellectual, historical and political issues. Inclusion of such writers as Joyce, Conrad, Woolf, Lawrence, Beckett and Murdoch possible but also post-colonial novelists as well.", "fall": true, "units": " 3"}, {"summer": false, "name": "20TH-Century British Poetry", "spring": true, "number": "ENG  571", "descripton": "Development of English poetry from its late Victorian phase through Modernism to present post-war scene. Inclusion of such writers as Hardy, Yeats, Eliot, Smith, Auden, Larkin, Heaney, Wolcott and Hill possible.", "fall": false, "units": " 3"}, {"summer": false, "name": "Modern British Drama", "spring": false, "number": "ENG  572", "descripton": "Survey of modern British drama from its beginnings at turn of the century to present.", "fall": true, "units": " 3"}, {"summer": false, "name": "Modern American Drama", "spring": false, "number": "ENG  573", "descripton": "A survey of modern American drama centering on major figures.", "fall": true, "units": " 3"}, {"summer": false, "name": "Southern Writers", "spring": true, "number": "ENG  575", "descripton": "Introduction to literary culture of \"the South,\" tracing the roots of the twentieth-century \"Southern Renaissance\" in such ante-bellum genres as plantation fiction, Southwestern humor, fugitive-slave narration and pastoral elegy.  Examination of persistence of \"Southern\" writing within increasingly standardized culture of the United States.", "fall": false, "units": " 3"}, {"summer": false, "name": "20TH-Century American Poetry", "spring": true, "number": "ENG  576", "descripton": "Development of modern American poetry from rebellion against the romantic and genteel verse of the 1890's; special attention to Robinson, Frost, Pound, Williams, Stevens and Ransom.", "fall": false, "units": " 3"}, {"summer": false, "name": "20th-Century American Prose", "spring": true, "number": "ENG  577", "descripton": "An examination of representative American writers of novel and short fiction.", "fall": false, "units": " 3"}, {"summer": false, "name": "English Drama To 1642", "prerequisites": "Prerequisite: ENG 261 and upper division or Graduate standing", "spring": false, "number": "ENG  578", "descripton": "Elizabethan and Jacobean drama from 1580 to 1642, excluding Shakespeare.  Coverage of such writers as Marlowe, Jonson, Webster, Beaumont and Fletcher, Heywood, Tourneur and Ford.", "fall": true, "units": " 3"}, {"summer": false, "name": "Restoration and 18th-Century Drama", "spring": true, "number": "ENG  579", "descripton": "Representative British plays of the period 1660-1780 studied in cultural, social and ethical contexts. Usually includes works by Etherege, Wycherley, Behn, Dry-den, Otway, Vanburgh, Farquhar, Congreve, Lillo, Gay, Goldsmith and Sheridan.", "fall": false, "units": " 3"}, {"summer": false, "name": "Literary Postmodernism", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "ENG  580", "descripton": "Post-1945 literary theory in relationship with representative avant-garde writers. Theoretical and argumentative essays in such areas as chaos theory, deconstruction, feminism and the limits of fiction. Fiction readings by Calvino, Pynchon, Barthelme, Cortazar and others.", "fall": false, "units": " 3"}, {"summer": false, "name": "Visual Rhetoric: Theory and Criticism", "prerequisites": "Graduate Students Only", "spring": true, "number": ")  581", "descripton": "Application of visual theory to rhetoric and of rhetorical theory to visual forms of communication. Discussion and analysis may include advertising, photography, news and informational media, political communication, instructional material, scientific visualization, visual arts, public commemorative artifacts, internet and other digital media.", "fall": false, "units": " 3"}, {"summer": false, "name": "Studies in Literature", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "ENG  582", "descripton": "Variation in content. Selected problems and issues in literature.", "fall": true, "units": " 3"}, {"summer": false, "name": "Studies In Composition and Rhetoric", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "ENG  583", "descripton": "Variation in content. Selected problems and issues in composition and rhetoric.", "fall": true, "units": " 3"}, {"summer": false, "name": "Studies In Linguistics", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "ENG  584", "descripton": "Variation in content. Selected problems and issues in linguistics.", "fall": true, "units": " 3"}, {"summer": false, "name": "Studies In Film", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "ENG  585", "descripton": "Variation in content. Selected problems and issues in film.", "fall": true, "units": " 3"}, {"summer": false, "name": "Studies In Theory", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "ENG  586", "descripton": "Variation in content. Selected problems and issues in theory.", "fall": true, "units": " 3"}, {"summer": false, "name": "Fiction Writing Workshop", "prerequisites": "Prerequisite: ENG 488 or ENG 489", "spring": false, "number": "ENG  588", "descripton": "Advanced work in techniques of writing fiction for students with substantial experience in writing. Workshop sessions with students commenting on each other's work.", "fall": true, "units": " 3"}, {"summer": false, "name": "Poetry Writing Workshop", "prerequisites": "Prerequisite: ENG 488 or ENG 489", "spring": true, "number": "ENG  589", "descripton": "Advanced work in techniques of writing poetry for students with substantial experience in writing. Workshop sessions with students commenting on each other's work.", "fall": false, "units": " 3"}, {"summer": false, "name": "Studies In Creative Writing", "prerequisites": "Prerequisite: ENG 588 or 589", "spring": true, "number": "ENG  590", "descripton": "Techniques special to a particular kind of writing within the traditional genres of prose, poetry or drama, such as \"Speculative Fiction\" or \"The Long Poem or Poetic Sequence.\"  Various subjects.", "fall": false, "units": " 3"}, {"summer": false, "name": "Studies in National Cinemas", "spring": true, "number": "ENG  591", "descripton": "Aesthetic develpments and historical importance of national cinema traditions in specific cultural contexts.  Focus on the relation between cinema and linguistic, literary and artistic develpments within a national setting or in regional or international contexts.  Topics, which change each year, may include Italian Neorealism, French New Wave, and British Social Realism.", "fall": false, "units": " 3"}, {"summer": false, "name": "Special Topics in Film Styles and Genres", "spring": true, "number": "ENG  592", "descripton": "Critical approaches to focused film topics involving film genres, directorial styles, or trends within a national cinema.  Topics will vary from semester to semester.  Students cannot obtain credit for both ENG 492 and ENG 592.", "fall": true, "units": " 3"}, {"summer": true, "name": "Special Topics English", "spring": true, "number": "ENG  610", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Teaching College Composition", "prerequisites": "Prerequisite: ENG 511 and mentored assistantship in ENG 101", "spring": false, "number": "ENG  624", "descripton": "Preparation for teaching college composition. Introduction to pedagogical principles and practices.  Practice in setting course goals, designing writing assignments to meet those goals, developing instructional activities to support assignments, andevaluating student writing.  The course is scheduled as a 5-day workshop before classes begin, followed by weekly meetings and mentoring during the fall semester.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Writing for Empirical Research", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "ENG  626", "descripton": "A seminar and workshop for graduate students in empirical research fields working on grant proposals, theses and dissertations, papers for professional journals, conference proposals, and other significant research texts.  Intensive practice and feedback on writing, grounded in an introduction to theory and research on writing processes, products, and contexts.  Requirements include three major writing projects designed by the student, review and discussion of drafts written by other workshop members, analysis and presentation of discipline-specific communication patterns and practices.", "fall": false, "units": " 3"}, {"summer": true, "name": "Directed Readings", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "ENG  636", "descripton": "Intensive study of a specific topic from various specializations of the English faculty.  Negotiation between the student and the director for variable credit and approved by Director of Graduate Studies.", "fall": true, "units": " 1-6"}, {"summer": "True", "name": "Bibliography and Methodology", "spring": "True", "number": "ENG  669", "descripton": "Intensive study of the bibliography and methodology of literary research. Required of all graduate students in English.", "fall": "True", "units": " 1-3"}, {"summer": false, "name": "Projects in Technical Communication", "prerequisites": "Prerequisite: ENG 518", "spring": true, "number": "ENG  675", "descripton": "Capstone course for M.S. in Technical Communication.  Students engage in major semester-long individual project under direction of instructor.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Master's Project in English", "spring": "True", "number": "ENG  676", "descripton": "Individual capstone project in English Studies.  Topic and mode of study determined in consultation with faculty project advisor.  For students in the final semester of the English MA program.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ENG  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ENG  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ENG  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": true, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ENG  690", "descripton": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ENG  693", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": false, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ENG  695", "descripton": "Thesis research.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "ENG  696", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": false, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ENG  699", "descripton": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their theses.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Linguistics and Literacy", "prerequisites": "Prerequisite: ENG 525", "spring": true, "number": "ENG  722", "descripton": "Focus on two-way relationship between linguistic theory and literacy. Metalinguistic awareness and acquisition of literacy, orthography and phonology, oral vs. written language, oral vs. literate cultures, and metalinguistic assumptions in linguistic theory.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Language Variation Research Seminar", "spring": true, "number": "ENG  723", "descripton": "This course is designed for PhD students who have basic knowledge of sociolinguistic variation. It looks in detail at the fundamental theories, methods, and conclusions that have shaped the study of sociolinguistic variation during the past 50 years, and it provides solid familiarity with theory and quantitative methods. Students will carry out quantitative research on linguistic variation.", "fall": false, "units": " 3"}, {"summer": false, "name": "Discourse Analysis", "spring": true, "number": "ENG  727", "descripton": "Overview of major issues, theories, and research methods in contemporary discourse analysis.  It explores how language as a form of social practice regulates social actions, relations and identities; how ways of speaking construct and are constructed by social order, cultural practice, and individual agency.  Texts/discourses are analyzed to examine how speakers create meaning through formal linguistic choices; what the micro-organization of talk reveals about social order; how critical understanding of discourse helps to interpret complex processes of social life.", "fall": false, "units": " 3"}, {"summer": false, "name": "Language Variation and Social Theory", "prerequisites": "Prerequisite: ENG 523", "spring": true, "number": "ENG  729", "descripton": "Although the field of sociolinguistic variation has developed its own body of theory, its central questions continue to call for engagement with theory in related socio-cultural disciplines.  This course examines sociolinguists' explicit and implicit incorporation of social theory into the analysis of language variation; it also explores the many ways in which social theory could yet enrich, and be enriched by, empirical sociolinguistic analysis.", "fall": false, "units": " 3"}, {"summer": false, "name": "Ethnolinguistic Variation", "prerequisites": "Prerequisite: ENG 525", "spring": true, "number": "ENG  730", "descripton": "This course examines the nature of ethnolinguistic variation in the English-speaking diaspora, with particular attention to the ethnic varieties in the United States, including African American English, Hispanic English, and Native American English.", "fall": false, "units": " 3"}, {"summer": false, "name": "Applied Sociolinguistics", "prerequisites": "Prerequisite: ENG 525", "spring": true, "number": "ENG  731", "descripton": "This course will introduce the main research concentrations and methods in Applied Sociolinguistics, including first language acquisition and teaching, second language learning, bilingualism, and clinical assessment and treatment of communication disorders.  Students will be introduced to the basic foundations of language variation from linguistic and sociocultural/historical perspectives and learn how sociolinguistic variation affects clinical and educational processes and organizations.", "fall": false, "units": " 3"}, {"summer": false, "name": "Special Topics in English Studies", "spring": true, "number": "ENG  798", "descripton": "Intensive exploration of specialized or emerging topics in an area of language, literature, rhetoric, film, or other aspect of English studies.  Emphasis on student research and writing.  May be used to test and develop new courses.  May be repeated for credit.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Directed Readings in English Studies", "spring": "True", "number": "ENG  810", "descripton": "Intensive study of a specific topic from various specializations of the English faculty.  Negotiation between the student and the director for the variable credit and approved by the director of Graduate Studies. May be repeated for credit.", "fall": "True", "units": " 1-6"}, {"summer": "True", "name": "Summer Dissert Res", "spring": "True", "number": "ENG  896", "fall": "True", "units": " 1"}]