[{"summer": false, "name": "Insects and People", "spring": false, "number": "ENT  201", "descripton": "Introduction to the fascinating world of insects and how they interact with people.  Survey of insect history, diversity, structure and function, and behavior. Examples of harmful and beneficial insects in a variety of human activities concluding with some profound impacts insects have had on history, society and culture.", "fall": false, "units": " 3"}, {"summer": false, "name": "An Introduction to the Honey Bee and Beekeeping", "spring": false, "number": "ENT  203", "descripton": "Introduction to honey bee biology and a fundamental understanding of beekeeping management including crop pollination by bees.  Examination of the relationships between honey bees and humans from prehistoric through modern times and the behavior and social system of one of the animal world's most complex and highly organized non-human societies.", "fall": true, "units": " 3"}, {"summer": false, "name": "Insects and Human Disease", "spring": true, "number": "ENT  207", "descripton": "This course is an introduction to the many interactions between insects, other arthropods and humans that result in disease, ranging from simple anxiety, phobias, discomfort and pain, to transmission of pathogenic organisms causing sickness and even death. Included will be an understanding of the special physical and chemical adaptations of insects that enable them to cause us harm. The major groups of insects, mites, ticks and related arthropods associated with human suffering and disease as well as an introduction to the diseases transmitted by them will be presented. Finally, the course will present information on how major outbreaks of disease transmitted by the insects have influenced human populations, demographics, warfare, religion, and societal structure throughout recorded history.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Forensic Entomology", "spring": true, "number": "ENT  305", "descripton": "This course provides a broad overview of forensic entomology-a specialized field of entomology employed in medicocriminal investigations.  Forensic entomology relies on knowledge of insect ecology, biology, taxonomy, physiology and development to elucidate the circumstances surrounding death.  The role of arthropods associated with decomposed human remains is one of several valued disciplines in forensic sciences.  Understanding the general principles of forensic entomology and their application will be the focus of this course.", "fall": false, "units": " 3"}, {"summer": false, "name": "Honey Bee Biology and Management", "prerequisites": "Prerequisite: (ENT 201, ENT 203, ENT 425, BIO 105 or PB 200)", "spring": true, "number": "ENT  401", "descripton": "A hands-on course in honey bee management including bee pollination of selected crops based on an understanding of bee biology, bee behavior, bee pathology, and bee botany.  Students must be able to provide their transportation to field sites or arrange to work with a beekeeping mentor.  Students may choose, but are not required, to purchase their own beekeeping equipment and hive.", "fall": false, "units": " 3"}, {"summer": false, "name": "Forest Entomology", "prerequisites": "Prerequisite: Junior standing.", "spring": true, "number": ")  402", "descripton": "Fundamentals of morphology, classification, biology, ecology and control of insects attacking trees, with emphasis on silvicultural practices.", "fall": false, "units": " 3"}, {"summer": true, "name": "General Entomology", "prerequisites": "Prerequisite: BIO 181 or BIO 140 or  BIO 350", "spring": false, "number": ")  425", "descripton": "Explores the science of entomology by focusing on the basic principles of systematics, morphology, physiology, development, behavior, ecology, and control of insects. Field trips provide opportunities to collect insects and study their adaptations to a wide variety of natural environments.", "fall": true, "units": " 3"}, {"summer": false, "name": "Challenges in Plant Resource Protection", "prerequisites": "Prerequisite: CS 414 or ENT 425 or PP 315", "spring": true, "number": ")  450", "descripton": "This course provides applied training to students in the scientific and regulatory aspects of plant protection using real-world studies, scenarios, and addressing important contemporary issues for safeguarding American agriculture.  Students will gain hands-on problem solving abilities regarding the diagnosis, containment, and mitigation of  introduced plant pests and pathogens.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Fundamentals of (Pest) Risk Analysis", "spring": "True", "number": ")  460", "descripton": "This course provides students with a historical perspective as well as real-time exposure to working professionals involved in the development of risk analysis documents for plant protection.  The course uses real world scenarios and addresses contemporary issues facing scientists and regulators tasked with safeguarding American agriculture.  Students will gain hands-on problem solving abilities regarding the identification and mitigation of plant pathogens, insects, and noxious weeds that can be introduced into the USA through international trade in agricultural commodities.", "fall": "True", "units": " 1"}, {"summer": false, "name": "Advanced Turfgrass Pest Management", "prerequisites": "Prerequisite: C- or better in CS 200", "spring": true, "number": ")  470", "descripton": "Characteristics and ecology of turfgrass weed, insect, and disease pests; identification and diagnosis of turfgrass pests, strategies for managing pests including cultural, mechanical, biological, and chemical methods; development of integrated pestmanagement programs, characteristics and modes of action for herbicides, insecticides, fungicides, and plant growth regulators; behavior and fate of pesticides in soil; and the development and management of pesticide resistant pest populations.", "fall": false, "units": " 2"}, {"summer": false, "name": "External Learning Experience", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "ENT  492", "descripton": "A learning experience within an academic framework that utilizes facilities and resources which are external to the campus. Contact and arrangements with prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior to the experience.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Special Problems in Entomology", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "ENT  493", "descripton": "A learning experience in agriculture and life sciences within an academic framework that utilizes campus facilities and resources. Contact and arrangements with prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior to the experience.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Special Topics in Entomology", "spring": true, "number": "ENT  495", "descripton": "Offered as needed to present materials not normally available in regular course offerings or for offering of new courses on a trial basis.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Advanced Beekeeping", "prerequisites": "Prerequisite: ENT 203", "spring": true, "number": "ENT  501", "descripton": "A hands-on course in honey bee management with some emphasis on bee pollination of selected crops based on an understanding of bee biology, bee behavior, bee pathology and bee botany.Credit not allowed for both ENT 401 and ENT 501.", "fall": false, "units": " 3"}, {"summer": false, "name": "Insect Diversity", "prerequisites": "Prerequisite: ENT 425", "spring": false, "number": "ENT  502", "descripton": "Diversity of insect biology and structure with emphasis upon identification of adults; includes speciation, evolutionary relationships, approaches to classification, nomenclature, zoogeography and techniques of collection.", "fall": true, "units": " 4"}, {"summer": false, "name": "Insect Morphology and Physiology", "prerequisites": "Prerequisite: CH 221, 223 and ENT 425", "spring": true, "number": "ENT  503", "descripton": "The objectives are to acquaint students with the internal morphology, histology, and ultra-structure and system functions of insects.  The laboratory will assist in recognizing the internal anatomy and associated external structure of insects and provide practical experience in the study of insect function.", "fall": false, "units": " 3"}, {"summer": false, "name": "Professional Development for Entomologists", "spring": false, "number": "ENT  504", "descripton": "A successful professional career in entomology is not limited to understanding just the science of Entomology. Also required is an understanding of career paths, professional ethics, written and verbal communication, safety, how to work with animals and human subjects, personal interactions, vita preparation, networking, and future directions of the discipline. These skills are essential to taking the knowledge obtained in entomology and applying them to a career in the discipline. Graduate Standing required.", "fall": true, "units": " 2"}, {"summer": false, "name": "Biology of Aquatic Insects", "prerequisites": "Prerequisite: ENT 425", "spring": true, "number": ")  509", "descripton": "Life history descriptions and identification of aquatic insects.  Emphasis on behavioral and physiological adaptations to diverse habitats and the role of insects in aquatic ecosystem function and as indicators of water quality.", "fall": false, "units": " 3"}, {"summer": false, "name": "Insect Behavior", "spring": true, "number": "ENT  520", "descripton": "This course stresses comprehensive coverage of the principles of animal behavior using insects as models and examples.  Physiology, genetics, mechanisms, behavioral ecology, and evolution of insect behavior will be covered.", "fall": false, "units": " 3"}, {"summer": false, "name": "Entomology for Educators", "prerequisites": "Prerequisite: General Biology", "spring": true, "number": "ENT  525", "descripton": "Insects and other arthropods used as paradigms for teaching basic principles of Biology and Ecology.  Project-oriented format covering topics embracing the learnign cycle, scientific method, critical thinking skills, and hand-on laboratory activites.", "fall": false, "units": " 3"}, {"summer": false, "name": "Organic Agriculture: Principles and Practices", "spring": true, "number": "ENT  526", "descripton": "This is a multidisciplinary class, and lectures cover many aspects of organic production given by a number of experts from both on and off campus. Classes also include discussions of issues and controversies surrounding organic production, as well as field trips to selected farms. This course is restricted to upper level undergraduate, graduate, or post-baccalaureate continuing education students.", "fall": false, "units": " 3"}, {"summer": false, "name": "Insect Neurogenomics", "prerequisites": "Prerequisite: GN 413/513 or similar coursework (with permission of instructor)", "spring": true, "number": ")  527", "descripton": "Sensory processing systems in the insect brain (visual, olfactory, gustatory, and mechanosensory), learning and memory and circadian rhythm.  Each process will be considered at the behavioral, anatomical, neural, and genetic level.  Examples will bedrawn from multiple insect species, using recent studies.  Techniques: quantitative real-time PCR, microarrays, mapping quantitative trait loci, Drosophila transgenics, RNAi, imaging neuronal activity, etc.  For Graduate students with background in molecular biology techniques.", "fall": false, "units": " 3"}, {"summer": false, "name": "Fundamentals of Arthropod Management", "prerequisites": "Prerequisite: ENT 425", "spring": false, "number": "ENT  550", "descripton": "The principles underlying modern methods for protecting food, clothing, shelter and health from insect attack.", "fall": true, "units": " 3"}, {"summer": false, "name": "Techniques in Molecular Ecology and Evolution", "spring": true, "number": "ENT  560", "descripton": "Laboratory-intensive course providing hands-on experience in application of several commonly used techniques in molecular ecology and evolution.  Lectures cover theory and application of specific techniques in the context of case studies from the primary literature.  By end of course, students should be comfortable with theory and application of molecular markers in studies of ecology and evolution, and should be able to incorporate one or more techniques into their thesis research.  Graduate standing or permission of the instructors required.", "fall": false, "units": " 3"}, {"summer": false, "name": "Medical and Veterinary Entomology", "prerequisites": "Prerequisite: ENT 425 or Graduate standing", "spring": true, "number": ")  582", "descripton": "The morphology, taxonomy, biology and control of the arthropod parasites and disease vectors of man and animals. The ecology and behavior of vectors in relation to disease transmission and control.", "fall": false, "units": " 3"}, {"summer": false, "name": "Special Topics In Entomology", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "ENT  591", "descripton": "A variable credit lecture and laboratory series offering topics such as advanced beekeeping, morphology, physiology, systematics, behavior, biological control, nursery and ornamental pests, host plant resistance, information retrieval, biological monitoring and sampling, population modeling, extension entomology, computer methods and urban, forest and stored product pests.", "fall": true, "units": " 3"}, {"summer": false, "name": "Seminar", "prerequisites": "Prerequisite: Graduate standing in ENT or closely allied fields", "spring": true, "number": "ENT  601", "descripton": "Discussion of entomological topics selected and assigned by seminar chair.", "fall": true, "units": " 1"}, {"summer": false, "name": "Insect Natural History and Field Ecology", "prerequisites": "Prerequisite: Graduate standing in Entomology", "spring": false, "number": "ENT  604", "descripton": "Diversity of ecological roles and lifestyles of insects and related arthropods using techniques in field ecology.  Two week-long field trips to Coastal Plain and Mountains with orientation walks, evening lectures, and field projects.Taught during the two weeks prior to the Fall semester.", "fall": true, "units": " 1"}, {"summer": false, "name": "Special Problems", "spring": true, "number": "ENT  620", "descripton": "Original research on special problems in entomology not related to a thesis problem. Provides experience and training in research.Credits Arranged.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Agricultural Entomology Practicum", "prerequisites": "Prerequisite: Economic entomology (ENT 762 recommended)", "spring": false, "number": "ENT  641", "descripton": "Practical experience in research, extension and commercial aspects of insect pest management on a broad range of agricultural crops under actual field conditions. Class meets 9 hours each Friday for 10 weeks from early June to mid-August. Students should register for second summer session.", "fall": false, "units": " 3"}, {"summer": false, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ENT  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ENT  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ENT  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": false, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ENT  690", "descripton": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ENT  693", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": false, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ENT  695", "descripton": "Thesis research.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "ENT  696", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": false, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "ENT  699", "descripton": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their theses.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Insect Pathology", "prerequisites": "Prerequisite: ENT 425 and MB 351", "spring": true, "number": "ENT  720", "descripton": "A treatment of the noninfectious and infectious diseases of insects, the etiological agents and infectious processes involved, immunological responses and applications.", "fall": false, "units": " 3"}, {"summer": false, "name": "Biological Control of Insects and Weeds", "prerequisites": "Prerequisite: ENT 425", "spring": false, "number": "ENT  726", "descripton": "Overview of the field of biological control and its role in Integrated Pest Management programs. Emphasis on the diversity and sometimes unusual interactions of insect parasitoids and predators with their hosts/prey, controversies in biological control, critical analysis of selected projects, and basic conceptual and \"hands-on\" tools for approaching biological control research and implementing projects.", "fall": true, "units": " 3"}, {"summer": false, "name": "Insect Ecology", "prerequisites": "Prerequisite: ENT 425 and BO (ZO) 760", "spring": false, "number": "ENT  731", "descripton": "The interrelationships among insects and components of their effective environments which result in dynamic spatial and temporal patterns of particular species. Also, the diverse roles of insects in structure and function of communities and ecosystems.", "fall": true, "units": " 3"}, {"summer": false, "name": "Insect Pest Management In Agricultural Crops", "prerequisites": "Prerequisite: ENT 425", "spring": true, "number": "ENT  762", "descripton": "Critical review of the biology and ecology of representative beneficial and injurious insects and arachnids of agricultural crops and the advantages and limitations of advanced concepts of their management in selected agroecosystems.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Forest Entomology", "prerequisites": "Prerequisite: ENT 402 or ENT 502", "spring": true, "number": "ENT  765", "descripton": "Coverage of the important insect pests of forest and shade trees including regeneration pests, defoliating insects, inner-bark borers, wood borers, sucking insects, and bud, twig and root feeding insects.  Detailed examination of concepts in forest pest management and population dynamics.", "fall": false, "units": " 3"}, {"summer": false, "name": "Special Topics In Entomology", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "ENT  791", "descripton": "A variable credit lecture and laboratory series offering topics such as advanced beekeeping, morphology, physiology, systematics, behavior, biological control, nursery and ornamental pests, host plant resistance, information retrieval, biological monitoring and sampling, population modelling, extension entomology, computer methods and urban, forest and stored product pests.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Seminar", "prerequisites": "Prerequisite: Graduate standing in ENT or closely allied fields", "spring": true, "number": "ENT  801", "descripton": "Discussion of entomological topics selected and assigned by seminar chair.", "fall": true, "units": " 1"}, {"summer": false, "name": "Insect Natural History and Field Ecology", "prerequisites": "Prerequisite: Graduate standing in Entomology", "spring": false, "number": "ENT  804", "descripton": "Diversity of ecological roles and lifestyles of insects and related arthropods using techniques in field ecology.  Two week-long field trips to Coastal Plain and Mountains with orientation walks, evening lectures, and field projects.Taught during the two weeks prior to the Fall semester.", "fall": true, "units": " 1"}, {"summer": false, "name": "Special Problems", "spring": true, "number": "ENT  820", "descripton": "Original research on special problems in entomology not related to a thesis problem. Provides experience and training in research.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Agricultural Entomology Practicum", "prerequisites": "Prerequisite: Economic entomology (ENT 762 recommended)", "spring": false, "number": "ENT  841", "descripton": "Practical experience in research, extension and commercial aspects of insect pest management on a broad range of agricultural crops under actual field conditions. Class meets 9 hours each Friday for 10 weeks from early June to mid-August. Students should register for second summer session.", "fall": false, "units": " 3"}, {"summer": false, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "ENT  885", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Doctoral Preliminary Exam", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "ENT  890", "descripton": "For students who are preparing for and taking written and/or oral preliminary exams.", "fall": true, "units": " 1-9"}, {"summer": false, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "ENT  893", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": false, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "ENT  895", "descripton": "Dissertation research.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "ENT  896", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": false, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "ENT  899", "descripton": "For students who have completed all credit hour, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations.", "fall": true, "units": " 1-3"}]