[{"summer": false, "name": "Introduction to Environmental Sciences", "spring": false, "number": ")  100", "descripton": "Environmental Science majors only, permission of instructor.  Interrelationships between human populations and the natural environment.  Human population trends, agriculture, air and water pollution, biological diversity, forest and land use, energyand mineral resources, and toxic substances.  Consideration of related economic factors, laws, politics, political behavior, and ethical questions.", "fall": false, "units": " 3"}, {"summer": false, "name": "Climate Change and Sustainability", "spring": true, "number": "ES  200", "descripton": "This course explores the relationships between humans and the environment with interdisciplinary content. Focus is on past impacts of climate change on human activities and future prospects. Course content is based on lectures with students also responsible for developing and presenting seminars.", "fall": true, "units": " 3"}, {"summer": false, "name": "Special Topics in Environmental Science", "spring": true, "number": "ES  295", "descripton": "Provides instruction on rapidly emerging curriculum. Also provides courses on an experimental basis before incorporation into the curriculum. See specific course offering for course details.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Energy and Environment", "prerequisites": "Prerequisite: CH 101 or PY 212 or PY 208", "spring": true, "number": "ES  300", "descripton": "This course explores relationships between humans, energy, and the environment with interdisciplinary context. Themes include environmental impacts of energy production, distribution and use with discussion of new technologies. Half of the course content is from subject lectures and half from self-selected student projects. Student projects emphasize analytical approaches to solving environmental problems, and enhance skills in writing, seminars, and team work.", "fall": true, "units": " 3"}, {"summer": false, "name": "Analysis of Environmental Issues", "prerequisites": "Prerequisite: ES 100, ES 200, ES 300 and Senior standing", "spring": true, "number": "ES  400", "descripton": "A capstone course for students in environmental sciences or related majors. The course teaches use of analytical approaches for solving environmental problems, and for communicating results. The course emphasizes development of student projects that lead to environmental decision-making, such as devising a resource management plan, developing a predictive model, prioritizing risk, identifying tipping points, designing new software or technologies, or predicting outcomes of environmental polices. Individual student projects fit within a team framework to simulate a work environment. Students enhance writing and seminar skills. Student may incur extra expenses with projects for this course.", "fall": true, "units": " 3"}, {"summer": false, "name": "Special Topics in Environmental Science", "prerequisites": "Prerequisite: Junior standing", "spring": true, "number": "ES  495", "descripton": "This course provides instruction on rapidly emerging environmental themes not currently covered in the undergraduate curriculum. Also provides courses on an experimental basis. See specific course offering for course detail.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Environmental Science Internship", "spring": true, "number": "ES  496", "descripton": " risk management for details an acquiring the insurance and the current charge.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Professional Development in Environmental Science", "spring": true, "number": "ES  497", "descripton": "The course provides 1-3 credits for students who develop skills necessary to organize, promote, and participate in an event such as a workshop, conference or a seminar. Examples of acceptable events include organizing a panel of speakers on a specific topic. A speaker series, a career fair, or a workshop.  The formats and topics of events are determined by the organizing student(s). Each student prepares an event proposal before the student can register for ED 497. Students must provide own transportation for professional development in environmental sciences.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Research in Environmental Science", "spring": true, "number": "ES  498", "descripton": "Students can earn  1 credit in ES 498 for every 50 hours of research during a semester up to a total of 3 credits for 150 of research in a semester. A student cannot complete more than 3 credits of ES 498 research in a single semester, or more than 6 credits in their program of study. Research can be traditional laboratory and/or fieldwork, or other creative activity. The student must produce a final report, seminar, or product that can be evaluated. Typically, the work for 1-3 credit of ES 498 research will be completed in one semester.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Thesis in Environmental Science", "spring": true, "number": "ES  499", "descripton": "ES 499 thesis provides academic credit for students who participate in original, inquiry-based learning and discovery in environmental sciences. Students present the thesis to a community of peers and experts for evaluation. ES 499 thesis requires a thesis proposal signed by the student, ES faculty advisor, a thesis host, and a supporting faculty member.", "fall": true, "units": " 3"}]