[{"summer": false, "name": "Elementary Japanese I", "prerequisites": "Corequisite: FLJ 103", "spring": false, "number": "FLJ  101", "descripton": "Introduction to standard, formal Japanese. Emphasis on speaking and listening skills. Exposure to Japanese culture, reading, and writing.", "fall": true, "units": " 3"}, {"summer": false, "name": "Elementary Japanese II", "prerequisites": "Prerequisite: FLJ 101, Corequisite: FLJ 104", "spring": true, "number": "FLJ  102", "descripton": "Continuation of basic skills. Emphasis on speaking and listening skills; inclusion of Japanese cultural factors in communication. Some reading and writing.", "fall": false, "units": " 3"}, {"summer": false, "name": "Elementary Japanese I Conversation", "prerequisites": "Corequisite: FLJ 101", "spring": false, "number": "FLJ  103", "descripton": "Supplements conversational practice in FLJ 101. Students are encouraged to use their speaking skills in a variety of situations. Special attention is given to correcting and improving pronunciation and intonation.", "fall": true, "units": " 1"}, {"summer": false, "name": "Elementary Japanese II Conversation", "prerequisites": "Prerequisite: FLJ 101, Corequisite: FLJ 102", "spring": true, "number": "FLJ  104", "descripton": "Supplements conversational practice in FLJ 102.  Extensive use of speaking skills in a variety of situations.  Special attention given to correcting and improving pronunciation and intonation.", "fall": false, "units": " 1"}, {"summer": false, "name": "Intermediate Japanese I", "prerequisites": "Prerequisite: FLJ 102 or FLJ 105, Corequisite: FLJ 203", "spring": false, "number": "FLJ  201", "descripton": "Continuation of basic skills. Greater emphasis on reading and writing. More exposure to Japanese cultural traditions.", "fall": true, "units": " 3"}, {"summer": false, "name": "Intermediate Japanese II", "prerequisites": "Prerequisite: FLJ 201, Corequisite: FLJ 204", "spring": false, "number": "FLJ  202", "descripton": "Continuation of the learning of the basic skills. Emphasis on reading and writing as well as on spoken Japanese and on cultural patterns of behavior.", "fall": false, "units": " 3"}, {"summer": false, "name": "Intermediate Japanese Conversation", "prerequisites": "Prerequisite: FLJ 102, Corequisite: FLJ 201, FLJ 202 or FLJ 301", "spring": true, "number": "FLJ  203", "descripton": "Practice in spoken Japanese through use of the language in a variety of situations. Increase vocabulary and develop fluency and ease in the structural patterns of the language.May be repeated for a maximum of three credit hours.", "fall": true, "units": " 1"}, {"summer": false, "name": "Intermediate Japanese II Conversation", "prerequisites": "Corequisite: FLJ 202", "spring": true, "number": "FLJ  204", "descripton": "Supplemental intermediate conversational practice.  Drills and situational exercises to build oral proficiency with patterns introduced in FLJ 202.", "fall": false, "units": " 1"}, {"summer": false, "name": "Intermediate Japanese III", "prerequisites": "Prerequisite: FLJ 202", "spring": false, "number": "FLJ  301", "descripton": "Continued study of Japanese language.  Primary emphasis on spoken Japanese, but attention also given to reading, writing and culture.", "fall": true, "units": " 3"}, {"summer": false, "name": "Intermediate Japanese IV", "prerequisites": "Prerequisite: FLJ 301", "spring": true, "number": "FLJ  302", "descripton": "Continued training in the foundations of Japanese language.  Primary emphasis on spoken Japanese, with increased attention to reading and writing.", "fall": false, "units": " 3"}, {"summer": false, "name": "Classical Japanese Literature in Translation", "spring": true, "number": "FLJ  342", "descripton": "A survey of literature in Japan from earliest recorded times through the sixteenth century. Examples from major eras and genres (folktales, poetry, philosophy, fictional narrative, theater, etc.) will be considered, with attention to historical and cultural contexts, as well as to contemporary scholarship and approaches toward traditional literature. Examples from literature outside Japan will be included for comparative purposes. No prior knowledge of Japanese required: Readings and discussions in English.", "fall": false, "units": " 3"}, {"summer": false, "name": "Early Modern Japanese Literature in Translation", "spring": true, "number": "FLJ  344", "descripton": "A survey of literature in Japan from 1600 to late Nineteenth Century. Examples from major periods and genres (novels, poetry, philosophy, dram, miscellaneous narrative, etc.) will be considered, with attention to historical and cultural contexts, as well as to contemporary scholarship and approaches toward the literature. Examples from literature outside Japan will be included for comparative purposed. No prior knowledge of Japanese required: Readings and discussions in English.", "fall": false, "units": " 3"}, {"summer": false, "name": "Modern Japanese Literature in Translation", "spring": true, "number": "FLJ  345", "descripton": "A survey in literature in Japan from the Meiji Era through World War Two. Examples from major periods and genres (novels, poetry, philosophy, drama, miscellaneous narrative, etc.) will be considered, with attention to historical and cultural contexts, as well as to contemporary scholarship and approaches toward the literature. Examples from literature outside Japan will be included for comparative purposes. No prior knowledge of Japanese required: Readings and discussions in English.", "fall": false, "units": " 3"}, {"summer": false, "name": "Contemporary Culture in Japan", "prerequisites": "Prerequisite: FLJ 101", "spring": true, "number": ")  351", "descripton": "Introduction to basic aspects of cultural practices in Japanese society, including education, work life, family relationships, everyday religious practices, aesthetic traditions, national identity, and gender. Students will develop an understanding of the interrelationships between language and culture.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Japanese I", "prerequisites": "Prerequisite: FLJ 302", "spring": false, "number": "FLJ  401", "descripton": "Continued training in the foundations of Japanese language, with emphasis on complex verb forms.  Increased attention to reading and writing.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Japanese II", "prerequisites": "Prerequisite: FLJ 401", "spring": true, "number": "FLJ  402", "descripton": "Elaboration on grammatical forms learned in the previous courses with applications in reading and writing, combined with more sophisticated vocabulary and idioms and attention to development of natural reading skills.", "fall": false, "units": " 3"}]