[{"summer": true, "name": "Conservation of Natural Resources", "spring": true, "number": ")  221", "descripton": "This course examines the importance of natural resources and their role in the progress of human civilization. Physical, biological and ecological principles are described that underlie sustainability of natural resources, particularly as these relate to the consequence of human impacts as resources are used to meet societal needs. The course emphasizes renewable natural resources, the importance of habitat, and a broadly-international context. The course has an optimistic perspective that life on Earth can and will be better in the future if we learn and practice good resource management today.", "fall": true, "units": " 3"}, {"summer": true, "name": "Piedmont Wildlife Ecology and Management", "spring": false, "number": "FW  311", "descripton": "This 3-week course will involve relationships of wildlife and habitat, the use of GIS and GPS, use of new technology (PIT tags, radio telemetry), and field identification of habitats and animals. This course is taught off-campus at Hill Forest. It is a 3 week residential camps with side trips and overnight trips. Class meets all day for 3 weeks. Additional charge for room and board. Students must provide their own transportation to Hill Forest. Junior standing in one of the following: FOM, NRE, SFW, SFF, SZO, ESC.", "fall": false, "units": " 3"}, {"summer": true, "name": "Fisheries Techniques and Management", "prerequisites": "Corequisite: FW 311 and FW 313", "spring": false, "number": "FW  312", "descripton": "Field exercises in aquatic environments emphasizing assessment of habitat, fish, invertebrates, plants, and ecological relationships to form the basis of describing and solving management dilemmas.  Taught off-campus at Hill Forest.  5 day residential camp.  Local travel required to various aquatic ecosystems.  Additional charges for room and board.", "fall": false, "units": " 1"}, {"summer": true, "name": "Mountain Wildlife Ecology and Management", "prerequisites": "Corequisite: FW 311 and FW 312", "spring": false, "number": "FW  313", "descripton": "Visit different mountain communities along an elevation gradient from 2,000 to 6,000 feet and observe changes in plant and animal communities.  Discuss wildlife and fisheries management issues, interact with agency personnel responsible for managingmountain fisheries and wildlife.  One-week field trip to the North Carolina mountains.  Additional charges for room and board.", "fall": false, "units": " 1"}, {"summer": true, "name": "Coastal Ecology and Management", "prerequisites": "Prerequisite: BIO 181", "spring": false, "number": "FW  314", "descripton": "Hands-on study of the fishery and wildlife resources associated with North Carolina coastal plain habitats. These habitats will include estuarine, ocean, longleaf pine savanna, pocosin, and Carolina bays.  Common techniques and concepts used in terrestrial, marine, and estuarine ecology and management will be taught.  Field identification of habitats, animals, and plants.  Use of multiple sampling gear including bottom trawl, beam trawl, beach seine, gill nets, and coverboards.  Use of water quality measurement equipment.  This course meets all day for 1 week off-campus at CMAST in Morehead City, NC.  Additional charge for room and board and boat rental.  Students must provide their own transportation to CMAST.", "fall": false, "units": " 1"}, {"summer": false, "name": "Conservation Biology in Practice", "prerequisites": "Prerequisite: FW 221 and (PB 360 or BIO 360 or FOR 260)", "spring": false, "number": "FW  333", "descripton": "An introductory course designed to focus on the scientific fundamentals of conservation biology, including population dynamics, extinction and its causes, metapopulations, modeling, population viability analysis, the design and management of protected areas, rare species management, and captive breeding and release programs.  Students will participate in active learning exercises, projects, and debates.  Projects will require students to make their own arrangements for transportation to field locations within Wake County.", "fall": true, "units": " 3"}, {"summer": false, "name": "Wildlife Management", "prerequisites": "Prerequisite:BIO 181", "spring": false, "number": ")  353", "descripton": "Historical development of Wildlife Management from anecdotal, observational practices to modern, scientific approaches used around the world. Principles of population analysis, management, protection and conservation of animals, particularly those of conservation, aesthetic, sport or food values in urban, rural and wilderness areas. Ethics of hunting and trapping. Contradictory objectives challenging modern wildlife managers.", "fall": true, "units": " 3"}, {"summer": false, "name": "Urban Wildlife Management", "prerequisites": "Prerequisite: Junior standing.", "spring": false, "number": "FW  403", "descripton": "Issues facing wildlife in urbanizing landscapes and the general courses of action to minimize the negative effects of urbanization on native wildlife.  Large-scale planning and zoning for roads, developments and open space; meso-scale planning and landscaping of new neighborhoods and other developments; and small-scale landscaping for backyard habitats.  Coexistence between wildlife and humans in urban environments and management of wildlife damage to human property.", "fall": true, "units": " 3"}, {"summer": false, "name": "Forest Wildlife Management", "prerequisites": "Prerequisite: Junior standing", "spring": false, "number": ")  404", "descripton": "Relationships between forest and wildlife management and the effects of silvicultural systems on wildlife. Species-habitat requirements, forest wildlife management techniques, and forest-wildlife policies and economics.", "fall": true, "units": " 3"}, {"summer": false, "name": "Human Dimensions of Wildlife and Fisheries", "prerequisites": "Juniors and Seniors Only", "spring": true, "number": "FW  411", "descripton": "Study of human interactions with wildlife and fisheries, including principles important for understanding and addressing wildlife management and conservation challenges.  Discussions of wildlife at the urban fringe, human attitudes towards hunting and fishing, and the public trust approach to wildlife management are included.", "fall": false, "units": " 3"}, {"summer": false, "name": "Introduction to Fisheries Science", "prerequisites": "Prerequisite: BIO 181 or ZO 150, BIO 260 or PB 360", "spring": true, "number": ")  420", "descripton": "Role of fish in aquatic ecosystems, fish biology, fish ecology, fisheries management and conservation.  Emphasis on aquatic ecosystems and food webs, life history and ecology of important sport and commercial fishes, population and community dynamics, and theory and practice of fisheries management and conservation.  Case studies from freshwater, estuarine and marine systems.", "fall": false, "units": " 3"}, {"summer": false, "name": "Fisheries and Wildlife Administration", "prerequisites": "Prerequisite: PS 201, PS 202; FW/BIO 420, FW/BIO 353", "spring": true, "number": ")  430", "descripton": "Describes and compares the administrative structures and programs of federal and state fish and wildlife agencies and develops an understanding of the basis on which these agencies function. Evaluates the interrelationships that fisheries-wildlife professionals, special interest groups, public agencies and legislative bodies play in resource  management programs.", "fall": false, "units": " 3"}, {"summer": false, "name": "Principles of Wildlife Science", "prerequisites": "Prerequisite: FW 353 and ST 311", "spring": true, "number": "FW  453", "descripton": "Principles and applications of population dynamics and biology to the management of terrestrial vertebrates.  Predicting population levels, composition and growth rates with and without management constraints.  Strategies for wildlife conservation, utilization, and enhancement.  Laboratories stress the collection and analysis of data, and often meet in outdoor environments.", "fall": false, "units": " 4"}, {"summer": "True", "name": "International Wildlife Management and Conservation", "prerequisites": "Prerequisite: Junior standing and above.", "spring": "True", "number": "FW  460", "descripton": "An international perspective on wildlife management and conservation through investigation and comparison of historical events, policies, international conservation organizations and transfrontier conservation areas. Fundamental principles necessaryin managing the African savannah ecosystem, protected areas and game ranches.  Identifying global biomes, zoogeography and the impacts of ecotourism.Cannot receive credit for both FW 460/560.", "fall": "True", "units": " 3"}, {"summer": true, "name": "African Ecology and Conservation", "prerequisites": "Prerequisite: One 200-level or higher course in ES, ET FOR, FW, NR, PB, PRT, or ZO", "spring": false, "number": "FW  465", "descripton": "This course provides an international perspective on desert ecology, the African savanna ecosystem, African wildlife ecology and management. In addition, the management of a large national park of international importance, conservation of predators and their conflict with humans, and international tourism are discussed. Various sampling techniques are practiced during field work. A combination of lectures, field lectures, field work, field excursions, data analyses and home work form an integral part of the course.", "fall": false, "units": " 4"}, {"summer": false, "name": "External Learning Experience", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "FW  492", "descripton": "A learning experience in agriculture and life sciences within an academic framework that utilizes facilities and resources which are external to the campus. Contact and arrangements with prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior to the experience.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Special Problems in Fisheries and Wildlife Sciences", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "FW  493", "descripton": "A learning experience in agriculture and life sciences within an academic framework that utilizes campus facilities and resources. Contact and arrangements with prospective employers must be initiated by student and approved", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Special Topics in Fisheries and Wildlife Science", "spring": true, "number": "FW  495", "descripton": "Offered as needed to present materials not normally available in regular course offerings or for offering of new courses on a trial basis.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Human Dimensions of Wildlife and Fisheries", "spring": true, "number": "FW  511", "descripton": "Study of human interactions with wildlife and fisheries, including principles important for understanding and addressing wildlife management and conservation challenges. Discussions of wildlife at the urban fringe, human attitudes towards hunting and fishing, and the public trust approach to wildlife management are included.", "fall": false, "units": " 3"}, {"summer": false, "name": "Fish Physiology", "prerequisites": "Prerequisite: GN 411, ZO 420, 421, 441", "spring": false, "number": ")  515", "descripton": "The biology of fishes: physiology, anatomy, endocrinology, behavior and genetics. Designed especially for graduate students in fisheries. Several trips to research laboratories taken.", "fall": true, "units": " 3"}, {"summer": false, "name": "Principles Of Wildlife Science", "prerequisites": "Prerequisite: BO 360 or ZO 260", "spring": true, "number": ")  553", "descripton": "The principles of wildlife management and their application studied in the laboratory and in the field.", "fall": false, "units": " 3"}, {"summer": "True", "name": "International Wildlife Management and Conservation", "prerequisites": "Prerequisite: One course in wildlife management or zoology or biology or natural resources or forestry or botany, Graduate standing", "spring": "True", "number": "FW  560", "descripton": "An international perspective on wildlife management and conservation through investigation and comparison of historical events, policies, international conservation organizations and transfrontier conservation areas. Fundamental principles necessaryin managing the African savanna ecosystem, protected areas and game ranches. Identifying global biomes, zoogeography and the impacts of ecotourism. Cannot receive credit for both FW 460 and FW 560.", "fall": "True", "units": " 3"}, {"summer": true, "name": "African Ecology and Conservation", "spring": false, "number": "FW  565", "descripton": "This course provides an international perspective on desert ecology, the African savanna ecosystem, African wildlife ecology and management. In addition, the management of a large national park of international importance, conservation of predators and their conflict with humans, and international tourism are discussed. Various sampling techniques are practiced during field work. A combination of lectures, field lectures, field work, field excursions, data analyses and home work form an integral part of the course.", "fall": false, "units": " 4"}, {"summer": false, "name": "Aquaculture I", "prerequisites": "Prerequisite: BO 360 or ZO 260 or Graduate standing or Senior standing", "spring": false, "number": ")  586", "descripton": "Biological and general principles of aquaculture. Emphasis on the present status of aquaculture, species involved, techniques employed, and problems encountered. Discussion of recent advances in research and development and identification of areas of future research and development.", "fall": true, "units": " 3"}, {"summer": false, "name": "Aquaculture I Laboratory", "prerequisites": "Prerequisite: BO 360 or ZO 260 or Graduate standing or Senior standing, Corequisite: ZO 586", "spring": false, "number": ")  587", "descripton": "Methods and techniques of cultivating aquatic organisms. Field trips and reports on local hatcheries and facilities required. (Three to four overnight field trips taken on week days to coastal areas, state hatcheries, and private hatcheries; students responsible for shared room costs and their meals. Four field trips also taken on laboratory day within driving range of Raleigh.)", "fall": true, "units": " 1"}, {"summer": true, "name": "Special Topics in Fisheries and Wildlife Sciences", "spring": true, "number": "FW  595", "descripton": "Special topics in various aspects fisheries and wildlife sciences are developed under the direction of a graduate faculty member. Also used to test and develop new courses.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Seminar In Wildlife Management", "spring": true, "number": "FW  602", "descripton": "Current topics and issues in wildlife biology and management. Students select and research topics, give seminars and lead group discussions.", "fall": false, "units": " 1"}, {"summer": true, "name": "Special Topics in Fisheries and Wildlife Sciences", "spring": true, "number": "FW  610", "descripton": "Special topics in various aspects of fisheries and wildlife science are developed under the direction of a graduate faculty member. Also used to develop new courses.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "FW  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "FW  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "FW  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": false, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "FW  690", "descripton": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "FW  693", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": false, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "FW  695", "descripton": "Thesis research.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "FW  696", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": false, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "FW  699", "descripton": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their theses.", "fall": true, "units": " 1-3"}, {"summer": "True", "name": "Epidemiology of Wildlife Diseases", "spring": "True", "number": ")  720", "descripton": "Concepts related to infectious disease outbreaks in free-ranging species of wildlife.  Numerous examples of wildlife diseases will be used to illustrate factors affecting host-agent-environment interactions in fish, amphibians, birds, and both aquatic and terrestrial mammals.  Enrollment in the Fisheries and Wildlife graduate program or Masters of Veterinary Public Health program; clinical residents or veterinary students at the College of Veterinary Medicine.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Quantitative Fisheries Management", "spring": false, "number": ")  726", "descripton": "Current methods for assessment and management of exploited fish populations, including sampling methods, data analysis and modeling. A required research paper or project.", "fall": true, "units": " 3"}, {"summer": false, "name": "Ethics in Fisheries and Wildlife Sciences", "spring": false, "number": "FW  730", "descripton": "Students will explore historical and current thinking concerning the search for truth about natural systems, and the complex ethics scientists and practitioners who operate in the public sector must consider.  Standards of professional and ethical behavior specific to Fisheries and Wildlife Sciences will be addressed.  Faculty will introduce topics and guide discussions; students will give seminars and lead some discussions.  For doctoral students in Fisheries and Wildlife Sciences.", "fall": true, "units": " 2"}, {"summer": false, "name": "Issues in Fisheries and Wildlife Sciences Doctoral Seminar", "spring": true, "number": "FW  801", "descripton": "Current topics and issues in Fisheries and Wildlife Sciences Research.  Students select and research topics, give seminars on Ph.D. proposals, and lead group discussions.  For doctoral students in Fisheries and Wildlife Sciences.", "fall": false, "units": " 2"}, {"summer": "True", "name": "Seminar in Fisheries and Wildlife", "spring": "True", "number": "FW  802", "descripton": "Current topics and issues in fisheries and wildlife biology and management.  Students select and research topics, give seminars, and lead group discussions.  For doctoral students in Fisheries and Wildlife Sciences.", "fall": "True", "units": " 1"}, {"summer": true, "name": "Special Topics in Fisheries and Wildlife", "spring": true, "number": "FW  810", "descripton": "Individual students or groups of students, under direction of a faculty member, will explore topics of special interest not covered by existing courses.  Format may consist of readings and independent study, problems or research not related to dissertation.  Also used to develop and test new 800-level courses.  For doctoral students in Fisheries and Wildlife Sciences.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Doctoral Supervised Teaching", "spring": true, "number": "FW  885", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.  For doctoral students in Fisheries and Wildlife Sciences.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Doctoral Preliminary Exam", "spring": true, "number": "FW  890", "descripton": "For students who are preparing for and taking written and/or oral preliminary exams.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Supervised Research", "spring": true, "number": "FW  893", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.  For doctoral students in Fisheries and Wildlife Sciences.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Dissertation Research", "spring": true, "number": "FW  895", "descripton": "Dissertation Research.  For doctoral students in Fisheries and Wildlife Sciences.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Doctoral Dissertation Research", "spring": false, "number": "FW  896", "descripton": "Summer Dissertation Research.  For doctoral students in Fisheries and Wildlife Sciences.", "fall": false, "units": " 1"}, {"summer": false, "name": "Doctoral Dissertation Preparation", "spring": true, "number": "FW  899", "descripton": "For students who have completed all credit hour, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations.", "fall": true, "units": " 1-3"}]