[{"summer": false, "name": "Design, Context, and Experience", "prerequisites": "Prerequisite: D 101, D 103, and D 103.  Co-requisite: GD 210, GD 217", "spring": false, "number": "GD  201", "descripton": "Introduction to analysis and form-making in graphic design through investigations of design artifacts as components of larger and physical, social, cultural, and technological systems.  Appropriate student-owned technology and software required.  Graphic Design Majors Only, except with Department Head permission", "fall": true, "units": " 6"}, {"summer": false, "name": "Designing for Settings, People, and Use", "prerequisites": "Prerequisite: GD 201, GD 210, GD 217; Corequisite: GD 310, GD 317", "spring": true, "number": "GD  202", "descripton": "Relationships among audience/user interpretive behavior, attributes of physical and cultural settings, and objects with attention to different perspectives on the role of the designer.  Graphic Design Majors Only, except with Department Head permission.", "fall": false, "units": " 6"}, {"summer": "True", "name": "History of Graphic Design", "spring": "True", "number": "GD  203", "descripton": "Events, ideas, movements, designs and individuals that have historical significance and influence on contemporary graphic design and the graphic design profession.  Concentration on graphic design of the last 100 years.", "fall": "True", "units": " Performing Arts"}, {"summer": false, "name": "Image and Technology", "prerequisites": "Prerequisite: D 101, D 103, and D 105", "spring": false, "number": "GD  210", "descripton": "Introduction to representation and visualization strategies particular to the applied communication contexts of graphic design, including mapping, diagramming, and photography.  Discussion of the role of various technologies in the construction of meaning.  Digital camera and appropriate student-owned technology and software required.  Graphic Design majors only, except with Department Head permission.", "fall": true, "units": " 3"}, {"summer": false, "name": "Typography and Technology", "prerequisites": "Prerequisite: D 101, D 103, and D 105", "spring": false, "number": "GD  217", "descripton": "Introduction to typography with respect to four primary systems: reading, form, language, and technology.  Appropriate student-owned technology and software required.  Graphic Design majors only, except with Department Head permission.", "fall": true, "units": " 3"}, {"summer": true, "name": "Special Topics in Graphic Design", "spring": true, "number": "GD  292", "descripton": "Topics of current interest in Graphic Design.  Normally used to develop new courses.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Branding, Interaction, and Service Design", "prerequisites": "Prerequisite: GD 202.  Corequisite: GD 410, GD 417", "spring": false, "number": "GD  301", "descripton": "Investigations of branding, interaction, and service design in response to problems of complex systems and contexts.  Graphic Design majors only, except with Department Head permission.", "fall": true, "units": " 6"}, {"summer": "True", "name": "Graphic Design Theory and Practice", "spring": "True", "number": "GD  303", "descripton": "An examination of theories and critical perspectives shaping graphic practice.  The course includes a discussion of contemporary design strategy in business and the role of visual communication in the information age.", "fall": "True", "units": " Performing Arts"}, {"summer": false, "name": "Visualization, Representation, and Display", "prerequisites": "Prerequisite: GD 210", "spring": true, "number": "GD  310", "descripton": "Surveying, documenting, and interpreting sites and subjects; representing relationships among settings, people, and objects through image-making strategies, such as activity maps, interviews, panoramas, and visual essays.  Graphic Design majors only, except with Department Head permission for other college of design majors.", "fall": false, "units": " 3"}, {"summer": false, "name": "Typographic Language, Writing, and Reading", "prerequisites": "Prerequisite: GD 217", "spring": true, "number": "GD  317", "descripton": "Continuation of typography and technology with greater emphasis on the individual reading experience, including page sequencing, grids, and the relationship between historical conventions and new interpretive demands on readers.  Graphic Design majors only, except with Department Head permission.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Graphic Design Studio", "prerequisites": "Prerequisite: GD 301", "spring": true, "number": "GD  400", "descripton": "Topical and interdisciplinary studios addressing advanced visual communication problems.  Graphic Design Majors only, except with Department Head permission.", "fall": true, "units": " 6"}, {"summer": false, "name": "Capstone Graphic Design Studio", "prerequisites": "Prerequisite: GD 400", "spring": true, "number": "GD  401", "descripton": "Capstone experience focused on the transition from school to work.  Individual capstone project,  collaborative work, and professional practice discussions.  Graphic Design majors only, Seniors.", "fall": true, "units": " 6"}, {"summer": false, "name": "Online and Mobile Interaction Design Systems", "prerequisites": "Prerequisite: GD 310", "spring": true, "number": "GD  410", "descripton": "Exploration of dynamic communication systems, including methods for visualizing user interaction, setting conditions for user experience, and managing collaborative work.  Graphic Design majors only, except with Department Head permission for other College of Design majors.", "fall": true, "units": " 3"}, {"summer": false, "name": "Information and Publishing Design Systems", "prerequisites": "Prerequisite: GD 317", "spring": false, "number": "GD  417", "descripton": "Continuation of typographic language, writing, and reading with attention to advanced grid, form, and font systems in the design of multi-page documents, as well as issues of production and printing.  Graphic Design majors only, except with Department Head permission.", "fall": true, "units": " 3"}, {"summer": true, "name": "Graphic Design International Studio", "prerequisites": "Prerequisite: Junior standing in the major and Study Abroad Office approval", "spring": false, "number": "GD  490", "descripton": "Define visual communication design problems and develop design solutions in an international setting.  Studio projects related to design, culture, and traditional and contemporary visual communication.  Directed studies in history and culture, and in artifact making.  Additional travel and trip costs are required beyond registration fees, as well as appropriate immunizations.Graphic Design majors and departmental approved Elective (\"swing\") Studio for all other College of Design Majors with Junior or Graduate Standing in Major.", "fall": false, "units": " 6"}, {"summer": true, "name": "Special Topics in Graphic Design", "prerequisites": "Prerequisite: Jr standing in Graphic Design major", "spring": true, "number": "GD  492", "descripton": "Topics of current interest in Graphic Design.  Normally used to develop new courses. Graphic Design Majors, and department approved elective for all other college of Design Majors with Junior or Graduate standing in major.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Internship in Graphic Design", "prerequisites": "Prerequisite: Junior standing in Graphic Design and 3.0 GPA or better", "spring": true, "number": "GD  494", "descripton": "Supervised field experience in graphic design offices and organizations.", "fall": true, "units": " 3"}, {"summer": true, "name": "Independent Study in Graphic Design", "prerequisites": "Prerequisite: Junior standing in Graphic Design and 3.0 GPA or better", "spring": true, "number": "GD  495", "descripton": "Special projects in graphic design developed under the direction of a faculty member on a tutorial basis.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Graduate Graphic Design Studio", "prerequisites": "Corequisite: GD 571", "spring": false, "number": "GD  501", "descripton": "Student-defined graphic design projects in response to critical content framework presentation by GD 571 faculty. Center of framework on role of design objects as cognitive artifacts and extension, transformation or diminishment of human thought by their form and content. Interaction of potential audiences with designer-created artifacts. Graphic design majors only.", "fall": true, "units": " 9"}, {"summer": false, "name": "Graduate Graphic Design Studio II", "prerequisites": "Prerequisite: GD 501, Corequisite: GD 572", "spring": true, "number": "GD  502", "descripton": "Student-defined graphic design projects in response to critical content framework presentation by GD 572 faculty. Center of framework on role of design objects as cultural artifacts and their reflection on social diversity of both designers and audiences. Creation, reproduction, distribution and reception of messages in both designer-created artifacts and audience's response. Graphic design majors only.", "fall": false, "units": " 9"}, {"summer": false, "name": "Graduate Graphic Design Studio III", "prerequisites": "Prerequisite: GD 573, Corequisite: GD 671", "spring": false, "number": "GD  503", "descripton": "Student-defined graphic design projects in response to critical content framework presentation by GD 671 faculty. Center of framework on nature of new information environments. Shape and response of technologies to new cognitive and cultural relationships among audiences.", "fall": true, "units": " 9"}, {"summer": false, "name": "Imaging for Graphic Design IV", "prerequisites": "Prerequisite: GD 410, Design Majors", "spring": true, "number": "GD  510", "descripton": "Advanced problems in the visual design and structuring of information in interactive multimedia presentations. Topics include the design of interfaces, navigation, motion graphics, and websites as well as exploration of narrative and hypermedia approaches to the organization of content.", "fall": false, "units": " 3"}, {"summer": false, "name": "Type IV", "prerequisites": "Prerequisite: GD 417, Design Majors", "spring": true, "number": "GD  517", "descripton": "Advanced problems of typographic expression/communication in which typographic variables are used to alter, enhance, or reinforce verbal meaning.  Historic precedent and experimentation with the conventions for typographic form are explored.  The impact of the computer on changes in typographic aesthetics, including motion graphics, typeface design, and website design.", "fall": false, "units": " 3"}, {"summer": false, "name": "Design As Cognitive Artifact", "spring": true, "number": "GD  571", "descripton": "Relationship between theories of human cognition and graphic design. Analysis and critique of design objects as cognitive artifacts and extension, transformation or diminishment of human thought by their form and content. A critical examination of cognitive, linguistic and social science theories shaping graphic design. Non-majors by permission only.", "fall": true, "units": " 3"}, {"summer": false, "name": "Design as Cultural Artifact", "spring": true, "number": "GD  572", "descripton": "Introduction to recent theories in various disciplines concerning a cultural understanding of graphic design. Theories of mass and popular culture, critiques of creativity and authorial intentionality, influences of interpretive criticism, theories of consumption and issues of cultural representation.  Emphasis on adaptation of these theories to an understanding of the cultural significance of graphic design.  Non-majors by permission only.", "fall": true, "units": " 3"}, {"summer": false, "name": "New Information Environments", "prerequisites": "Prerequisite: GD 503", "spring": true, "number": "GD  573", "descripton": "Changing role of graphic design in new information environments. Implications of new technology on social construction of meaning, impact of electronic media on culture and cognition, and differences in designing artifacts and designing experiences.Non-majors by permission only.", "fall": true, "units": " 3"}, {"summer": false, "name": "Special Topics In Graphic Design History", "prerequisites": "Prerequisite: GD 242", "spring": true, "number": "GD  580", "descripton": "Topics of current interest in interpretation, criticism, methodology and research, relating to graphic design history. Further specialized study in history of printing, typography, communication, image-making and information systems. Investigation of how we study artifacts, production and producers.", "fall": false, "units": " 3"}, {"summer": false, "name": "Graphic Design Final Project Research", "prerequisites": "Prerequisite: GD 502", "spring": false, "number": "GD  581", "descripton": "A seminar course to assist students in preparing foundation for final project to be conducted in GD 688 Final Project Studio.", "fall": true, "units": " 3"}, {"summer": false, "name": "Final Project Studio In Graphic Design", "prerequisites": "Prerequisite: GD 581", "spring": true, "number": "GD  588", "descripton": "Final project for graduate students supervised by members of their graduate advisory committees.", "fall": true, "units": " 6"}, {"summer": false, "name": "Special Topics In Graphic Design", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "GD  592", "descripton": "Topics of current interest to program/option offered by faculty in School. Subjects offered under this number normally used to test and develop new courses.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Special Topics In Graphic Design", "prerequisites": "Prerequisite: Permission of grad. advisor", "spring": true, "number": "GD  610", "descripton": "An investigation of special topics in graphic design of a particular interest to advanced students under direction of chair of graduate committee on a tutorial basis; credit and content vary with each student.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Independent Study In Graphic Design", "spring": true, "number": "GD  630", "descripton": "Special problems in various aspects of graphic design developed under the direction of a faculty member on a tutorial basis.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Special Project In Graphic Design", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "GD  676", "descripton": "Seminar on subjects of current interest in graphic design, presented by persons not part of regular faculty.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "GD  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "GD  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "GD  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": true, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "GD  690", "descripton": "For students in non-thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam.", "fall": true, "units": " 1-6"}]