[{"summer": "True", "name": "History of Art From Ancient Greece Through the Renaissance", "spring": "True", "number": "HA  201", "descripton": "Art from Ancient Greece and Rome through Italian Renaissance. Major art forms of painting, sculpture, and architecture.", "fall": "True", "units": " Performing Arts"}, {"summer": "True", "name": "History of Art From the Renaissance Through the 20th Century", "spring": "True", "number": "HA  202", "descripton": "Art from the Northern Renaissance in Europe through the 20th century in Europe and America: painting, sculpture and architecture recent mixed media techniques such as collage, and trottage.", "fall": "True", "units": " Performing Arts"}, {"summer": "True", "name": "History of American Art", "spring": "True", "number": "HA  203", "descripton": "A history of American Art (painting, sculpture and architecture) from the Colonial Period through the 20th century.", "fall": "True", "units": " Performing Arts"}, {"summer": false, "name": "Introduction to Visual Culture", "spring": false, "number": ")  240", "descripton": "Introduction to the role of visual cultural production in the nineteenth and twentieth centuries in expressing and shaping both individual and collective identities. Case studies of imperialism, gender, and war draw from different regional histories and utilize a variety of visual genres - such as photography, popular posters, painting, advertising, and film stills - to study how visual culture can be used as evidence to understand the past, using the approaches of the disciplines of History and Art History.", "fall": true, "units": " 3"}, {"summer": true, "name": "Special Topics in Art History", "spring": true, "number": "HA  298", "descripton": "Special topics in art history with emphasis on chronological periods such as 20th-century art of the Italian Renaissance or on fields of art such as paintings, sculpture, photography, or architecture.", "fall": true, "units": " 3"}, {"summer": "True", "name": "History of Art and Photography", "spring": "True", "number": "HA  310", "descripton": "History of and the interaction between art and photography from the invention of photography to the present.", "fall": "True", "units": " Performing Arts"}, {"summer": true, "name": "History of Art: Study Abroad", "spring": true, "number": "HA  395", "descripton": "Topical History of Art courses taught in NC State Study Abroad programs.  (Current listings available in History Department, Study Abroad Office and CHASS Dean's Office.)", "fall": true, "units": " 3"}, {"summer": "True", "name": "l9th Century European Art", "prerequisites": "Prerequisite: HA 201 or HA 202", "spring": "True", "number": "HA  401", "descripton": "Major stylistic movements of 19th century European art and the theoretical basis for their development. Covers Neo Classicism, Romanticism, Realism and Impressionism, and Post Impressionism.", "fall": "True", "units": " Performing Arts"}, {"summer": "True", "name": "Italian Renaissance Masters", "prerequisites": "Prerequisite: 3 hrs. of HA", "spring": "True", "number": "HA  404", "descripton": "Selected problems in the development of Italian Renaissance art including painting sculpture and architecture, 1300-1550: including the pioneers Giotto and Duccio; founders of the early Renaissance: Masaccio, Donatello, and Brunelleschi; great masters of the High Renaissance: Michelangelo, Raphael and Leonardo da Vinci. Works of art analyzed in terms of style, subject matter and historical context.", "fall": "True", "units": " Performing Arts"}, {"summer": false, "name": "Independent Study in History of Art", "prerequisites": "Prerequisite: 3 hours History of Art", "spring": true, "number": "HA  498", "descripton": "Directed independent study of topics in the History of Art.", "fall": true, "units": " 1-6"}]