[{"summer": false, "name": "Home Horticulture", "spring": true, "number": "HS  200", "descripton": "Introduction and review of home horticulture as it relates to the horticultural enthusiast. A general understanding of plant growth, structure, and development; house plant selection and care, selecting trees, shrubs, and flowers for the home landscape, and other related topics.\t Note: this course was previously offered as HS 100.", "fall": true, "units": " 3"}, {"summer": false, "name": "The World of Horticulture: Principles and Practices", "spring": true, "number": "HS  201", "descripton": "Principles of plant growth and development relating to production and utilization of fruit, vegetable, floricultural, and ornamental crops.  Historical, economic, and global importance of horticultural crops and services.", "fall": true, "units": " 3"}, {"summer": false, "name": "Power of Plants: Appreciation and Use", "spring": true, "number": "HS  202", "descripton": "Power of Plants will focus on how plants are names and can be used in different horticultural situations and growing environments. Uniqueness, use, and plant descriptions of a wide range of horticultural plants will be considered including bonsai, topiary, espalier, and rain gardens. Not for horticultural science majors (SH, THG, THL).", "fall": false, "units": " 3"}, {"summer": false, "name": "Home Plant Propagation", "spring": true, "number": "HS  203", "descripton": "Not for Horticultural Science Majors (SH, THG, THL). Substitution of HS 203 for HS 301 are not allowed. An introduction to the basic principles of sexual and asexual plant propagation, including seeds, cuttings, layering, Grafting, and Division.", "fall": false, "units": " 3"}, {"summer": true, "name": "Home Landscape Maintenance", "prerequisites": "Prerequisite: HS 200 or HS 201", "spring": true, "number": "HS  204", "descripton": "An understanding of the basic principles of landscape maintenance including, but not limited to, soil fertility and management, tree biology, pruning, turfgrass maintenance, plant selection, irrigation management and waterwise gardening, integrated pest management, and hardscape construction.  Not for Horticultural Science majors (SH, THG, THL).", "fall": false, "units": " 3"}, {"summer": false, "name": "Basic Agricultural Genetics", "prerequisites": "Prerequisite: ZO 160 or BIO 183", "spring": false, "number": ")  215", "descripton": "Basic principles of inheritance in plants and animals of agricultural significance. Transmission genetics and its effects on the usefulness of plants and animals. Basic principles of plant and animal improvement.", "fall": true, "units": " 3"}, {"summer": true, "name": "Home Landscape Design: Creating Garden Spaces", "spring": false, "number": "HS  250", "descripton": "Home landscape design is a 3-credit hour course for non-landscape design majors. Students will be introduced to the various issues associated with landscape design at the residential level. Through a series of Power Point lectures, on-line discussions, and small projects/exercises, students will gain an understanding of landscape graphics. Skills in design, and develop landscape plans and other forms of landscape graphics. Students will use all of their learned skills to develop a design for a given site using provided design software.", "fall": false, "units": " 3"}, {"summer": false, "name": "Landscape Graphic Communication", "prerequisites": "Prerequisite: Horticultural Science Majors", "spring": true, "number": "HS  252", "descripton": "Visualization of the entire design process, from conception to presentation drawings. A complete graphic vocabulary (concepts, techniques, and drawing styles) will be covered, providing the designer with an effective means of communicating design ideas, to her/himself, other professionals, clients, and the public.", "fall": false, "units": " 3"}, {"summer": false, "name": "Horticulture: Careers and Opportunities", "spring": false, "number": "HS  290", "descripton": "Introduction and orientation to programs in horticultural science.  Discussion of current status of horticulture, extension and research. Emphasis on undergraduate program management, internships, graduate education, and career planning.  Guest lectures, career opportunities and qualifications for employment in horticulture and related fields.", "fall": true, "units": " 1"}, {"summer": false, "name": "Plant Propagation", "prerequisites": "Prerequisite: BIO 181 or BO 200", "spring": false, "number": "HS  301", "descripton": "Theoretical basis and techniques for successful asexual and sexual propagation of seed plants and ferns. Influence of heredity, phytopathological infection, and environmental conditions on success and quality of propagules. Recent developments and innovations in propagation techniques and methodologies.", "fall": true, "units": " 4"}, {"summer": false, "name": "Gardening with Herbaceous Perennials", "prerequisites": "Prerequisite: BIO 183 or BO 200", "spring": true, "number": "HS  302", "descripton": "Examination of the use of herbaceous perennials in the home garden and commercial landscapes.  Topics include: general plant characteristics, culture and management, garden attributes, design usage, horticultural history, propagation, use of exotic (nonnative)species in the garden, heirloom roses and ornamental grasses.", "fall": false, "units": " 3"}, {"summer": false, "name": "Ornamental Plant Identification I", "prerequisites": "Prerequisite: BIO 181", "spring": false, "number": "HS  303", "descripton": "Identification, distribution, growth, characteristics, adaptation, and usage of ornamental plants. Emphasizes bedding plants, trees, and gymnosperms.", "fall": true, "units": " 3"}, {"summer": false, "name": "Ornamental Plan Identification II", "prerequisites": "Prerequisite: BIO 181", "spring": true, "number": "HS  304", "descripton": "Identification, distribution, growth, characteristics, adaptation, and usage of ornamental plants. Emphasizes shrubs, ground covers, vines, bulbs, and interior landscape plants.", "fall": false, "units": " 3"}, {"summer": false, "name": "Indoor Plantscapes: Identification and Use", "prerequisites": "Prerequisite: BIO 181 or BO 200, second semester Sophomore standing", "spring": true, "number": "HS  305", "descripton": "Identification, selection, installation, utilization, and maintenance of plants commonly used in commercial interior settings.", "fall": false, "units": " 3"}, {"summer": false, "name": "Landscape Horticulture", "spring": true, "number": "HS  342", "descripton": "Introduction to comprehensive process for small scale landscape projects.  Includes garden history, social and environmental analysis, creative problem solving process and the practice of oral, written and graphic communication.", "fall": true, "units": " 3"}, {"summer": false, "name": "Site Design and Construction Materials", "prerequisites": "Prerequisite: Landscape Horticulture (11HORTTHL) students, HS 252 and HS 342", "spring": true, "number": "HS  357", "descripton": "Site design of small scale landscape design projects including: understanding two-dimensional and three-dimensional representation of landform, landform manipulation, surveying and measuring, base map development, site analysis, grading and drainageplans, small circulation systems (pedestrian and vehicular), pavement, functional role of plants, designing site structures (steps, ramps, walls, and fences), documenting and analyzing user information, and special population site requirements. Exploration of appropriate construction materials and their properties occurs concurrently with the above topics. Field trips will be required.", "fall": true, "units": " 4"}, {"summer": false, "name": "Residential Landscaping", "prerequisites": "Prerequisite: HS 211, 212, 342, LAR 430, Corequisite: LAR 457", "spring": true, "number": "HS  400", "descripton": "Equips students with the necessary skills to create functional, aesthetic, and humanistic designs for residential and other small scale projects. Aspects of problem identification, project organization, design, execution, and evaluation. Required field trip with fee.", "fall": true, "units": " 6"}, {"summer": false, "name": "Landscape Construction Studio", "prerequisites": "Prerequisite: THL Majors, HS 357, 400", "spring": true, "number": "HS  401", "descripton": "Small scale landscape design with a concentrated focus on detail design and construction documentation. Development of skills in designing, drawing, and building landscape features. Opportunities for hands-on experiences.", "fall": false, "units": " 6"}, {"summer": false, "name": "Nursery Management", "prerequisites": "Prerequisite: BIO 181, SSC 200, Junior standing", "spring": false, "number": "HS  411", "descripton": "Principles and practices of production, management, and marketing of field-grown and container-grown nursery plants. One of three scheduled weekend field trips required at students' expense.", "fall": true, "units": " 3"}, {"summer": false, "name": "Planting Design", "prerequisites": "Prerequisite: Landscape Horticulture (11HORTTHL) concentration, HS 400", "spring": true, "number": "HS  416", "descripton": "Developing and cultivating a design process for creating meaningful and compelling ornamental planting designs through the study and practice of spatial articulation (form, enclosure, permeability), physical properties of plants (line, form, texture, color), client/site analysis and program development, visual journaling, garden narrative, presentation skills, utilizing principles of visual composition, design communication, and understanding and resolving technical and horticultural issues in contemporary planting design.", "fall": true, "units": " 4"}, {"summer": false, "name": "Temperate-Zone Tree Fruits: Physiology and Culture", "prerequisites": "Prerequisite: BIO 181 or B0 200", "spring": false, "number": "HS  421", "descripton": "Physiology and culture of the major temperate-zone tree fruit and nut crops of the United States.  Fundamental principles underlying woody plant growth as applied to the culture of specific tree-fruit crops with emphasis on crops of commercial importance to North Carolina.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Small Fruit Production", "prerequisites": "Prerequisite: BIO 181, SSC 200, HS 201", "spring": "True", "number": "HS  422", "descripton": "Importance and economic value of blackberries, blueberries, cranberries, grapes, raspberries, strawberries and minor small fruit crops in the agricultural economy of the USA and the world.  Cultural requirements of these crops and manipulation of their known morphological and physiological traits for successful production.  Six all afternoon field trips are required.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Viticulture", "prerequisites": "Prerequisite: Junior standing or Senior standing", "spring": true, "number": "HS  423", "descripton": "A presentation of the commercial importance, distribution, anatomy, physiology, and production of Genus Vitis (grapes) including cultivars, propagation, canopy management, diseases, weed control, physiology, anatomy, irrigation, wine production, climates and soils. This course will not require students to provide their own transportation. Non-scheduled class time for field trips or out-of-class activities IS required for this class", "fall": false, "units": " 3"}, {"summer": false, "name": "Vegetable Production", "prerequisites": "Prerequisite: BIO 181, SSC 200", "spring": false, "number": "HS  431", "descripton": "Principles and practices of production and marketing of seventeen vegetable crops grown in the U.S. Additional topics include pest management, seed technology, food safety, sustainable agriculture, use of genetically engineered crops, and consumer issues.", "fall": true, "units": " 4"}, {"summer": false, "name": "Permaculture: Sustainable Living", "spring": true, "number": "HS  432", "descripton": "Permaculture means \"permanent culture,\" (or \"permanent agriculture\") and ...\"is the conscious design and maintenance of cultivated ecosystems that have the diversity, stability, and resilience of a natural ecosystem.\" (Bill Mollison)  This course will explore, through lectures, discussions, field trips, and required projects, a design/thinking methodology that seeks to provide for our physical needs, food, water, shelter, energy, etc., while doing so in an environmentally friendly, sustainable manner.  The Saturday field trips and the weekend mountain trip are all optional.", "fall": true, "units": " 3"}, {"summer": false, "name": "Greenhouse Management", "prerequisites": "Prerequisite: SSC 200 and HS 201", "spring": false, "number": "HS  440", "descripton": "Perspective of greenhouse systems management. Selection of greenhouse site, construction, heating, cooling and production systems. Emphasis on greenhouse operations, cost accounting and analysis. Other topics; root substrates, sanitation, water, fertilization, chemical growth regulation, temperature, light and marketing. Hands-on experience in greenhouse operations plus trips to commercial greenhouses and markets.", "fall": true, "units": " 3"}, {"summer": false, "name": "Floriculture Crop Production", "prerequisites": "Prerequisite: SSC 200, HS 201", "spring": true, "number": "HS  442", "descripton": "Production of floricultural crops.  Emphasis on environmental manipulation and scheduling of crop growth and development for targeted market periods.  Specific flowering crops as models to demonstrate potted flowering plant, cut flower, and bedding plant production systems.  Hands-on crop production experience plus field trips to commercial floriculture production and marketing facilities.\t", "fall": false, "units": " 3"}, {"summer": false, "name": "Plant Nutrition", "prerequisites": "Prerequisite: SSC 200", "spring": true, "number": "HS  451", "descripton": "An understanding of the basic mineral nutrient requirements, nutritional monitoring procedures, and fertilizer application methods in horticultural production systems including those for fruits, field vegetables, fruits and vegetables under plasticulture, nursery crops, landscapes, greenhouse flowers and vegetables, interior plantscapes, hydroponics, and organic farming.", "fall": false, "units": " 3"}, {"summer": false, "name": "Postharvest Physiology", "prerequisites": "Prerequisite: PB 421", "spring": true, "number": ")  462", "descripton": "Preharvest and postharvest factors that affect market quality of horticultural commodities with an emphasis on technologies to preserve postharvest quality and extend storage life of fruits, vegetables and ornamentals.", "fall": false, "units": " 3"}, {"summer": false, "name": "Tree and Grounds Maintenance", "prerequisites": "Prerequisite: SSC 200", "spring": true, "number": "HS  471", "descripton": "Principles and practices of tree and grounds maintenance.   Physical (water) and chemical (fertility) properties of urban soils.  Tree and shrubbery: physiology, selection, transplanting, pruning, fertilization, and protection.  Weed biology and nonchemical and chemical management options.", "fall": false, "units": " 4"}, {"summer": false, "name": "Horticulture Internship", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "HS  492", "descripton": "A learning experience in agriculture and life sciences within an academic framework that utilizes facilities and resources which are external to the campus. Contact and arrangements with prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior to the experience.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Independent Study in Horticultural Science", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "HS  493", "descripton": "A learning experience in agriculture and life sciences within an academic framework that utilizes campus facilities and resources. Contact and arrangements with prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior to the experience.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Experimental Courses in Horticultural Science", "spring": true, "number": "HS  495", "descripton": "Independent study under faculty supervision of horticultural topics in the student's area of interest not available in regular course offerings.  Offering of new courses on a trial basis.", "fall": true, "units": " 1-6"}, {"summer": false, "name": " Diagnosis", "prerequisites": "Prerequisite: PP 315", "spring": false, "number": ")  502", "descripton": "Introduction to the basic principles of disease causality in plants and the methodology for the study and diagnosis of plant diseases caused by fungi.  Identification of plant-pathogenic fungi.  Research project, disease profiles and field trips arerequired.", "fall": true, "units": " 2"}, {"summer": false, "name": "Viticulture", "prerequisites": "Prerequisite: BS Horticulture/Plant Science or permission from the instructor", "spring": true, "number": "HS  523", "descripton": "A presentation of the commercial importance, distribution, anatomy, physiology, and production of Genus Vitis (grapes) including cultivars, propagation, canopy management, diseases, weed control, physiology, anatomy, irrigation, wine production, climates and soils.  This course will not require students to provide their own transportation.  Non-scheduled class time for field trips or out-of-class activities is required for this class.  One Saturday field-trip will be scheduled.  Students may not receive credit for both HS 423 and HS 523.", "fall": false, "units": " 3"}, {"summer": false, "name": "Introduction to Permaculture", "spring": true, "number": "HS  532", "descripton": "Permaculture means \"permanent culture,\" and ...\"is the conscious design and maintenance of cultivated ecosystems that have the diversity, stability, and resilience of a natural ecosystem.\" (Bill Mollison) This course will explore a design/thinking methodology that seeks to provide our essential physical needs in an environmentally friendly, sustainable manner.  The field trips in the \"live\" courses are optional and will be held on Saturdays.  This course is restricted to upper level undergraduate, graduate, or matriculated continuing education students.  STUDENTS MAY NOT RECEIVE CREDIT FOR BOTH HS 432 AND HS 532.", "fall": true, "units": " 3"}, {"summer": false, "name": "Plant Breeding Methods", "prerequisites": "Prerequisite: ST 511, Corequisite: ST 512", "spring": false, "number": ")  541", "descripton": "Overview of plant breeding methods for advanced undergraduate and beginning graduate students. Covers principles and concepts of inheritance, germplasm resources, pollen control, measurement of genetic variances, and heterosis. Special topics include heritability, genotype-environment interaction, disease resistance, and polyploidy. In-depth coverage on methods for breeding cross-pollinated and self-pollinated crops. Prepares students for advanced plant breeding courses.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Food Production in Greenhouses and High Tunnels", "prerequisites": "Prerequisite: HS 431, HS 440 and HS 451", "spring": "True", "number": "HS  543", "descripton": "Several food crops and technologies are discussed, but the focus is hydroponic production of greenhouse tomatoes and soil production of tomatoes and cool-season crops in high tunnels.  Pest management emphasizes biocontrol, IPM and reduced risk pesticides.  Climate control is discussed mainly as it contributes to environmental stress and physiological disorders.  Students are introduced to current research as well as specialized topics such as organic production, aquaponics and grafting.  A multi-day field trip is required unless special arrangements are made.  Undergraduates required to have Senior status and 3.0 GPA in major.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Environmental Nursery Production", "prerequisites": "Prerequisite: HS 411, Nursery Management, or an equivalent course.", "spring": true, "number": "HS  550", "descripton": "The course focuses on the impacts of the nursery industry on the environment and environmentally sound nursery practices.  Exploration of the major challenges facing the nursery industry that drive decision making during production.  Evaluation of past and current research addressing these challenges and sampling procedures and interpretation will be learned.  Graduate status and an undergraduate nursery production or management course or working knowledge of nursery production required.", "fall": false, "units": " 3"}, {"summer": false, "name": "Postharvest Physiology", "spring": true, "number": ")  562", "descripton": "Pre- and post-harvest factors that affect market quality of horticultural commodities with an emphasis on technologies to preserve quality and extend storage life of crops.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Floral Crop Production and Handling", "spring": true, "number": "HS  583", "descripton": "Principles and commercial practices for producing floral potted crops and cut flowers emphasizing the physical responses of plants to their environment and post-harvest physiology.  Lab will be conducted at the student's home location and students will document plant growth with photos or video.  Some live plants will be mailed to the student; however, the student will be required to purchase some plants (e.g. African violet).  Course is restricted to graduates students only.", "fall": false, "units": " 3"}, {"summer": true, "name": "Special Problems in Horticultural Science", "spring": true, "number": "HS  590", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Professional Presentation Skills in Horticultural Science", "spring": false, "number": "HS  601", "descripton": "The purpose of this course is to familiarize the students with the professional presentation skills they need to be successful.  These skills include speaking, writing, poster and website development, based on the student's proposed research/project and literature review.", "fall": true, "units": " 2"}, {"summer": true, "name": "Special Topics in Horticultural Science", "spring": true, "number": "HS  610", "descripton": "Investigation of special theoretical problems at 600 level in horticultural science not related to a thesis problem; new 600-level courses during developmental phase.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Advanced Special Topics", "spring": true, "number": "HS  615", "descripton": "Investigation of theoretical problems at the 600 level in horticultural science not related to a thesis problem; new 600-level courses during the development phase.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "HS  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "HS  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "HS  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": true, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "HS  690", "descripton": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "HS  693", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "HS  695", "descripton": "Thesis research.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "HS  696", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "HS  699", "descripton": "Original research on specific problems in fruit, vegetable and ornamental crops.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Plant Metabolism", "prerequisites": "Prerequisite: CH 223 and PB 421", "spring": false, "number": "HS  701", "descripton": "A brief introduction to various aspects of metabolism in plants including the basic biochemical processes including the syntheses, utilization and roles of amino acids, lipids, carbohydrates and secondary metabolites in plant growth, development and response to the environment.  This course is taught as a 5-week mini course..", "fall": true, "units": " 1"}, {"summer": false, "name": "Biology of Plant Hormones", "prerequisites": "Prerequisite: BO 421, (GN 411 or BCH 451)", "spring": false, "number": "HS  702", "descripton": "Recent developments and current literature on the physiology, biochemistry, molecular biology, and practical applications of the primary plant hormones. The biosynthesis, signal transduction pathways, and biological functions of specific plant hormones will be examined. Taught as a five-week minicourse.", "fall": true, "units": " 1"}, {"summer": false, "name": "Breeding Asexually Propagated Crops", "prerequisites": "Prerequisite: CS 413", "spring": false, "number": "HS  703", "descripton": "Principles and problems associated with breeding clonally propagated crops and techniques used in overcoming these problems.  Taught third five weeks of semester.  Drop date is by last day of 3rd week of minicourse.", "fall": true, "units": " 1"}, {"summer": false, "name": "Plant Nomenclature", "prerequisites": "Prerequisite: PB 421", "spring": true, "number": "HS  704", "descripton": "A practical foundation in plant nomenclature and nomenclatural references.  Emphasis on the evolution of international rules for naming plant taxa and their application in both wild and cultivated plants. Nomenclature applications used in patents, cultivar releases and journal articles.  Taught mid-semester.  Taught five weeks of semester.", "fall": false, "units": " 1"}, {"summer": false, "name": "Physiology Of Flowering", "prerequisites": "Prerequisite: PB 421", "spring": false, "number": "HS  705", "descripton": "Examination of physiological basis of flowering in plants such as: floral initiation, transition to reproductive growth; floral development; plant response to light, temperature, nutrition, water supply; plant age; chemical growth regulation and in vitro flowering. Taught first five weeks of fall semester. Drop date is by last day of 3rd week of minicourse.", "fall": true, "units": " 1"}, {"summer": false, "name": "Fruit Development and Postharvest Physiology", "prerequisites": "Prerequisite: PB 421", "spring": true, "number": "HS  706", "descripton": "Theories of plant senescence, both physiological and biochemical, and postharvest changes in all types of plant parts. Emphasis on physiological principles underlying current postharvest handling and storage techniques. A study of fruit development from fruit set to senescence. Taught third five weeks of semester. Drop date is by last day of 3rd week of minicourse.", "fall": false, "units": " 1"}, {"summer": false, "name": "Environmental Stress Physiology", "prerequisites": "Prerequisite: PB 421", "spring": false, "number": "HS  707", "descripton": "Physiology of plant responses to environmental stresses, with emphasis on current research in selected physiological, molecular, and biochemical mechanisms for tolerance to environmental stresses such as temperature extremes, drought, salt, pathogens and other plants.  Taught second five weeks of semester.", "fall": true, "units": " 1"}, {"summer": false, "name": "Weed Management Systems", "prerequisites": "Prerequisite: CS 414", "spring": false, "number": ")  717", "descripton": "Weed management systems including integration of cultural, biological, mechanical and chemical methods for vegetables, fruits, ornamentals, turf, small grains, corn, tobacco, cotton, peanuts, aquatic and non-cropland settings.  Taught second 5 weeksof semester.  Drop date is by last day of 3rd week of minicourse.", "fall": true, "units": " 1"}, {"summer": false, "name": "Molecular Biology In Plant Breeding", "prerequisites": "Prerequisite: CS(GN,HS) 741", "spring": true, "number": ")  720", "descripton": "Theory and principles of molecular biology applied to plant breeding. Experimental approaches to induce genetic change, cytoplasmic recombination, haploid utilization and potentials of molecular techniques for solving breeding problems.", "fall": false, "units": " 3"}, {"summer": false, "name": "Pesticide Chemistry", "prerequisites": "Prerequisite: CH 201 and 221", "spring": true, "number": ")  725", "descripton": "Chemical properties of pesticides including hydration and solvation, ionization, volatilization, lipophilicity, molecular structure and size, and reactivity and classification according to chemical description, mode of action or ionizability. Taughtduring the first 5 weeks of semester. Drop date is last day of 3rd week of the minicourse.", "fall": false, "units": " 1"}, {"summer": false, "name": "Pesticide Behavior and Fate In the Environment", "prerequisites": "Prerequisite: CS(HS,SSC,TOX)725,SSC 200", "spring": true, "number": ")  727", "descripton": "Sorption/desorption, soil reactivity, movement, volatilization, bioavailability, degradation and stability of pesticides in the environment. Taught during the last 10 weeks of semester. Drop date is last day of 3rd week of the minicourse.", "fall": false, "units": " 2"}, {"summer": false, "name": "Herbicide Behavior In Plants", "prerequisites": "Prerequisite: BO 751 and BO 752 and CS(HS,SSC) 725", "spring": true, "number": ")  729", "descripton": "Chemical, physiological and biochemical actions of herbicides in plants including uptake, translocation, metabolism and mechanism of action.", "fall": false, "units": " 2"}, {"summer": false, "name": "Quantitative Genetics In Plant Breeding", "prerequisites": "Prerequisite: CS(GN, HS) 741, ST 512, course in quantitative genetics recommended", "spring": true, "number": ")  745", "descripton": "Theory and principles of plant quantitative genetics.  Experimental approaches of relationships between type and source of genetic variability, concepts of inbreeding, estimations of genetic variance and selection theory.", "fall": false, "units": " 1"}, {"summer": false, "name": "Breeding Methods", "prerequisites": "Prerequisite: CS (GN, HS) 741, ST 512", "spring": true, "number": ")  746", "descripton": "Theory and principles of plant breeding methodology including population improvement, selection procedures, genotypic evaluation, cultivar development and breeding strategies.", "fall": false, "units": " 2"}, {"summer": true, "name": "Special Problems in Horticultural Science", "spring": true, "number": "HS  790", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Advanced Special Topics", "spring": true, "number": "HS  815", "descripton": "Investigation of theoretical problems at 600 level in horticultural science not related to a thesis problem; new 600-level courses during development phase.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Plant Breeding Laboratory", "prerequisites": "Prerequisite: CS(GN,HS)741", "spring": true, "number": ")  860", "descripton": "Visitation of plant breeding projects in the Depts. of CS and HS at NC State, along with commercial seed companies. Discussion and viewing of breeding objectives, methods and equipment and teaching and practice of hybridization methods.", "fall": false, "units": " 1"}, {"summer": false, "name": "Plant Breeding Laboratory", "prerequisites": "Prerequisite: CS(GN,HS)741", "spring": false, "number": ")  861", "descripton": "Visitation of plant breeding projects in the Depts. of CS and HS at NC State, along with commercial seed companies. Discussion and viewing of breeding objectives, methods and equipment and teaching and practice of hybridization methods.", "fall": true, "units": " 1"}, {"summer": true, "name": "Doctoral Supervised Teaching", "spring": true, "number": "HS  885", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "HS  890", "descripton": "For students who are preparing for and taking written and/or oral preliminary exams.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "HS  893", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "HS  895", "descripton": "Dissertation Research", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "HS  896", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": false, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "HS  899", "descripton": "For students who have completed all credit hour requirements, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations.", "fall": true, "units": " 1-3"}]