[{"summer": false, "name": "Environmental Ethics", "spring": true, "number": "IDS  201", "descripton": "Interdisciplinary consideration of ways in which field of study coupled with personal/cultural values contribute towards either solving or compounding environmental problems; provides framework for process of making ethical decisions.", "fall": true, "units": " 3"}, {"summer": false, "name": "Eating through American History", "spring": false, "number": "IDS  211", "descripton": "Examination of cultural and scientific forces that have shaped our relationship with food.  Science and politics of dietary recommendations.  Influence, over time, of economic, social and political conditions on food preparation, preference and nutritional knowledge.  Role of religion, family, tradition and personal experience in shaping eating attitudes and behaviors.  Roles played only by women in American food culture.", "fall": false, "units": " 3"}, {"summer": true, "name": "Special Topics in Interdisciplinary Studies", "spring": true, "number": "IDS  295", "descripton": "Detailed investigation of an interdisciplinary topic. Topic and mode of study to be determined by faculty member and/or teach team.", "fall": true, "units": ""}, {"summer": false, "name": "Humans and the Environment", "spring": false, "number": ")  303", "descripton": "Interactions among human populations in the biophysical system and the environment.  Emphasis on current issues, ecological principles and their relationships to basic biophysical processes; considers food, population dynamics, public land and common resources, renewable natural resources, pollution, water resources, energy and non-renewable resources.", "fall": false, "units": " 3"}, {"summer": false, "name": "Interdisciplinary Methods and Issues", "prerequisites": "Prerequisite: Interdisciplinary Studies Self-Design Majors, Senior standing", "spring": true, "number": "IDS  490", "descripton": "Capstone seminar for students in the IDS self-design major. Intensive study of student's area of concentration, leading to a major research paper.", "fall": true, "units": " 3"}, {"summer": false, "name": "Special Topics in Interdisciplinary Studies", "spring": true, "number": "IDS  495", "descripton": "Examination of selected topics of an interdisciplinary nature.", "fall": true, "units": ""}, {"summer": "True", "name": "Topics in Film and Interdisciplinary Studies", "spring": "True", "number": "IDS  496", "descripton": "Detailed examination of film within interdisciplinary contexts. Specific topics will vary from semester to semester.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Independent Study in Interdisciplinary Studies", "spring": true, "number": "IDS  498", "descripton": "Independent investigation and discussion of a selected topic of an interdisciplinary nature.", "fall": true, "units": ""}]