[{"summer": false, "name": "Manufacturing Systems Engineering Project", "prerequisites": "Prerequisite: Graduate standing in IMSE", "spring": true, "number": "IMS  675", "descripton": "Individual or team project work in integrated manufacturing systems engineering resulting in an engineering report. Required of all degree candidates in IMSE master's program. Forms the basis for IMSE student's final oral examination.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Master's Directed Study", "prerequisites": "Prerequisite: Graduate standing in IMSE", "spring": true, "number": "IMS  680", "descripton": "Independent study providing opportunity for individual students to explore topics of special interest under direction of a member of faculty.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "IMS  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "IMS  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "IMS  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": true, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "IMS  690", "descripton": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Summer Project Research", "spring": false, "number": "IMS  696", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to project research.", "fall": false, "units": " 1"}]