[{"summer": false, "name": "Landscape Architecture Introductory Studio", "prerequisites": "Prerequisite: Design Majors and D 104", "spring": false, "number": "LAR  200", "descripton": "Small scale landscape architectural design.  Site observation exercises and visits, physical design projects, reading and discussion.  Basic skills in landscape architecture, discerning the environmental issues in design, understanding design process, drawing and verbally communicating issues, and idea conceptualization and realization.", "fall": true, "units": " 6"}, {"summer": true, "name": "Digital Drawing for Landscape Architecture", "prerequisites": "Prerequisite: LAR Majors", "spring": false, "number": "LAR  210", "descripton": "Digital modeling and computer aided design in landscape architecture.  Integration of digital data in visualization of past, existing and future designs.", "fall": true, "units": " 3"}, {"summer": true, "name": "Digital Design Media for Landscape Architecture", "prerequisites": "Prerequisite: LAR Majors", "spring": true, "number": "LAR  211", "descripton": "Principles and practices related to the use of digital applications in landscape architectural design.  Includes two-dimensional raster imaging, vector graphics, photo simulation, and three-dimensional modeling.", "fall": false, "units": " 3"}, {"summer": false, "name": "Introduction to Environment and Behavior for Designers", "spring": true, "number": "LAR  221", "descripton": "Integration of behavioral and environmental systems related to design.  Exploration of humane, ecologically sound design alternatives.", "fall": false, "units": " 3"}, {"summer": false, "name": "Perception and Behavior for Designers", "spring": true, "number": "LAR  222", "descripton": "Perceptual systems, linkages among them, and linkages between them and language and culture as these affect the design process.", "fall": false, "units": " 3"}, {"summer": true, "name": "Special Topics in Landscape Architecture", "spring": true, "number": "LAR  292", "descripton": "Topics of current interest in Landscape Architecture.  Normally used to develop new courses.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Landscape Architecture Studio", "prerequisites": "Prerequisite: D 105, LAR 200; or Departmental Head Approval", "spring": true, "number": "LAR  400", "descripton": "Projects cover small scale design, urban landscapes, community design, and environmental management. Design process stressed, including attention to project organization, design synthesis and realization.", "fall": false, "units": " 6"}, {"summer": false, "name": "Site Planning", "prerequisites": "Prerequisite: LAR 400 or LAR 501", "spring": true, "number": "LAR  430", "descripton": "Technical operations and environmental landscape controls for site development. Site analysis, grading and drainage, earthwork, horizontal and vertical control for road alignment. Graphic exercises.", "fall": false, "units": " 3"}, {"summer": "True", "name": "History of Landscape Architecture", "spring": "True", "number": "LAR  444", "descripton": "The history of designed landscapes.  Environmental, social and cultural factors which influence human made landscapes presented with history and art of landscape architecture.", "fall": "True", "units": " Performing Arts"}, {"summer": false, "name": "Landscape Construction Materials, Methods and Documentation", "prerequisites": "Prerequisite: LAR 400 or LAR 502", "spring": false, "number": "LAR  457", "descripton": "Materials, standards, and construction methods used to implement landscape architectural designs. Development of construction documents.", "fall": true, "units": " 3"}, {"summer": false, "name": "Landscape Architecture International Studio", "prerequisites": "Prerequisite: Junior Standing in the College of Design and Approval of the International Study Abroad Office.", "spring": true, "number": "LAR  465", "descripton": "Define landscape architectural problems and develop design solutions in an international setting.  Exercises and projects related to design, culture and the physical environment of the host country.  Focus on landscape architecture, gardens and urbanism studied through sketching and documentation, discussion, site investigation, historical context, current design examples and design applications.", "fall": true, "units": " 6"}, {"summer": true, "name": "Special Topics in Landscape Architecture", "spring": true, "number": "LAR  492", "descripton": "Topics of current interest in Landscape Architecture.  Normally used to develop new courses.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Internship in Landscape Architecture", "prerequisites": "Prerequisite: Junior standing in Landscape Architecture; 3.0 GPA or better", "spring": true, "number": "LAR  494", "descripton": "Supervised field experience in landscape architecture office, related design office, or governmental agency.  Students work in an office or agency for up to 12 hours per week.  A daily work journal and a final paper summarizing the work experience are required.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Independent Study in Landscape Architecture", "prerequisites": "Prerequisite: Junior standing in Landscape Architecture 3.0 GPA or better", "spring": true, "number": "LAR  495", "descripton": "Individual projects in landscape architecture developed under the direction of a faculty member on a tutorial basis.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Landscape Design Studio", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "LAR  500", "descripton": "Application of information and skills developed in course work to environmental design problems. Process of site selection, activity programming, site planning and program evaluation followed employing creation of interactive communication systems between designer, clients and users. Goals include design of satisfying new landscapes as well as conservation and design strategies for existing culturally important landscapes and townscapes.", "fall": true, "units": " 6"}, {"summer": false, "name": "Landscape Architecture Introduction Studio", "prerequisites": "Prerequisite: MLA Majors", "spring": false, "number": "LAR  501", "descripton": "Introduction of basic design and landscape architecture concepts through design problems, discussions, and readings.", "fall": true, "units": " 6"}, {"summer": false, "name": "Landscape Description Studio", "prerequisites": "Prerequisite: LAR 501", "spring": true, "number": "LAR  502", "descripton": "Describing landscapes by systematically analyzing their natural and cultural systems and experiential qualities to comprehensivly define design problems and inform design decisions.  Individual and team work on small to large-scale projects in urbanand non-urban sttings.  Reading, writing, site observation, precedent study, user input, and participatory activities.  Exploring ethical issues and how other (creative) people describe and use landscapes.", "fall": false, "units": " 6"}, {"summer": false, "name": "Landscape Architecture Construction Studio", "prerequisites": "Prerequisite: BLA Majors or MLA Majors", "spring": true, "number": "LAR  503", "descripton": "Studio integrates construction issues into the design experience.  involves visits to built sites, construction sites, and construction manufacturing companies.", "fall": false, "units": " 6"}, {"summer": false, "name": "Landscape Architecture Final Project Studio", "spring": true, "number": "LAR  505", "descripton": "Individual semester long projects demonstrating capabilities in a full range of design and production skills.", "fall": true, "units": " 6"}, {"summer": false, "name": "Graphics for Landscape Architects", "prerequisites": "Prerequisite: Graduate standing, Corequisite: LAR 500", "spring": false, "number": "LAR  510", "descripton": "A series of demonstrations and exercises to give students exposure to and experience with conventional techniques of graphic representation and presentation.", "fall": true, "units": " 3"}, {"summer": false, "name": "Community Design Policy", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "LAR  511", "descripton": "Exploration of theory and practices of social policy impact on designed environment and users of that environment. Study of public community development process studied in relation to built environment.", "fall": false, "units": " 3"}, {"summer": false, "name": "Values, Theory and Methods of Landscape Architecture", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "LAR  521", "descripton": "Radical change in profession of landscape architecture in the past decade. New and emerging roles for landscape architect include regional analysis, landscape assessment, land development, urban planning, recreation planning, etc. Development of core values and theories from which each emerged and survey of the techniques and methods of their development.", "fall": true, "units": " 3"}, {"summer": false, "name": "Research Methods and Final Project Development", "spring": false, "number": "LAR  522", "descripton": "Explores future career paths, introduces methods of critical inquiry, criticism, and research in landscape architecture.", "fall": true, "units": " 3"}, {"summer": true, "name": "International Landscape Architecture Design Studio", "prerequisites": "Prerequisite: Graduate standing the College of Design and approval of the International Study Abroad Office", "spring": false, "number": "LAR  565", "descripton": "Landscape architectural problems and design solution in international setting.  Exercises and projects related to design, culture and physical environment of host country.  Focus on landscape architecture, gardens and urbanism through sketching and documentation, discussion, site investigation, historical context, current design examples and design applications.", "fall": false, "units": " 6"}, {"summer": false, "name": "Community Design", "spring": false, "number": ")  576", "descripton": "Processes through which citizens shape and manage built environment.  Strategic planning, visioning process, community action, and mediation will be discussed and illustrated with case study examples from architecture, landscape architecture and planning.  Analysis and assessment from case studies of participation techniques such as charrette, study circles, and visual appraisal.", "fall": true, "units": " 3"}, {"summer": false, "name": "Sustainable Communities", "prerequisites": "Prerequisite: Graduate standing, Master's student in the School of Design or Department of City and Regional Planning (UNC-Chapel Hill)", "spring": true, "number": ")  577", "descripton": "Historical precedents of sustainable communities.  Examination of the Garden City, the New Towns Movement, and the New Urbanism.  Comparison of sustainable communities to urban visions of Wright, Corbusier, Soleri and others.  Virtual cities and digital communities.", "fall": false, "units": " 3"}, {"summer": false, "name": "Ecological Design", "prerequisites": "Prerequisite: Graduate standing, Master's student in the School of Design or Department of City and Regional Planning (UNC-Chapel Hill)", "spring": false, "number": "LAR  578", "descripton": "An integrative approach to human and natural systems.  Ecological scale, function, spatial structure, and human-ecosystem interaction will be examined through case studies at a variety of scales.  Ecological concepts will be linked to design and planning principles.", "fall": true, "units": " 3"}, {"summer": false, "name": "Human Use of the Urban Landscape", "prerequisites": "Prerequisite: Graduate standing, Master's student in the School of Design or Department of City and Regional Planning (UNC-Chapel Hill)", "spring": false, "number": "LAR  579", "descripton": "Techniques for documenting and analyzing user needs at site planning scale.  Methods of integrating user needs into design programming in design and redesign projects.  Community participation methods.  Examples of best practice in design of user-intensive settings in residential, health, education, and recreation.  Principles of Universal Design.  Fieldwork oriented.", "fall": true, "units": " 3"}, {"summer": false, "name": "Special Topics In Landscape Architecture", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "LAR  582", "descripton": "Topics of current interest to programs in School of Design offered by faculty in the School. Subjects offered under this number are normally used to test and develop new courses.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Independent Study", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "LAR  630", "descripton": "Special problems in various aspects of design developed under direction of a faculty member on a tutorial basis.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Final Project Studio In Landscape Architecture", "prerequisites": "Prerequisite: LAR 697", "spring": true, "number": "LAR  679", "descripton": "Graduate students sufficiently prepared may undertake selected research investigations. A proposal for such investigations must be submitted prior to consent for enrollment.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "LAR  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": "True", "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": "True", "number": "LAR  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": "True", "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "LAR  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": true, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "LAR  690", "descripton": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam.", "fall": true, "units": " 1-6"}, {"summer": "True", "name": "Summer Thesis Res", "spring": "True", "number": "LAR  696", "fall": "True", "units": " 1"}, {"summer": false, "name": "Final Research Project", "prerequisites": "Prerequisite: 3 LAR 500 studios", "spring": true, "number": "LAR  697", "descripton": "Each student in his or her terminal semester not registered in any other courses and in conjunction with terminal case study will prepare and submit to his or her committee a presentation on relevance of one's minor to design process with particularreference to individual's case study.", "fall": true, "units": " 1-3"}, {"summer": "True", "name": "Summer Dissert Res", "spring": "True", "number": "LAR  896", "fall": "True", "units": " 1"}]