[{"summer": "True", "name": "Managerial and Career Effectiveness", "spring": "True", "number": "MBA  500", "descripton": "Frameworks, concepts and tools for management and career effectiveness.  Assessment of managerial strengths, weaknesses, and potential.  Team building, public speaking, networking, decision making, creativity and problem solving.  Career development techniques including data mining, job search, behavior based interviewing, and negotiation skills with practical application of those concepts.  Restricted to MBA Students.", "fall": "True", "units": " .5-3"}, {"summer": "True", "name": "Survey of Accounting", "spring": "True", "number": "MBA  503", "descripton": "Accelerated survey of basic concepts underlying accounting in profit-oriented firms; concepts for decision making in manufacturing; content and interpretation of published financial statements; data measurement; product costing; budgeting.   May notbe taken for credit by students majoring or minoring in accounting", "fall": "True", "units": " 3"}, {"summer": "True", "name": " Forecasting Methods for Management", "spring": "True", "number": "MBA  504", "descripton": "Role of quantitative modeling in management.  Application of tools for data analysis and forecasting, with an emphasis on decision making and analytical skills.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Global Economics for Managers", "spring": "True", "number": "MBA  505", "descripton": "Survey of economic concepts applied to managerial decisions.  Competition.  Market power.  The firm, production, and cost.  Pricing practices.   Output, employment, interest rates and inflation.  Determinants of exchange rates and balance of payments.  Not open to students pursuing major or minor in Economics.  Restricted to MBA students.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Global Management Simulation", "spring": "True", "number": "MBA  508", "descripton": "Introductory experience in managerial decision-making for success in the global economy.  Immersion in simulation of business functions including finance, operations, marketing, human resource management, information technology, and accounting.  Hands-on management of complex corporate forms and analytical tools from multiple functional areas of business.  Introduction to effective team-building, leadership, and communication for high-performance in international competition.  Restricted to MBAstudents.", "fall": "True", "units": " 1"}, {"summer": "True", "name": "Networking Infrastructure for E-Commerce", "spring": "True", "number": "MBA  511", "descripton": "Network infrastructure necessary for electronic commerce, as well as general business needs.  Network technologies, architectures, security and applications.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Technology, Law, and the Internet", "spring": "True", "number": "MBA  514", "descripton": "Legal aspects of technology management.  Examination of intellectural property law, mainly focused on software.  Contract law for e-commerce as well as warranties and new product development.  cyberlaw issues such as protection of privacy, freedom of expression, crime, and fraud.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Enterprise Systems", "spring": "True", "number": "MBA  515", "descripton": "Use of enterprise systems in planning, controlling and managing operations.  Discussion of ERP and other enterprise systems such as customer relationship management systems.  Enterprise systems life cycle.  Project using reengineering principles to make business processes more efficient.  Hands on experience with Netsuite ERP/CRM and Microsoft Visio.  Enterprise systems case studies providing implications for IT management.  Technical and end u ser aspects included.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Managerial Finance", "spring": "True", "number": "MBA  520", "descripton": "Investment and financing decisions by businesses with emphasis on technology-driven organizations in rapidly changing environments.  Cash as the basis of asset valuation.  Time value of money.  Capital budgeting decisions under certainty and uncertainty.  Capital market theory.  Cost of capital. Capital structure theory and dividend policy.  Cash management.  Options and managerial implications.  Derivatives and risk management.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Advanced Corporate Finance", "spring": "True", "number": "MBA  521", "descripton": "Overview of financial management.  Evaluation of projects and valuation of real assets using traditional discounted cash flow analysis and real options.  Role of financial leverage; optimal capital structure.  Conflicts between security holders and management; stockholder-bondholder conflicts; financial distress, bankruptcy and reorganization; corporate control and restructuring; corporate governance issues.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Investment Theory and Practice", "spring": "True", "number": "MBA  523", "descripton": "Advanced topics in investments with a focus on underlying theory and practical application using real world data.  Stock valuation models, bond valuation, derivatives, portfolio performance evaluation, investment strategies, efficient market theory and other current issues in investment finance.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Equity Valuation", "prerequisites": "Prerequisite: MBA 523", "spring": true, "number": "MBA  524", "descripton": "Advanced quantitative course on applied equity valuation.  Students conduct stock valuation analysis which is then used to select stocks for the student-managed SunTrust MBA fund.  Topics include the investment decision making process, empirical evidence on securities returns, forecasting financial statements, industry and macro-economic analysis, valuation models, portfolio performance evaluation and performance attribution.", "fall": false, "units": " 3"}, {"summer": true, "name": "Taxes and Business Strategy", "spring": false, "number": "MBA  525", "descripton": "Importance of tax consideratoins in business decisions.  Framework for understanding how taxes affect business strategy and financing decisions in a wide variety of settings.", "fall": true, "units": " 3"}, {"summer": "True", "name": "International Finance", "spring": "True", "number": "MBA  526", "descripton": "Theory and practice of financial management in the international arena, including spot and forward markets for foreign exchange, currency futures and options contracts, international arbitrage conditions, foreign exchange exposure, foreign trade financing instruments, direct and portfolio investment abroad, and the role of country risk in determining investments.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Corporate Risk Management", "prerequisites": "Prerequisite: MBA 520", "spring": true, "number": "MBA  527", "descripton": "Fundamentals of corporate risk management from a strategic decision-making perspective.  Emphasis on how exposures to financial risks (foreign currency, credit, interest rate, etc.) affect the firm, and how risk exposures can be reengineered to enhance shareholder value.  Topics include the major sources of risk, the measurement of risk exposures, methods and strategies of managing and controlling risk and tools of the financial engineer--futures, options, swaps, and other derivatives.", "fall": false, "units": " 3"}, {"summer": "True", "name": "New Firm Financing", "spring": "True", "number": "MBA  529", "descripton": "Survey of financial management problems at firms from initial formation to initial public offering. Financial components of business plan, design of financial information and control systems, sources of funds for small firms, financing rapid growth,firm valuation for initial public offerings, going public transactions.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "People Management", "spring": "True", "number": "MBA  530", "descripton": "Fundamental principles of organizational behavior and leadership. Individuals, teams and organizations. Staffing, performance management, and incentives. Leadership and influence. Organizational culture. Ethical issues in organizations. Restricted to MBA students.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Creativity in Management", "spring": false, "number": "MBA  536", "descripton": "Organizational use of creativity management techniques to generate and synthesize new ideas that can lead to new products or processes.  Research-based literature in psychology and management on how companies should and do manage creativity, including processes that can stimulate creative thinking. Models exploring creativity and the workplace.  Development, enhancement and evaluation of concepts.  Implementation issues.", "fall": true, "units": " 3"}, {"summer": false, "name": "Operations and Supply Chain Management", "spring": true, "number": "MBA  540", "descripton": "Design and management of organizational operations, including both services and manufacturing.  Analysis of strategies, processes, planning and control, quality, scheduling, work design, and advanced operations techniques using a variety of managerial and quantitative models.  Restricted to MBA students.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Supply Management", "spring": "True", "number": "MBA  541", "descripton": "Major themes and strategies in supply management.  Focus on performance measurement, supplier assessment, negotiations, contracting, cost modeling, supplier relationship management, and supply market analysis in a globally integrated supply chain.  Emphasizes collaboration and strategy execution through assessing, establishing metrics/ expectations, contracting, and managing external business relationships.  Students will engage in a supply chain simulation that provides insights into application of these concepts, as well as completion of a commodity analysis for an SCRC member company.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Supply Chain Logistics", "spring": "True", "number": "MBA  542", "descripton": "Effective logistics decision-making using a variety of conceptual frameworks and quantitative tools.  Relationship between logistics and broader issues of managing the entire supply chain and fulfilling the strategic objectives of a firm.  Inventorymanagement.  Transportation.  Network design.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Planning and Control Systems", "spring": "True", "number": "MBA  543", "descripton": "Design and management of planning and control systems within the organization and across the supply chain.  Business planning, master production scheduling, material requirements planning, just-in-time and theory of constraints.  Enterprise resourceplanning (ERP) and business-to-business (B2B) systems.  Impact of information technologies on planning and control systems.  Major project using state-of-the-art ERP system.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Supply Chain Management Practicum", "prerequisites": "Prerequisite: MBA 540", "spring": true, "number": "MBA  549", "descripton": "Research project examining supply chain management issues at an organization, usually a member of the Supply Chain Resource Cooperative.  Projects will typically focus on procurement, logistics, materials management, operations, or integrated supply chain issues.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Management of Technology and Innovation", "spring": "True", "number": "MBA  550", "descripton": "Overview of the management of innovation and technology for value creation in increasingly complex and changing business environments.  Management of strategic innovation and new product/service development processes within organizations. Implementation issues in innovation strategy. Restricted to MBA students.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Services Management and Marketing", "spring": true, "number": "MBA  551", "descripton": "Overview of services management and marketing.  Key managerial and marketing components associated with running a service focused business.  Introduction to services definitions and taxonomies.  Nature of services and analysis of the service encounter via the GAPs model.  Customer behavior, expectations and perceptions related to services.   Exploration of customer relationships, profitability and return on investment. Articulation of services business strategy.  New service development, design, and blue printing processes and issues associated with managing capacity and demand in services businesses.", "fall": false, "units": " 3"}, {"summer": false, "name": "Managerial Issues in Organizational Culture", "spring": true, "number": "MBA  552", "descripton": "Services depend on a successful co-production relationship of individuals from different organizations, with different organizational cultures. This course will focus on skills development to engage in that co-production relationship successfully, \"read and speak\" the culture of an organization using solid research tools, and use those skills in the practice of a service development within a particular organizational culture context.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Business Process Design and Analysis", "spring": "True", "number": "MBA  553", "descripton": "Identification, development, analysis, improvement and management of business processes.  Strategic and executional issues critical to high-performance processes.  Lean tools.  Six sigma.  Process redesign.  Outsourcing.  Service oriented architecture.  Examples from different industries and functional areas within firms, to identify similarities and differences of well run processes.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Project Management", "spring": "True", "number": "MBA  554", "descripton": "Life cycle view of organizing and managing technical projects, including project selection, planning, and execution.  Methods for managing and controlling project costs, schedules, and scope.  techniques for assessing project risk.  Use of popular project management software tools.  Application of project management tools and methods to product development, software, and process reengineering projects.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Product Design and Development", "spring": "True", "number": "MBA  555", "descripton": "Total product realization process, including customer needs analysis, product design and engineering, manufacturability assessment and marketing plan development. Definition of relevant market, design and engineering principles, financial considerations and manufacturing aspects of product development process. Application and integration of business, design and engineering methodologies, concepts and tools on actual product design and development project.", "fall": "True", "units": " 4"}, {"summer": false, "name": "Management Consulting", "spring": true, "number": "MBA  557", "descripton": "Overview of management consulting with primary emphasis on the application of consulting methods employed to address business issues within organizations.  Overview of the generic issue-based consulting process: identifying and prioritizing issues, identifying root-causes of priority issues, developing interventions to address root-causes and measureing impact of interventions on performance.  Explanation of how the concepts, procedures and methods of issue-based consulting concepts and procedures to organization issues in strategy, performance, process and change management.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Marketing Management and Strategy", "spring": "True", "number": "MBA  560", "descripton": "Market segmentation, targeting, and positioning.  Consumer behavior. Channels of distribution, promotion strategy, product development strategy, and pricing strategy.  Relationship marketing and marketing strategy.  Applications in high-tech environments.  Restricted to MBA students.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Marketing Analytics", "spring": true, "number": "MBA  561", "descripton": "The art and science of developing and utilizing quantitative marketing decision models to plan, implement, and analyze marketing strategies and tactics.  Market response models.  Segmentation and targeting.  Price and sales promotion decisions.  Strategic market analysis; new product decisions.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Research Methods In Marketing", "spring": "True", "number": "MBA  562", "descripton": "A systematic approach to structure, implementation and analysis of marketing research for decision making. Models of consumer demand and firm behavior analyzed in a marketing context.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Product and Brand Management", "spring": "True", "number": "MBA  563", "descripton": "Marketing planning and product management.  New product concept evaluation and selection.  Managing products over the life cycle.  Developing and implementing a brand strategy.  Repositioning and revitalizing brands Brand extension.  Managing globalbrands.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Business Relationship Management", "spring": true, "number": "MBA  564", "descripton": "Strategic, successful management of the multitude of business relationships that contemporary managers face.  Universal and idiosyncratic business relationship skills to allow technically-oriented managers such as engineers and scientists to interact with a variety of constituents.  Integrated perspective of marketing communications as a process of successfully interacting with each constituency with the goal of fostering long-term satisfaction and loyalty, which ultimately translates to sustainable competitive advantage.", "fall": false, "units": " 3"}, {"summer": false, "name": "Managing the Growth Venture", "spring": true, "number": "MBA  570", "descripton": "Entrepreneurial planning as an iterative process continually driven by a stream of strategic choices.  Social networks, organizational structure and culture, opportunity creation, discovery and evaluation, firm growth and change, intellectual property, employment practices and incentives, innovation, financing, and entrepreneurial improvisation. Creation of a strategic growth plan for a venture.", "fall": false, "units": " 4"}, {"summer": "True", "name": "Technology Evaluation and Commercialization Concepts", "spring": "True", "number": ")  576", "descripton": "Commercialization potential of new technologies, products and processes. Marketing, organizational, financial, operational and manufacturing issues. Strategic assessment and planning. Innovation management. Entrepreneurial transfer mechanisms including spinoffs, licensing and high-technology start-ups. Practical application with project and team management skills development.", "fall": "True", "units": " 4"}, {"summer": false, "name": "Technology Evaluation and Strategy", "prerequisites": "Prerequisite: MBA/MSE 576", "spring": true, "number": ")  577", "descripton": "Theoretical and practical team-based application of systematic evaluation techniques for assessing commercial potential of technologies, products and processes. Prioritization and selection based on technology strategy.", "fall": true, "units": " 4"}, {"summer": "True", "name": "Global Strategy", "spring": "True", "number": "MBA  580", "descripton": "Practice-oriented capstone course that integrates the concepts, knowledge and skills of the MBA program.  Strong global emphasis.  Strategic thinking, strategic analysis, creation of competitive advantage.  Creation and monitoring of entrepreneurial opportunities. Corporate and business level strategies. Strategic alliances, acquisitions, and restructuring. Restricted to MBA students.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Current Topics in BioSciences Management", "spring": true, "number": "MBA  585", "descripton": " realities, product life cycles, key elements of product discovery and development, intellectual property, regulatory trials, government approval, production, sourcing, logistics, sales, marketing and customer service.  The complete value chain of a new biotechnology-based product.", "fall": false, "units": " 3"}, {"summer": false, "name": "Legal and Marketing Dynamics in Pharmaceutical and Biotechnology", "spring": false, "number": "MBA  586", "descripton": "Exploration of unique environment in which biotechnology research is conducted and resultant drugs and products are sold. Legal restraints affecting pharmaceutical marketing and reimbursement options; regulatory issues; pre-clinical research.  Laws limiting or affecting pharmaceutical and biomedical marketing  Ethical issues in the research and marketing processes.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Special Topics In Business Management", "spring": "True", "number": "MBA  590", "descripton": "Presentation of material not normally available in regular courses offerings or offering of new courses on a trial basis.", "fall": "True", "units": " 1-6"}, {"summer": "True", "name": "Special Topics in Business Administration", "spring": "True", "number": "MBA  610", "descripton": "Special topics course dealing with issues not covered in regularly scheduled courses.  Restricted to MBA students.", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Independent Study In Business Management", "spring": "True", "number": "MBA  630", "descripton": "Detailed investigation of topics of particular interest to graduate students under faculty direction on a tutorial basis.  Determination of credits and content by faculty member in consultation with department head.", "fall": "True", "units": " 1-6"}, {"summer": "True", "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "spring": "True", "number": "MBA  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": "True", "units": " 1"}, {"summer": "True", "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "spring": "True", "number": "MBA  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": "True", "units": " 3"}]