[{"summer": false, "name": "Earth System Science: Exploring the Connections", "prerequisites": "Prerequisite: Competence in high school algebra and chemistry", "spring": true, "number": "MEA  100", "descripton": "An introduction to the processes of and linkages among major components of planet Earth.  Geosphere, hydrosphere, atmosphere, biosphere as dynamic and interdependent systems.  Influence of human activity on earth systems.  Optional weekend field trip.", "fall": false, "units": " 4"}, {"summer": true, "name": "Geology I: Physical", "prerequisites": "Corequisite: Recommended that MEA 110 be taken concurrently", "spring": true, "number": "MEA  101", "descripton": "Systematic consideration of processes operating on and below the earth's surface and the resulting features of landscape, earth structures, and earth materials. Occurrences and utilization of the earth's  physical resources.", "fall": true, "units": " 3"}, {"summer": true, "name": "Geology I Laboratory", "prerequisites": "Corequisite: MEA 101 or Prerequisite: MEA 100, MEA 101, MEA 120, MEA 140 or MEA 200", "spring": true, "number": "MEA  110", "descripton": "Scientific methodology applied to the study of common rock-forming minerals, common rocks, topographic maps, geologic structures and geological maps. Field trips.", "fall": true, "units": " 1"}, {"summer": false, "name": "The Dinosaurian World", "spring": false, "number": "MEA  120", "descripton": "Evolution and ecology of dinosaurs related to broader features of Earth history, including plate tectonics, paleoclimatology, mass extinction and the long-term effects of natural selection.", "fall": false, "units": " 3"}, {"summer": false, "name": "The Dinosaurian World Lab", "prerequisites": "Corequisite: MEA 120", "spring": false, "number": "MEA  121", "descripton": "Companion to lecture course on \"The Dinosaurian World.\"  Adaptive significance of osteological characteristics, ecological correlates of body weight and physical environmental variables, and concepts relating to natural selection, fitness, biodiversity and changes in the planetary environment on various time scales.  Discussion, specimen demonstrations and problem solving.", "fall": true, "units": " 1"}, {"summer": false, "name": "Introduction to Weather and Climate", "prerequisites": "Prerequisite: For Non-Majors", "spring": true, "number": "MEA  130", "descripton": "Explores the structure, physical causes, and climatology of weather systems including the jet streams, mid-latitude cyclones, hurricanes, thunderstorms, and tornadoes. Clouds and precipitation, air pollution, climate modification, optical effects (rainbows, halos) and weather instruments. Weather systems and forecasting techniques are illustrated through daily weather map discussions.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Weather and Climate Laboratory", "prerequisites": "Corequisite: MEA 130", "spring": true, "number": "MEA  135", "descripton": "Experiments include effects of air pressure change on temperature and density (gas law); measurement of atmospheric moisture; formation of clouds and hail; effects of variable solar heating.  Graphical display and interpretation of data; weather instruments and observations; weather map analysis; forecasting principles.", "fall": true, "units": " 1"}, {"summer": false, "name": "Natural Hazards and Global Change", "spring": false, "number": "MEA  140", "descripton": "The science of natural hazards and global change: the impact on human civilization of events in the lithosphere, atmosphere, biosphere, and hydrosphere (e.g., earthquakes, hurricanes, red tides, and floods), and the impact of humans on the global environment (e.g., global warming).", "fall": true, "units": " 3"}, {"summer": false, "name": "Environmental Issues in Water Resources", "spring": false, "number": "MEA  150", "descripton": "The science of current environmental concerns, particularly those related to water resources. Major topics include weather and climate, natural resource cycles, resource depletion and contamination, societal impacts. Scientific aspects of environmental issues. Required field trips.", "fall": true, "units": " 4"}, {"summer": false, "name": "Introduction to Oceanography", "prerequisites": "Corequisite: Recommended that MEA 210 be taken concurrently.", "spring": true, "number": "MEA  200", "descripton": "The ocean as a part of our environment including interactions between atmosphere and ocean, ocean circulation, physical and chemical properties of sea water, marine geology and marine biology.", "fall": true, "units": " 3"}, {"summer": false, "name": "Geology II: Historical", "prerequisites": "Prerequisite: (MEA 100, MEA 101, MEA 120, MEA 140 or MEA 200 )and MEA 110; Corequisite: Recommended that MEA 211 be taken concurrently", "spring": true, "number": "MEA  202", "descripton": "The second semester of the basic introductory sequence in geology. Utilization of the principles of geology to reconstruct and understand the earth's history. Geologic events that cause modification of the earth's crust, emphasizing North America. History of life and the environmental significance of changes in animal and plant life through geologic time.", "fall": false, "units": " 3"}, {"summer": false, "name": "Oceanography Lab", "prerequisites": "Corequisite: MEA 200", "spring": true, "number": "MEA  210", "descripton": "Complements the lecture course in Oceanography.  Numerous demonstrations and resource materials visualize basic oceanographic concepts such as geological processes operating in the marine realm, the chemical properties of seawater, oceanic circulation, tides and waves, as well as processes affecting the biology of the oceans.", "fall": true, "units": " 1"}, {"summer": false, "name": "Geology II Laboratory", "prerequisites": "Corequisite: MEA 202", "spring": false, "number": "MEA  211", "descripton": "Reconstruction and interpretation of events in the history of the earth. Interpretation of sedimentary rocks, construction and interpretation of geological maps, identification of fossil organisms and utilization of fossils in the reconstruction of earth history.", "fall": false, "units": " 1"}, {"summer": false, "name": "Introduction to Atmospheric Sciences I", "prerequisites": "Corequisite: MA 141", "spring": false, "number": "MEA  213", "descripton": "Introduction to the atmospheric environment. Fundamental concepts and applications of atmospheric physics and dynamics and how they relate to day-to-day and seasonal weather as well as climate change.", "fall": true, "units": " 2"}, {"summer": false, "name": "Introduction to Atmospheric Sciences II", "prerequisites": "Prerequisite: MEA 213", "spring": true, "number": "MEA  214", "descripton": "Second course in a series introducing the atmospheric environment. Topics include midlatitude weather systems from planetary scale to mesoscale, climate and climate change, implications and impacts of the climate change, and air pollution.", "fall": false, "units": " 2"}, {"summer": false, "name": "Marine Biology", "prerequisites": "Prerequisite: MEA 200 or BIO 181", "spring": true, "number": ")  220", "descripton": "Introduction to marine plants and animals, their adaptations to life in the sea and ecological interactions in selected marine environments (e.g. coral reefs, deep sea, salt marshes). Interactions of man with the sea: food from the seas, biology of diving. Optional trip.", "fall": false, "units": " 3"}, {"summer": false, "name": "Introduction to Coastal Environments", "prerequisites": "Prerequisite: MEA 200/210 or MEA 101/110", "spring": false, "number": "MEA  250", "descripton": "A global survey of coastal habitats, the processes that shape these dynamic environments, and the physicochemical controls that regulate their indigenous biological communities.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Introduction to Coastal Environments Laboratory", "prerequisites": "Corequisite: MEA 250", "spring": "True", "number": "MEA  251", "descripton": "Complements the lecture course Introduction to Coastal Environments (MEA 250).  Experiments involving the physical, chemical and biological processes that shape a variety of coastal environments.", "fall": "True", "units": " 1"}, {"summer": "True", "name": "Environmental Geology", "prerequisites": "Prerequisite: MEA 101 or MEA 150 or MEA 140 or SSC 200", "spring": "True", "number": "MEA  300", "descripton": "Geologic aspects of the environment. Effects of humans upon or interactions with geologic processes. Geologic considerations in land use planning, waste disposal, water resources, and natural resources. A field and lab oriented course with combined lecture/laboratory. Inquiry-based learning approach to study the basic processes of environmental geology and develop research skills. Required field trips.", "fall": "True", "units": " 4"}, {"summer": false, "name": "Atmospheric Thermodynamics", "prerequisites": "Prerequisite: MA 141, PY 205; Corequisite: MA 241, PY 208", "spring": true, "number": "MEA  312", "descripton": "Introduction to atmospheric thermodynamics for meteorology majors. Topics include the equation of state for mixture of gases; first and second laws of thermodynamics; diabatic and adiabatic processes for dry and moist air; measurement and phase changes of water vapor. Atmospheric statics: static stability of moist air; CAPE and vertical acceleration. Focus will be on applying the rigorous framework of classical thermodynamics to derive and solve quantitatively the governing equations describing these processes.", "fall": false, "units": " 4"}, {"summer": false, "name": "Mathematics Methods in Atmospheric Sciences", "prerequisites": "Prerequisite: MA 116, MA 141, MA 241; Corequisite: MA 242", "spring": false, "number": ")  315", "descripton": "For sophomore meteorology and marine science students. A complement to MA 242 designed to prepare students for quantitative atmospheric applications. Topics include an introduction to vectors and vector calculus, atmospheric waves, phase and group velocity, perturbation analysis, fourier decomposition, matrix operations, chaos and predictability. For MY, MMY, and MRM majors only.", "fall": true, "units": " 4"}, {"summer": false, "name": "Fundamentals of Air Pollution", "prerequisites": "Prerequisite: MA 121 or MA 131 or MA 141, CH 201, PY 131 or PY 201 or PY 205 or PY 211", "spring": true, "number": ")  320", "descripton": "Air pollution sources, and the influence of natural and anthropogenic processes on the atmosphere.  Roles of local, state and federal governments in air pollution control and importance of the Clean Air Act and it amendments.", "fall": false, "units": " 3"}, {"summer": false, "name": "Fundamentals of Air Quality and Climate Change", "prerequisites": "Prerequisite: CH 101, CH 201, MA 141, MA 241; Corequisite: PY 205", "spring": false, "number": "MEA  321", "descripton": "An intermediate-level introduction, for meteorology majors, to the physical and chemical environment of the atmosphere and to climate change. Topics include the atmosphere's chemical composition; atmospheric chemical reaction processes in gas phase, liquid phase, and on particle surfaces", "fall": true, "units": " 3"}, {"summer": false, "name": "Earth System Chemistry", "prerequisites": "Prerequisite: CH 201 and (CE 373 or any MEA course)", "spring": true, "number": "MEA  323", "descripton": "Chemistry of the earth with an emphasis on the interactions of the biosphere, geosphere and atmosphere. The origin and chemical evolution of the solar system, chemical cycles in the environment, and the impact of man on biogeochemical processes.", "fall": false, "units": " 3"}, {"summer": false, "name": "Terrestrial Paleontology", "prerequisites": "Prerequisite: BIO 181 or MEA 202 or MEA 120", "spring": true, "number": "MEA  369", "descripton": "Evolution of terrestrial life traced through geologic time, accenting the functional significance of adaptations and the history of terrestrial ecosystems.  Required field trips.", "fall": false, "units": " 4"}, {"summer": false, "name": "Introduction to Mineralogy and Petrology", "prerequisites": "Prerequisite: (MEA 100, MEA 101, MEA 120, MEA 140 or MEA 200), and MEA 110 and CH 101/102", "spring": false, "number": "MEA  410", "descripton": "Introduction to the fundamentals of mineralogy, optical mineralogy, and igneous and metamorphic petrology. Description and identification of minerals, using physical properties and geological associations. Optical properties of non-opaque rock-forming minerals, emphasizing petrographic thin sections. Introduction to igneous and metamorphic environments and rocks. Description and classification of common crystalline rocks. Required overnight field trips; additional expenses required.", "fall": true, "units": " 4"}, {"summer": false, "name": "Marine Sediment Transport", "prerequisites": "Prerequisite: MEA 101 or MEA 200, MA 241, PY 201 or PY 205", "spring": false, "number": "MEA  411", "descripton": "Quantitative study of sediment transport in the marine environment including an introduction to fluid mechanics and sediment transport theory.  Discussion of the processes and products of sediment transport in specific marine environments from estuaries to the deep sea and interpretation of sediment transport processes from sedimentary structures. Credit not allowed for both MEA 411 and MEA 562", "fall": true, "units": " 3"}, {"summer": false, "name": "Atmospheric Physics", "prerequisites": "Prerequisite: MA 242, PY 208", "spring": true, "number": "MEA  412", "descripton": "Physical and analytical descriptions of atmospheric aerosols, clouds/fogs, and precipitation processes; size distribution and sources of atmospheric aerosols; impact of aerosols on visibility and climate; microstructure of warm and cold clouds and their interaction with solar and terrestrial radiation; collision-coalescence and ice phase mechanisms of precipitation formation; atmospheric electricity; planned and inadvertent weather modification; weather radar; atmospheric optics.", "fall": false, "units": " 3"}, {"summer": false, "name": "Climate Dynamics", "prerequisites": "Prerequisite: MEA 412 and MEA 422", "spring": false, "number": "MEA  415", "descripton": "A physically based treatment of climate change, climate variability, and climate models, for upper-level undergraduate meteorology majors.  Topics include Earth's energy balance and the greenhouse effect, drivers of future and past climate change, and climate model projections of global warming and its implications.  Cannot receive credit for both MEA 415 and MEA 515.", "fall": true, "units": " 3"}, {"summer": false, "name": "Atmospheric Dynamics I", "prerequisites": "Prerequisite: MA 242 and PY 208 and MEA 312", "spring": false, "number": "MEA  421", "descripton": "Meteorological applications of fluid kinematics: divergence, vorticity, deformation, advection, mass continuity and vertical motion.  Atmospheric dynamics: the equation of motion on a rotating earth; component equations in Cartesian, polar-sphericaland pressure coordinates.  Scale analysis and simplifications.  Cases of horizontal flow: geostrophic and gradient wind, ageostrophy and acceleration; thermal wind and vorticity.", "fall": true, "units": " 3"}, {"summer": false, "name": "Atmospheric Dynamics II", "prerequisites": "Prerequisite: MEA 421", "spring": true, "number": "MEA  422", "descripton": "Vorticity and potential vorticity equations; dynamics of synoptic-scale motions; quasi-geostrophic theory; atmospheric waves including shallow water, internal gravity, inertia-gravity, and Rossby waves; finite difference methods; numerical weather prediction; atmospheric instabilities including static, Kelvin-Helmholtz, inertial, symmetric, barotropic, and baroclinic instabilities.", "fall": false, "units": " 3"}, {"summer": true, "name": "Introduction to Atmospheric Chemistry", "prerequisites": "Prerequisite: MA 141, CH 201, (PY 205, PY 211 or MEA 320)", "spring": true, "number": "MEA  425", "descripton": "The course covers history, regulations, sources, physics, and chemistry of major air pollutants and factors affecting their transport and fate.  Emphasis is placed on atmospheric chemistry and physics underlying five major air pollutant problems including urban outdoor air pollution, indoor air pollution, acid deposition, stratospheric ozone reduction, and global climate change.  Credit will not be allowed for MEA 425 and MEA 525.", "fall": true, "units": " 3"}, {"summer": false, "name": "Forensic Geology", "prerequisites": "Prerequisite: MEA 101", "spring": true, "number": "MEA  433", "descripton": "Application of geology to crime investigation, ranging from violent crime to fraud and liability in property management. Role of a geologist as expert witness. Application of analytical techniques, e.g., petrographic microscopy, trace-element analysis, remote sensing, digital mapping, and image analysis. Tour of the SBI lab and a certified gemology lab. Identification of art fraud by pigment analysis and a corresponding tour of the NC Museum of Art.", "fall": false, "units": " 4"}, {"summer": false, "name": "Engineering Geology", "prerequisites": "Prerequisite: MEA 101 and Junior standing in Colleges of Agriculture and Life Sciences, Engineering, Natural Resources, Physical and Mathematical Sciences or Textiles", "spring": true, "number": ")  435", "descripton": "Application of both geology and geotechnical engineering to engineering projects.  Illustrations of relevant materials properties and techniques utilized in describing subsurface conditions.", "fall": false, "units": " 3"}, {"summer": false, "name": "Igneous and Metamorphic Petrology", "prerequisites": "Prerequisite: MEA 410", "spring": true, "number": "MEA  440", "descripton": "The study of rocks formed by the crystallization of magmas (igneous) and by the recrystallization of existing rocks (metamorphic), with emphasis on whole-rock and mineral compositions, classification, petrography, hand-sample and thin-section identification, and the rock origins in terms of magma genesis and emplacement and tectonics.  Field trips are required.", "fall": false, "units": " 4"}, {"summer": false, "name": "Synoptic Weather Analysis and Forecasting", "prerequisites": "Prerequisite: MEA 421", "spring": false, "number": "MEA  443", "descripton": "Analysis and forecasting of mid-latitude weather systems with emphasis on simplified models and methods.  Barotropic model, Rossby waves; baroclinic structure, upper-level wave evolution, forecasting; surface cyclone evolution, Sutcliffe-Petterssen model.  Numerical computation methods; numerical weather prediction and operational models, subjective and objective analysis of meteorological fields.", "fall": true, "units": " 4"}, {"summer": false, "name": "Mesoscale Analysis and Forecasting", "prerequisites": "Prerequisite: MEA 443", "spring": true, "number": "MEA  444", "descripton": "Analysis and forecasting of mid-latitude weather systems with emphasis on mesoscale phenomena. Definition of the mesoscale, approximations to the governing equations, basic measurements and techniques; observations, basic governing dynamics, and forecasting of mesoscale phenomena, including drylines, low-level jets, conditional symmetric instability, crographically-induced circulations, thunderstorms, mesoscale convective, and severe convective weather.", "fall": false, "units": " 4"}, {"summer": false, "name": "Principles of Biological Oceanography", "spring": false, "number": ")  449", "descripton": "Biological productivity and trophic relationships in plankton, nekton and benthos; community ecology of selected habitats (estuaries, intertidal zones, coral reefs, deep sea); and adaptation of organisms to the marine environment.  Credit is not allowed for both MEA/BIO 449 and MEA/BIO 549", "fall": true, "units": " 3"}, {"summer": false, "name": "Introductory Sedimentary Petrology/Stratigraphy", "prerequisites": "Prerequisite: MEA 410", "spring": true, "number": "MEA  450", "descripton": "Properties, classification, geologic occurrences, and origin of minerals and rocks formed by physical, chemical, and biologic processes at and near the earth's surface.  Principles of division of stratified terrains into natural units, correlation of strata, interpretation of depositional environments and facies.  Required field trips.", "fall": false, "units": " 4"}, {"summer": false, "name": "Structural Geology", "prerequisites": "Prerequisite: MEA 410", "spring": false, "number": "MEA  451", "descripton": "Basic principles of geometric, kinematic and dynamic analysis as applied to fractures, shear zones, folds, and fabrics of deformed rock bodies.  Considers both brittle and ductile realms of the crust from microscale to regional tectonics.  Required overnight field trips.", "fall": true, "units": " 4"}, {"summer": false, "name": "Marine Physical-Biological Interactions", "prerequisites": "Prerequisite: MEA 460 and MEA/ZO 449", "spring": true, "number": "MEA  454", "descripton": "Space-time relationships between physics and biology; influence of Reynolds Number on aquatic life style; aspects of physical and biological mathematical modeling; influence of biology on physical phenomena; influence of static physical/chemical properties on biology; influence of dynamic physical phenomena (turbulence, waves and advection) on biology within the water column and its boundaries. Credit is not allowed for both MEA454 and 554", "fall": false, "units": " 3"}, {"summer": false, "name": "Micrometeorology", "prerequisites": "Prerequisite: MEA 422 or MAE 308", "spring": false, "number": "MEA  455", "descripton": "Energy budget near the earth's surface; soil temperatures and heat transfer; air temperature, humidity, and wind distribution in the planetary boundary layer; fundamentals of viscous flows and turbulence; semiempirical theories of turbulence; exchanges of momentum, heat and moisture in the atmospheric surface layer; air modification due to changes in surface properties; agricultural and forest micrometeorology.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Field Investigation of Coastal Processes", "prerequisites": "Prerequisite: MEA 250 and MEA 251", "spring": "True", "number": "MEA  459", "descripton": "Coastal zone processes and dynamics with emphasis on the forcing factors that regulate changing coastal landforms, the ecology and physicochemical character of coastal ocean water-masses, seabed morphologies, landscape academes, etc.  Field observations and field techniques will be emphasized in tidal-freshwater coastal wetlands, estuaries, barrier island, tidal inlets, continental shelves and shelf-margin habitats.  Additional feeds required.", "fall": "True", "units": " 5"}, {"summer": false, "name": "Principles of Physical Oceanography", "prerequisites": "Prerequisite: MA 241 or MA 231; Corequisite: PY 203,PY 208 or PY 212.", "spring": false, "number": "MEA  460", "descripton": "Introduction to principles and practices of physical oceanography.  Equation of state of seawater; energy transfer to the ocean by thermal, radiative and mechanical processes;  the heat budget; oceanic density distribution; oceanic boundary conditions; conservations equation; air-sea interaction; global fluxes and general description of major ocean currents. Credit is not allowed for both MEA 460 and MEA 540", "fall": true, "units": " 3"}, {"summer": false, "name": "Undergraduate Cruise Experience", "prerequisites": "Corequisite: MEA 200 or MEA 220", "spring": true, "number": "MEA  461", "descripton": "Broad exposure to planning and execution of oceanographic research operations, including demonstration of techniques and equipment regularly used aboard ships and familiarization with acquisition and processing of oceanographic data via preparation for and participation in a demonstration cruise under the guidance of NCSU oceanography faculty members.", "fall": true, "units": " 1"}, {"summer": "True", "name": "Observational Methods and Data Analysis in Marine Physics", "prerequisites": "Prerequisite: MEA 460", "spring": "True", "number": "MEA  462", "descripton": "Practical experience in the observational techniques used by physical oceanographers. Basic instrumentation described, emphasizing principles rather than detailed descriptions. Both direct and indirect techniques used to define the three-dimensionalcirculation of the ocean as a function of time.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Fluid Physics", "prerequisites": "Prerequisite: MA 341 and PY 208", "spring": false, "number": ")  463", "descripton": "A derivation of the basic equations governing fluid motion in a rotating coordinate system.  Equations include conservation of mass or the continuity equation, momentum equations, thermodynamic energy equation and the vorticity equation.  Application of equations to simplified oceanic flows which include surface gravity waves, inertial motion, geostrophic motion, Ekman dynamics and vorticity dynamics.", "fall": true, "units": " 3"}, {"summer": false, "name": "Ocean Circulation Systems", "prerequisites": "Prerequisite: MEA 460", "spring": true, "number": "MEA  464", "descripton": "Dynamical processes governing ocean circulation. Driving of ocean currents by the atmosphere, currents on a rotating spherical earth. Mid-ocean gyre, western boundary currents, equatorial current systems, and polar circulation. Currents in coastal regions and shallow-water processes.", "fall": false, "units": " 3"}, {"summer": true, "name": "Geologic Field Camp", "prerequisites": "Prerequisite: MEA 450 and MEA 451", "spring": false, "number": "MEA  465", "descripton": "Introduction to field instruments and techniques used in geological sciences.  Geologic field mapping in areas ranging from undeformed sedimentary rocks to complexly deformed crystalline rocks. May include field techniques specific to engineering geology, geophysics, hydrogeology, and paleontology.  Preparation of maps and reports.  Four-week course taught off-campus, typically out-of-state.  Additional fees required.", "fall": false, "units": " 4"}, {"summer": false, "name": "Marine Meteorology", "prerequisites": "Prerequisite: MEA 422 or MEA 460", "spring": true, "number": "MEA  467", "descripton": "Basic equation and concepts.  Review of ocean and atmospheric circulations.  Ocean mixed layer, air-sea interaction and coastal ocean and meteorological processes, marine boundary layer and cloud processes.", "fall": false, "units": " 3"}, {"summer": false, "name": "Ecology of coastal Resources", "prerequisites": "Prerequisite: MEA 250 and MEA 220 or MEA 449", "spring": true, "number": "MEA  469", "descripton": "Anthropogenic impacts on estuarine and coastal marine ecosystems.  Survey of basic biological, physical, chemical and geological mechanisms underlying habitat-specific functioning, followed by discussion, in-class presentation, and critique of real and hypothetical case studies involving anthropogenic impacts.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Introduction to Geophysics", "prerequisites": "Prerequisite: PY 208 or 212", "spring": "True", "number": "MEA  470", "descripton": "Structure of the earth, a dynamic and evolving entity, as inferred from seismology, gravity, magnetism and heat flow. Geodynamic processes responsible for continental drift; plate tectonic theory; regional geophysics of selected areas.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Exploration and Engineering Geophysics", "prerequisites": "Prerequisite: PY 208 or PY 211", "spring": "True", "number": "MEA  471", "descripton": "Geophysical methods  applied to exploring the earth's shallow sub-surface.  Principles of gravity, magnetic, electrical, and seismic exploration surveys.  Planning, conducting, and interpreting geophysical surveys.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Principles of Chemical Oceanography", "prerequisites": "Prerequisite: CH 201", "spring": false, "number": "MEA  473", "descripton": "Chemical processes controlling the composition of oceans, including discussions of chemical equilibria, biological cycling of nutrients and use of chemical tracers in marine environment; consideration of origin and chemical history of oceans. Creditis not allowed for both MEA 473 and MEA 573", "fall": true, "units": " 3"}, {"summer": false, "name": "Air Quality", "prerequisites": "Prerequisite: CE 373,CE 382; or CHE 311(CHE Majors); or MEA 421 (MEA Majors), Corequisite: ST 370 ; ST 380 (MEA Majors)", "spring": true, "number": ")  479", "descripton": "Introduction to: risk assessment, health effects, and regulation of air pollutants; air pollution statistics; estimation of emissions; air quality meteorology; dispersion modeling for non-reactive pollutants; chemistry and models for tropospheric ozone formation; aqueous-phase chemistry, including the \"acid rain: problem; integrated assessment of air quality problems; and the fundamentals and practical aspects of commonly used air quality models. Credit is allowed only for one of CE/MEA 479 or CE/MEA 579", "fall": false, "units": " 3"}, {"summer": "True", "name": "Geomorphology: Earth's Dynamic Surface", "prerequisites": "Prerequisite: (MEA 100, MEA 101, MEA 120, MEA 140 or MEA 200) and MEA 110", "spring": "True", "number": "MEA  481", "descripton": "Landforms and the processes responsible for their origin. Emphasis on the geologic principles involved in interpreting the origin and evolution of various landforms, and discussion of North American geomorphic process.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Introduction to Hydrogeology", "prerequisites": "Prerequisite: (MEA 101 or MEA 202), (MA 131 or MA 141), CH 201, and (PY 201, PY 205, or PY 211)", "spring": "True", "number": "MEA  485", "descripton": "Basic science of groundwater flow in geological media. Saturated and unsaturated flow, Darcy's equation, heterogeneity and anisotrophy, flownets, storage properties of geological materials, effective stress, equations for steady and unsteady flow, recharge, groundwater exchange with surface water, groundwater flow to pumping wells, estimation of hydraulic properties of aquifers, contaminant plumes and chemical transport in groundwater.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Seminar on Selected Geologic Topics", "prerequisites": "Prerequisite: Senior standing in GYS, GYA, or GPY", "spring": false, "number": "MEA  491", "descripton": "Study and discussion of selected topics from the geological literature.  Preparation of a major library research paper.", "fall": true, "units": " 2"}, {"summer": false, "name": "Senior Seminar in the Atmospheric Sciences", "spring": false, "number": "MEA  492", "descripton": "Emphasis on student professional development. Discussions of professional opportunities, resources and ethics. Atmospheric scientists from the public and private sectors introduce students to career options. Strategies for finding jobs and graduate programs are presented. Students reflect on future career goals and plans. For seniors in the Atmospheric Sciences.", "fall": true, "units": " 1"}, {"summer": false, "name": "Special Topics in MEAS", "spring": true, "number": "MEA  493", "descripton": "Directed individual study or experimental course offering.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Senior Seminar in the Marine, Earth, and Atmospheric Sciences", "spring": false, "number": "MEA  495", "descripton": "Emphasis on student professional development.  Discussions of professional opportunities, resources, and ethics.  Professionals from the public and private sectors introduce students to career options in marine, earth and atmospheric sciences..  Strategies for finding jobs and graduate programs are presented.  Students reflect on future career goals and plans.", "fall": true, "units": " 1"}, {"summer": true, "name": "Internship in MEAS", "spring": true, "number": "MEA  498", "descripton": "Awards academic credit for learning that occurs during internships.  Requires daily journal and written summary report.  Successful completion of the course based on review of summary report by an MEAS faculty, who shall be identified by the studentprior to the internship.  Transportation expenses may be incurred.  MEAS majors only.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Air Pollution Meteorology", "prerequisites": "Prerequisite: MAE 308 or MEA 455 or MEA 700", "spring": true, "number": "MEA  510", "descripton": "Wind structure in atmospheric surface layer and planetary boundary layer; temperature structure and stability; mixed layer and inversions; turbulence intensity and scale; meteorological factors affecting dispersion of pollutants; diffusion theories and models; diffusion and transport experiments; plume rise, fumigation and trapping; removal processes; effects of buildings and hills; effects of local winds.", "fall": false, "units": " 3"}, {"summer": false, "name": "Introduction to Meterological Remote Sensing", "spring": true, "number": "MEA  511", "descripton": "Meteorological remote sensing data sets used in operational forecast and research applications. Sensor physical principles. Emphasis is on understanding the strengths and weaknesses of the different types of observational data so that the student can judge adequacy of purpose for their applications.", "fall": false, "units": " 3"}, {"summer": false, "name": "Satellite Meteorology", "prerequisites": "Prerequisite: MA 241, Corequisite: MEA 443", "spring": true, "number": "MEA  512", "descripton": "Basic background in satellite orbits, coordinate systems and image navigation; description of sensors and techniques for quantitative measurement of atmospheric variables. Applications of satellite data in analysis of weather systems; evolution of convective systems, tropical disturbances and mid-latitude cyclones as revealed by visible and infrared imagery; current research in satellite applications.", "fall": false, "units": " 3"}, {"summer": false, "name": "Radar Meteorology", "prerequisites": "Prerequisite: MEA 412, MEA 422, CSC 112, ST 380", "spring": true, "number": "MEA  513", "descripton": "Principles of radar operations and analysis. Application of radar to observing stormy and clear weather. Conventional weather radar; Doppler, polarimetric and wind profiling radars. Precipitation estimation, hydrometeor identification, air motion analysis using radar. Practical radar imagery interpretation using computer-based learning and case studies. Radar observations and analyses of thunderstorms, mesocylones, tornadoes, fronts, hurricanes, boundary layer phenomena.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Physical Meteorology", "prerequisites": "Prerequisite: MEA 412, MEA 421", "spring": false, "number": "MEA  514", "descripton": "Fundamental laws and concepts of thermodynamics and electromagnetic radiative transfer considered in an atmospheric context. Application of these principles to a number of meteorological problems, including radiative climate models, the global energy balance, atmospheric aerosols, lidar/radar backscatter and remotely sensed temperature fields.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Atmospherice Chemistry", "prerequisites": "Prerequisite: MA 141, CH 201, (PY 205, PY 211 or MEA 320)", "spring": true, "number": "MEA  525", "descripton": "The course covers history, regulations, sources, physics, and chemistry of major air pollutants and factors affecting their transport and fate.  Emphasis is placed on atmospheric chemistry and physics underlaying  five major air pollutant problems including urban outdoor air pollution, indoor air pollution, acid depostion, stratospheric ozone reduction, and global climate change.  Credit will not be allowed for MEA 425 and MEA 525.", "fall": false, "units": " 3"}, {"summer": false, "name": "Principles of Physical Oceanography", "prerequisites": "Prerequisite: MA 231 and PY 212", "spring": true, "number": "MEA  540", "descripton": "Introduction to principles and practice of physical oceanography. The equation of state of seawater; energy transfer to the ocean by thermal, radiative and mechanical processes; the heat budget; oceanic boundary conditions; geographical distributionof oceanic properties; observational methods; conservation equations; simple waves and tides; physical oceanography of North Carolina coastal zone. Application of Fourier analysis techniques to interpretation of low-frequency motions in ocean and atmosphere. Review of Fourier method. Filtering of tidal signals. Spectral estimates and calculation of current ellipses. Identification of coherent motions and their empirical orthogonal modes. Data from field experiments used in lectures and homeworkassignments. Credit is not allowed for both MEA 460 and MEA 540", "fall": false, "units": " 3"}, {"summer": false, "name": "Principles of Biological Oceanography", "prerequisites": "Prerequisite: BIO 181", "spring": false, "number": ")  549", "descripton": "Environmental dependencies, biological productivity, and trophic relationships in plankton, nekton and benthos; Sampling methods and experimental design; Human impacts on marine systems.Credit is not allowed for both MEA 449 and MEA(ZO)549.", "fall": true, "units": " 3"}, {"summer": false, "name": "Marine Physical-Biological Interactions", "prerequisites": "Prerequisite: MEA 460/560 and MEA 449 or MEA(ZO) 549", "spring": true, "number": "MEA  554", "descripton": "Space-time relationships between physics and biology; influence of Reynolds Number on aquatic life style; aspects of physical and biological mathematical modeling; influence of biology on physical phenomena; influence of static physical/chemical properties on biology; influence of dynamic physical phenomena (turbulence, waves and advection) on biology within the water column and its boundary. Credit is not allowed for both MEA 454 and 554", "fall": false, "units": " 3"}, {"summer": false, "name": "Marine Sediment Transport", "prerequisites": "Prerequisite: MEA 101 or MEA 200, MA 241, PY 201 or PY 205", "spring": false, "number": "MEA  562", "descripton": "Quantitative study of sediment transportation in the marine environment including introduction to fluid mechanics and sediment transportation theory. Processes and products of sediment transportation in specific marine environments from estuaries todeep sea and the interpretation of sediment transport processes from sedimentary structures. Credit not allowed for both MEA 411 and MEA 562", "fall": true, "units": " 3"}, {"summer": false, "name": "Geological Oceanography", "spring": false, "number": "MEA  570", "descripton": "A comprehensive overview of the geological aspects of oceanography.  Topics include: a) marine geophysics and the evolution of ocean basins, b) sedimentological processes and the formation of marine deposits, c) marine geochemistry and authigenic sedimentation, d) paleoceanography and the interpretation of marine stratigraphy.", "fall": true, "units": " 3"}, {"summer": false, "name": "Principles of Chemical Oceanography", "prerequisites": "Prerequisite: CH 201", "spring": false, "number": "MEA  573", "descripton": "Chemical processes controlling the composition of oceans, including discussions of chemical equilibria, biological cycling of nutrients and use of chemical tracers in marine environment; consideration of origin and chemical history of oceans. Creditis not allowed for both MEA 473 and MEA 573", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Igneous Petrology", "prerequisites": "Prerequisite: MEA 440", "spring": true, "number": "MEA  574", "descripton": "Physicochemical principles related to igneous petrogenesis. General principles and specific problems including origin, differentiation and emplacement of magmas and the possible relationships of igneous processes to global tectonics.", "fall": false, "units": " 3"}, {"summer": false, "name": "Electron Microprobe Analysis of Geologic Material", "prerequisites": "Prerequisite: MEA 410", "spring": false, "number": "MEA  577", "descripton": "Theory of quantitative analysis of geologic material by electron beam application; laboratory operation of electron microprobe to acquire chemical composition and x-ray images of geologic material.", "fall": true, "units": " 2"}, {"summer": false, "name": "Principles of Air Quality Engineering", "prerequisites": "Prerequisite: CE 373,CE 382; or CHE 311(CHE Majors); or MEA 421(MEA Majors), Corequisite: ST 370; ST 380(MEA Majors)", "spring": true, "number": "MEA  579", "descripton": "Introduction to: risk assessment, health effects, and regulation of air pollutants; air pollution statistics; estimation of emissions; air quality meteorology; dispersion modeling for non-reactive pollutants; chemistry and models for tropospheric ozone formation; aqueous-phase chemistry, including the \"acid rain\" problem; integrated assessment of air quality problems; and the fundamentals and practical aspects of commonly used air quality models. Credit is allowed only for one of CE/MEA 479 or CE/MEA 579", "fall": false, "units": " 3"}, {"summer": false, "name": "Air Quality Modeling and Forecasting", "prerequisites": "Prerequisite: CSC 112, MEA 425/525, CE 479/579", "spring": true, "number": "MEA  580", "descripton": "Topics include numerical solutions to ODEs/PDEs, atmospheric chemistry, cloud and aerosol microphysics, emission modeling, meteorological modeling, and model design, applications, and evaluation. It is targeted for students who would like to learn about air quality modeling and who are prospective air quality model users.", "fall": true, "units": " 4"}, {"summer": false, "name": "Fluid Mechanics in Natural Environments", "prerequisites": "Prerequisite: CE 382 or MEA 463 or permission of instructor", "spring": false, "number": ")  581", "descripton": "Free surface flows of water and air occurring in natural fluid systems and influencing environmental transport and mixing. Review of fundamental principles of fluids, covering the scales relevant to both engineering and geo-physical applications. Topics and examples include waves, instability, stratification, turbulent boundary layers, jets and plumes, and open channel flows. Cannot receive credit for both CE 581 and MEA 581.", "fall": true, "units": " 3"}, {"summer": false, "name": "Geospatial Modeling and Analysis", "spring": true, "number": ")  582", "descripton": "The course explains digital representation and analysis of geospatial phenomena and provides foundations in methods and algorithms  used in GIS analysis and modeling. Special focus is on terrain modeling, geomorphometry, watershed analysis and introductory GIS-based modeling of landscape process (water, sediment). This course includes analysis from lidar data, 3D visualization, and principles of open source GIS. Introductory level knowledge of GIS or surveying/ geomatics principles is required.", "fall": false, "units": " 3"}, {"summer": false, "name": "Physical Hydrogeology", "prerequisites": "Prerequisite: MEA 101, MEA 110, MA 241, and PY 201 or PY 205", "spring": true, "number": "MEA  585", "descripton": "Physical aspects of groundwater flow in geological media.  Saturated and unsaturated flow, Darcy's equation, heterogeneity and anisotropy, storage properties of geological materials, effective stress, governing equations for steady and unsteady flow, recharge, groundwater exchange with surface water, groundwater flow to well,s estimation of hydraulic properties of aquifers.", "fall": false, "units": " 3"}, {"summer": true, "name": "Special Topics in Marine Science", "spring": true, "number": "MEA  591", "descripton": "Opportunity for advanced undergraduate and graduate students to study timely special problem areas in Marine Science and Engineering", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Special Topics in Earth Sciences", "spring": true, "number": "MEA  592", "descripton": "Special topics in earth sciences, provided to groups or to individuals.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Special Topics in Atmospheric Science", "spring": true, "number": "MEA  593", "descripton": "Special topics in atmospheric science, provided to groups or to individuals.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Regional Geology of North America", "prerequisites": "Prerequisite: MEA 101 or MEA 120, Senior standing", "spring": true, "number": "MEA  599", "descripton": "Field study of classic geologic localities and geomorphic processes not indigenous to North Carolina. Typical areas: New England and adjacent Canada, northern Mexico and southwestern United States and Pacific Northwest. Representative subjects include Canadian Shield, Precambrian mineral deposits, San Andreas fault, desert geomorphology, Grand Canyon stratigraphy, modern and ancient reefs and glaciated volcanoes. Mineral, rock and fossil collecting. Required student reports.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Seminar", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "MEA  601", "descripton": "Presentation by each student of one seminar on his/her current research.", "fall": true, "units": " 1"}, {"summer": true, "name": "Special Topics in Marine Sciences", "spring": true, "number": "MEA  611", "descripton": "Special topics in earth sciences, provided to groups or to individuals.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Special Topics in Earth Sciences", "spring": true, "number": "MEA  612", "descripton": "Special topics in atmospheric science, provided to groups or to individuals.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Special Topics Atmospheric Sciences", "spring": true, "number": "MEA  613", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Graduate At-Sea Laboratory", "prerequisites": "Corequisite: 500 level Oceanography Course", "spring": false, "number": "MEA  615", "descripton": "Specialized experience in planning and execution of oceanographic research operations, including practice with techniques and equipment regularly used aboard ships and familiarization with acquistition and processing of oceanographic data via preparations for and participation in a research cruise under the guidance of NCSU faculty members.", "fall": true, "units": " 1"}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "MEA  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "MEA  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "MEA  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": true, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "MEA  690", "descripton": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "MEA  693", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's Student", "spring": true, "number": "MEA  695", "descripton": "Thesis Research", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "MEA  696", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "MEA  699", "descripton": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis. Credits Arranged", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Environmental Fluid Mechanics", "prerequisites": "Prerequisite: MA 241, PY 208", "spring": false, "number": "MEA  700", "descripton": "Basic concepts and laws governing motion of atmosphere and oceans developed from first principles, including approximations valid for environmental flows, kinematics, dynamics and thermodynamics of fluid flows as well as introduction to environmental turbulence. Credit is not allowed for both MEA 463 and MEA 700", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Cloud and Precipitation Physics", "prerequisites": "Prerequisite: MEA 421 or MEA 412", "spring": false, "number": "MEA  702", "descripton": "Analysis of microstructure of warm and cold clouds and precipitation, cloud microphysics-dynamics interactions, formation of cloud droplets, growth of cloud droplets by condensation, initiation of rain in nonfreezing clouds, formation and growth of ice crystals, precipitation theories, planned and inadvertent weather modification, and the problem of acid rain.", "fall": true, "units": " 3"}, {"summer": false, "name": "Atmospheric Aerosols", "prerequisites": "Prerequisite: CH 201 and PY 205 or 211, Corequisite: MEA 412", "spring": true, "number": "MEA  703", "descripton": "An understanding of aerosols as primary air pollutants, indoor versus outdoor pollution, transformation processes, prediction of atmospheric concentrations, scavenging of aerosols, transport of air pollutants on a regional scale, discussion of national experiments to characterize and study impact of urban-industrial pollution, tropospheric aerosol and weather, stratospheric aerosol, effect of aerosols on atmospheric warming and cooling and air-quality models.", "fall": false, "units": " 3"}, {"summer": false, "name": "Dynamic Meteorology", "prerequisites": "Prerequisite: MEA 422", "spring": false, "number": "MEA  705", "descripton": "Brief review of classical and physical hydrodynamics; scale analysis of dynamic equations; atmospheric instabilities; dynamics of tropical convections; perturbation theory and approximations for atmospheric wave motions.", "fall": true, "units": " 3"}, {"summer": false, "name": "Meterology of the Biosphere", "prerequisites": "Prerequisite: PY 205 or 211; CH 201; MA 101 or 111", "spring": false, "number": "MEA  706", "descripton": "For graduate students in the life sciences, presenting physical principles governing the states and processes of atmosphere in contact with earth's surface of land, water and life. Exchanges of heat, mass and momentum analyzed for various conditionsof atmosphere and surface and as function of season, time and geographic location.", "fall": true, "units": " 3"}, {"summer": false, "name": "Planetary Boundary Layer", "prerequisites": "Prerequisite: MEA 455 or MEA 721", "spring": true, "number": "MEA  707", "descripton": "Review of basic equations and concepts of planetary boundary layers. The closure problem and semi-empirical theories of turbulence, buoyancy effects on mean flow and turbulence, instrumentation and observational platforms for PBL experiments, observed characteristics of atmospheric boundary layers, numerical and physical modeling of PBL and its parameterization in large-scale atmospheric circulation models.", "fall": true, "units": " 3"}, {"summer": false, "name": "Atmospheric Turbulence", "prerequisites": "Prerequisite: MAE 550 or MEA 700 or MEA 707", "spring": true, "number": "MEA  708", "descripton": "Statistical description of turbulence, including probability, correlation and spectrum functions. Statistical theory of homogeneous turbulence, spectral dynamics and Kolmogorov's local similarity hypotheses. Effects of shear, thermal stratification and earth's rotation. Observed structure and scales of turbulence in PBL and free atmosphere. Higher-order closure models and large eddy simulations of atmospheric turbulence.", "fall": false, "units": " 3"}, {"summer": false, "name": "Atmospheric Dispersion", "prerequisites": "Prerequisite: MAE 550 or MEA 700 or MEA 510", "spring": false, "number": "MEA  710", "descripton": "Lagrangian vs. Eulerian descriptions of turbulence and diffusion. Statistical theories of absolute and relative diffusion from continuous and instantaneous releases. Effects of shear, thermal stratification and earth's rotation on atmospheric dispersion. Lagrangian similarity theories of diffusion in the surface layer and mixed layer. Random walk, Monte Carlo and large eddy simulations of atmospheric dispersion. Urban and regional dispersion models.", "fall": true, "units": " 3"}, {"summer": false, "name": "Mesoscale Modeling", "prerequisites": "Prerequisite: MEA 705", "spring": false, "number": "MEA  712", "descripton": "Modeling mesoscale weather phenomena including midlatitude cyclones, mesoscale convective complexes and squall lines. Application of finite difference, spectral and implicit methods and coordinate transforms to these problems. Utilization of explicit representations of moist processes. Development of parameterizations of convective clouds, planetary boundary layer and moist processes.", "fall": true, "units": " 3"}, {"summer": false, "name": "Mesoscale Dynamics", "prerequisites": "Prerequisite: MEA 700 and MEA 705", "spring": false, "number": "MEA  713", "descripton": "Inertia-gravity waves. Mechanical and thermally forced waves. Generation, circulation and maintenance of mesoscale convective storms and systems. Symmetric instability. Wave-CISK, quasi-geostrophic and semi-geostrophic fronts and fronto-genesis. Meso-B/Y frontogenesis. Lee and coastal cyclogenesis.", "fall": true, "units": " 3"}, {"summer": false, "name": "Atmospheric Convection", "prerequisites": "Prerequisite: MEA 412, MEA 700, MEA 705", "spring": false, "number": "MEA  714", "descripton": "Structure, physics and dynamics of convective clouds and cloud systems; fundamental equations for modeling convection; microphysical parameterization schemes; influence of instabilities on convective cloud systems; severe thunderstorms dynamics; tornadogenesis theories; mesoscale convective systems; upscale feedback effects of convection; cumulus parameterization schemes.", "fall": true, "units": " 3"}, {"summer": false, "name": "Dynamics of Mesoscale Precipitation System", "prerequisites": "Prerequisite: MEA 444", "spring": false, "number": "MEA  715", "descripton": "Frontogenesis theory; inertial and conditional symmetric instability; mesoscale gravity waves and wave-CISK; conveyor belts; seeder-feeder processes and precipitation generating cells; classification and dynamics of precipitation band types.", "fall": true, "units": " 3"}, {"summer": false, "name": "Numerical Weather Prediction", "prerequisites": "Prerequisite: MEA 705, CSC (MA) 427 and some FORTRAN programming experience", "spring": true, "number": "MEA  716", "descripton": "Physical and mathematical basis of numerical weather prediction with computer experiments to demonstrate principles and techniques. Derivation of sets of prediction equations consistent with scale analysis and dynamical constraints; atmospheric waves and filtered equations; numerical methods and computational instabilities; filtered and primitive equation models; NWS operational models.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Weather Analysis", "prerequisites": "Prerequisite: MEA 444, MEA 705", "spring": false, "number": "MEA  717", "descripton": "Evolution of physical and dynamic structure of synoptic and sesoscale storm systems occurring in middle and high latitudes. Recent advances in understanding these storm systems through intensive field experiments and computer modeling. Introduction to contemporary analysis techniques through laboratory exercises shedding light on storm structure, dynamics and scale interaction.", "fall": true, "units": " 3"}, {"summer": false, "name": "Climate Modeling", "prerequisites": "Prerequisite: MEA 705", "spring": false, "number": "MEA  719", "descripton": "Climate system. Fundamental equations and time scales. Atmosphere, ocean, biosphere, cryosphere, lithosphere and hydrosphere subsystems. Computational numerical methods. Physical processes; atmosphere-ocean coupling, role of radiation, clouds and land surface processes. Climate anomalies due to changes in atmospheric composition, boundary conditions and extra-terrestrial forcing. Model validation, climate change detection, past climates and future climate scenarios.", "fall": true, "units": " 3"}, {"summer": false, "name": "Coastal Meteorology", "prerequisites": "Prerequisite: MEA 455", "spring": false, "number": "MEA  720", "descripton": "Importance and complexity of coastal meteorological processes; modification induced by surface inhomogeneities; development of internal boundary layers; thermally induced internal boundary layers; coastal fumigation processes; structure and development of sea and land breezes; analytical and numerical modeling of sea breezes; coastal fronts; storm surges; prediction models for storm surges; cold air outbreaks; baroclinic boundary layer processes near coastal areas.", "fall": false, "units": " 3"}, {"summer": false, "name": "Air-Sea Interaction", "prerequisites": "Prerequisite: MEA 422 or MEA 560", "spring": true, "number": "MEA  721", "descripton": "Review of basic equations and concepts of turbulent transfer in geophysical flows, air-sea interaction processes and their importance to man's activities, theory and observation of wind-generated ocean surface waves, turbulent transfers in planetaryboundary layer of marine atmosphere, oceanic mixed layer, development of thermocline and inversion.", "fall": false, "units": " 3"}, {"summer": false, "name": "Geophysical Fluid Mechanics", "prerequisites": "Prerequisite: MAE 701", "spring": false, "number": ")  725", "descripton": "The principles of fluid mechanics applied to geophysical systems.  Special emphasis placed on those features of these systems, such as almost rigid rotation and stable stratification, which produce unique and important effects.  The effects of almost rigid rotations on homogeneous and stratified flows examined in detail.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Geophysical Fluid Mechanics", "prerequisites": "Prerequisite: MAE 725", "spring": true, "number": ")  726", "descripton": "Principles of fluid mechanics applied to geophysical systems.  Special emphasis on role of stable stratification on the flows in these systems.  Detailed study of generation, interaction, propagation and dissipation of internal gravity waves.  Studyof other geophysically important flows.", "fall": false, "units": " 3"}, {"summer": false, "name": "Fourier Analysis of Geophysical Data", "prerequisites": "Prerequisite: MA 341 and ST 511", "spring": true, "number": "MEA  735", "descripton": "Application of Fourier analysis to interpretation of low-frequency motions in ocean and atmosphere.  Review of Fourier method.  Filtering of tidal signals.  Spectral estimates and calculation of current ellipses.  Identification of coherent motions and their empirical orthogonal modes.  Data from field experiments used in lectures and homework assignments.", "fall": false, "units": " 3"}, {"summer": false, "name": "Synpotic Physical Oceanography", "prerequisites": "Prerequisite: MEA 560", "spring": true, "number": "MEA  741", "descripton": "Basic discussion of the techniques and terminology of synoptic physical oceanography; focus on water characteristics and their relationship to currents in the individual oceans; a systematic quantitative description of the character of ocean waters and their movements.", "fall": false, "units": " 3"}, {"summer": false, "name": "Ocean Circulation", "prerequisites": "Prerequisite: MEA 700 or PY 411", "spring": false, "number": "MEA  743", "descripton": "Basic study of mechanics of ocean circulation with emphasis on various simple models of circulation systems.", "fall": true, "units": " 3"}, {"summer": false, "name": "Dynamics of Shelf Circulation", "prerequisites": "Prerequisite: MEA 700", "spring": false, "number": "MEA  744", "descripton": "Description and models of dynamic processes on the shelf, including seiches and tides in gulfs, propagation of tides and storm surges, wind-induced coastal upwelling, continental shelf waves and coastally trapped waves. Steady circulation driven by winds, river plumes and density forcing, formation of shelf-break fronts; and influence from deep-ocean currents.", "fall": true, "units": " 3"}, {"summer": false, "name": "Marine Benthic Ecology", "prerequisites": "Prerequisite: ZO 402, ZO 509 or ZO 760 or MEA(ZO) 550", "spring": true, "number": ")  750", "descripton": "Marine benthic systems in deep sea and in shallow waters, focusing upon abiotic and biotic processes regulating density, diversity and taxonomic and functional composition. Discussions of benthic-pelagic coupling, predation, interspecific competition, biogeography, sampling problems, evolutionary trends, trophic structure and community organization.", "fall": true, "units": " 3"}, {"summer": false, "name": "Marine Plankton Ecology", "prerequisites": "Prerequisite: BCH 451 and MA 121 and ZO 419", "spring": false, "number": "MEA  752", "descripton": "Examination of worldwide relationships between physical-chemical environment and planktonic organisms.  Organism descriptions; effects of light, temperature, salinity, density, water motion and chemical constituents on organisms; interactions among different organisms emphasizing competition and predation; community structure, distribution and succession; and mathematics models of distribution, production and interaction.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advances In Marine Community Ecology", "prerequisites": "Prerequisite: ZO 402 or ZO 760 or MEA(ZO) 750", "spring": true, "number": "MEA  754", "descripton": "Current research and biological and physical processes structuring shallow and deep water benthic communities. Recent research on competition, predation, disturbance, succession, animal-sediment-flow interactions, life history tactics and experimental design in marine benthic biology. Student discussion of current issues and critique of recent papers.", "fall": false, "units": " 3"}, {"summer": false, "name": "Organic Geochemistry", "spring": false, "number": "MEA  759", "descripton": "Sources and fates of organic material in the geochemical environment.  Microbial transformations of organic compounds.  The use of biomarkers to study depositional environments.  Petroleum, natural gas and coal formation.  Extraterrestrial organic geochemistry.", "fall": true, "units": " 3"}, {"summer": false, "name": "Biogeochemistry", "spring": false, "number": "MEA  760", "descripton": "Processes involved in the biogeochemical cycling of C, N, S and related biogenic elements.  Stable isotopic and other geochemical signatures of biological processes.  Introduction to modeling chemical distributions in sediments.  The impact of biogeochemical processes on atmospheric chemistry.", "fall": true, "units": " 3"}, {"summer": false, "name": "Marine Geochemistry", "prerequisites": "Prerequisite: CH 331, MEA 560", "spring": true, "number": "MEA  762", "descripton": "Detailed examination of chemical processes occurring in marine environment.  Chemical evolution of the oceans, continental and submarine weathering, particle scavenging of reactive elements from water, column, formation of biogenic and metaliiferousdeposits, sediment diagenesis and marine geochronology.", "fall": false, "units": " 3"}, {"summer": false, "name": "Geochemistry", "prerequisites": "Prerequisite: CH 331 or 431", "spring": false, "number": "MEA  763", "descripton": "Quantitative distribution of elements in earth's crust, hydrosphere and atmosphere. Application of laws of chemical equilibrium and resultant chemical reactions to natural earth systems. Geochemical application of Eh-pH diagrams. Geochemical cycles.Isotope geochemistry.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Air Quality", "prerequisites": "Prerequisite: CH 201 and MEA(CE) 479", "spring": true, "number": "MEA  779", "descripton": "Local, regional and global scale chemical interactions, transport and behavior of trace gases (sulfur carbon, nitrogen, hydrocarbon, and photo-chemical oxidants) in the atmosphere.  covers three primary elements of air quality: anthropogenic and natural emissions of trace gases; interactions of the pollutants in the atmosphere; and monitoring and sampling of gaseous and particulate pollutants.", "fall": false, "units": " 3"}, {"summer": false, "name": "Chemical Hydrogeology", "prerequisites": "Prerequisite: CH 201, and MEA 585 or CE 584", "spring": true, "number": "MEA  785", "descripton": "Quantitative analysis of hydrological, geological, and geochemical factors controlling the transport and fate of organic and inorganic chemicals in groundwater.  Acid-base, precipitation-dissolution, weathering, redox, complexation, sorption, and gas exchange reactions.  Advection, diffusion, and dispersion in porous media, analytical solutions to the advection-dispersion equation.  Non-aqueous-phase (organic) liquids.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Structural Geology", "prerequisites": "Prerequisite: MEA 451", "spring": false, "number": "MEA  788", "descripton": "Principles of rock mechanics and their application in solving geologic problems; finite strain analysis of deformed rocks; advanced techniques of structural analysis; petrofabrics; development of various geologic structures. Emphasis upon application of principles and techniques in the field.", "fall": true, "units": " 3"}, {"summer": false, "name": "Topics In Appalachian Geology", "prerequisites": "Prerequisite: MEA 440, 450 and 451", "spring": false, "number": "MEA  789", "descripton": "Examination of geology of areas within Appalachian orogenic belt. Lectures, discussions, reading and review of current literature and consideration of ideas concerning geological evolution of region. Required field trips.", "fall": true, "units": " 3"}, {"summer": false, "name": "Geotectonics", "prerequisites": "Prerequisite: MEA 440, 450, 451", "spring": false, "number": "MEA  790", "descripton": "In-depth examination of current ideas in plate tectonic theory. Plate tectonic controls on orogeny, orogenic belts, magmatism and metallogeny.", "fall": true, "units": " 3"}, {"summer": true, "name": "Advanced Special Topics in Marine Science", "spring": true, "number": "MEA  791", "descripton": "Opportunity for advanced undergraduate and graduate students to study timely special problem areas in Marine Science and Engineering", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Advanced Special Topics in Earth Sciences", "spring": true, "number": "MEA  792", "descripton": "Special topics in earth sciences, provided to groups or to individuals.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Advanced Special Topics in Atmospheric Science", "spring": true, "number": "MEA  793", "descripton": "Special topics in atmospheric science, provided to groups or to individuals.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Regional Tectonics", "prerequisites": "Prerequisite: MEA 440, 450, 451", "spring": true, "number": "MEA  794", "descripton": "Methods of study of tectonic history of major geologic regions in North America and other areas of world through the application of stratigraphy, petrology and structural geology. Synthesizing regional tectonic patterns and events.", "fall": false, "units": " 3"}, {"summer": false, "name": "Exploration And Engineering Geophysics", "prerequisites": "Prerequisite: MEA 470 or PY 208", "spring": true, "number": "MEA  796", "descripton": "Geophysical methods as applies to exploring the earth's mineral and energy resources and to investigating subsurface geological structure and physical properties.  Principles, measurements, analyses, and interpretations of gravity, magnetic, electric, electromagnetic, seismic methods.  Required research paper.", "fall": false, "units": " 3"}, {"summer": false, "name": "Seminar", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "MEA  801", "descripton": "Presentation by each student of one seminar on his/her current research.", "fall": true, "units": " 1"}, {"summer": true, "name": "Special Topics", "spring": true, "number": "MEA  810", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Special Topics in Marine Sciences", "spring": true, "number": "MEA  811", "descripton": "Special topics in earth sciences, provided to groups or to individuals.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Special Topics in Earth Sciences", "spring": true, "number": "MEA  812", "descripton": "Special topics in atmospheric science, provided to groups or to individuals.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Special Topics in Atmospheric Sciences", "spring": true, "number": "MEA  813", "descripton": "Special topics in earth sciences, provided to groups or to individuals.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "MEA  885", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planing for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "MEA  893", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Dissertation Research", "spring": true, "number": "MEA  895", "descripton": "Dissertation Research", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "MEA  896", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "MEA  899", "descripton": "For students who have completed all credit hour requirements, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations.", "fall": true, "units": " 1-3"}]