[{"summer": false, "name": "Introduction to Business Processes", "spring": true, "number": "MIE  201", "descripton": "Cross-functional treatment of major activities of business, such as product design, distribution, production, and marketing.  Description of specific tasks, via lectures and case studies, in support of major business activities.  Interactions among various functional areas of business.", "fall": true, "units": " 3"}, {"summer": false, "name": "Business Career Planning", "prerequisites": "Prerequisite: Successful completion of the Software Skills Test", "spring": false, "number": "MIE  300", "descripton": "Integration of work values, career interests, and skills and corporate environments and career fields related to business management.  Development of proactive plans and skills to enhance marketability for placement into professional career paths inbusiness.  Minimal fee assessed to cover cost of career tests administered during course.", "fall": true, "units": " 1"}, {"summer": "True", "name": "Legal and Regulatory Environment", "prerequisites": "Prerequisite: Successful completion of the Software Skills Test", "spring": "True", "number": "MIE  305", "descripton": "Introduction to contract, tort and agency law, the judicial system, common law, statutory law, and constitutional law.  Review and discussion of the major legal and regulatory issues affecting business including ethics, fiduciary duty, white collar crime, dispute resolution, intellectual property, international, and product safety laws.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Managing Ethics in Organizations", "prerequisites": "Prerequisite: MIE 201 or BUS 201", "spring": true, "number": "MIE  306", "descripton": "Management practices to define, communicate, and implement ethical conduct in business organizations. Normative and applied analysis of current ethical dilemmas of corporations in free markets, techniques for effective management of corporate social responsibility, and formulation and implementation of ethics management programs. College of Management majors only.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Entrepreneurship", "prerequisites": "Prerequisite: MIE 201 or BUS 201", "spring": true, "number": "MIE  310", "descripton": "Introduction to planning, formation, and management of entrepreneurial ventures. Fundamental business concepts and managerial skills applied to entrepreneurial ventures. Course projects support experiential learning of critical skills. Some individual off-campus travel is required.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Human Resource Management", "prerequisites": "Prerequisite:MIE 201, Sophomore standing; and Successful completion of the Software Skills Test", "spring": "True", "number": "MIE  330", "descripton": "The systematic principles for managing the human resource component of organizations.  Topics include: environmental influences on planning, recruitment, and selection; managing workforce diversity; developing effectiveness and enhancing productivity; compensation, benefits, and security; and strengthening employee-management relations.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Organizational Behavior", "prerequisites": "Prerequisite: 9 hrs. of social science or 6 hours of social science plus MIE 201; and Prerequisite: Successful completion of the Software Skills Test", "spring": true, "number": "MIE  335", "descripton": "Survey of contemporary managerial applications for managing people in modern organizations.  Topics include: motivation, group dynamics, team development, ethics, communications, organizational politics, leadership, power, organizational development, organizational design and structure.  Current managerial issues include total quality management and technology management.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Business Opportunity Analysis", "prerequisites": "Prerequisite: MIE 310", "spring": "True", "number": "MIE  410", "descripton": "Issues and management processes related to the identification of new business opportunities with emphasis on commercializing new technologies.  Students will analyze and develop individual plans for commercialization of a new technology or other innovation.  New venture formation is the primary focus, but the processes and skills students develop are relevant to new product introductions by existing firms.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Managing the Growth Venture", "prerequisites": "Prerequisite: MIE 310", "spring": "True", "number": "MIE  411", "descripton": "Managing a growth venture with emphasis on entrepreneurial planning in the dynamic context of rapidly growing ventures and the development of managerial skills necessary for successful leadership in high growth ventures.   Fundamental concepts, issues and skills are taught through an integrated combination of readings, lectures, discussions, cases analyses, and applied project with a local venture.  Students need to provide their own transportation to off-campus sites.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Finance and Accounting for Entrepreneurs", "prerequisites": "Prerequisite: MIE 310", "spring": true, "number": "MIE  412", "descripton": "Financial planning for new ventures including financial reporting conventions and projection of critical financial amounts for new ventures. Introduction to fundamental accounting and finance concepts applied in the context of entrepreneurial ventures. Topics include projection of revenues, expenses, capital expenditures, cash flows, and balance sheet amounts; and the creation of pro-forma financial statements. Individual student projects integrate financial projections and pro-forma financial statements with the preparation of a complete business plan. Some individual off-campus travel is required.", "fall": false, "units": " 3"}, {"summer": false, "name": "New Venture Planning", "prerequisites": "Prerequisite: MIE 410", "spring": true, "number": "MIE  413", "descripton": "Developing the business plan for a new venture and the entrepreneurial process of executing the first phases of new venture creation. Topics include idea conception, entrepreneurship, business planning, market research, entrepreneurial opportunitiesand strategies. Emphasis is placed on high growth business opportunities. The final deliverable is a complete business plan for a high growth venture and formal presentation of the plan to mock investors. Some individual off-campus travel is required.", "fall": false, "units": " 3"}, {"summer": "True", "name": "The Legal Dynamics of Entrepreneurship", "prerequisites": "Prerequisite: MIE 310", "spring": "True", "number": "MIE  416", "descripton": "Overview of important legal and regulatory issues facing entrepreneurs and start-up entities including legal structure of the organization, intellectual property protection, human resource requirements, product liability, and risk management.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Social Entrepreneurship Practicum", "prerequisites": "Corequisite: MIE 413", "spring": "True", "number": "MIE  418", "descripton": "Application of entrepreneurship skills and knowledge to plan a social entrepreneurial venture envisioned by the student.  This course is a capstone course for the Minor in Entrepreneurship and the Concentration in Entrepreneurship.  The deliverablesinclude an evaluation of the venture and a formal presentation including a summary of work completed and the implications of the work for each student's project.  Students need to provide their own transportation to off-campus sites.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Entrepreneurship Practicum", "prerequisites": "Corequisite: MIE 413", "spring": true, "number": "MIE  419", "descripton": "Application of entrepreneurship skills and knowledge to plan an entrepreneurial venture envisioned by the student. This course is the capstone course for the Minor in Entrepreneurship. The final deliverable includes an evaluation of the project and a formal presentation that includes a summary of the work completed and the implications of that work each student's project. Some individual off-campus travel is required.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Compensation: Pay Systems", "prerequisites": "Prerequisite: MIE 330", "spring": "True", "number": "MIE  431", "descripton": "Direct compensation philosophy, strategy, and policy.  Merit pay, individual, and group incentive plans.  Legal, regulatory, economic, and strategic issues affecting direct compensation.  Strategies for developing an internally consistent and marketcompetitive pay structure to enhance organizational performance.  Pay for international and contingent workers.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Industrial Relations", "prerequisites": "Prerequisite: EC 201 (or ARE 201 or EC 205) and MIE 330", "spring": true, "number": "MIE  432", "descripton": "The role of collective  bargaining in the labor market. Determinants of the pattern of union membership today  and its growth rate. The objectives and tactics of both labor and management within public  policy guidelines. Analysis of the impact of unions on job security, productivity, and  compensation.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Compensation: Benefits", "prerequisites": "Prerequisite: MIE 330", "spring": "True", "number": "MIE  433", "descripton": "Legally mandated benefits including Social Security, Medicare, Workers' Compensation, and Unemployment Insurance.  Discretionary benefits including pensions, health insurance, paid time off, and flexible benefits.  Employer benefit policies and their role in total compensation.  Attracting, retaining, motivation, and retiring workers.  Differences in benefits across industries, occupations, and company size. International variation in the use of employee benefits.     \t", "fall": "True", "units": " 3"}, {"summer": false, "name": "Compensation Systems", "prerequisites": "Prerequisite: MIE 330", "spring": true, "number": "MIE  434", "descripton": "Compensation philosophy, strategy, and policy.  Earnings, individual and group incentive plans, voluntary and mandated benefits.  Legal, regulatory, economic, and strategic issues affecting compensation and benefits.  Strategies for developing the structure and level of compensation to enhance organizational performance.", "fall": true, "units": " 3"}, {"summer": false, "name": "Leadership and Management", "prerequisites": "Prerequisite: MIE 330", "spring": true, "number": ")  435", "descripton": "Development of leadership and management skills for organizational settings.  Self-awareness: interpersonal needs, attitudes toward change; cognitive styles, ethics and values; listening; communicating; interviewing; time and stress management; creativity and managing creativity.  Team building and group dynamics.  Leadership and followership: theory and case studies (Churchill, Antigone; Henry V; Machiavelli); the use of power and authority; women and leadership the use of language in leadership embodiment of leadership traits; effective traits and characteristics of great leaders.", "fall": true, "units": " 3"}, {"summer": false, "name": "Training, Development and Performance Management", "prerequisites": "Prerequisite: MIE 330", "spring": true, "number": "MIE  436", "descripton": "Training, development and performance management functions in organizations. Needs assessment, legal issues, training program design, learning, training methods, transfer of training, effectiveness and utility of training programs, executive development, criteria development for performance appraisal, validation, instrumentation, sources, accuracy, and feedback.", "fall": true, "units": " 3"}, {"summer": false, "name": "Staffing", "prerequisites": "Prerequisite: MIE 330", "spring": true, "number": "MIE  438", "descripton": "Staffing of contemporary organizations including strategic and environmental influences on: HR planning, job analysis, measurement, recruitment, assessment and selection, decision making, employment, and termination.  Considerable emphasis on employment and labor recruitment, assessment and selection, decision making, employment, and termination.  Considerable emphasis on employment and labor legislation.", "fall": true, "units": " 3"}, {"summer": false, "name": "Business Policy and Strategy", "prerequisites": "Prerequisite: BUS/MIE 305, BUS 320, BUS 360, BUS 370, MIE 330, and (BUS/ST 350 or ST 302 or ST 361 or ST 370 or ST 372)", "spring": true, "number": "MIE  480", "descripton": "Comprehensive analysis of administrative policy-making from the point of view of the general manager.  Integration of perspectives from marketing, finance, and other functional areas of management.  Use of case analyses and written reports to develop decision making skills.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Special Topics in MIE", "spring": "True", "number": "MIE  495", "descripton": "Presentation of material normally not available in regular course offerings, or offering of new courses on a trial basis.", "fall": "True", "units": " 1-6"}, {"summer": "True", "name": "Independent Study in MIE", "spring": "True", "number": "MIE  498", "descripton": "Detailed investigation of topics of particular interest to advanced undergraduates under faculty direction on a tutorial basis.  Credits and content determined by faculty member in consultation with Department Head.", "fall": "True", "units": " 1-6"}]