[{"summer": false, "name": "Introduction to Leadership and Values I", "prerequisites": "Prerequisite: Freshman standing or Sophomore standing", "spring": false, "number": "MS  101", "descripton": "This course introduces students to fundamental components of service as an officer in the United State Army.  Initial lessons form building blocks of progressive lessons in values, fitness, leadership and officership.  Classroom instruction includes\"life skills\" including physical and mental fitness, communication theory, and interpersonal relationships.  Upon completion, students will be prepared to receive more complex leadership instruction.", "fall": true, "units": " 1"}, {"summer": false, "name": "Basic Military Leadership", "spring": true, "number": "MS  102", "descripton": "Familiarizes students with the fundamentals of map reading, land navigation techniques, small unit tactics and leadership, personal goal setting, Army Leadership and values, ethical decision making as well as Army basics.", "fall": true, "units": " 1"}, {"summer": false, "name": "Intermediate Leadership Theory I", "spring": false, "number": "MS  201", "descripton": "Instruction is orientated on communication and leadership theory using practical exercise to apply communications and leadership concepts.  Critical \"life skills\" and their relevance to success in the Army are stressed.  Upon completion of this course, students will understand fundamental principles of leadership, and be prepared to intensity practical application in subsequent coursework.", "fall": true, "units": " 2"}, {"summer": false, "name": "Intermediate Leadership Theory II", "prerequisites": "Prerequisite: MS 101", "spring": true, "number": "MS  202", "descripton": "This course focuses on the purpose, roles, and obligations of commissioned officers.  Coursework will include origins of Army institutional values and practical application in decision making and leadership.  Upon completion of this course, studentswill possess and understanding of leadership and officership, demonstrate the ability to apply these skills, and be prepared for the Advanced Military Science Program.", "fall": false, "units": " 2"}, {"summer": "True", "name": "Special Topics in Military Leadership", "spring": "True", "number": "MS  295", "descripton": "Intensive supervised study in applied military leadership and management in an organization or historically applied scenario.  Departmental approval required.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Military Leadership and Training Management", "prerequisites": "Prerequisite: ROTC advanced course cadet", "spring": false, "number": "MS  301", "descripton": "Organizational leadership and processes in the Army; leadership activities and key management functions. Management and conduct of group training activities.", "fall": true, "units": " 3"}, {"summer": false, "name": "Intermediate Small Unit Tactics", "prerequisites": "Prerequisite: ROTC advanced course cadets", "spring": true, "number": "MS  302", "descripton": "Planning, organizing and executing military operations at the squad and platoon level. Focus on the leader's actions, map reading, and navigation.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Military Science - Leadership and Systems Management", "prerequisites": "Prerequisite: MS 301, MS 302", "spring": false, "number": "MS  401", "descripton": "A course designed to familiarize the student with the fundamentals of staff operations and procedures, military correspondence, and the U.S. Army training management system.  Also included are the Officer Personnel Management and Officer Evaluation Report systems (OPMS/OER), the Army logistics system, mobilization and deployment, and intelligence/electronic warfare.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Military Science - Military Justice, Ethics and Professionalism", "prerequisites": "Prerequisite: MS 401", "spring": true, "number": "MS  402", "descripton": "The role of military justice, the Uniform Code of Military Justice (UCMJ) and the procedures for accomplishing certain legal actions.  Ethics and professionalism of the officer corps.  Also included are counseling techniques and continued preparation for the transition from cadet to commissioned officer.  Emphasis on student interaction and small group exercise practical application.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Special Topics in Military Science", "spring": "True", "number": "MS  495", "descripton": "Individualized readings/research of Company Command level issues and implementation of the Uniform Code of Military Justice, DOD Policies, and additional duties required of company grade officers.  Departmental approval required-advanced course students only.", "fall": "True", "units": " 3"}]