[{"summer": true, "name": "Mechanical Properties of Structural Materials", "prerequisites": "Prerequisite: CH 101", "spring": true, "number": "MSE  200", "descripton": "An introduction to the atomic and grain structure of structural materials emphasizing the mechanical properties. Effects of mechanical and heat treatments on structure and properties. Fatigue and creep of materials, fracture toughness, mechanical and non-destructive evaluation, effects of environment. Design considerations, characteristics of metals, ceramics, polymers and composites. Not for Materials majors", "fall": true, "units": " 3"}, {"summer": true, "name": "Structure and Properties of Engineering Materials", "prerequisites": "Prerequisite: CH 101", "spring": true, "number": "MSE  201", "descripton": "Introduction to the fundamental physical principles governing the structure and constitution of metallic and nonmetallic materials and the relationships among these principles and the mechanical, physical and chemical properties of engineering materials.", "fall": true, "units": " 3"}, {"summer": false, "name": "Experimental Methods for Structural Analysis of Materials", "prerequisites": "Corequisite: MSE 201", "spring": true, "number": "MSE  255", "descripton": "Principles and application of basic techniques for characterizing the structure of materials at different length scales.  Optical microscopy, electron microscopy, scanning probe microscopy, X-ray diffraction and spectroscopic methods applied to metals, ceramics, polymers and semiconducting materials.", "fall": false, "units": " 2"}, {"summer": false, "name": "Mathematical Methods for Materials Engineers", "prerequisites": "Prerequisite: E 115, MA 141", "spring": true, "number": "MSE  260", "descripton": "Use of Excel spreadsheets to illustrate principles and application of mathematical and simulation methods that are central to materials science and engineering.  Data plotting, curve fitting, Taylor series, Fourier transforms, numerical integration and differentiation, finite element analysis, numerical solution of differential equations, atomistic and molecular modeling using Monte Carlo and other methods.", "fall": false, "units": " 3"}, {"summer": false, "name": "Materials Science and Engineering Seminar", "prerequisites": "Corequisite: MSE 201", "spring": true, "number": "MSE  270", "descripton": "This course surveys the field of materials science and engineering and introduces students to contemporary issues.  Job and career opportunities at the BS and graduate degree levels are presented.  Students are introduced to opportunities for laboratory assistant jobs in the MSE department, summer internships, co-ops and summer research experiences at NCSU and other institutions.  Students will learn to prepare effective resumes, technical reports and oral presentations.", "fall": false, "units": " 1"}, {"summer": false, "name": "Structure of Materials at the Nanoscale", "prerequisites": "Prerequisite: C- or better in MSE 201", "spring": false, "number": "MSE  300", "descripton": "This course covers the structure of materials at the nanometer scale.  Structure includes the periodic arrangements of atoms and ions in crystalline solids, the amorphous networks of atoms, ions, and molecules in glassy materials, and the molecular structure of polymeric and biological materials.  The typical means of characterizing nanostructure are also reviewed.  Finally, the course will introduce the structure of novel nanomaterials like nanotubes, buckyballs and self assembled monolayers.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Thermodynamics of Materials", "prerequisites": "Prerequisite: MSE 201 or MSE 203; MSE majors must have a C- or better in MSE 201", "spring": false, "number": "MSE  301", "descripton": "Review of classical thermodynamics and thermodynamic relationships.  Use of statistical methods of describe entropy and other thermodynamic properties.  Description of vapor-, liquid-, and solid-phase equilibrium in unary and other multicomponent material systems.  Treatment of ideal and nonideal solution behavior in inorganic alloys and organic polymers. Application of gas-phase reaction kinetics and identification of the criteria required for reaction equilbria.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Defects in Solids", "prerequisites": "Prerequisite: C- or better in MSE 201", "spring": false, "number": "MSE  320", "descripton": "Classification of defects as point, line, surface or volume types. Geometrical and crystallographic aspects of defects. Defects in metallic, ionic and covalently bonded crystal structures. Physical, chemical, electronic and magnetic aspects of defects. Field quantities and forces associated with defects. Novel defects in nanostructured materials and semicrystalline materials.", "fall": true, "units": " 3"}, {"summer": false, "name": "Experimental Methods for Analysis of Material Properties", "prerequisites": "Prerequisite: C- or better in MSE 201", "spring": false, "number": "MSE  335", "descripton": "Principles and application of basic techniques for characterizing the properties of materials. Mechanical, thermal, electrical, optical and magnetic property measurements applied to metals, ceramics, polymers and semiconducting materials.", "fall": true, "units": " 2"}, {"summer": "True", "name": "Mechanics of Materials", "prerequisites": "Prerequisite: MA 341", "spring": "True", "number": "MSE  350", "descripton": "Covers fundamental topics in stress analysis and mechanics of materials including statics and structures, elasticity, plasticity, fracture, fatigue,  testing methods, and engineering applications.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Electrical, Magnetic and Optical Properties of Materials", "prerequisites": "Prerequisite: PY 208 and MA 341", "spring": true, "number": "MSE  355", "descripton": "Fundamental treatment of the electronic properties of materials, including the electrical, magnetic and optical characteristics. The role of electrons, band structure, and Bruillouin zones on the various classes of materials is discussed from the semiclassical and quantum mechanical viewpoints. Applications of these principles to specific technological devices is also covered.", "fall": false, "units": " 3"}, {"summer": false, "name": "Kinetic Processes in Materials", "prerequisites": "Prerequisite: MA 341 and MSE 301", "spring": true, "number": "MSE  360", "descripton": "Types, mechanisms, and kinetics of solid state phase transformations are covered with selected applications to all classes of materials.  Mechanisms of diffusion and techniques for diffusion calculations are presented. The role of surface energy and strain in the evolution of structure during transformation is presented. Phenomena at different size scales (atomic, nano, micro) are described relative to the evolution of structure during transformation.", "fall": false, "units": " 3"}, {"summer": false, "name": "Microstructure of Inorganic Materials", "prerequisites": "Prerequisites: MSE 300, MSE 301, and MSE 320", "spring": true, "number": "MSE  370", "descripton": "Structure-property relationships in metallic and ceramic materials. Crystal structures of important metallic and ceramic elements, alloys, and compounds. Binary and ternary phase diagrams for notable systems will be presented. Microstructural features to be covered include grain size and distribution, multiphase microstructures, and defects. Examples of important metallic and ceramic systems for structural, electrical, optical and magnetic applications will be given.", "fall": false, "units": " 3"}, {"summer": false, "name": "Microstructure of Organic Materials", "prerequisites": "Prerequisite: CH 220 and MSE 300", "spring": true, "number": "MSE  380", "descripton": "Covers microstructure and properties of soft materials including polymer molecular weight distributions, amorphous polymers, semicrystalline polymers, copolymers, elastomers, biopolymers, soft tissue, bone and cellular structure. The design and function of implantable biomaterials are also covered.", "fall": false, "units": " 3"}, {"summer": false, "name": "Nuclear Materials", "spring": true, "number": ")  409", "descripton": "Students cannot receive credit for both 409 and 509.", "fall": false, "units": " 3"}, {"summer": false, "name": "Nuclear Materials", "spring": true, "number": ")  409", "descripton": "Students cannot receive credit for both 409 and 509.", "fall": false, "units": " 3"}, {"summer": false, "name": "Mechanical Properties of Materials", "prerequisites": "Prerequisite: MSE 370 and MSE 380", "spring": false, "number": "MSE  420", "descripton": "Basic concepts for mechanical properties of materials, elasticity, plasticity, viscoelasticity, rubber elasticity, strengthening mechanisms, creep, fracture and fatigue. Includes metals, ceramics, polymers and composites. Describes mechanical properties for nanostructured materials and biomaterials.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Materials Engineering Design", "prerequisites": "Prerequisite: Senior standing in MSE", "spring": false, "number": "MSE  423", "descripton": "Materials selection in engineering design involving lecture, cooperative and problem-based learning techniques. Course stresses creative thinking, problem solving methodology, interdependence of design with analysis and evaluation, teamwork and sharpening of communication skills. Real industrial problems are introduced which are analyzed by student teams. This a half-semester course. The classroom lectures end at mid-semester. In the second half of the semester, student teams develop a proposal which is submitted to the industrial sponsors at the end of the semester. The proposal defines future work to be conducted under MSE 470.", "fall": true, "units": " 1"}, {"summer": false, "name": "Processing of Metallic Materials", "prerequisites": "Prerequisite: MSE 360 and MSE 370. Corequisite: MSE 420", "spring": false, "number": "MSE  440", "descripton": "Fundamental concepts of solidification and their application to foundry and welding practices; metal forming concepts applied to forging, rolling, extrusion, drawing, and sheet forming operations; machining mechanisms and methods; powder metallurgy;advanced processing methods including rapid solidification and mechanical alloying. Credit for both MSE 440 and MSE 540 is not allowed", "fall": true, "units": " 3"}, {"summer": false, "name": "Ceramic Processing", "prerequisites": "Prerequisite: MSE 370", "spring": false, "number": "MSE  445", "descripton": "Ceramic processing of powders includes powder synthesis, characterization, mixing, and size reduction.  Theoretical aspects include particle packing, particles in suspension, and some aspects of surface chemistry.  Forming methods include compaction, casting, and extrusion.  Firing and sintering are examined. Credit for both MSE 445 and MSE 545 is not allowed", "fall": true, "units": " 3"}, {"summer": false, "name": "Polymer Technology and Engineering", "prerequisites": "Prerequisite: MSE 380", "spring": true, "number": ")  455", "descripton": "This course will cover commercial polymers, polymer blends and miscibility, dynamic mechanical behavior, Boltzmann superposition principle, ultimate properties of polymers, polymer rheology and processing, recycling and design and selection of polymeric materials.  Guest instructors from industry will give presentations on contemporary topics in polymer technology and engineering.  Field trips are required.", "fall": false, "units": " 3"}, {"summer": false, "name": "Composite Materials", "prerequisites": "Prerequisite: MSE 420", "spring": true, "number": "MSE  456", "descripton": "The course covers the basic principles underlying properties of composite materials as related to the properties of individual constituents and their interactions. Polymer, metal and ceramic matrix composites are included. Property averaging and micromechanics of composites are covered at an introductory level. Emphasis is placed on design and processing of composite systems to yield desired combinations of properties. Credit for both MSE 456 and MSE 556 is not allowed.", "fall": false, "units": " 3"}, {"summer": false, "name": "Microelectronic Materials", "prerequisites": "Prerequisite: MSE 355", "spring": false, "number": "MSE  460", "descripton": "Processes and characterization techniques relevant to microelectronic materials science and technology.  Boule growth, wafer preparation, oxidation, epitaxial growth, doping techniques, metallization, and device applications of elemental and compound semiconductors.  Electrical, structural and chemical characterization of semiconductors is included as well as materials considerations relevant to device fabrication. Credit for both MSE 460 and MSE 560 is not allowed", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Nanomaterials", "prerequisites": "Prerequisite: MSE 201", "spring": true, "number": "MSE  465", "descripton": "Introduction to nanoparticles, nanotubes, nanowires, and nanostructured films, emphasizing their synthesis, structural and property characterization, novel physical and chemical properties, applications and contemporary literature.", "fall": false, "units": " 3"}, {"summer": false, "name": "Materials Science and Engineering Senior Design Project", "prerequisites": "Prerequisite: MSE 423", "spring": true, "number": "MSE  470", "descripton": "Design project in materials science and engineering requiring problem definition and analysis, synthesis, and presentation of a designed solution. Students work in groups with a faculty adviser on problems submitted by local industrial sponsors or emerging research issues that represent the major specialty areas including ceramics, metals, polymers, or electronic materials.", "fall": false, "units": " 3"}, {"summer": false, "name": "Materials Forensics", "prerequisites": "Prerequisite: MSE 370 and MSE 380", "spring": true, "number": "MSE  480", "descripton": "Covers principles and prevention of the degradation of materials. The topics will include dissolution of polymer and ceramic materials, electrochemical corrosion, oxidation of metals and polymers, degradation of polymers, friction and wear, degradation of electrical device components, bio-deterioration of materials, and failure analysis. The general practice in failure analysis will be applied to a variety of case studies to illustrate important failure mechanisms.  Credit will not be given for both MSE 480 and MSE 580.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Special Topics in Materials Engineering", "spring": "True", "number": "MSE  490", "descripton": "Offered as needed for the development of new courses in materials engineering, including areas such as metals, ceramics, polymers, or microelectronic materials.", "fall": "True", "units": " 1-4"}, {"summer": false, "name": "Materials Engineering Projects", "prerequisites": "Prerequisite: Junior standing or Senior standing", "spring": true, "number": "MSE  495", "descripton": "Application of engineering principles to a specific materials engineering project by a student or small group of students under supervision of a faculty member. A written report required.", "fall": true, "units": " 1-6"}, {"summer": "True", "name": "Modern Concepts in Materials Science", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "MSE  500", "descripton": "Fundamentals of structure, structure modification and properties of materials with emphasis on structure-property relationships and modern theory of solids.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Nuclear Materials", "spring": true, "number": ")  509", "descripton": "Students cannot receive credit for both 409 and 509.", "fall": false, "units": " 3"}, {"summer": false, "name": "Nuclear Materials", "prerequisites": "Prerequisite: MSE 201", "spring": false, "number": ")  509", "descripton": "Introduces students to properties and selection of materials for nuclear steam supply systems and to radiation effects on materials. Implications of radiation damage to reactor materials and materials problems in nuclear engineering are discussed. Topics include an overview of nuclear steam supply systems, crystal structure and defects, dislocation theory, mechanical properties, radiation damage, hardening and embrittlement due to radiation exposure and problems concerned with fission and fusion materials. Students cannot receive credit for both 409 and 509.", "fall": true, "units": " 3"}, {"summer": false, "name": "Physical Metallurgy", "prerequisites": "Prerequisite: MAT 321, MAT 450, Corequisite: MAT 430", "spring": false, "number": "MSE  531", "descripton": "Application and design of selected metals and alloys in a theoretical and practical context.  Relationships between mechanical behavior, and alloy chemistry, microstructure, and processing.  Corrosion resistance; fatigue failure; creep; brittle fracture.  Design of specific microstructures. Credit for both MAT 431 and MSE 531 is not allowed", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Materials", "prerequisites": "Prerequisite: MSE 201 and MAE 314", "spring": false, "number": ")  539", "descripton": "Introduces production/structure/property/function relation and application of a number of materials mainly for biomedical, mechanical and aerospace applications. Topics include ultra light materials (production, processing and applications of cellular solids), biomaterials (classes and application of materials in medicine and dentistry), composites (classes and application), refractory materials and coatings for high temperature applications, thin film shape memory alloys for micro-electro mechanical systems (MEMS).", "fall": true, "units": " 3"}, {"summer": false, "name": "Processing of Metallic Materials", "prerequisites": "Prerequisite: MAT 321, MAT 450, Corequisite: MAT 431", "spring": false, "number": "MSE  540", "descripton": "Fundamental concepts of solidification and their application to foundry and welding practices; metal forming concepts applied to forging, rolling, drawing, and sheet forming operations; machining mechanisms and methods; powder metallurgy; advanced processing methods including rapid solidification and mechanical alloying. Credit for both MAT 440 and MSE 540 is not allowed", "fall": true, "units": " 3"}, {"summer": false, "name": "Ceramic Processing", "prerequisites": "Prerequisite: MAT 434, MAT 435", "spring": false, "number": "MSE  545", "descripton": "Powder synthesis, characterization, colloidal processing, forming method, theory of sintering, aspects of microstructural control. Credit for both MAT 445 and MSE 545 is not allowed", "fall": true, "units": " 3"}, {"summer": false, "name": "Polymer Technology and Engineering", "prerequisites": "Prerequisite: MSE 424 or equivalent", "spring": true, "number": "MSE  555", "descripton": "Classes of commercially important polymers, advanced topics in phase behavior, viscoelasticity, fracture and ultimate properties of polymers; polymer rheology, and processing; design of polymeric materials.  Credit for both MSE 455 and MSE 555 is not allowed.", "fall": false, "units": " 3"}, {"summer": false, "name": "Composite Materials", "prerequisites": "Prerequisite: MAT 450", "spring": false, "number": "MSE  556", "descripton": "Basic principles underlying properties of composite materials as related to properties of individual constituents and their interactions. Emphasis on design of composite systems to yield desired combinations of properties.", "fall": true, "units": " 3"}, {"summer": false, "name": "Microelectronic Materials Science and Technology", "prerequisites": "Prerequisite: MAT 331, Corequisite: MAT 431", "spring": true, "number": "MSE  560", "descripton": "Processes and characterization techniques relevant to microelectronic materials science and technology.  Boule growth, water preparation, oxidation, epitaxial growth, doping techniques, metallization, and device applications of elemental and compound semiconductors.  Electrical, structural and chemical characterization of semiconductors as well as materials considerations relevant to device fabrication. Credit for both MAT 460 and MSE 560 is not allowed", "fall": false, "units": " 3"}, {"summer": "True", "name": "Organic Chemistry Of Polymers", "spring": "True", "number": ")  561", "descripton": "Principles of step reaction and addition polymerizations; copolymerization; emulsion polymerization; ionic polymerization; characterization of polymers; molecular structure and properties.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Polymer Technology and engineering", "prerequisites": "Prerequisite: MAT 424", "spring": "True", "number": "MSE  575", "descripton": "Classes of commercially important polymers, advanced topics in phase behavior, viscoelasticity, fracture and ultimate properties of polymers; polymer rheology, processing and permeability; design of polymeric materials.  Credit for both MAT 475 and MSE 575 is not allowed.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Technology Evaluation and Commercialization Concepts", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": ")  576", "descripton": "Commercialization potential of new technologies, products and processes. Marketing, organizational, financial, operational and manufacturing issues. Strategic assessment and planning. Innovation management. Entrepreneurial transfer mechanisms including spinoffs, licensing and high-technology start-ups. Practical application with project and team management skills development.", "fall": "True", "units": " 4"}, {"summer": false, "name": "Technology Evaluation and Strategy", "prerequisites": "Prerequisite: MBA/MSE 576", "spring": true, "number": ")  577", "descripton": "Theoretical and practical team-based application of systematic evaluation techniques for assessing commercial potential of technologies, products and processes. Prioritization and selection based on technology strategy.", "fall": true, "units": " 4"}, {"summer": false, "name": "Materials Forensics", "prerequisites": "Prerequisite: MSE 370 and MSE 380", "spring": true, "number": "MSE  580", "descripton": "Covers principles and prevention of the degradation of materials. The topics will include dissolution of polymer and ceramic materials, electrochemical corrosion, oxidation of metals and polymers, degradation of polymers, friction and wear, degradation of electrical device components, bio-deterioration of materials, and failure analysis. The general practice in failure analysis will be applied to a variety of case studies to illustrate important failure mechanisms.  Credit will not be given for both MSE 480 and MSE 580.", "fall": false, "units": " 3"}, {"summer": false, "name": "Seminar", "spring": true, "number": "MSE  601", "descripton": "Reports and discussion of special topics in materials science and engineering and allied fields.", "fall": true, "units": " 1"}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "MSE  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "MSE  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "MSE  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": true, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "MSE  690", "descripton": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "MSE  693", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "MSE  695", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "MSE  696", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "MSE  699", "descripton": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Defects In Solids", "prerequisites": "Prerequisite: MSE 500", "spring": true, "number": "MSE  702", "fall": false, "units": " 3"}, {"summer": false, "name": "Electrical, Optical and Magnetic Properties of Materials", "prerequisites": "Prerequisite: MAT 700, MAT 710, and MSE 500", "spring": true, "number": "MSE  704", "descripton": "Electron theory of materials, band theory; electrical behavior of metals, semiconductors, dielectrics and noncrystalline materials; theory of optical behavior and applications; foundations of magnetic properties and applications of ferrites and permanent magnetic materials.", "fall": false, "units": " 3"}, {"summer": false, "name": "Mechanical Behavior Of Engineering Materials", "prerequisites": "Prerequisite: MAT 450, MAT 702", "spring": false, "number": "MSE  705", "descripton": "Coverage of both fundamental and engineering aspects of mechanical behavior of materials. Elasticity, plasticity and dislocation theory concepts used to describe phenomenological behavior and micro-mechanical mechanisms. Strengthening mechanisms in crystals, high-temperature deformation, fracture mechanics, fracture toughening mechanisms and cyclic deformation.", "fall": true, "units": " 3"}, {"summer": false, "name": "Phase Transformations and Kinetics", "prerequisites": "Prerequisite: MAT 700, MAT 710, and MSE 500", "spring": true, "number": "MSE  706", "descripton": "Homogeneous and heterogeneous nucleation, spinodal decomposition, interface and diffusion-controlled growth, formal theory of transformation kinetics, precipitation, coarsening, order-disorder, and martensitic transformations.", "fall": false, "units": " 3"}, {"summer": false, "name": "Thermodynamics Of Materials", "prerequisites": "Prerequisite: MAT 301 and MSE 500", "spring": false, "number": "MSE  708", "descripton": "Review of first and second laws of thermodynamics, equilibrium and irreversible processes, open and closed systems, partition functions and particle distribution functions. Applications include extension of thermodynamic potentials to situations where electrical, magnetic and stress fields present, heat capacity of crystals, electron gas in metals, solution models, binary phase diagrams and rubber elasticity in polymers.", "fall": true, "units": " 3"}, {"summer": false, "name": "Elements Of Crystallography and Diffraction", "spring": false, "number": "MSE  710", "descripton": "Crystal symmetry, lattices and space groups; elementary diffraction by crystalline matter; experimental methods of x-ray diffraction.", "fall": true, "units": " 3"}, {"summer": false, "name": "Scanning Electron Microscopy", "spring": false, "number": "MSE  712", "descripton": "Electron optics, sources and detectors. Beam specimen interactions, secondary and backscattered electrons, and EDS. Resolution limits, experimental conditions, related techniques, beam-induced damage and materials modifications.", "fall": true, "units": " 3"}, {"summer": false, "name": "Fundamentals Of Transmission Electron Microscopy", "prerequisites": "Prerequisite: MAT 710", "spring": true, "number": "MSE  715", "descripton": "Electron optics, electron-solid interactions, electron diffraction, image contrast, defect characterization, analytical and high resolution microscopy.  Parallel laboratory demonstrations and exercises. Laboratory enrollment limited to twelve, but laboratory may be waived with consent of instructor.", "fall": false, "units": " 4"}, {"summer": false, "name": "Materials Processing by Deformation", "prerequisites": "Prerequisite: Six hrs. of solid mechanics and/or materials", "spring": false, "number": ")  731", "descripton": "Presentation of mechanical and metallurgical fundamentals of materials processing by deformation. Principles of metal working, friction, forging, rolling, extrusion, drawing, high energy rate forming, chipless forming techniques, manufacturing system concept in production.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Principles of Corrosion", "prerequisites": "Prerequisite: MAT 201 and CH 431 or MAT 301", "spring": "True", "number": "MSE  741", "descripton": "Fundamentals of metallic corrosion and passivity. Electro-chemical nature of corrosive attack, basic forms of corrosion, corrosion rate factors, methods of corrosion protection. Laboratory work included.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Thin Film and Coating Science and Technology I", "prerequisites": "Prerequisite: MAT 700", "spring": false, "number": "MSE  751", "descripton": "Vacuum science and technology including gas kinetics, gas flow calculations, system design and use of various pumps, materials and components. Atomistics of solid surfaces. Nucleation and growth of films and coatings.", "fall": true, "units": " 3"}, {"summer": false, "name": "Thin Film and Coating Science and Technology II", "prerequisites": "Prerequisite: MSE 751", "spring": true, "number": "MSE  752", "descripton": "Techniques for thin films and coatings deposition and their applications. Interfaces, adhesion and surface modification. Artificially structured and chemically modulated layered materials. Pseudomorphic structures. Characterization of thin films andcoatings.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Radiation Effects on Materials", "spring": "True", "number": "MSE  757", "descripton": "Interaction of radiation with matter with emphasis on microstructural modification, physical and mechanical effects.  Defects generation and annealing, void swelling, irradiation growth and creep, and irradiation induced effects in reactor materialsare discussed.  Current theories and experimental techniques are discussed.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Materials Science in Processing of Semiconductor Devices", "prerequisites": "Prerequisite: MAT 460 and MSE 500", "spring": true, "number": "MSE  760", "descripton": "Ion implantation and doping for advanced semiconductor devices, thin films and epitaxy, silicides, ohmic contacts and interconnection metallurgy, oxidation and nitridation, gettering of impurities and dopant segregation phenomena, electromigration, electronic packaging materials science and advanced device concepts.", "fall": false, "units": " 3"}, {"summer": false, "name": "Polymer Blends and Alloys", "prerequisites": "Prerequisite: CHE 316 or MAT 301", "spring": false, "number": ")  761", "descripton": "Thermodynamics, morphological characteristics and properties of multiphase polymer systems composed of homopolymers or copolymers.  Interfacial characteristics and modification of multicomponent polymer blends through emulsification and reactive blending.  Microphase ordering in block copolymers, and emerging technolgies employing these nanostructured materials.  Conformational properties and dynamics of macromolecules constrained near an interface.", "fall": true, "units": " 3"}, {"summer": false, "name": "Characterization Of Structure Of Fiber Forming Polymers", "prerequisites": "Prerequisite: MA 301, PY 208", "spring": false, "number": ")  763", "descripton": "Theories, experimental evidence and characterization methods of the molecular fine structure of fiber forming polymers in the solid state. Characterization methods include X-ray diffraction, microscopy, infrared, thermal and magnetic resonance.  An introduction to nucleation theory of polymer systems.", "fall": true, "units": " 3"}, {"summer": false, "name": "Defects, Diffusion and Ion Implantation In Semiconductors", "prerequisites": "Prerequisite: MAT 701", "spring": false, "number": "MSE  770", "descripton": "Thermodynamics of vacancies and interstitials, defect complexes, electronic defects, defect annealing processes, self diffusion, dopant and impurity diffusion, substitutional/interstitial diffusion, diffusion in amorphous solids, electro transport, fundamentals of ion-solid interactions, semiconductor doping atomic structure of defects, damage annealing processes, supersaturated alloys, laser annealing, ion beam mixing phenomena, ion implantation and rapid thermal annealing processes, shallow junctions and devices.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Materials Science of Nanoelectronics", "prerequisites": "Prerequisite: MSE 500", "spring": "True", "number": "MSE  771", "descripton": " processing of all materials (metals, semiconductors, ceramics, polymers and biomaterials).  Current status and future prospects for the semiconductor industry summarized by invited scientists and by review and discussion of selected current literature.  Student presentations and research proposals are required.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Structure of Semicrystalline Polymers", "prerequisites": "Prerequisite: MAT 425", "spring": true, "number": "MSE  775", "descripton": "Structure and organization of semicrystalline polymers, from molecular scale to bulk state, including chain configuration, unit cell geometries, polymer crystallography, single crystals, spherulites, epitaxial crystallization, morphology, crystal defects, annealing and deformation mechanisms.  Emphasis on analysis of x-ray diffraction, electron diffraction and electron microscopy data for structural characterization.", "fall": false, "units": " 3"}, {"summer": true, "name": "Advanced Topics in Materials Science and Engineering", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "MSE  791", "descripton": "Special studies of advanced topics in materials science and engineering.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Advanced Materials Experiments", "prerequisites": "Prerequisite: Senior standing or Graduate standing", "spring": true, "number": "MSE  795", "descripton": "Advanced engineering principles applied to a specific experimental project dealing with materials. A seminar period provided; required written report.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Seminar", "spring": true, "number": "MSE  801", "descripton": "Reports and discussion of special topics in materials science and engineering and allied fields.", "fall": true, "units": " 1"}, {"summer": true, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "MSE  885", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Doctoral Preliminary Exam", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "MSE  890", "descripton": "For students who are preparing for and taking written and/or oral preliminary exams.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "MSE  893", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "MSE  895", "descripton": "Dissertation Research", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "MSE  896", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "MSE  899", "descripton": "For students who have completed all credit hour requirements, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations.", "fall": true, "units": " 1-3"}]