[{"summer": false, "name": "Fundamentals of Grant Development for Nonprofits", "spring": true, "number": "NPS  340", "descripton": "The focus of this class is on obtaining grant funding for nonprofit organizations. This course covers the skills and strategies essential to the grants development process including basic strategies for researching funding sources and developing successful grant proposals.", "fall": false, "units": " 3"}, {"summer": false, "name": "Special Topics in Nonprofit Studies", "spring": false, "number": "NPS  395", "descripton": "Offered as needed to present material not normally available in regular departmental course offerings or for offering of new courses on a trial basis.", "fall": false, "units": " 1-6"}, {"summer": true, "name": "Internship in Nonprofit Studies", "prerequisites": "Prerequisite: PS 203, COM 466", "spring": true, "number": "NPS  490", "descripton": "The 150-hour internship provides students with the opportunity to apply the knowledge, skills, and abilities gained through their coursework in the minor in Nonprofit Studies to a nonprofit organizational work setting. The course will include a bi-weekly, two-hour seminar that focuses on careers in the nonprofit sector and nonprofit employment strategies. Students will discuss and reflect upon the service-learning themes of the minor in Nonprofit Studies as they relate to their ongoing internship experiences. Departmental approval required.", "fall": false, "units": " 4"}, {"summer": false, "name": "Capstone Seminar in Nonprofit Studies", "prerequisites": "Prerequisite: PS 203, COM 466, Corequisite: NPS 490", "spring": true, "number": "NPS  498", "descripton": "This capstone seminar integrates the knowledge, skills, and abilities gained through coursework in the minor in Nonprofit Studies through class discussions and reflective writings where students draw upon previous service-learning experiences to reflect on challenges facing nonprofit leaders. Case studies and articles that focus on the themes of the minor are used to stimulate class discussions. Nonprofit leaders serve as discussants. In addition, students complete and submit a Nonprofit Studies portfolio, which documents successful achievement of program objectives. Departmental approval required", "fall": true, "units": " 1"}]