[{"summer": false, "name": "Introduction to Natural Resources", "spring": false, "number": "NR  100", "descripton": "Orientation to natural resources management.  Case study of a current natural resource management issue including biophysical, economic, social and political dimensions. Field experience with local natural resources issues.  Career orientation and counseling. Open to Natural Resources, Forest Management and University Undesignated students only", "fall": true, "units": " 2"}, {"summer": "True", "name": "Special Topics in Natural Resources", "spring": "True", "number": "NR  295", "descripton": "Special Topics in Natural Resources at the 200 level for offering of courses on an experimental basis.", "fall": "True", "units": " 1-3"}, {"summer": false, "name": "Natural Resource Measurements", "prerequisites": "Prerequisite: (PB 360 or BIO 360) and ST 311", "spring": true, "number": "NR  300", "descripton": "Theory and practice of measuring, analyzing, and describing the characteristics of natural ecosystems.  Surveying and mapping, inventory of vegetation, soils, wildlife habitat, and hydrology.  Sampling, data analysis, and presentation of data.  Use of geographic information systems to store, analyze, and present environmental data.  Intensive instruction and practice in communication of technical information", "fall": false, "units": " 4"}, {"summer": false, "name": "Practicum for Professional Development I", "prerequisites": "Prerequisite: Junior standing, NR Majors", "spring": false, "number": "NR  301", "descripton": "Instruction in professional report writing and presentation, resume preparation and interview skills, professional ethics and practices, job searching skills; review and critique of professional seminars and coduments from NR 501 students; preparation for summer work experience.", "fall": true, "units": " 1"}, {"summer": false, "name": "Humans and the Environment", "spring": false, "number": ")  303", "descripton": "Interactions among human populations in the biophysical system and the environment.  Emphasis on current issues, ecological principles and their relationships to basic biophysical processes; considers food, population dynamics, public land and common resources, renewable natural resources, pollution, water resources, energy and non-renewable resources.", "fall": false, "units": " 3"}, {"summer": true, "name": "International Sustainable Resource Use", "prerequisites": "Prerequisite: Sophomore standing", "spring": false, "number": "NR  350", "descripton": "Study of sustainable use of natural resources in a global economy with consideration of consumption choices, sustainable production issues, conservation of various managed landscapes, and cross cultural perspectives. Specific topics vary somewhat byyear and study location. Travel in North America in even years and to Sweden in odd years. Domestic or international travel overnight. Depending upon travel location, possible additional expense for passport, health certificate, insurance and domestic or international travel.", "fall": false, "units": " 4"}, {"summer": true, "name": "Internship Experience", "prerequisites": "Prerequisite: NR 301 and Junior standing", "spring": true, "number": "NR  360", "descripton": "Internship experience with a natural resource agency or company.  Most internships require working and living off-campus.", "fall": true, "units": " 3"}, {"summer": false, "name": "Natural Resource Management", "prerequisites": "P:Senior standing in NR, ETM, FOM, or FW", "spring": true, "number": "NR  400", "descripton": "Theory and practice of integrated natural resource management. Quantitative optimization, economics of multiple-use, compounding and discounting, optimal rotations, linear programming.  Public and private management case studies and team projects.", "fall": false, "units": " 4"}, {"summer": false, "name": "Practicum for Professional Development II", "prerequisites": "Prerequisite: NR majors, NR 360", "spring": false, "number": "NR  401", "descripton": "Preparation and presentation of journal on summer work experience, final report and oral presentation of summer work activities; instruction in presentation techniques; review and critique of seminars and documents; mentoring NR 301 students.", "fall": true, "units": " 1"}, {"summer": false, "name": "Conservation of Biological Diversity", "prerequisites": "Prerequisite: Junior standing", "spring": false, "number": "NR  406", "descripton": "Population biology concepts fundamental to understanding the properties of the objects of conservation. Genetic diversity in agriculture, forestry, and animal breeding; the ethical and international policy issues in preservation and management.", "fall": true, "units": " 3"}, {"summer": false, "name": "Watershed and Wetlands Hydrology", "prerequisites": "Prerequisite:SSC 200 and (PB 360 or BIO 360)", "spring": false, "number": ")  420", "descripton": "Principles of hydrologic science; classification and assessment of watersheds and stream networks; hydrologic, erosion, and water quality processes in natural and managed watersheds; wetlands hydrology; hydrologic measurements and data analysis; applications of hydrology and water quality management for forest agriculture, and urban ecosystems; watershed restoration.  Emphasis field study of watersheds and hydrologic measurements.  Two weekend field trips are required. Credit will not be given for both FOR(NR)420 and FOR(NR)520.", "fall": true, "units": " 4"}, {"summer": false, "name": "Wetland Assessment, Delineation and Regulation", "prerequisites": "Prerequisite: SSC 200, (PB 360 or BIO 360), and (FOR 339 or PB 405)", "spring": true, "number": "NR  421", "descripton": "Wetland definitions and systems of classification and functional assessment; methods for assessing ecological functions of wetlands; identification and delineation of jurisdictional wetlands in accordance with US Army Corps of Engineers procedures; application of federal and state regulatory programs.  Five Saturday field trips are required. Credit will not be given for both NR 421 and NR 521", "fall": false, "units": " 3"}, {"summer": false, "name": "Renewable Natural Resource Management and Policy", "prerequisites": "Prerequisite: Junior standing.", "spring": false, "number": "NR  460", "descripton": "The interaction of legal principles and governmental institutions in the development and implementation of natural resource policy and management.  Legal principles, constitutional provisions and the location and organization of governmental programs.  Examples from both historic and current case studies.", "fall": true, "units": " 3"}, {"summer": false, "name": "Environmental Impact Assessment", "prerequisites": "Prerequisite: ET 310 or NR 300 or FOR 260 or SSC 442", "spring": false, "number": "NR  484", "descripton": "Impact assessment principles, practices, and their evolution.  Lectures and field practicums concerning problems addressed by environmental assessment practitioners.  Practical implications of current regulatory requirements, especially endangered species and wetlands.", "fall": true, "units": " 4"}, {"summer": false, "name": "Special Topics in Forestry and Related Natural Resources", "spring": true, "number": ")  491", "descripton": "Independent (or group) study or research of a forestry or related natural resources topic with a faculty supervisor of the student's choice. Also courses offered on a trial basis.", "fall": true, "units": " 1-4"}, {"summer": false, "name": "Natural Resource Management", "prerequisites": "Prerequisite: ARE 336 and either ST 311 or ST 350; Graduate standing", "spring": true, "number": "NR  500", "descripton": "Theory and practice of integrated natural resource management.  Quantitative optimization, economics of multiple-use, compounding and discounting, optimal rotations, linear programming.  Public and private management case studies and team projects.Graduate students expected to provide more in-depth critique of planning process. Credit will not be allowed for both NR 400 and NR 500", "fall": false, "units": " 3"}, {"summer": false, "name": "Wetland Assessment, Delineation, and Regulation", "prerequisites": "Prerequisite: SSC 200, BO 360, FOR 212 or BO 405, and FOR 420", "spring": true, "number": "NR  521", "descripton": "Wetland definitions and systems of classification and functional assessment; methods for assessing ecological functions of wetlands; identification and delineation of jurisdictional wetlands in accordance with US Army Corps of Engineers procedures; application of federal and state regulatory programs.  Two required weekend field trips.", "fall": false, "units": " 3"}, {"summer": false, "name": "Historical Environments", "spring": true, "number": "NR  548", "descripton": "Course examines how we know and what we know about historical environments. Compares and contrasts contributions by various disciplines and interdisciplinary approaches to historical ecology and environmental history. Readings drawn from science, social science and humanities literature. Individual investigation projects required.", "fall": false, "units": " 3"}, {"summer": false, "name": "Introduction to Data Analysis in Natural Resources", "prerequisites": "Prerequisite: ST 512", "spring": true, "number": "NR  554", "descripton": "Data examination for errors, data cleaning, data summary, statistical analyses options using various procedures of the SAS software and R with an emphasis on natural resource applications.  Interpretation of SAS program outputs.  Discussions of individual data problems.  Hands-on use of computers and the SAS and R software.", "fall": false, "units": " 3"}, {"summer": false, "name": "Current Issues in Natural Resource Policy", "spring": true, "number": "NR  571", "descripton": "Seminar providing an overview of current natural resource issues for the world and the U.S.  Population, sustainable development, food and agriculture, forests, rangelands, biodiversity, energy resources, water resources, atmosphere and climate, international policies and instructions.", "fall": false, "units": " 3"}, {"summer": false, "name": "Special Topics in Natural Resources", "spring": true, "number": "NR  595", "descripton": "Individual students or groups of students, under direction of a faculty member, may explore natural resources related topics of special interest not covered by existing courses.  Format may consist of readings and independent study, problems, or research not related to thesis.  Also used to develop and test new 500-level courses.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Graduate Seminar", "spring": true, "number": "NR  601", "descripton": "Weekly seminar in which students registered for course present the results of research and special projects.  Invitation to all graduate students and faculty in department to attend and join discussion.", "fall": true, "units": " 1"}, {"summer": false, "name": "Special Topics in Natural Resources", "spring": true, "number": "NR  610", "descripton": "Individual students or groups of students, under direction of a faculty member, may explore natural resources related topics of special interest not covered by existing courses.  Format may consist of readings and independent study, problems, or research not related to thesis.  Also used to develop and test new 600-level courses.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "NR  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "NR  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "NR  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": false, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "NR  690", "descripton": "For students in non-thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "NR  693", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": false, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "NR  695", "descripton": "Thesis Research", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "NR  696", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": false, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "NR  699", "descripton": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis.", "fall": true, "units": " 1-3"}]