[{"summer": false, "name": "Perspectives on Botany", "spring": false, "number": "PB  101", "descripton": "Orientation to modern botany, including discussions of historical background, relation to other sciences, the nature of modern subdisciplines, professionalism and ethics, local resources of personnel and facilities, educational opportunities, and career possibilities.", "fall": true, "units": " 1"}, {"summer": true, "name": "Plant Life", "spring": true, "number": "PB  200", "descripton": "An introduction to the structure, processes, and  reproduction of higher plants, including the diversity of the plant kingdom and principles  of inheritance, ecology, and evolution. Credit cannot be given for both BO 200 and BO 250.", "fall": true, "units": " 4"}, {"summer": true, "name": "Our Green World", "spring": false, "number": "PB  205", "descripton": "Awareness and understanding of plants in the world for the non-science student.  Essential fundamental concepts of plant structure, growth, processes, uses, biotechnology, evolution, environmental issues and ecology.  Short field trips will be held that may require students to provide their own transportation. Credit cannot be received for both PB 205 and (PB 200 or PB 250).", "fall": false, "units": " 3"}, {"summer": true, "name": "Agricultural Biotechnology: Issues and Implications", "spring": true, "number": ")  208", "descripton": "Trends and issues of agricultural biotechnology in today's society are addressed while covering the basic biological science behind the technology. Applications of and policy issues associated with plant, animal, and environmental biotechnology used in the agricultural industry are examined from an interdisciplinary approach.", "fall": false, "units": " 3"}, {"summer": false, "name": "Plants and Civilization", "prerequisites": "Prerequisite: BIO 125, BIO 105 or PB 200", "spring": false, "number": "PB  213", "descripton": "Economic social, political, religious, and medical roles of plants and plant products in human civilization. Foods, beverages, drugs, fibers, oils, latexes, religious symbols and elements.", "fall": false, "units": " 3"}, {"summer": false, "name": "Medicinal Plants", "prerequisites": "Prerequisite: CH 101 and any one of the following courses: BIO 125,BIO 181,PB 200,ZO 150,ZO 160", "spring": false, "number": "PB  215", "descripton": "Plants and their derived pharmaceuticals in Western medicine and in herbal medicine.", "fall": true, "units": " 3"}, {"summer": false, "name": "Plants in Folklore, Myth, and religion", "spring": false, "number": "PB  219", "descripton": "The structural and functional biology of plants and cultural inclusions in folklore, myth, and religion.  The myth/religion-plant-human culture nexus.  Mythical and religious themes covered, but not limited to, are: the world tree and cosmic order; plants and the creation of Earth; the unity of plants and divine entities; the tree of life; life-giving waters and human immortality; human descent from plants; origin of food plants from humans; plants of witchcraft and magic; psychoactive plants and access to deities; solidarity between humans and plants; death and resurrection of plants and humans.", "fall": true, "units": " 3"}, {"summer": false, "name": "Local Flora", "prerequisites": "Prerequisite: BIO 125 or PB 200", "spring": false, "number": "PB  220", "descripton": "Structural terminology of vascular plants, field identification of plant species using popularized field guides, description of plant community types and their soil and topographic features.", "fall": false, "units": " 3"}, {"summer": false, "name": "Plant Biology", "spring": false, "number": "PB  250", "descripton": "An introduction for Life Science majors to the ecology, structure, function, processes, reproduction and evolution of higher plants. BIO 181 and BIO 183 or BIO 125 ; Students may not receive credit for both BO 200 and BO 250.", "fall": true, "units": " 4"}, {"summer": false, "name": "Space Biology", "prerequisites": "Prerequisite: BIO 105 or BIO 140 or BIO 181 or BIO 183 or PB 200", "spring": false, "number": "PB  277", "descripton": "Overview of the biology of plants, animals and humans in the space environment, including gravitational biology, aerospace medicine, search for extraterrestrial life, terraforming and life support.", "fall": true, "units": " 3"}, {"summer": true, "name": "Special Topics in Botany", "spring": true, "number": "PB  295", "descripton": "Trial offerings of new or experimental courses in Botany at the early undergraduate level.", "fall": true, "units": " 1-4"}, {"summer": false, "name": "Introduction to Whole Plant Physiology", "prerequisites": "Prerequisite: BIO 183 or PB 200 or PB 250; CH 101/102 and CH 220 or CH 221", "spring": true, "number": "PB  321", "descripton": "Physiology of higher plants with emphasis on whole plant aspects including structure-function relationships, water and solute movement, energy sources and needs, plant growth and development, and the impact of plant physiology findings on agriculture. Students cannot receive credit for both PB 321 and PB 421.", "fall": false, "units": " 3"}, {"summer": false, "name": "Evolutionary Biology", "prerequisites": "Prerequisite: C- or better in BIO 181and BIO 183", "spring": true, "number": ")  330", "descripton": "Principles and patterns of organic evolution. Topics will include the origin of life, patterns of genetic variation, adaptations, natural selection, and the formation of species, the relationship between micro and macroevolution, and the importance of evolution to humans and medicine.", "fall": false, "units": " 3"}, {"summer": true, "name": "Ecology", "prerequisites": "Prerequisite: C- or better in BIO 181", "spring": true, "number": ")  360", "descripton": "The science of ecology, including factors which control distribution and population dynamics of organisms, structure and function of biological communities, and energy flow and nutrient cycling in ecosystems; contrasts among the major biomes; and principles governing ecological responses to global climatic and other environmental changes.", "fall": true, "units": " 4"}, {"summer": false, "name": "Plant Structure and Diversity", "prerequisites": "Prerequisite: BIO 181 or PB 200 or PB 250", "spring": true, "number": "PB  400", "descripton": "Survey of the structure and diversity of plants.  Emphasis on anatomy, including cells, tissue systems, and organs, morphology, evolutionary trends, adaptive strategies, and bases for assumed phylogenetic relationships of fossil as well as living forms.  Two one-day weekend field trips.", "fall": false, "units": " 4"}, {"summer": false, "name": "Systematic Botany", "prerequisites": "Prerequisite: PB 200, PB 250, BIO 183, Junior standing", "spring": false, "number": "PB  403", "descripton": "The course introduces basic and contemporary systematic principles and methods as applied to vascular plants, with emphasis on flowering plants.  It covers classification, identification, phylogenetics, and molecular approaches, and surveys important and common plant families representing major groups of vascular plants.", "fall": true, "units": " 4"}, {"summer": false, "name": "Wetland Flora", "prerequisites": "Prerequisite: PB 200 or PB 250 or PB 403 or FOR 212", "spring": false, "number": "PB  405", "descripton": "Plant morphological terminology and identifications of wetland plants; discussion of wetland flora, plant communities, functions and values of North Carolina wetland types; several one-day weekend field trips required.", "fall": true, "units": " 3"}, {"summer": false, "name": "Plant Anatomy", "prerequisites": "Prerequisite: PB 200 or PB 250 or PB 321 or PB 421", "spring": true, "number": "PB  413", "descripton": "Students cannot reserve credit for both PB 413 and PB 513.", "fall": false, "units": " 2"}, {"summer": false, "name": "Cell Biology", "prerequisites": "Prerequisite: C- or better in BIO 183 and CH 221", "spring": true, "number": ")  414", "descripton": "The chemical and physical bases of cellular structure and function with emphasis on methods and interpretations.", "fall": false, "units": " 3"}, {"summer": false, "name": "Plant Physiology", "prerequisites": "Prerequisite: BIO 183 or ZO 160, or PB 200 and CH 220 or CH 221", "spring": false, "number": "PB  421", "descripton": "Physiology of higher plants with emphasis on biochemical, cell biological and molecular aspects of how plants function.  Unique aspects of regulation of plant metabolism including photosynthesis, respiration, nitrogen fixation, cell wall biosynthesis, growth and stress responses will be emphasized.  The course is intended for students interested in postgraduate studies in plant biology. Students cannot receive credit for both PB 321 and PB 421.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Paleobotany", "prerequisites": "Prerequisite: BIO 181 or MEA 102", "spring": "True", "number": "PB  445", "descripton": "Morphologic, taxonomic, geologic and evolutionary relationships of fossil plants; emphasis on vascular plants; discussions of taphonomy, biogeography and palynology. Requires weekend field trips at student expense. Credit will not be allowed for both BO 445 and BO 545.", "fall": "True", "units": " 4"}, {"summer": false, "name": "Rare Plants of North Carolina", "prerequisites": "Prerequisite: One of the following: (PB 200, PB220, PB 403, or PB 405)", "spring": false, "number": "PB  464", "descripton": "This course provides a taxonomic survey of the rare plants of North Carolina, focusing primarily on federally - and secondarily on state-listed species. Particular attention will be placed on : (1) the identification of rare species, their congeners, and morphologically similar species, (2) the biogeography of rare species, (3) optimum survey windows, and (4) the conservation biology of select taxa. Two Saturday field trips required. Junior level or higher. Students cannot receive credit for both PB 464 and PB 564.", "fall": true, "units": " 3"}, {"summer": false, "name": "Applied Bioinformatics", "prerequisites": "Prerequisite: BIT 410 or BCH 454 or GN 311", "spring": false, "number": ")  476", "descripton": "The haploid human genome occupies a total of just over 3 billion DNA base pairs. This information is not contained in books, but stored in electronic databases. Computational biology utilizes infer function by comparative analysis. This course is designed for life scientists from all fields to introduce them to the power of bioinformatics and enable them to access and utilize biological information in databases for their own research.", "fall": true, "units": " 2"}, {"summer": false, "name": "Introduction to Plant Biotechnology", "prerequisites": "Prerequisite: BCH 454 or BIT 410 or CS 211 or GN 311 or PB/BIO 414 or PB 421.", "spring": true, "number": "PB  480", "descripton": "Introduction to gene cloning, plant tissue culture and transformation, and the development of agriculturally important transgenic traits. Critical thinking, case studies, and discussions are used to examine global approaches to the regulation and risks of genetically-modified organisms, plant and gene patents, and the consequences of these factors on food soverienty and trade. Students cannot receive credit for both PB 480 and PB 580.", "fall": true, "units": " 3"}, {"summer": false, "name": "Plant Tissue Culture and Transformation", "prerequisites": "Prerequisite: BIT 360 or MB 409 or BCH 454 or ZO 480", "spring": true, "number": ")  481", "descripton": "Basic techniques in plant tissue culture and transformation. Empirical approaches to techniques in plant tissue culture, designing transgenes for expression in specific plant cell organelles and tissues, use of reporter genes to optimize transformation, and troubleshooting transformation. Laboratory sessions provide hands-on experience with plant tissue culture and transformation. Use of reporter genes, fluorescence microscopy and digital imaging. Half semester course, first part.", "fall": false, "units": " 2"}, {"summer": false, "name": "External Learning Experience", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "PB  492", "descripton": "A learning experience in agriculture and life sciences within an academic framework that utilizes  facilities and resources which are external to the campus. Contact and arrangements with prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior to the experience.", "fall": true, "units": " 1-6"}, {"summer": "True", "name": "SP Problems in BO", "spring": "True", "number": "PB  493", "descripton": "A learning  experience within an academic framework that utilizes campus facilities and resources.  Contact and arrangements with prospective employers must be initiated by student and  approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior to the experience.", "fall": "True", "units": " 1-6"}, {"summer": true, "name": "Special Topics in Botany", "prerequisites": "Prerequisite: 8 hrs. of Botany courses", "spring": true, "number": "PB  495", "descripton": "Individualized study, under faculty supervision, of botanical topics in the student's area of interest  and not covered in existing courses. Development of a new course on a trial basis.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Biology of Plant Pathogens", "prerequisites": "Prerequisite: PP 315, or PP 318, or an introductory course in microbiology", "spring": false, "number": ")  501", "descripton": "Biology of microbes that cause plant diseases.  The ecology, genetics, physiology, taxonomy, and mechanisms of parasitism, pathogenicity and virulence of bacteria (and other prokaryotes), fungi (and oomycetes), nematodes, and viruses that cause plant diseases.  Prepares graduate students for advanced courses in plant pathology, host-parasite interactions, and provides a knowledge base for students in other disciplines involved with plant pathogens or who seek to broaden their knowledge of microbes.", "fall": true, "units": " 3"}, {"summer": false, "name": "Systematic Botany", "prerequisites": "Prerequisite: PB 200, PB 250, BIO 183, Junior standing", "spring": false, "number": "PB  503", "descripton": "The course introduces basic and contemporary systematic principles and methods as applied to vascular plants, with emphasis on flowering plants.  It covers classification, identification, phylogenetics, and molecular approaches, and surveys important and common plant families representing major groups of vascular plants.", "fall": true, "units": " 4"}, {"summer": false, "name": "Plant Anatomy", "prerequisites": "Prerequisite: PB 200 or PB 250 or PB 321 or PB 421", "spring": true, "number": "PB  513", "descripton": "Students cannot receive credit for both PB 413 and PB 513.", "fall": false, "units": " 2"}, {"summer": false, "name": "Paleobotany", "prerequisites": "Prerequisite: PB 400, 403, 413, 544, MEA 423", "spring": true, "number": "PB  545", "descripton": "Morphologic, taxonomic, geologic and evolutionary relationships of fossil plants; emphasis on vascular plants; discussions of taphonomy, biogeography and palynology. Required field trips.", "fall": false, "units": " 4"}, {"summer": false, "name": "Plant Community Ecology", "prerequisites": "Prerequisite: PB 360 or ZO 260", "spring": false, "number": "PB  565", "descripton": "Consideration of structure and function of terrestrial vascular plant communities, with emphasis on both classical and recent research. Measurement and description of community properties, classification, ordination, vegetation pattern in relation to environment, ecological succession and a survey of vegetation of North America.", "fall": true, "units": " 4"}, {"summer": false, "name": "Plant Functional Ecology", "prerequisites": "Prerequisite: PB/BIO 360", "spring": false, "number": "PB  570", "descripton": "Mechanisms by which plants interact with their environment, with an emphasis on the role of physiological, morphological, and life history traits, and the evolution of these traits.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Mycology", "spring": false, "number": ")  575", "descripton": "A survey of the fungal kingdom in context of phyla and classes.  Systematics, ecology, biology and utilization.  Illustrative material, cultural techniques in laboratories.  Collection and paper required.", "fall": true, "units": " 4"}, {"summer": false, "name": "Introduction to Plant Biotechnology", "prerequisites": "Prerequisite: BCH 454 or BIT 410 or CS 211 or GN 311 or PB/BIO 414 or PB 421", "spring": true, "number": "PB  580", "descripton": "Introduction to gene cloning, plant tissue culture and transformation, and the development of agriculturally important transgenic traits.  Critical thinking, case studies, and discussions are used to examine global approaches to the regulation and risks of genetically modified organisms, plant and gene patents, and the consequences of these factors on food sovereignty and trade.  Students cannot receive credit for both PB 480 and PB 580.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Special Topics Botany", "spring": "True", "number": "PB  595", "fall": "True", "units": " 1-4"}, {"summer": false, "name": "Botany Seminar", "spring": true, "number": "PB  601", "fall": true, "units": " 1"}, {"summer": "True", "name": "Special Problems In Botany", "spring": "True", "number": "PB  620", "descripton": "Directed research in some phase of botany other than a thesis problem, but designed to provide experience and training in research. Credits Arranged.", "fall": "True", "units": " 1-4"}, {"summer": false, "name": "Topical Problems", "spring": true, "number": "PB  624", "descripton": "Discussions and readings on problems of current interest in fields of ecology, anatomy and morphology, taxonomy, plant physiology and cell biology. May be repeated with a change in topic for a maximum of six credits.", "fall": true, "units": " 1-4"}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "PB  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's Student", "spring": true, "number": "PB  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's Student", "spring": true, "number": "PB  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": true, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's Student", "spring": true, "number": "PB  690", "descripton": "For students in non-thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's Student", "spring": true, "number": "PB  693", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's Student", "spring": true, "number": "PB  695", "descripton": "Thesis Research.", "fall": true, "units": " 1-9"}, {"summer": "True", "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's Student", "spring": "True", "number": "PB  696", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": "True", "units": " 1"}, {"summer": true, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's Student", "spring": true, "number": "PB  699", "descripton": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Plant Nomenclature", "spring": true, "number": "PB  704", "descripton": "A practical foundation in plant nomenclature and nomenclatural references.  Emphasis on the evolution of international rules for naming plant taxa and their application in both wild and cultivated plants. Nomenclature applications used in patents, cultivar releases and journal articles.  Taught mid-semester.  Taught five weeks of semester.", "fall": false, "units": " 1"}, {"summer": false, "name": "Fungal Genetics and Physiology", "prerequisites": "Prerequisite: BCH 451, PB 575, GN 411 or PP 501", "spring": true, "number": ")  730", "descripton": "Basic concepts of genetics and physiology of fungi, with emphasis on saprophytic and plant pathogenic mycelial fungi. Current literature on evolution, cell structure, growth and development, gene expression, metabolism, sexual and asexual reproduction and incompatibility systems. Laboratory exercises on mutant isolation, sexual and parasexual analysis, genetic transformation, and RFLP and isozyme analysis.", "fall": false, "units": " 3"}, {"summer": false, "name": "Plant Growth and Development", "prerequisites": "Prerequisite: PB(ZO) 414 or PB 421, organic chemistry", "spring": true, "number": "PB  733", "descripton": "Advanced course in plant physiology covering plant growth, development, differentiation, senescence and biological control mechanisms.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Plant Physiology I", "prerequisites": "Prerequisite: PB 421", "spring": false, "number": "PB  751", "descripton": "Cellular mechanisms and regulatory features related to plant respiration, photosynthesis, sulfur metabolism, nitrogen fixation and metabolism, and signal transduction. One of two courses covering field of plant physiology.", "fall": true, "units": " 3"}, {"summer": false, "name": "Phycology", "prerequisites": "Prerequisite: BIO 125 or PB 200", "spring": true, "number": ")  774", "descripton": "Introduction to taxonomy, morphology, reproduction and ecological importance of organisms which may be included in the algae. Attention to local freshwater flow and physiology of selected species in relation to algal blooms, water quality and nutrient loading in aquatic habitats.", "fall": false, "units": " 3"}, {"summer": false, "name": "Plant Molecular Biology", "prerequisites": "Prerequisite: BCH 451, GN 411", "spring": false, "number": "PB  780", "descripton": "Molecular analysis of plant growth and development. Molecular techniques and their application to understanding control of gene expression in plants.", "fall": true, "units": " 3"}, {"summer": false, "name": "Special Topics Botany", "spring": true, "number": "PB  795", "fall": true, "units": " 1-4"}, {"summer": false, "name": "Seminar", "spring": true, "number": "PB  801", "fall": true, "units": " 1"}, {"summer": "True", "name": "Special Problems", "spring": "True", "number": "PB  820", "descripton": "Directed research in some phase of botany other than a thesis problem, but designed to provide experience and training in research. Credits Arranged.", "fall": "True", "units": " 1-4"}, {"summer": false, "name": "Topical Problems", "spring": true, "number": "PB  824", "descripton": "Discussions and readings on problems of current interest in fields of ecology, anatomy and morphology, taxonomy, plant physiology and cell biology. May be repeated with a change in topic for a maximum of six credits.", "fall": true, "units": " 1-4"}, {"summer": true, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral Student", "spring": true, "number": "PB  885", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral Student", "spring": true, "number": "PB  890", "descripton": "For students who are preparing for and taking written and/or oral preliminary exams.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "PB  893", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "PB  895", "descripton": "Dissertation Research", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral Student", "spring": false, "number": "PB  896", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral Student", "spring": true, "number": "PB  899", "descripton": "For students who have completed all credit hours, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations.", "fall": true, "units": " 1-3"}]