[{"summer": false, "name": "Introduction to Polymer and Color Chemistry", "prerequisites": "Corequisite: PCC 104", "spring": false, "number": "PCC  101", "descripton": "Introduction of topics related to Polymer and Color Chemistry, e.g. fiber and fiber forming polymers, polymerization methods, into to color assessment methods, various chemistry disciplines, molecular interactions, periodic table, acids, bases, solutions, into to and examples of textile coloration and textile finishing techniques.", "fall": true, "units": " 2"}, {"summer": false, "name": "Introduction to Polymer and Color Chemistry Lab", "prerequisites": "Corequisite: PCC 101", "spring": false, "number": "PCC  104", "descripton": "An introduction to hands-on laboratory work for the study of basic polymer principles, dye synthesis, forensic analysis and coloration of fibers.", "fall": true, "units": " 1"}, {"summer": false, "name": "Polymer Chemistry and Environmental Sustainability", "prerequisites": "Prequisite: CH 101; Corequisite: CH 221", "spring": false, "number": "PCC  106", "descripton": "Polymers are prevalent in almost every part of our lives. Many polymers are petroleum based and their raw material supply is limited. Using a theme of environmental impact, this course will review the origin and preparation of key industrial raw materials and how they are used in polymer synthesis. Properties of synthetic polymers will be introduces and concepts for establishing sustainable polymers will be discussed.", "fall": true, "units": " 3"}, {"summer": true, "name": "Introduction to Polymer Chemistry", "prerequisites": "Prerequisite: CH 101 and (MT 105 or TT 105 or PCC 101)", "spring": true, "number": "PCC  203", "descripton": "Organic reaction principles necessary to understand the preparation, properties and chemistry of polymers.  Synthesis, applications and behavior of common classes of polymers with emphasis on those materials used in the textile industry.  The chemistry and structure of natural and man-made fibers.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Forensic Science", "spring": true, "number": "PCC  274", "descripton": "The field of forensic science is the application of science to the law.  The primary purpose of this course is to introduce students to the 'real world' of forensics.  It will serve as a basis for more advanced forensic courses.  Solving crimes are often complex and costly affairs, involving myriad science and engineering disciplines, ethics, legal issues, and strong communication skills.  These key areas will be introduced via regular course lectures, guest lectures from faculty members within NC State and other institutions, and guest lectures from current or former field agents and professional forensic scientists.", "fall": false, "units": " 3"}, {"summer": false, "name": "Technology of Dyeing and Finishing", "prerequisites": "Prerequisite: PCC 106 or PCC 203 or TE 200 and Corequisite: PCC 304", "spring": true, "number": "PCC  301", "descripton": "Basic principles and procedures for the preparation, dyeing, printing, and finishing of natural and man-made fibers. The chemical nature of dyes and fastness properties and the chemical nature of finishes used to impart specific end-use properties.", "fall": true, "units": " 3"}, {"summer": true, "name": "Technology of Textile Wet Processing", "prerequisites": "Prerequisite: (TT 105 or MT 105 or PCC 101) and TMS 211 and CH 101 and (PY 211 or PY 205).", "spring": true, "number": "PCC  302", "descripton": "Introduction to the science and technology used in textile wet processing.  Topics include preparation, dyeing, printing and finishing of textiles, basics of color generation and measurement.  Emphasis mainly on cotton, wool, nylon and polyester.  Laboratory includes experiments in wet processing and a project on statistical analysis of fabric defects.", "fall": true, "units": " 4"}, {"summer": false, "name": " Finishing Laboratory", "prerequisites": "Prerequisite: PCC 106 or PCC 203 or TE 200 and Corequisite: PCC 301", "spring": true, "number": "PCC  304", "descripton": "Laboratory experience involving the preparation, dyeing, printing, and finishing of natural and man-made fibers.", "fall": true, "units": " 1"}, {"summer": false, "name": "Introduction to Color Science and Its Applications", "prerequisites": "Prerequisite: PCC 301 and either PY 208 or PY 212; Corequisite: PCC 354", "spring": true, "number": "PCC  350", "descripton": "Basic principles and applications of color science. Physical, physiological and psychophysical aspects of color, color perception, color specification, color measurement and color control.", "fall": false, "units": " 2"}, {"summer": false, "name": "Intro to Color Science Laboratory", "prerequisites": "Prerequisite: PCC 301 and either PY 208 or PY 212; Corequisite: PCC 350", "spring": true, "number": "PCC  354", "descripton": "An introdiction to hands-on laboratory work for the color measurement and perceotion of colored materials.", "fall": false, "units": " 1"}, {"summer": false, "name": "Impact of Industry on the Environment and Society", "prerequisites": "Prerequisite: Junior standing.", "spring": false, "number": "PCC  401", "descripton": "Relationship of society to safety and environmental aspects of manufactured products.  Quantifying manufacturing risks.  Protective methods, e.g. administrative, engineering, personal, treatment, pollution prevention.  Social factors, e.g. political, regulatory, legal, consumer attitudes, public policy, perceptions.  Understanding complex social issues, especially situations with conflicting goals.  Critical comparison of options for risk reduction, and selecting reasonable (hopefully optimal) courses of action in complex and uncertain situations. Unsolved problems of industry and society (e.g. greenhouse effect).  Relationships of ethics, laws and regulations to manufacturing.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to the Theory and Practice of Fiber Formation", "prerequisites": "Prerequisite: TE 200 and CH 201 and (PY 208 or PY 212) and (MA 231 or MA 241)", "spring": false, "number": "PCC  402", "descripton": "Flow behavior of polymeric materials as related to the formation of fibers by melt, dry and wet extrusion. Elementary theories of drawing and heat setting. Application of fiber-forming theories to synthetic and cellulosic fibers. Offered in Fall only.", "fall": true, "units": " 3"}, {"summer": false, "name": "Textile Preparation and Finishing Chemistry", "prerequisites": "Prerequisite: PCC 301", "spring": false, "number": "PCC  410", "descripton": "Topics in textile wet processing. Chemical mechanisms and unit operations in fabric preparation and finishing.", "fall": true, "units": " 3"}, {"summer": false, "name": "Textile Chemical Analysis", "prerequisites": "Prerequisite: PCC 301 and (CH 331 or CH 433 or TE 303); Corequisite: PCC 414", "spring": true, "number": "PCC  412", "descripton": "Application of analytical techniques for analysis to fibers, textile chemicals and textile processes; atomic absorption, ultraviolet, visible, near-infrared and infrared spectrophotometer; chromatography; interfacial tension; calorimetric, gravimetric and complexometric analyses. Emphasis on interpretation of data and solving problems of analysis for quantitate and characterization purposes.", "fall": false, "units": " 2"}, {"summer": false, "name": "Textile Chemistry Analysis Lab", "prerequisites": "Prerequisite: PCC 301 and (CH 331 or CH 433 or TE 303); Corequisite: PCC 412", "spring": true, "number": "PCC  414", "descripton": "Laboratory course in the application of analytical techniques for analysis of fibers, textile chemicals and textile processes; atomic absorption, ultraviolet, visible, near-infrared and infrared spectrophotometery; chromatography; interfacial tension; calorimetric, gravimetric and complexometric analyses. Emphasis on interpretation of data solving problems of analysis for quantitavive and characterization purposes.", "fall": false, "units": " 1"}, {"summer": false, "name": "Textile Dyeing and Printing", "prerequisites": "Prerequisite: PCC 301", "spring": true, "number": "PCC  420", "descripton": "Topics in coloration of textile fibers; chemical and physical mechanisms in textile dyeing and printing.", "fall": false, "units": " 3"}, {"summer": false, "name": "Theory of Physico-Chemical Processes in Textiles II", "prerequisites": "Prerequisite: TE 303 or CH 331 or CH 433", "spring": false, "number": "PCC  442", "descripton": "Second semester of a two-semester sequence. Ideal and non-ideal solutions, colligative properties. Electro chemistry, dyeing isotherms, chemical kinetics, surface chemistry, theory of repellency and other special topics.", "fall": true, "units": " 3"}, {"summer": false, "name": "Chemistry of Polymeric Materials", "prerequisites": "Prerequisite: (CH 220 and TE 200) or CH 223; Corequisite: PCC 464", "spring": false, "number": "PCC  461", "descripton": "Polymers are a critical component of most products used by society today. Knowledge of their formation and properties is key to development of the materials of the future. The formation and properties of the major polymers are the primary focus areas of this course, including Step-growth and Chain-growth polymerization, formation techniques for preparation of synthetic fibers and the fundamental relationships between chemical structure and physical properties of natural and synthetic polymers.", "fall": true, "units": " 3"}, {"summer": false, "name": "Characterization and Physical Properties of Polymers", "prerequisites": "Prerequisite: PCC 461", "spring": false, "number": "PCC  462", "descripton": "Properties unique to polymers are related to their high molecular weight, long and flexible chains, or polymers physics. The detailed molecular structures of polymer, pr polymer chemistry, are characterized and utilized to establish structure-property relations. An inside/outside approach connects their microstructures to their local conformational flexibilities, which impact their global responses, such as sizes and shapes and conformational entropies, to both their environments and the stresses placed upon them.", "fall": true, "units": " 3"}, {"summer": false, "name": "Chemistry of Polymeric Materials Laboratory", "prerequisites": "Prerequisite: (CH 220 and TE 200) or CH 223; Corequisite: PCC 461", "spring": false, "number": "PCC  464", "descripton": "Polymers are a critical component of most products used by society today. Understanding their formation and properties is key to development of the materials of tomorrow. This laboratory course is focused on preparation of the major synthetic polymers using step-growth and chain-growth polymerization techniques. The properties of the resultant polymers are studied.", "fall": true, "units": " 1"}, {"summer": false, "name": "Polymer Chemistry Laboratory", "prerequisites": "Prerequisite: (CH 331 or TE 303 or CH 433) and Senior Standing", "spring": true, "number": "PCC  466", "descripton": "Synthesis and characterization of polymers; thermodynamics of rubber elasticity and gelation; spectroscopic, thermal and scattering techniques for polymer analysis. The processing of polymers into fibers and films.", "fall": false, "units": " 3"}, {"summer": false, "name": "The Chemistry of Synthetic and Natural Bipolymers", "prerequisites": "Prerequisite: CH 220 or CH 221", "spring": true, "number": ")  471", "descripton": "Introduction to natural and synthetic biopolymers used for biomedical applications.  Goals and challenges of biomaterials selection for biomedical engineering.  Polymer concepts of polymerization and characterization.  Sources/synthesis, chemical and physical properties and degradation mechanisms are described.  Polymer classes include: polysaccharides, proteins, polyesters, polyurethanes, polyanhydrides and polyethers.", "fall": false, "units": " 3"}, {"summer": false, "name": "Forensic Chemistry Laboratory", "prerequisites": "Prerequisite: (CH 220 or CH 223) and TMS 211", "spring": false, "number": "PCC  474", "descripton": "Forensic chemistry is the application of chemistry to the law. It is a key part of crime scene investigations. In this course, students work in teams and discover standard methods of crime scene processing, latent evidence processing and analysis of materials and chemicals germane to forensic trace evidence. Advanced analytical chemistry techniques will be learned and applied to solve a 'crime' with suspects. Students will attempt to solve the crime and will present their analytical evidence in a courtroom setting with cross-examination.", "fall": true, "units": " 3"}, {"summer": true, "name": "Undergraduate Research in Polymer and Color Chemistry", "prerequisites": "Prerequisite: PCC 301 and PCC 461/CH 461 and (TE 303 or CH 331 or CH 433).", "spring": true, "number": "PCC  490", "descripton": "Faculty-supervised individual research for undergraduates in PCC.  Students must find an advisor from within the department with whom to work on a regular basis. Intended for PCC majors", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Seminar in Polymer and Color Chemistry", "prerequisites": "Prerequisite: Senior standing", "spring": true, "number": "PCC  491", "descripton": "Familiarizes student with the principal sources of polymer and color chemistry literature and emphasizes importance of keeping abreat of developments in the field.  Emphasizes fundamentals of technical writing.  Arranged. Intended for PCC majors3", "fall": true, "units": " 1"}, {"summer": true, "name": "Special Topics in Polymer and Color Chemistry", "spring": true, "number": "PCC  492", "descripton": "Presentation of material not normally available in regular course offerings or offering of new courses on a trial basis.  Credits and content determined by faculty member in consultation with the Department Head.", "fall": true, "units": " 3"}]