[{"summer": false, "name": "Alcohol, Drugs and Tobacco", "spring": true, "number": "PEH  212", "descripton": "Theories of drug use, pharmacology, tolerance, dependence, nicotine, alcohol usage, alcoholism, sedative-hypnotics, narcotics, amphetamines, cocaine, marijuana, hallucinogens, steroids and treatment. This course does not constitute credit toward meeting the Physical Education GER requirement", "fall": true, "units": " 2"}, {"summer": true, "name": "Human Sexuality", "spring": true, "number": "PEH  213", "descripton": "Physiological and psychosocial aspects of human sexuality. Emphasis placed on health-related topics of birth control, pregnancy, childbirth, abortion and sexually-transmitted diseases. Concepts of gender acquisition, sexual values, and sexual morality discussed as related to the promotion of healthy lifestyles within contemporary American culture.", "fall": true, "units": " 2"}, {"summer": true, "name": "Responding to Emergencies", "spring": true, "number": "PEH  280", "descripton": "This course introduces the basics of first aid treatment for the lay rescuer.  Topics include CPR, AED use, chocking and bleeding emergencies, and other basic first aid procedures.  This course does not satisfy the Physical Education GEP requirement.", "fall": true, "units": " 2"}, {"summer": true, "name": "Emergency Medical Responder", "spring": true, "number": "PEH  281", "descripton": "This course introduces the knowledge and skills necessary to respond appropriately in an emergency at the Emergency Medical Responder provider level.  Topics include: introduction to the EMS system, roles and responsibilities, medical/legal considerations, respiratory emergencies and ventilation devices, cardiac emergencies and cardio pulmonary resuscitation (CPR), automated external defibrillation (AED), patient assessment, medical emergencies, trauma management, special patients, and emergency medical service (EMS) operations.  This course does not satisfy the Physical Education GEP requirement.", "fall": true, "units": " 3"}, {"summer": false, "name": "Women's Health Issues", "spring": true, "number": "PEH  284", "descripton": "This course will review health and wellness issues affecting women through their life span. It will explore medical concerns and prevention as well as social health issues that disproportionately affect women in contemporary society. Discussions of current critical topics in women's health will also take place. Minor courses.", "fall": true, "units": " 2"}, {"summer": false, "name": "Personal Health", "spring": true, "number": "PEH  285", "descripton": "Behavior change, wellness, stress management, cardiovascular diseases, alcohol and tobacco use, cancer, infectious diseases, arthritis, human sexual response, sexual assault, contraception, and sexually transmitted diseases. This course does not constitute credit toward meeting the Physical Education GER requirement", "fall": true, "units": " 2"}, {"summer": false, "name": "Nutrition, Exercise and Weight Control", "spring": true, "number": "PEH  286", "descripton": "A nutrition, exercise and weight management program emphasizing the basics of proper nutrition and exercise.  Emphasis on lifestyle changes and their relationship to appropriate weight management. Medical request", "fall": true, "units": " 2"}, {"summer": false, "name": "Stress Management", "spring": true, "number": "PEH  287", "descripton": "Impact of stress upon the psychological and physiological function of the body.  Exploration and interaction with stress management techniques. This course does not constitute credit toward meeting the Physical Education GER requirement", "fall": true, "units": " 2"}, {"summer": false, "name": "Emergency Medical Technician Basic", "prerequisites": "Prerequisite: PEH 281", "spring": true, "number": ")  300", "descripton": "This course leads to eligibility for optional certification as an emergency medical technician basic with the state of North Carolina and the National Registry of Emergency Medical Technicians.  Topics include: roles and responsibilities; medical/legal considerations; respiratory/cardiac emergencies; CPR and airway adjuncts; bleeding and shock; trauma management; medical emergencies and their management; environmental emergencies; emergency childbirth; pediatrics; geriatrics; exposure to hazardous situations; introduction to hazardous materials; psychological emergencies; patient packaging and triage; stabilization and transport of the sick and injured; communications and report writing. Two Saturday classes are required.  Certification requires additional time, fees and internship liability insurance.", "fall": false, "units": " 4"}, {"summer": false, "name": "Emergency Medical Technician Intermediate I", "prerequisites": "Prerequisite: PEH 300 and EMT Basic Certification", "spring": true, "number": ")  301", "descripton": "This course, together with a second course in this series, leads to eligibility for optional certification as an Emergency Medical Technician Intermediate with the state of North Carolina and the National Registry of Emergency Medical Technicians.  Topics include: foundations of the EMT-Intermediate, overview of human systems, emergency pharmacology, venous access and medication administration, airway management and ventilation, history taking, techniques of physical examination, patient assessment in the field, clinical decision making, communications, documentation, trauma and trauma systems, blunt trauma, penetrating trauma, hemorrhage and shock, burns, thoracic trauma, abdominal trauma, and trauma management skills.  Two Saturday classes required.  Internship insurance required.", "fall": false, "units": " 4"}, {"summer": false, "name": "Prevention of Sexual Assault and Violence", "spring": true, "number": "PEH  335", "descripton": "Historical and cultural perspective on rape, sexual assault, and relationship violence will be presented. The course prepares students to deliver a standard outreach program that includes statistics, definitions, risk reduction techniques, medical, legal, psychological, community and campus resources.", "fall": true, "units": " 3"}, {"summer": false, "name": "Health Planning and Programming", "prerequisites": "Prerequisite: PEH 285 Personal Health", "spring": true, "number": "PEH  375", "descripton": "This course is designed to assist students in developing a foundation in health programming. Students will learn the necessary skills to develop, implement, and evaluate health education programs.", "fall": true, "units": " 2"}, {"summer": false, "name": "Methods of Health Promotion", "spring": true, "number": "PEH  377", "descripton": "This course focuses on methods and techniques for delivering health-related content to diverse populations.  Cooperative learning, critical thinking, peer educator training, and decision-making will be applied to various health dimensions.", "fall": true, "units": " 2"}, {"summer": false, "name": "Practicum in Health", "prerequisites": "Prerequisite: PEH 285, PEH 375, PEH 377, and 6 hours of electives from the Health Minor", "spring": true, "number": "PEH  493", "descripton": " Risk Management for details on acquiring the insurance and the current charge.", "fall": true, "units": " 1"}]