[{"summer": true, "name": "Introduction to Philosophy", "prerequisites": "Credit is not allowed for both PHI 205 and PHI 210.", "spring": true, "number": "PHI  205", "descripton": "Introduction to selected problems of enduring philosophical importance, including such topics as the nature of morality, knowledge, human freedom, and the existence of God. Content varies with different sections.", "fall": true, "units": " 3"}, {"summer": false, "name": "Representation, Reason and Reality", "prerequisites": "Credit is not allowed for both PHI 210 and PHI 205", "spring": true, "number": "PHI  210", "descripton": "This course is an introduction to philosophical issues concerning topics such as language, thought, knowledge, reason, truth, and reality through the study of problems, puzzles, and paradoxes. Not both PHI 205 and PHI 210 may be used towards satisfaction on PHI major or PHI minor requirements.", "fall": false, "units": " 3"}, {"summer": true, "name": "Issues in Business Ethics", "spring": true, "number": "PHI  214", "descripton": "An analysis and evaluation of major issues in business ethics.  Topics include the social responsibility of business; social justice and free enterprise; the rights and duties of employers, employees, manufacturers, and consumers; duties to the environment, the world's poor, future generations, and the victims of past injustices; the moral status of the corporation; and the ethics of advertising.", "fall": true, "units": " 3"}, {"summer": true, "name": "Contemporary Moral Issues", "spring": true, "number": "PHI  221", "descripton": "Philosophical analysis and theory applied to a broad range of contemporary moral issues, including euthanasia, suicide, capital punishment, abortion, war, famine relief, and environmental concerns.", "fall": true, "units": " 3"}, {"summer": false, "name": "Thinking Logically", "spring": false, "number": "PHI  250", "descripton": "Deductive arguments attempt to guarantee their conclusions. Inductive arguments attempt to make their conclusions more probable. Using a small number of simple, powerful logical techniques, this course teaches you how to find, analyze and evaluate deductive and inductive arguments, and thus how to avoid the most common errors in reasoning.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Special Topics in Philosophy", "spring": "True", "number": "PHI  298", "descripton": "Selected studies in philosophy that do not appear regularly in the curriculum. Topics will be announced for each semester in which the course is offered.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Ancient Philosophy", "spring": true, "number": "PHI  300", "descripton": "Western philosophy of the ancient world, with special emphasis on Plato and Aristotle.", "fall": true, "units": " 3"}, {"summer": false, "name": "Early Modern Philosophy", "spring": true, "number": "PHI  301", "descripton": "Western philosophy of the 17th and 18th centuries, including such philosophers as Descartes, Hobbes, Leibniz, Locke, Berkeley, Hume, and Kant.", "fall": true, "units": " 3"}, {"summer": false, "name": "19th Century Philosophy", "spring": false, "number": "PHI  302", "descripton": "Western philosophy of the 19th century, including such philosophers as Kant, Hegel, Schopenhauer, Kierkegaard, Marx, and Nietzsche.", "fall": false, "units": " 3"}, {"summer": false, "name": "Philosophy of Religion", "spring": false, "number": "PHI  305", "descripton": "The existence and nature of God, including such topics as traditional proofs of God, skeptical challenges to religious belief, miracles, the problem of evil, faith and reason, and religious experience.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Contemporary Political Philosophy", "prerequisites": "Prerequisite: One PHI course", "spring": "True", "number": "PHI  309", "descripton": "Current theories about basic concepts in political philosophy, such as liberty, equality, justice, natural rights, and democracy, with special attention to disputes concerning the nature of a just social order.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Existentialism", "spring": false, "number": "PHI  310", "descripton": "Philosophy of Existentialism, including such thinkers as Kierkegaard, Nietzsche, Doestoevsky, Sartre, Heidegger, and Camus.", "fall": false, "units": " 3"}, {"summer": false, "name": "Philosophy of Law", "spring": false, "number": "PHI  312", "descripton": "Fundamental legal issues such as what constitutes a law or legal system.  Justifications of legal interference with individual liberty. Philosophical legal issues illustrated by specific legal cases.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Ethical Problems in the Law", "prerequisites": "Prerequisite: PHI 221, 275, or 375", "spring": "True", "number": "PHI  313", "descripton": "Explores uses of the legal system, including such topics as the death penalty, plea bargaining, legalizing euthanasia, censorship, Good Samaritan laws, the insanity defense, civil disobedience, preferential treatment.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Bio-Medical Ethics", "spring": true, "number": ")  325", "descripton": "Interdisciplinary examination and appraisal of emerging ethical and social issues resulting from recent advances in the biological and medical sciences. Abortion, euthanasia, physician-assisted suicide, compromised infants, aids, reproductive technologies, and health care. Focus on factual details and value questions, fact-value questions, fact-value interplay, and questions of impact assessment and policy formulation.", "fall": true, "units": " 3"}, {"summer": false, "name": "Metaphysics", "prerequisites": "Prerequisite: One PHI course", "spring": false, "number": "PHI  330", "descripton": "Metaphysical problems: distinction between appearance and reality, nature of space and time, free will and determinism, mind and body, nature of identity.", "fall": false, "units": " 3"}, {"summer": false, "name": "Philosophy of Language", "prerequisites": "Prerequisite: One PHI course", "spring": false, "number": "PHI  331", "descripton": "Introduction to traditional and modern accounts of the relations between language and reality, the nature of truth, problems of intentionality and propositional attitudes.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Philosophy of Psychology", "prerequisites": "Prerequisite: One PHI course or one PSY course", "spring": "True", "number": "PHI  332", "descripton": "Problems and controversies that overlap the boundary between philosophy and psychology: the mind/body problem, behaviorism vs. cognitivism, the prospects for artificial intelligence, and language and the questions of innate knowledge.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Theory of Knowledge", "prerequisites": "Prerequisite: One PHI course", "spring": false, "number": "PHI  333", "descripton": "Analysis of such central concepts as knowledge, belief, and truth, and the investigation of the principles by which claims to knowledge may be justified.", "fall": false, "units": " 3"}, {"summer": true, "name": "Philosophy of Science", "spring": true, "number": "PHI  340", "descripton": "Nature of science highlighted by differences between science and pseudoscience, relationships between science and religion, and roles of purpose-directed (teleological) and causal explanation in physical, life and social sciences.", "fall": true, "units": " 3"}, {"summer": false, "name": "Ethics", "spring": true, "number": "PHI  375", "descripton": "Examination of traditional questions of philosophical ethics: What are the principles of moral conduct?  What sort of life is worthy of a human being?  Includes both classic and contemporary literature.", "fall": true, "units": " 3"}, {"summer": false, "name": "History of Ethics", "prerequisites": "Prerequisite: One PHI course", "spring": false, "number": "PHI  376", "descripton": "Topics in the history of ethics.  Philosophers to be studied may include Plato, Aristotle, Aquinas, Butler, Hume, Kant, Sidgwick and Nietzsche.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Kant's Critique of Pure Reason", "prerequisites": "Prerequisite: 6 credits in PHI. Credit is not allowed for both PHI 401 and PHI 501.", "spring": "True", "number": "PHI  401", "descripton": "A text-based critical study of Kant's Critique of Pure Reason Focusing on such topics as perception, judgment, knowledge, space, time, substance, causation and reality.  Students cannot receive credit for both PHI 401 and PHI 501.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Life Science Ethics", "prerequisites": "Prerequisite: One PHI course", "spring": "True", "number": "PHI  415", "descripton": "Recent work in normative evaluation of human actions affecting living things.  Advanced readings in moral theory, comparative value assessment, and public policy. Students cannot receive credit for both PHI 415 and PHI 515.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Global Justice", "prerequisites": "Prerequisite: One PHI course. Credit is not allowed for both PHI 420 and PHI 520.", "spring": "True", "number": "PHI  420", "descripton": "The applications of the ideas of justice and right beyond and across the borders of individual nation states, attending to the facts of globalization and their consequences for political and economic justice and human rights. Topics: skepticism about global justice; transnational distributive justice, pollution, and poverty; national sovereignty, self-determination, and intervention; the ethics of war; international human rights; and global democracy. No one can receive credit for both PHI 420 and PHI 520.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Philosophical Issues in Environmental Ethics", "prerequisites": "Prerequisite: One PHI course", "spring": false, "number": "PHI  422", "descripton": "Ethical questions about the environment; in particular, what obligations we have to the environment.  Topics: animal rights, obligations to species and ecosystems, intrinsic vs. extrinsic value, and policy implications of moral judgments. Students cannot receive credit for both PHI 422 and PHI 522. Students who have received credit for PHI 322 cannot receive credit for either PHI 422 or PHI 522.", "fall": false, "units": " 3"}, {"summer": false, "name": "Introduction to Cognitive Science", "prerequisites": "Prerequisite: One upper-level PHI, PSY, CSC or Linguistics course. Credit is not allowed for PHI 425 and PHI/PSY 525.", "spring": false, "number": ")  425", "descripton": "Philosophical foundations and empirical fundamentals of cognitive science, an interdisciplinary approach to human cognition. Topics include: the computational model of mind, mental representation, cognitive architecture, the acquisition and use of language.  Students cannot receive credit for both PHI/PSY 425 and PHI/PSY 525.", "fall": false, "units": " 3"}, {"summer": false, "name": "The Scientific Method", "prerequisites": "Prerequisite: One upper-level PHI course. Credit is not allowed for both PHI 440 and PHI 540.", "spring": false, "number": "PHI  440", "descripton": "Detailed examination of core issues in the philosophy of science: the confirmation of scientific theories, falsification, projectibility, the nature of scientific explanation, laws of nature, and causation. Students cannot receive credit for both PHI 440 and PHI 540.", "fall": false, "units": " 3"}, {"summer": false, "name": "Philosophy, Evolution and Human Nature", "prerequisites": "Prerequisite: One 300 level or higher course in Philosophy, Biology, Psychology or Anthropology. Credit is not allowed for PHI 447 and PHI 557.", "spring": false, "number": "PHI  447", "descripton": "This course covers philosophical issues in the evolutionary study of human cognition: the role of adaptationism; the values of psychological vs. behavioral approaches; the phenotypic gambit; the evolution of morality and altruism; the nature of culture and the possibility of cultural evolution; innateness, genetic determinism and development; and case studies of evolutionary explanation of human behavior or psychology.  Students cannot receive credit for both PHI 447 and PHI 547.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Ethical Theory", "prerequisites": "Prerequisite: PHI 375 or PHI 376. Credit is not allowed for both PHI 475 and PHI 575.", "spring": "True", "number": "PHI  475", "descripton": "An introduction to some central themes and issues in ethical theory.  Topics in normative and meta-ethics such as consequentialism, deontology, virtue ethics, constructivism, realism, relativism, subjectivism, and expressivism. Readings primarily from contemporary literature.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Research and Writing in Ethics", "prerequisites": "Corequisite: One of (PHI 275,298,306,309,310, 311, 313,325,375, 376, 420, 422, 475, or 498)", "spring": true, "number": "PHI  494", "descripton": "A substantial paper in ethics, assigned by the instructor of the corequisite; enrollment subject to departmental approval; may be repeated for credit.", "fall": true, "units": " 1"}, {"summer": false, "name": "Research and Writing in History of Philosophy", "prerequisites": "Prerequisite: PHI 250, LOG 201 or 335 and one other PHI course, Corequisite: One of PHI 298, 300, 301, 302, 303, 310, 401 or 498", "spring": true, "number": "PHI  495", "descripton": "A substantial paper in history of philosophy, assigned by the instructor of the corequisite; enrollment subject to departmental approval; may be repeated or credit.", "fall": true, "units": " 1"}, {"summer": false, "name": "Research and Writing in Contemporary Philosophy", "prerequisites": "Prerequisite: PHI 250, LOG 201 or 335 and one other PHI course, Corequisite: One of PHI 298, 305, 306, 330, 331, 332, 333, 340, 425, 440, 445, 447 or 498", "spring": true, "number": "PHI  496", "descripton": "A substantial paper in contemporary philosophy, assigned by the instructor of the corequisite; enrollment subject to departmental approval; may be repeated for credit.", "fall": true, "units": " 1"}, {"summer": false, "name": "Research and Writing in Logic, Representation and Reasoning", "prerequisites": "Prerequisite: LOG 201 or 335, and one other PHI course, not PHI 250, Corequisite: One of LOG 335, 435/535, 437, PHI 298, 330, 331, 332, 333, 340, 425/525, 440/540, 445/545, 447", "spring": true, "number": "PHI  497", "descripton": "A substantial paper in logic, representation and reasoning, assigned by the instructor of the corequisite. enrollment subject to departmental approval; may be repeated for credit", "fall": true, "units": " 1"}, {"summer": false, "name": "Special Topics in Philosophy", "prerequisites": "Prerequisite: Six credits in PHI courses", "spring": true, "number": "PHI  498", "descripton": "Detailed investigation of selected topics in  philosophy. Topics determined by faculty members in consultation with head of the department. Course may be used for individualized study.", "fall": true, "units": " 1-6"}, {"summer": "True", "name": "Kant's Critique of Pure Reason", "prerequisites": "Prerequisite: Graduate Standing. Credit is not allowed for both PHI 501 and PHI 401.", "spring": "True", "number": "PHI  501", "descripton": "A text-based critical study of Kant's Critique of Pure Reason focusing on topics such as perception, judgment, knowledge, space, time, substance, causation, and reality.  Students cannot receive credit for both PHI 401 and PHI 501.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Global Justice", "prerequisites": "Prerequisite: Graduate standing. Credit is not allowed for both PHI 520 and PHI 420.", "spring": "True", "number": "PHI  520", "descripton": "The applications of the ideas of justice and right beyond and across the borders of individual nation states, attending to the facts of globalization and their consequences for political and economic justice and human rights. Topics: skepticism about global justice; transnational distributive justice, pollution, and poverty; national sovereignty, self-determination, and intervention; the ethics of war; international human rights; and global democracy. Students cannot receive credit for both PHI 420 and PHI 520.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Introduction To Cognitive Science", "prerequisites": "Prerequisite: Graduate standing. Credit is not allowed for PHI 525 and PHI/PSY 425.", "spring": "True", "number": ")  525", "descripton": "Philosophical foundations and empirical fundamentals of cognitive science, an interdisciplinary approach to human cognition. The computational model of mind, mental representation, cognitive architecture, the acquisition and use of language. Students cannot receive credit for both PHI/PSY 425 and PHI/PSY 525.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "The Scientific Method", "prerequisites": "Prerequisite: Graduate standing. Credit is not allowed for both PHI 540 and PHI 440.", "spring": "True", "number": "PHI  540", "descripton": "Detailed examination of core issues in philosophy of science: confirmation of scientific theories, falsification, projectibility, nature of scientific explanation, laws of nature, and causation. Students cannot receive credit for both PHI 440 and PHI 540.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Philosophy, Evolution and Human Nature", "prerequisites": "Credit is not allowed for both PHI 557 and PHI 447.", "spring": "True", "number": "PHI  547", "descripton": "Core philosophical issues in the evolutionary study of human cognition: the role of adaptationism; the value of psychological vs. behavioral approaches; the phenotypic gambit; the evolution of mortality and altruism; the nature of cultural evolution; innateness, genetic determinism and development; and case studies of evolutionary explanation of human behavior and psychology.  Students cannot receive credit for both PHI 447 and PHI 547.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Ethical Theory", "prerequisites": "Prerequisite: Graduate Standing. Credit is not allowed for both PHI 575 and PHI 475.", "spring": "True", "number": "PHI  575", "descripton": "An introduction to some central themes and issues in ethical theory.  Topics in normative and meta-ethics such as consequentialism, deontology, virtue ethics, constructivism, realism, relativism, subjectivism, and expressivism.  Readings primarily from contemporary literature. Students cannot receive credit for both PHI 475 and PHI 575.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Special Topics in Philosophy", "spring": true, "number": "PHI  598", "fall": true, "units": " 3"}, {"summer": "True", "name": "Summer Thesis Res", "spring": "True", "number": "PHI  696", "fall": "True", "units": " 1"}, {"summer": "True", "name": "Advanced Topics In Philosophy", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "PHI  798", "descripton": "Detailed investigation of selected advanced topics in philosophy. Topics determined by faculty members in consultation with head of department.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Introduction to Research Ethics", "prerequisites": "Prerequisite: Graduate standing", "spring": "True", "number": "PHI  816", "descripton": "Institutional rules guiding the responsible conduct of research (RCR) and their philosophical justification.  Rudiments of moral reasoning and their application to RCR.  Topics: plagiarism, falsification and fabrication of data, and ethics versus custom, law, science, and religion.", "fall": "True", "units": " 1"}, {"summer": "True", "name": "Summer Dissert Res", "spring": "True", "number": "PHI  896", "fall": "True", "units": " 1"}]