[{"summer": false, "name": "Principles of Livestock and Poultry Production", "spring": true, "number": "PO  100", "descripton": "General Information on production practices for poultry, beef cattle, dairy cattle, sheep, goats, horses, pigs, and aquaculture.  The student will learn general terminology, reproductive systems, nutrition, management, animal selection, animal welfare, marketing, and meats.  There is no lab for this course.  Offered via distance education.  The prerequisite is a high school diploma or equivalent.", "fall": false, "units": " 3"}, {"summer": false, "name": "Poultry Science and Production", "prerequisites": "Co-requisite: PO 202", "spring": true, "number": "PO  201", "descripton": "Fundamental principles of broiler, turkey and egg production including poultry physiology, breeding, incubation, housing, nutrition, disease control, management and marketing.", "fall": true, "units": " 3"}, {"summer": false, "name": "Poultry Science and Production Laboratory", "prerequisites": "Corequisite: PO 201", "spring": true, "number": "PO  202", "descripton": "This laboratory course will cover the fundamental principles of broiler, turkey and egg production including poultry physiology, breeding, incubation, housing, nutrition, disease control, management and marketing. This course includes field trips for which transportation will be provided.", "fall": true, "units": " 1"}, {"summer": false, "name": "Poultry Seminar", "prerequisites": "Prerequisite: Sophomore standing", "spring": false, "number": "PO  290", "descripton": "Exploration of topics related with current and future potential to influence the poultry industry.  Guest lectures from industry representatives will include: vertically integrated poultry production, primary breeders, marketing, animal health, veterinary medicine as it relates to poultry, allied equipment manufacturers, and management of poultry companies.  Special emphasis on summer internships and career services.", "fall": true, "units": " 1"}, {"summer": false, "name": "Muscle Foods and Eggs", "prerequisites": "Prerequisite: ZO 160, BIO 181 or BIO 183", "spring": false, "number": ")  322", "descripton": "Processing and preserving fresh poultry, red meats, seafood, and eggs.  Ante- and post-mortem events as they affect quality, yield, and compositional characteristics of muscle foods.  Principles and procedures involved in the production of processedmeat items.", "fall": true, "units": " 3"}, {"summer": false, "name": "Live Poultry and Poultry Product Evaluation, Grading, and Inspection", "prerequisites": "Prerequisite: PO 201", "spring": false, "number": "PO  340", "descripton": "To provide students with experience handling live poultry as well as working with an learning about USDA grades and evaluation of poultry meat, meat products, and eggs. Develop an understanding of product specifications.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to HACCP", "spring": true, "number": ")  350", "descripton": "Introductory course on the Hazard Analysis and Critical Control Points System (HACCP) which is designed to decrease hazards in foods.  An International HACCP Alliance approved curriculum which covers prerequisite programs.  A step by step approach for developing and implementing a HACCP plan for USDA regulated food processing plants. Offered only as a world wide web course through the Office of Instructional Telecommunications.", "fall": true, "units": " 3"}, {"summer": false, "name": "Avian Anatomy and Physiology", "prerequisites": "Prerequisite: PO 201", "spring": false, "number": "PO  404", "descripton": "Principles of avian physiology integrating physiological functions and anatomical structures of organs and organ systems. Practical problems associated with poultry production. The importance of maximizing growth and productivity via exploitation ofenvironmental influences on physiological systems.", "fall": true, "units": " 4"}, {"summer": false, "name": "Avian Anatomy and Physiology", "prerequisites": "Prerequisite: PO 201", "spring": false, "number": "PO  405", "descripton": "Principles of avian physiology integrating physiological functions and anatomical structures of organs and organ systems. Practical problems associated with poultry production. The importance of maximizing growth and productivity via exploitation ofenvironmental influences on physiological systems.", "fall": true, "units": " 4"}, {"summer": false, "name": "Physiological Aspects of Poultry Management", "prerequisites": "Prerequisite: PO 201, Corequisite: PO 407", "spring": false, "number": "PO  406", "descripton": "Application of physiological principles to modern poultry management and research. Poultry physiology will be related to practical and research management topics including nutrition, housing, ventilation, disease, heat stress, and lighting programs. Students cannot receive credit for both PO 406 and PO 506.", "fall": true, "units": " 3"}, {"summer": false, "name": "Physiological Aspects of Poultry Management Laboratory", "prerequisites": "Prerequisite: PO 201, Corequisite: PO 406", "spring": false, "number": "PO  407", "descripton": "Practical experience with poultry husbandry, animal environment management, and feeding in a research environment  Laboratory exercises include feeding and nutrition programs, weighing birds, lighting management and infrastructure, biosecurity and sanitation, vaccinations, hatching egg management, brooding, ventilation programs and infrastructure, housing design and infrastructure, SOP development, human safety and health training, and animal care training.  Laboratory exercises will prepare students for both commercial poultry industry and animal research management careers.  Co-requisite with PO 406.  Personal transportation to Chicken Educational Unit required.", "fall": true, "units": " 1"}, {"summer": "True", "name": "Production and Management of Game Birds in Confinement", "spring": "True", "number": "PO  410", "descripton": "Management principles associated with the successful propagation and rearing of game birds, ornamental birds and waterfowl in confinement. Housing and pen requirements, nutrition, disease control and regulatory issues included.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Agrosecurity", "prerequisites": "Junior standing or above", "spring": true, "number": "PO  411", "descripton": "This course is designed to increase the awareness of the issues and vulnerabilities of the IS agricultural system, the importance of agriculture in the US economy, and the importance of protecting it from disease and/or attack. This course is organized to integrate and assimilate knowledge across multiple disciplines including agriculture, animal health, human health, infectious diseases, business, economics, and public policy. Students will identify and analyze the interactions between these disciplines in light of increasing population and concentrated agriculture's increased vulnerability to major disruptions in food production. Students will also analyze where potential links in the food chain are susceptible to disruptions by individuals (or natural disasters), the consequences of these disruptions, and how to minimize the associated risks by developing case studies and strategies for defending against specific threats. Students must have junior standing.", "fall": false, "units": " 3"}, {"summer": false, "name": "Comparative Nutrition", "prerequisites": "Prerequisite: ANS 225 or ANS 230 or CH 220 or CH 223", "spring": false, "number": ")  415", "descripton": "Principles of nutrition, including the classification of nutrients and the nutrient requirements of and metabolism by different species for health, growth, maintenance and productive functions.", "fall": true, "units": " 3"}, {"summer": false, "name": "Commercial Egg Production", "prerequisites": "Prerequisite: PO 201", "spring": true, "number": "PO  421", "descripton": "Principles and current practices of commercial egg production.", "fall": true, "units": " 2"}, {"summer": false, "name": "Incubation and Hatchery Management", "prerequisites": "Prerequisite: PO 201", "spring": false, "number": "PO  422", "descripton": "Principles and current practices of hatching egg production, incubation, and hatchery management, beginning with the placement of broiler breeder chicks on the breeder farm and ending with the placement of chicks at the brooding facility.", "fall": true, "units": " 2"}, {"summer": false, "name": "Poultry Meat Production", "prerequisites": "Prerequisite: PO 201", "spring": true, "number": "PO  424", "descripton": "Principles and current practices of vertically integrated broiler and turkey production; encompassing management, nutrition, poultry health, environmental, and related areas.", "fall": false, "units": " 3"}, {"summer": false, "name": "Feed Manufacturing Technology", "spring": true, "number": ")  425", "descripton": "Feed mill management, feed ingredient purchasing, inventory, storage, and quality evaluation, computerized feed formulation, feeding programs for poultry and swine, feed mill design, equipment, maintenance, operation, safety, state and federal regulations pertaining to feed manufacture.", "fall": false, "units": " 3"}, {"summer": false, "name": "Poultry Processing and Products", "prerequisites": "Prerequisite: PO 201", "spring": false, "number": "PO  433", "descripton": "Poultry processing, further processing, and resulting products as affected by basic muscle composition and function during the conversation of muscle to meat. Microbiology of spoilage and pathogenic organisms, and the regulatory and HACCP programs designed to minimize problems. Overall business functions of poultry processing to understand profit/loss factors, and skills necessary for communication and management. Various sections on sanitary design/construction, pest control, wastewater treatment, and further processed egg products. Credit for both PO 533 and PO 433 is not allowed. Transportation to field trips will be provided. Non-scheduled class time for field trips or out-of-class activities may be required for this class. Transportation to scheduled labs at Lake Wheeler CEU/Poultry Processing Lab will be provided by students.", "fall": true, "units": " 3"}, {"summer": false, "name": " Breeding", "prerequisites": "Prerequisite: PO 201", "spring": true, "number": "PO  435", "descripton": "Principles and current practices of modern poultry incubation and breeding production systems.  Students will be able to describe basic elements of breeding management and production practices, to apply those elements to specific scenarios, and to strengthen their ability to interpret and make critical judgements relative to the breeding of poultry, production of hatching eggs, and the subsequent incubation and hatching process.", "fall": false, "units": " 4"}, {"summer": false, "name": "External Learning Experience", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "PO  492", "descripton": "A learning experience in agriculture and life sciences within an academic framework that utilizes facilities and resources which are external to the campus. Contact and arrangements with prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior to the experience.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Special Problems in Poultry Science", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "PO  493", "descripton": "A learning experience in agriculture and life sciences within an academic framework that utilizes campus facilities and resources. Contact and arrangements with prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior to the experience.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Special Topics in Poultry Science", "spring": true, "number": "PO  495", "descripton": "Offered as needed to present materials not normally available in regular course offerings or for offering of new courses on a trial basis.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Physiological Aspects Of Poultry Management", "prerequisites": "Prerequisite: PO 201, PO 405 or Graduate standing", "spring": true, "number": "PO  505", "descripton": "Application of physiological principles to modern poultry management. Poultry physiology related to management topics including nutrition, housing, ventilation, disease, heat stress and lighting programs.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Poultry Product Safety: An On-Farm Model", "spring": "True", "number": "PO  510", "fall": "True", "units": " 3"}, {"summer": true, "name": "Advanced Comparative Nutrition", "spring": true, "number": ")  515", "descripton": "An in-depth presentation of core nutrition principles stressing the role nutrient availability plays in digestive and metabolic adaptations of a variety of animal species.  Consideration will be given to translational biomedical nutrition issues that apply to both human and animal health.  Students are expected to develop a term paper suitable for submission in a peer-reviewed scientific journal that reviews the latest information in metabolic or digestive adaptations of a specific species as related to nutritional processes. Credit will not be allowed for both ANS/NTR/PO 415 comparative Nutrition and NTR/PO 515 Advanced Comparative Nutrition.", "fall": true, "units": " 3"}, {"summer": false, "name": "Comparative Endocrinology", "prerequisites": "Prerequisite: BIO 421 or PO 405", "spring": true, "number": ")  524", "descripton": "Basic concepts of endocrinology, including functions of major endocrine glands involved in processes of growth, metabolism and reproduction.", "fall": false, "units": " 3"}, {"summer": false, "name": "Poultry Processing and Products", "prerequisites": "Prerequisite: PO 201", "spring": false, "number": "PO  533", "descripton": "Poultry processing, further processing, and resulting products as affected by basic muscle composition and function during the conversation of muscle to meat. Microbiology of spoilage and pathogenic organisms, and the regulatory and HACCP programs designed to minimize problems. Overall business functions of poultry processing to understand profit/loss factors, and skills necessary for communication and management. Various sections on sanitary design/construction, pest control, wastewater treatment, and further processed egg products. Credit for both PO 533 and PO 433 is not allowed. Transportation to field trips will be provided. Non-scheduled class time for field trips or out-of-class activities may be required for this class. Transportation to scheduled labs at Lake Wheeler CEU/Poultry Processing Lab will be provided by students.", "fall": true, "units": " 3"}, {"summer": false, "name": "Animal Cell Culture Techniques", "prerequisites": "Prerequisite: BIT 360 or BIT 810 equivalent", "spring": true, "number": ")  566", "descripton": "Introduction to animal cell culture techniques.  Aseptic technique for vertebrate cell culture, media formulation, primary cell culture, long-term maintenance of cell lines, application of molecular techniques to in vitro situations.  Half semester course, second part.", "fall": false, "units": " 2"}, {"summer": false, "name": "Feed and Ingrdient Quality Assurance", "prerequisites": "Prerequisite: NTR(FM) 525", "spring": false, "number": ")  580", "descripton": "The course will teach students the principles of feed and ingredient quality assurance and how to develop a comprehensive quality assurance program. The course will include the development of an approved supplier list, ingredient specifications, feed manufacturing quality assurance procedures, and risk based feed safety programs.", "fall": true, "units": " 3"}, {"summer": true, "name": "Special Problems in Poultry Science", "spring": true, "number": "PO  590", "descripton": ".", "fall": true, "units": " 3"}, {"summer": true, "name": "Seminar", "spring": true, "number": "PO  601", "descripton": "Preparation for research, research perspectives, rising concerns in poultry production, orientation for graduate studies in poultry science. Required of all graduate students in the Department of Poultry Science.", "fall": true, "units": " 1"}, {"summer": true, "name": "Special Problems", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "PO  620", "descripton": "Specific problems of study assigned in various phases of poultry science.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "PO  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "PO  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "PO  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": false, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "PO  690", "descripton": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "PO  693", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "PO  695", "descripton": "Thesis Research", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "PO  696", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": false, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "PO  699", "descripton": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Comparative Immunology", "prerequisites": "Prerequisite: MB 751 or MB 441 or BIO 414", "spring": true, "number": ")  757", "descripton": "Compare and contrast the immune system structure and function of animal species of agricultural and veterinary significance with that of humans and traditional biomedical model organisms.  Discuss key evolutionary differences, how different species use different mechanisms to achieve the same outcomes, and the clinical implications for these differences.", "fall": false, "units": " 3"}, {"summer": false, "name": "Mineral Metabolism", "prerequisites": "Prerequisite: ANS(NTR,PO) 415, BCH 451 and ZO 421", "spring": false, "number": ")  775", "descripton": "Requirements, function, distribution, absorption, excretion and toxicity of minerals in humans and domestic animals. Interactions between minerals and other factors affecting mineral metabolism or availability. Emphasis on mechanisms associated withmineral functions and the metabolic bases for the development of signs of deficiency.", "fall": true, "units": " 3"}, {"summer": false, "name": "Graduate Seminar In Poultry Science", "spring": false, "number": "PO  801", "descripton": "Preparation for research, research perspectives, rising concerns in poultry production, orientation for graduate studies in poultry science. Required of all graduate students in the Department of Poultry Science.", "fall": true, "units": " 1"}, {"summer": false, "name": "Special Problems In Poultry Science", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "PO  820", "descripton": "Specific problems of study assigned in various phases of poultry science.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "PO  885", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planing for the teaching assignment, observe and provide feedback to the student during the teaching assignment and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "PO  890", "descripton": "For students who are preparing for and taking written and/or oral preliminary exams.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "PO  893", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "PO  895", "descripton": "Dissertation Research", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "PO  896", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "PO  899", "descripton": "For students who have completed all credit hour requirements, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations.", "fall": true, "units": " 1-3"}]