[{"summer": "True", "name": "Introduction to Plant Molecular Biology", "spring": "True", "number": "PP  150", "descripton": "Hands-on introduction to modern molecular biology techniques.  Isolation of SNA from tobacco leaves, isolating a plant gene through polymerase chain reaction (PCR), cloning DNA fragments in plasmid vectors, bacterial transformation and plasmid DNA purification, restriction digestion and gel electrophoresis, gene transfer and expression of reporter genes in plant cell lines through a biolistic gene gun.  Field trips, poster assignment and poster presentation are mandatory.  This course is part of the Summer College in Biotechnology and Life Sciences (SCIBLS) and other pre-college, transitional and early-college programs. Students must have no more than 30 credit hours.  Deparment approval required.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Kingdom of Fungi", "prerequisites": "Prerequisite: Any 100-level course in Biology or 200-level course in Plant Biology", "spring": true, "number": "PP  222", "descripton": "Influence and impact of fungi in our world. The role of fungi in history, ecology, medicine, human and plant diseases, industry, food and politics. Mushrooms, molds, mildews and symbiosis.", "fall": true, "units": " 3"}, {"summer": false, "name": "Principles of Plant Pathology", "spring": false, "number": "PP  315", "descripton": "Fundamental principles of plant pathology with emphasis on disease etiology, nature of pathogenesis, ecology of host/parasite interaction, epidemiology of plant diseases, current strategies and practices for integrated disease control.", "fall": true, "units": " 4"}, {"summer": false, "name": "Forest Pathology", "prerequisites": "Prerequisite: PB 200", "spring": true, "number": ")  318", "descripton": "Major diseases of forest trees and deterioration of wood products emphasizing principles of plant pathology; diagnosis; nature, physiology, ecology, and dissemination of disease-causing agents; mechanisms of pathogenesis; epidemiology and environmental influences; principles and practices of control.", "fall": false, "units": " 3"}, {"summer": false, "name": "Challenges in Plant Resource Protection", "prerequisites": "Prerequisite: CS 414 or ENT 425 or PP 315", "spring": true, "number": ")  450", "descripton": "This course provides applied training to students in the scientific and regulatory aspects of plant protection using real-world studies, scenarios, and addressing important contemporary issues for safeguarding American agriculture.  Students will gain hands-on problem solving abilities regarding the diagnosis, containment, and mitigation of  introduced plant pests and pathogens.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Fundamentals of (Pest) Risk Analysis", "spring": "True", "number": ")  460", "descripton": "This course provides students with a historical perspective as well as real-time exposure to working professionals involved in the development of risk analysis documents for plant protection.  The course uses real world scenarios and addresses contemporary issues facing scientists and regulators tasked with safeguarding American agriculture.  Students will gain hands-on problem solving abilities regarding the identification and mitigation of plant pathogens, insects, and noxious weeds that can be introduced into the USA through international trade in agricultural commodities.", "fall": "True", "units": " 1"}, {"summer": false, "name": "Advanced Turfgrass Pest Management", "prerequisites": "Prerequisite: C- or better in CS 200", "spring": true, "number": ")  470", "descripton": "Characteristics and ecology of turfgrass weed, insect, and disease pests; identification and diagnosis of turfgrass pests, strategies for managing pests including cultural, mechanical, biological, and chemical methods; development of integrated pestmanagement programs, characteristics and modes of action for herbicides, insecticides, fungicides, and plant growth regulators; behavior and fate of pesticides in soil; and the development and management of pesticide resistant pest populations.", "fall": false, "units": " 2"}, {"summer": false, "name": "External Learning Experience", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "PP  492", "descripton": "A learning experience in agriculture and life sciences within an academic framework that utilizes facilities and resources which are external to the campus. Contact and arrangements with prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior to the experience.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Special Problems in Plant Pathology", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "PP  493", "descripton": "A learning experience in agriculture and life sciences within an academic framework that utilizes campus facilities and resources. Contact and arrangements with prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior to the experience.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Special Topics in Plant Pathology", "spring": true, "number": "PP  495", "descripton": "Offered as needed to present materials not normally available in regular course offerings or for offering of new courses on a trial basis.", "fall": true, "units": " 1-3"}, {"summer": "True", "name": "Plant Disease: Principles, Diagnosis and Management", "prerequisites": "Prerequisite: B.S. degree in Plant Sciences", "spring": "True", "number": "PP  500", "descripton": "A one-semester survey of plant pathology.  Principles of plant pathology for diagnosis and control of plant diseases, principally for county agents and non-plant pathology graduate students.", "fall": "True", "units": " 4"}, {"summer": false, "name": "Biology of Plant Pathogens", "prerequisites": "Prerequisite: PP 315, or PP 318, or an introductory course in microbiology", "spring": false, "number": ")  501", "descripton": "Biology of microbes that cause plant diseases.  The ecology, genetics, physiology, taxonomy, and mechanisms of parasitism, pathogenicity and virulence of bacteria (and other prokaryotes), fungi (and oomycetes), nematodes, and viruses that cause plant diseases.  Prepares graduate students for advanced courses in plant pathology, host-parasite interactions, and provides a knowledge base for students in other disciplines involved with plant pathogens or who seek to broaden their knowledge of microbes.", "fall": true, "units": " 3"}, {"summer": false, "name": " Diagnosis", "prerequisites": "Prerequisite: PP 315", "spring": false, "number": ")  502", "descripton": "Introduction to the basic principles of disease causality in plants and the methodology for the study and diagnosis of plant diseases caused by fungi.  Identification of plant-pathogenic fungi.  Research project, disease profiles and field trips arerequired.", "fall": true, "units": " 2"}, {"summer": false, "name": "Epidemiology and Plant Disease Control", "prerequisites": "Prerequisite: PP 315 or PP 318", "spring": true, "number": "PP  506", "descripton": "Consideration of fundamental concepts and principles of epidemiology as applied to modern strategies of plant disease control. Special consideration given to evaluation of current techniques for control of fungal, bacterial, viral and nematode pathogens in an integrated crop protection system.", "fall": false, "units": " 3"}, {"summer": false, "name": "Agriculture, Ethics and the Environment", "spring": false, "number": "PP  530", "descripton": "Case studies in ethical theory and moral issues in agriculture and life sciences research including ethical theories, populations, food, ozone depletion, soil quality, sustainable and organic agriculture, plant biotechnology and biodiversity, animalrights and welfare, water quality, pesticides, risk assessment, biologically-based pest management, environmental policy and research ethics.  Students are active participants and use role playing to present a forum.", "fall": true, "units": " 3"}, {"summer": false, "name": "Tropical Plant Pathology", "spring": true, "number": "PP  540", "descripton": "Class introduces students to agriculture in the tropics and disease on tropical crops including cacao, banana, potato, root vegetables and coffee will be given. Trade issues relevant to US and Central American farmers are discussed. A week long trip Costa Rice in the summer and tours of coffee, banana, pineapple, tropical fruit, cacao and vegetable farms in the country is required. Learn about the diseases, social and political issues facing farmers in the developing world.", "fall": false, "units": " 2"}, {"summer": false, "name": "Introduction to Mycology", "spring": false, "number": ")  575", "descripton": "A survey of the fungal kingdom in context of phyla and classes.  Systematics, ecology, biology and utilization.  Illustrative material, cultural techniques in laboratories.  Collection and paper required.", "fall": true, "units": " 4"}, {"summer": true, "name": "Special Topics", "spring": true, "number": "PP  590", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Seminar", "spring": true, "number": "PP  601", "descripton": "Discussion of assigned phytopathological topics.", "fall": true, "units": " 1"}, {"summer": true, "name": "Special Topics", "spring": true, "number": "PP  610", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Advanced Special Topics in Plant Pathology", "prerequisites": "Prerequisite: PP 501, 502, Corequisite: ST 511", "spring": true, "number": "PP  615", "descripton": "Offered as needed to present materials not normally available in regular course offerings or for offering of new courses on a trial basis.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Special Problems", "spring": true, "number": "PP  620", "descripton": "Investigation of special problems in plant pathology not related to thesis problem. Investigations may consist of original research and/or literature survey.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "PP  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "PP  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "PP  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": false, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "PP  690", "descripton": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "PP  693", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": false, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "PP  695", "descripton": "Thesis research.", "fall": true, "units": " 1-9"}, {"summer": "True", "name": "Summer Thesis Res", "spring": "True", "number": "PP  696", "fall": "True", "units": " 1"}, {"summer": true, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "PP  699", "descripton": "Original research in plant pathology.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Plant Microbe Interactions", "prerequisites": "Prerequisite: PP 501", "spring": true, "number": "PP  707", "descripton": "Fundamental concepts and current status of research on the physiology, biochemistry and molecular biology of host-pathogen interactions during plant disease.  Topics include recognition, penetration and colonization, pathogenicity and virulence determinants, resistance mechanisms, sign transduction, programmed cell death, and other current topics.  Information presented in context of virual-, bacterial-, fungal-and nematode-plan interactions.Credit cannot be received for both PP 507 and PP 707", "fall": false, "units": " 3"}, {"summer": "True", "name": "Applied Evolutionary Analysis of Population Genetic Data", "spring": "True", "number": ")  715", "descripton": "This course will introduce nonparametric and model-based methods for making inferences on population processes (mutation, migration, drift, recombination, and selection).  The goal is to provide a conceptual overview of these methods and hands-on training on  how to implement and interpret the results.  Sample data sets in computer laboratories will integrate summary statistic, cladistic, coalescent, and bayesian approaches to examine population processes in different pathosystems with specific emphasis on eukaryotic microbes, viruses and bacteria.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Ecology of Soil Ecosystems", "prerequisites": "Prerequisite: One course in: (SSC 332, SSC 511, SSC 521, or SSC 532), or ecology (BO 360 or CS 430), or microbiology (MB 351), or consent of instructor.", "spring": false, "number": "PP  727", "descripton": "An interdisciplinary course primarily focusing on the interactions between soil organisms and their environment, and the ecological consequences of these diverse complex interactions.  A broad range of topics, including soil biodiversity, plant-microbial interactions, trophic interactions, energy flow and nutrient cycling, and microbial controls over plant and ecosystem responses to natural and anthropogenic perturbation (e.g, tillage or global change components) are addressed.", "fall": true, "units": " 3"}, {"summer": false, "name": "Soilborne Plant Pathogens", "prerequisites": "Prerequisite: PP 501, 502", "spring": false, "number": "PP  728", "descripton": "In-depth study of ecology of soilborne fungal and bacterial pathogens inducing root and wilt diseases in plants. Concepts and principles including but not limited to the rhizosphere, inoculum potential, soil fungistasis, survival, root disease models and biological control.", "fall": true, "units": " 3"}, {"summer": false, "name": "Fungal Genetics and Physiology", "prerequisites": "Prerequisite: BCH 451, BO 775, GN 411 or PP 501", "spring": true, "number": ")  730", "descripton": "Basic concepts of genetics and physiology of fungi, with emphasis on saprophytic and plant pathogenic mycelial fungi. Current literature on evolution, cell structure, growth and development, gene expression, metabolism, sexual and asexual reproduction and incompatibility systems. Laboratory exercises on mutant isolation, sexual and parasexual analysis, genetic transformation, and RFLP and isozyme analysis.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Special Topics", "spring": "True", "number": "PP  790", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Advanced Special Topics", "spring": "True", "number": "PP  795", "fall": "True", "units": " 1"}, {"summer": false, "name": "Seminar In Plant Pathology", "spring": true, "number": "PP  801", "descripton": "Discussion of assigned phytopathological topics.", "fall": true, "units": " 1"}, {"summer": true, "name": "Special Topics", "spring": true, "number": "PP  810", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Advanced Special Topics", "spring": true, "number": "PP  815", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Special Problems In Plant Pathology", "spring": true, "number": "PP  820", "descripton": "Investigation of special problems in plant pathology not related to thesis problem. Investigations may consist of original research and/or literature survey.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "PP  885", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "PP  890", "descripton": "For students who are preparing for and taking written and/or oral preliminary exams.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "PP  893", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "PP  895", "descripton": "Dissertation Research", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "PP  896", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "PP  899", "descripton": "For students who have completed all credit hour requirements, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree and are writing and defending their dissertations.", "fall": true, "units": " 1-3"}]