[{"summer": false, "name": "Topics in Scholarship, Leadership, and Service II", "prerequisites": "Prerequisite: PRK 101, restricted to Park Scholars", "spring": true, "number": "PRK  102", "descripton": "Interdisciplinary seminar with distinguished speakers and community leaders.  A one-two day, off-campus trip will develop student leadership skills through examination of leadership challenges facing North Carolina.  Volunteer work with an off-campus service agency will build awareness of community needs and how to address those needs.  Students may need to use public transportation, which is free to NC State students with their id, to perform required public service.  Restricted to Park Scholars.", "fall": false, "units": " 0"}, {"summer": false, "name": "Topics in Scholarship, Leadership and Service IV", "prerequisites": "Prerequisite: PRK 201, restricted to Park Scholars", "spring": true, "number": "PRK  202", "descripton": "Interdisciplinary seminar includes speaker seminars and organizing Service Raleigh, a major spring service project.  Planning begins for senior year enrichment activities.  Students may need to use public transportation, which is free to NC State Students with their id, to perform required public service.  Restricted to Park Scholars.", "fall": false, "units": " 0"}, {"summer": false, "name": "Topics in Scholarship, Leadership, and Service VI", "prerequisites": "Prerequisite: PRK 301, restricted to Park Scholars", "spring": true, "number": "PRK  302", "descripton": "Interdisciplinary seminar to develop leadership skills through a Leadership Academy, attendance at various speaker seminars and dinners, and through continued community volunteerism.  The Leadership Academy is a half-day workshop in February and builds on the skills from the fall Leadership Academy.  Students may need to use public transportation, which is free to NC State Students with their id, to perform required public service.  Restricted to Park Scholars.", "fall": false, "units": " 0"}, {"summer": false, "name": "Topics in Scholarship, Leadership and Service VIII", "prerequisites": "Prerequisite: PRK 401, restricted to Park Scholars", "spring": true, "number": "PRK  402", "descripton": "Interdisciplinary seminar will promote understanding of scholarship, leadership, and service.  Students hold a dinner with a William Friday Award recipient, establish their class legacy for the campus, and work with younger students on developing their leadership styles.  Students continue to volunteer in the community.  Students may need to use public transportation, which is free to NC State Students with their id, to perform required public service.  Restricted to Park Scholars.", "fall": false, "units": " 0"}]