[{"summer": true, "name": "Introduction to Psychology", "spring": true, "number": "PSY  200", "descripton": "Survey of basic principles for the understanding of behavior and experience including development, learning, cognition, biological foundations, perception, motivation, personality, behavior abnormalities, measurement of individual differences, and social processes. The value of scientific observation and experimentation to the development of psychological understanding is emphasized.", "fall": true, "units": " 3"}, {"summer": false, "name": "Controversial Issues in Psychology", "prerequisites": "Prerequisite: Freshman standing", "spring": false, "number": "PSY  201", "descripton": "Students will explore contemporary controversial issues within several areas of psychology (biological, human development, cognitive processes, mental health, psychological treatment, and social psychology) and encounter the diverse approaches used by psychologists and other scientists.  Students will have the opportunity to refine and use their critical thinking skills as they inquire into basic psychological concepts relevant to issues they help select and will practice confronting differing opinions responsibly and respectfully to fully contribute to and gainfully receive from the university community.", "fall": true, "units": " 3"}, {"summer": false, "name": "Orientation to Psychology", "spring": false, "number": "PSY  220", "descripton": "Orientation for new or potential Psychology majors.  Analysis of expectations and demands of the psychology degree programs.  Exploration of the challenges and opportunities presented by various post- baccalaureate educational and career options.", "fall": true, "units": " 1"}, {"summer": true, "name": "Introduction to Psychological Research", "prerequisites": "Prerequisite: PSY 200", "spring": true, "number": "PSY  230", "descripton": "This course is an introduction to the principles of scientific research. Students will develop and test research hypotheses in accordance with methods approved by the American Psychological Association. Methods of analyzing data and the interpretation of research findings will be stressed. Students will work in teams to collect, analyze, report, and provide a professional presentation of a group research project. Psychology majors and minors must take the course under the graded option.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Behavioral Research I", "prerequisites": "Prerequisite: PSY or HRD Majors, PSY  200, Corequisite: PSY (ST) 241", "spring": true, "number": ")  240", "descripton": "Introduction to quantitative methods in psychology, including measurement, experimental control, validity, and fundamentals of research design. Discussion of distributions and statistical inference.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Behavioral Research I Lab", "prerequisites": "Prerequisite: PSY or HRD Majors, PSY 200, Corequisite: PSY (ST) 240", "spring": true, "number": ")  241", "descripton": "Students design, analyze and report a variety of simple experiments.", "fall": true, "units": " 1"}, {"summer": false, "name": "Introduction to Behavioral Research II", "prerequisites": "Prerequisite: PSY or HRD Majors, PSY (ST) 240, Corequisite: PSY (ST) 243", "spring": true, "number": ")  242", "descripton": "Continuation of PSY (ST) 240. Ethics of Research in Psychology. Techniques for the development of research proposals. Statistical techniques for data analysis including non-parametrics, one-way and two-way ANOVA and introduction to correlation and regression.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Behavioral Research II Lab", "prerequisites": "Prerequisite: PSY or HRD Majors, PSY (ST) 240, Corequisite: PSY (ST) 242", "spring": true, "number": ")  243", "descripton": "Design and analysis of a major research project.", "fall": true, "units": " 2"}, {"summer": true, "name": "Industrial and Organizational Psychology", "prerequisites": "Prerequisite: PSY 200 or PSY 201, Junior standing or Senior standing", "spring": true, "number": "PSY  307", "descripton": "Surveys the application of psychological theories and methods to problems involving people in working settings. Topics include: organizational and management theory; work motivation and job satisfaction; job and organizational analysis; performance evaluation; personnel recruitment, selection, and placement; and personnel training and development.", "fall": true, "units": " 3"}, {"summer": true, "name": "Social Psychology", "prerequisites": "Prerequisite: PSY 200 or PSY 201", "spring": true, "number": "PSY  311", "descripton": "Theory and research on how individuals respond and are responded to in social situations.  Topics include attitude formation and change, affiliation, attraction, self and interpersonal perception, interpersonal relationships, aggression, helping behavior, intergroup behavior, and group dynamics.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Applied Psychology", "prerequisites": "Prerequisite: PSY 200 or PSY 201", "spring": "True", "number": "PSY  312", "descripton": "Covers diverse areas of psychological practice, related methods and ethical issues.  Includes illustrative cases of psychological practice in health, education, work settings, law, sports, consumer markets, and cross-cultural settings.  Explores professional roles and contributions in the contexts of social, organizational and technological change.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Ergonomics", "prerequisites": "Prerequisite: PSY 200 or PSY 201", "spring": false, "number": "PSY  340", "descripton": "Concepts from ergonomics, environmental psychology, and cognitive psychology related through design examples to problems of everyday living. Criteria of efficiency, comfort and safety evaluated relative to the design of activity, products, and the environment. Topics include: visual and auditory perception, information processing, physical activity, noise and lighting, work space design, workload, and product design.", "fall": true, "units": " 3"}, {"summer": false, "name": "Psychology and the African American Experience", "prerequisites": "Prerequisite: PSY 200 or PSY 201", "spring": false, "number": ")  345", "descripton": "Historical and cultural examination of the psychological experiences of African American experience from pre-American times to the present.  Focus on mental health, personality, identity development, racism, oppression, psychological empowerment andan African-centered world view.  Discussion of contemporary issues within the African American community.", "fall": true, "units": " 3"}, {"summer": false, "name": "Community Psychology Principles and Practice", "prerequisites": "Prerequisite: PSY 200", "spring": false, "number": "PSY  360", "descripton": "This course provides an introduction to the field of community psychology.  The aim of this course is to help empower students to contribute to effective social change in their communities.  Community psychology focuses upon person-environment interactions and the ways individuals navigate between different social contexts (e.g. schools, neighborhood, community, and society).   Community psychologists employ a variety of methodological approaches to understand the social issues facing communities today such as juvenile violence, homelessness, HIV-AIDS, and domestic violence.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Personality", "prerequisites": "Prerequisite: PSY 200", "spring": "True", "number": "PSY  370", "descripton": "Major personality theories. Definition of personality associated with each theory as well as the assumptions and principles used in accounting for human behavior. Theories evaluated considering recent research.", "fall": "True", "units": " 3"}, {"summer": true, "name": "Developmental Psychology", "prerequisites": "Prerequisite: PSY 200, PSY 201 or PSY 304 or EDP 304", "spring": true, "number": "PSY  376", "descripton": "Behavioral development during the life span, including study of current theories and project work with persons at various stages of the life cycle.", "fall": true, "units": " 3"}, {"summer": true, "name": "Perception", "prerequisites": "Prerequisite: PSY 200 or PSY 201, Junior standing", "spring": true, "number": "PSY  400", "descripton": "Anatomy and physiology of the major sensory systems, their relationship to central structures of the brain, important and/or common pathological conditions.  Basic issues and techniques of psychophysics.  Perceptual phenomena and theory, with an emphasis on topics in two-and three- dimensional spatial perception, including the perceptions of size, depth and motion.  Consideration of perceptual phenomena in practical settings.", "fall": true, "units": " 3"}, {"summer": false, "name": "Psychology of Gender", "prerequisites": "Prerequisite: PSY 200, PSY 201 or HSS 200", "spring": true, "number": ")  406", "descripton": "Current theory and research on perceived and actual biological, social, cognitive, personality and emotional similarities and differences of men and women throughout the lifespan.  The construction and consequences of gender in our society and others.Credit cannot be given for both PSY 406 and PSY 506", "fall": true, "units": " 3"}, {"summer": false, "name": "Learning and Motivation", "prerequisites": "Prerequisite: PSY 200, Junior standing", "spring": false, "number": "PSY  410", "descripton": "Introduction to the primary laboratory research areas in learning and motivation: classical conditioning, operant conditioning, verbal learning, drive theory, and the role of motives. Emphasis upon research on conditioning and its motivational processes as the foundations for techniques in behavior modification. Examination of both the uses and limitations of current information on learning and motivation.", "fall": true, "units": " 3"}, {"summer": false, "name": "Psychology of Emotion", "prerequisites": "Prerequisite: PSY 200", "spring": false, "number": "PSY  416", "descripton": "Introduction to the classic and contemporary theories of emotion, with strong emphasis on how data provide evidence to test theory. Biological, cognitive, social, and cultural foundations are explored.", "fall": true, "units": " 3"}, {"summer": true, "name": "Cognitive Processes", "prerequisites": "Prerequisite: PSY 200, Junior standing", "spring": true, "number": "PSY  420", "descripton": "Introduction to research and theory in cognition, including such topics as memory, acquisition and use of language, reading, problem-solving, reasoning, and concepts.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Cognitive Science", "prerequisites": "Prerequisite: One upper-level course in either PHI, PSY, CSC or Linguistics. Credit is not allowed for both PSY 425 and PHI/PSY 525.", "spring": false, "number": ")  425", "descripton": "Philosophical foundations and empirical fundamentals of cognitive science, an interdisciplinary approach to human cognition. Topics include: the computational model of mind, mental representation, cognitive architecture, the acquisition and use of language.  Students cannot receive credit for both PHI/PSY 425 and PHI/PSY 525.", "fall": false, "units": " 3"}, {"summer": false, "name": "Biological Psychology", "prerequisites": "Prerequisite: BIO 105/106 or BIO 181", "spring": true, "number": "PSY  430", "descripton": "Biological mechanisms of behavior, including elementary neuroanatomy and neurophysiology, sensory and motor processes, and their application to motivation, learning, and psychological processes.", "fall": true, "units": " 3"}, {"summer": false, "name": "Health Psychology", "prerequisites": "Prerequisite: PSY 200 and (PSY 230 or PSY 240/242 OR equivalent research methods course).", "spring": true, "number": "PSY  431", "descripton": "Introduction to health psychology. This course provides an overview of the field of health psychology, which is concerned with how behavior and psychological states influence physical health (i.e., how people stay healthy, why people become ill, and how people respond to illness). Application of psychological theory and research methods to such topics as: pain, stress and coping, helplessness and control, reactivity to stress, the effectiveness of behavioral interventions in health, illness prevention, health maintenance, recovery from injury and chronic pain, adjustment to chronic illness, treatment compliance.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Psychological Measurement", "prerequisites": "Prerequisite: PSY 240-241", "spring": true, "number": "PSY  436", "descripton": "The basic principles of psychological measurement, including elementary statistical concepts, reliability, and validity.  Emphasizes measurement in the science of psychology.  Application of measurement principles to a wide variety of measurement problems.", "fall": false, "units": " 3"}, {"summer": true, "name": "Abnormal Psychology", "prerequisites": "Prerequisite: PSY 200 or 304 or EDP 304", "spring": true, "number": "PSY  470", "descripton": "Common psychological disorders of children and adults. Historical and theoretical perspectives on abnormal behavior; issues of assessment and classification, etiology, symptoms, and treatment of disorders.", "fall": false, "units": " 3"}, {"summer": false, "name": "Child Psychology", "prerequisites": "Prerequisite: PSY 200 or 304 or EDP 304; PSY 376", "spring": true, "number": "PSY  475", "descripton": "Theories, methods, and phenomena of child psychology and application of this information to the enhancement of child development.  Multiple aspects of development, including physical, cognitive/intellectual, and social/emotional development, from conception to adolescence.  Emphasis on recent research findings in developmental psychology.", "fall": true, "units": " 3"}, {"summer": true, "name": "Psychology of Adolescent Development", "prerequisites": "Prerequisite: PSY 200 or EDP 304", "spring": true, "number": ")  476", "descripton": "Theories, principles, and issues of human psychological development emphasizing adolescence. Cognitive, social, and physical changes; their interaction.  Implications for teaching and parenting adolescents.", "fall": true, "units": " 3"}, {"summer": false, "name": "Special Topics in Psychology", "prerequisites": "Prerequisite: PSY 200", "spring": true, "number": "PSY  491", "descripton": "Exploration in depth of advanced areas and topics of current interest in psychology.", "fall": true, "units": " 3"}, {"summer": false, "name": "Human Resource Development Practicum", "prerequisites": "Prerequisite: HRD Majors, Junior standing", "spring": true, "number": "PSY  495", "descripton": "Supervised practicum in a human resource development organization during two consecutive semesters.  Application of human resource development knowledge and skills.", "fall": true, "units": " 1-8"}, {"summer": false, "name": "Senior Seminar in Psychology", "prerequisites": "Prerequisite: HRD or PSY Majors, Senior standing", "spring": true, "number": "PSY  497", "descripton": "Readings and discussions in depth of a special topic, which integrates several fields covered in the undergraduate psychology or HRD major.", "fall": false, "units": " 2"}, {"summer": false, "name": "Psychology Honors Seminar", "prerequisites": "Prerequisite: HRD and PSY honors students", "spring": false, "number": "PSY  498", "descripton": "Seminar and independent study under faculty direction. Provides the undergraduate psychology honors students with an opportunity to practice skills in designing, conducting, and evaluating research. The student, working closely with a faculty advisor, designs a research approach to a particular body of literature, accumulates appropriate data, and analyzes and evaluates the data. Must take two semesters", "fall": false, "units": " 3"}, {"summer": false, "name": "Individual Study in Psychology", "prerequisites": "Corequisite: PSY 495 for HRD majors during their work semester", "spring": true, "number": "PSY  499", "descripton": "Individual research project (literature review, experiment, survey, field study) open to any undergraduate, under the direction of a Psychology Department faculty member.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Visual Perception", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "PSY  500", "descripton": "Detailed consideration of anatomy and physiology of visual system (both peripheral and central components). Modern quantitative approaches to psychophysical problems of detection, discrimination, scaling. Examination of chief determinants of visual perception, including both stimulus variables and such organismic variables as learning, motivation and attention. Discussion of perceptual theory and processes emphasizes several topics in two- and three-dimensional spatial perception.", "fall": true, "units": " 3"}, {"summer": false, "name": "Physiological Psychology", "prerequisites": "Prerequisite: Twelve hours of PSY including PSY 200, 400,410", "spring": false, "number": "PSY  502", "descripton": "Physiological foundations of behavior, basic vertebrate neuroanatomy and neurophysiology.", "fall": true, "units": " 3"}, {"summer": false, "name": "Evolutionary Psychology", "spring": true, "number": "PSY  504", "descripton": "Emphasis upon use of evolutionary theory to understand the interaction of genetic and environmental influences on human behavior and thought. Topics include human mating, kinship, parenting, cooperation, aggression, cognition, and morality.", "fall": true, "units": " 3"}, {"summer": false, "name": "Psychology of Gender", "spring": true, "number": ")  506", "descripton": "Current theory and research on perceived and actual biological, social, cognitive, personality, and emotional similarities and differences of men and women throughout lifespan.  Construction and consequences of gender in our society and others.Credit for both PSY 406 and PSY 506 is not allowed.", "fall": true, "units": " 3"}, {"summer": false, "name": "Cognitive Processes", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": false, "number": "PSY  508", "descripton": "Emphasis upon the results from research on a number of complex processes (e.g., remembering, concept learning, problem solving, acquisition and use of language) and the theories that have been proposed to explain these results.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Problems In Psychology", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "PSY  510", "descripton": "Offers opportunities to explore various areas of psychology. Sections: Section D, developmental psychology; Section X, experimental psychology; Section I, industrial-organizational and vocational psychology; Section S, social psychology.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Advanced Social Psychology", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": false, "number": "PSY  511", "descripton": "A survey of theory and research in social psychology through reading and discussion of primary source materials. In addition, the course deals with issues of methodology, ethical questions in social psychological research and application of researchfindings to the world at large.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Introduction To Cognitive Science", "prerequisites": "Prerequisite: Graduate standing. Credit is not allowed for both PSY 525 and PHI/PSY 425.", "spring": "True", "number": ")  525", "descripton": "Philosophical foundations and empirical fundamentals of cognitive science, an interdisciplinary approach to human cognition. The computational model of mind, mental representation, cognitive architecture, the acquisition and use of language. Students cannot receive credit for both PHI/PSY 425 and PHI/PSY 525.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Tests and Measurements", "prerequisites": "Prerequisite: Six hours of PSY program", "spring": true, "number": "PSY  535", "descripton": "A study of the principles of psychological testing including norms and units of measurement, elementary statistical concepts, reliability and validity. In addition, some attention devoted to the major types of available tests such as general intellectual development, tests of separate abilities, achievement tests, measures of personality and interest inventories.", "fall": true, "units": " 3"}, {"summer": false, "name": "Human Factors In Systems Design", "prerequisites": "Prerequisite: IE 452 or PSY 340, Corequisite: ST 507 or 515", "spring": false, "number": ")  540", "descripton": "Introduction to problems of the systems development cycle, including human-machine function allocation, military specifications, display-control compatibility, the personnel sub-system concept and maintainability design. Detailed treatment given to people as information processing mechanisms.", "fall": true, "units": " 3"}, {"summer": false, "name": "Principles and Practice Of Ecological/Community Psychology", "prerequisites": "Prerequisite: Six hours PSY program", "spring": true, "number": "PSY  553", "descripton": "Introduction to community psychology and its attempt to redefine social problems according to an ecological frame-of-reference with emphasis on humanitarian values, cultural diversity, the promotion of a psychological sense of community among individuals and groups, and the need for psychologists to engage in systematic community research and action.", "fall": false, "units": " 3"}, {"summer": false, "name": "Psychology and the African Experience", "prerequisites": "Prerequisite: Six hours PSY program", "spring": true, "number": "PSY  558", "descripton": "An ethnographic approach to the psychology of peoples of African descent through examination of the influence of historical and cultural phenomena.  Specific attention to understanding the Africentric world view and issues of mental health, personality and identity development, racism, oppression and empowerment.", "fall": false, "units": " 3"}, {"summer": true, "name": "Adolescent Development", "prerequisites": "Prerequisite: 6 hours in PSY", "spring": true, "number": ")  582", "descripton": "Current theories and research on development during adolescence. Topics include: physical growth, cognitive changes, relationships with peers, parents and teachers, quest for identity and independence, morality and sexuality.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Developmental Psychology", "prerequisites": "Prerequisite: Nine hrs. of PSY, including PSY 376, PSY 475 or PSY 476", "spring": false, "number": "PSY  584", "descripton": "A survey of the role of growth and development in human behavior, particularly during the child and adolescent periods. This course pays particular attention to basic principles and theories in the area of developmental psychology.", "fall": true, "units": " 3"}, {"summer": false, "name": "History and Systems Of Psychology", "prerequisites": "Prerequisite: PSY 200,400,410,420, Consent of Instructor or Graduate standing", "spring": true, "number": "PSY  591", "descripton": "Aim of this course is to acquaint students with the history of psychology and psychological systems and to give students some practice in taking different approaches to a particular problem area.", "fall": false, "units": " 1-3"}, {"summer": false, "name": "Psychological Clinic Practicum", "prerequisites": "Prerequisite: Twelve hrs. in grad. PSY, which must include clinical skill courses PSY 722 and PSY 723.", "spring": true, "number": "PSY  641", "descripton": "Clinical participation in interviewing, counseling, psycho-therapy and administration of psychological tests. Practicum to be concerned with adults and children.", "fall": true, "units": ""}, {"summer": false, "name": "Internship In Psychology", "prerequisites": "Prerequisite: Approval of advisory committee", "spring": true, "number": "PSY  651", "descripton": "Supervised work experience in an appropriate setting with professional supervision in the field from a doctoral level psychologist with credentials and/or experience in the appropriate specialty in psychology. Experience consists of full time for one semester or half time for an academic year or equivalent time.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Directed Study Psychology", "spring": true, "number": "PSY  680", "descripton": "Research project for graduate students supervised by members of the graduate faculty. Research to be elected on basis of interest of student and not to be part of thesis or dissertation research. Credits Arranged", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "PSY  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "PSY  693", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "PSY  695", "descripton": "Thesis Research", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "PSY  696", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "PSY  699", "descripton": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis. Credits arranged", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Learning and Motivation", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": true, "number": "PSY  704", "descripton": "A systematic analysis of some of the major classes of variables determining behavioral change. Learning variables analyzed within their primary experimental setting, and emphasis upon the diversity of the functions governing behavior change rather than upon the development of some comprehensive theory. Examination of both learning and motivational variables as they contribute to changes in performance within the experimental setting.", "fall": false, "units": " 3"}, {"summer": false, "name": "Affect and Cognition", "prerequisites": "Prerequisite: SIx Hours of Graduate Level PSY", "spring": true, "number": "PSY  705", "descripton": "Critical examination of research and theory dealing with the intersection of affect and cognition. Topics will include the impact of emotion, mood and other aspects of affective experience on memory, decision making, judgment, and reasoning. Developmental and individual difference will be explored, as will the neuropsychological underpinnings of observed relationships.", "fall": false, "units": " 3"}, {"summer": false, "name": "Special Topics In Psychology", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "PSY  710", "descripton": "Course provides opportunity for exploration in depth of advanced topical areas which, because of their degree of specialization, are not generally involved in other courses; for example, multivariate methodology in psychology, computer simulation, mathematical model building. Some new 700-level courses will first be offered under this title during developmental phase and as such may involve lectures and/or laboratories.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Social Psychology: Small Groups Research", "prerequisites": "Prerequisite: PSY 511", "spring": true, "number": "PSY  714", "descripton": "Surveys the literature and research pertaining to social psychological processes in and between groups. Course content includes basic principles of group formation, role differentiation, communication, influence, norms, social exchange, equity, cooperation/conflict, decision making and pro-social behavior. Environmental factors affecting group behavior also considered. In conjunction with each substantive topic, suitable methodologies for research considered.", "fall": false, "units": " 3"}, {"summer": false, "name": "Area Seminar In School Psychology", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": false, "number": "PSY  721", "descripton": "The following topics dealt with: (1) the development of school psychology as a professional area, (2) methods of inquiry, (3) scientific and theoretical bases, (4) contemporary issues, (5) ethical questions, (6) relationship to other areas within psychology.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Individual Intelligence Measurement", "prerequisites": "Prerequisite: PSY 535 and consent of school psychology coordinator", "spring": false, "number": "PSY  722", "descripton": "Theoretical approaches to and individual assessment of intellectual functioning, child development, adaptive behavior, and visual motor functioning.  Administration, scoring, and interpretation of current standardized instruments and nonstandardizedassessment.  Written communication of findings.", "fall": true, "units": " 4"}, {"summer": false, "name": "Personality Measurement", "prerequisites": "Prerequisite: PSY 722", "spring": true, "number": "PSY  723", "descripton": "Theory and practicum in individual personality testing of children and adults with emphasis on projective techniques, other personality measures, report writing and case studies.", "fall": false, "units": " 3"}, {"summer": false, "name": "Psychological Intervention I", "prerequisites": "Prerequisite: PSY 723", "spring": false, "number": "PSY  724", "descripton": "Designed to examine theories, research, techniques, ethics and professional responsibilities related to approaches to psychological intervention. Types of psychological intervention include behavior modification, milieu approaches, crisis intervention techniques and group process methods, in addition to more intensive relationship approaches. A close integration of experiences, content and supervision emphasized in a variety of professional settings with a wide range of personal problems and age groups.", "fall": true, "units": " 3"}, {"summer": false, "name": "Psychological Intervention II", "prerequisites": "Prerequisite: PSY 724", "spring": true, "number": "PSY  725", "descripton": "The primary purpose of this course is to provide students opportunities to acquire information, conceptual frameworks, interpersonal skills and a sense of ethical responsibility, all basic to their further development as practicing psychologists. A major effort in the course made to help the student increase his/her interpersonal skills as a means of promoting the psychological growth and effective-ness of others.", "fall": false, "units": " 3"}, {"summer": false, "name": "Psychological Consultation", "prerequisites": "Prerequisite: Nine hrs. grad. PSY or ED", "spring": true, "number": "PSY  727", "descripton": "Introduction to psychological consultation with emphasis on school setting. Presentation of various consultation models and theoretical bases. Development of skills in practice of consultation.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Engineering Psychology of Human-computer Interaction", "prerequisites": "Prerequisite: IE(PSY) 540 or CSC 554", "spring": "True", "number": ")  740", "descripton": "Exploration of usability of computer technology. Theory and practice of user-centered design for HCI applications. Course focuses on current usability paradigms and principles, psychology of users, iterative and participatory design processes, system requirements specification, prototyping, user support systems, usability evaluation and engineering, interface design guidelines and standards. Application domains include, universal design, virtual reality, and scientific data visualization.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Ergonomic Performance Assessment", "prerequisites": "Prerequisite: PSY 200, ST 507 and 508", "spring": false, "number": ")  743", "descripton": "Fundamentals of ergonomic performance measurement used to assess the effects of environment and system design on human performance. Treatment of topics such as workload measurement, measurement of complex performance, simulator studies, measurement of change, task taxonomies, criterion task sets and statistical methods of task analysis. Problems of laboratory and field research, measurement of change and generalizability of findings.", "fall": true, "units": " 3"}, {"summer": false, "name": "Human Information Processing", "prerequisites": "Prerequisite: PSY 200, ST 507 and 508", "spring": true, "number": ")  744", "descripton": "Fundamentals of human information processing basic to skilled operator performance and the design of displays, controls and complex systems. Treatment of topics such as channel capacity, working memory, long-term memory, decision making, attention and process monitoring. Problems of display and control design and evaluation, evaluation of textual material, and human-computer interaction.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Human Performance Modeling", "prerequisites": "Prerequisite: ST 507 or 515 or equivalent; IE (PSY) 540, CSC 554 or IE (PSY) 744", "spring": "True", "number": ")  745", "descripton": "Advanced aspects of human performance research.  Qualitative models of human information processing.  Characteristics and role of memory in decision making and response execution.  Sensory channel parameters, attention allocation, time-sharing of tasks. Situation awareness and workload responses in complext tasks.  Limitations of human factors experimentation.  Factors in human multiple task performance.  Cognitive task analysis and computational cognitave modeling/simulation of user behavior in specific applications.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Area Seminar In Human Resources Development", "spring": true, "number": "PSY  750", "descripton": "The following topics dealt with: (1) human resources development as an area of inquiry, (2) methods of inquiry, (3) contemporary issues, (4) ethical questions, (5) relationship to other areas within psychology.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Human Resource Planning", "prerequisites": "Prerequisite: Graduate standing or PBS status, Corequisite: ST 507", "spring": false, "number": "PSY  751", "descripton": "Review of the literature, methods and research issues in the field of human resource planning and evaluation.  Goal-setting, needs assessment, information systems, subjective probability, human resource accounting, decision processes, incentive programs, human productivity and related subjects.  Focus on planning and evaluation methods for communities and organizations.", "fall": true, "units": " 3"}, {"summer": false, "name": "Action Research In Psychology", "prerequisites": "Prerequisite: ST 511, Corequisite: ST 508", "spring": true, "number": "PSY  752", "descripton": "Action research models in psychology and their relationships to research methods. Research in field settings and implications for ethics and social responsibility, internal and external validity, experimenter and volunteer effects and problems of measurement.", "fall": false, "units": " 3"}, {"summer": false, "name": "Cross-Cultural Research and Development", "prerequisites": "Prerequisite: ST 507, Graduate standing, Corequisite: ST 508", "spring": true, "number": "PSY  755", "descripton": "Review of the literature, methods and issues in cross-cultural research and development. Cross-cultural programs evaluation and policy studies in health, education, technology transfer, international cooperation and communications.  For graduate students in science and technology with plans to work in international settings.", "fall": false, "units": " 3"}, {"summer": false, "name": "Consumer Research", "prerequisites": "Prerequisite: ST 507, Graduate standing or PBS status, Corequisite: ST 508", "spring": true, "number": "PSY  756", "descripton": "Review of the literature, methods and research issues pertaining to consumer behavior.  Consumer demographics, psychographics, attitudes, persuasion, intentions, decision processes, consumption, saving, innovation and related topics. Research methods including experiments, surveys, focus groups and case studies.", "fall": false, "units": " 3"}, {"summer": false, "name": "Innovation and Technology", "prerequisites": "Prerequisite: 3 hrs. grad. ST or research methods", "spring": false, "number": "PSY  757", "descripton": " management; social/administrative technology; adoption and dissemination; public policy; computer-mediated communications; implementation; and intended and unintended outcomes for individuals, organizations and society.", "fall": true, "units": " 3"}, {"summer": false, "name": "Psychometrics", "prerequisites": "Prerequisite: Six hours of graduate statistics, including linear regression", "spring": false, "number": "PSY  760", "descripton": "Theoretical and statistical approaches to understanding psychological measurement.  Topics include detailed coverage of reliability, validity, and factor analysis.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Advanced Psychometrics: Item Response Theory", "prerequisites": "Prerequisite: PSY 760", "spring": "True", "number": "PSY  761", "descripton": "Item Response Theory approaches to advanced test construction and scoring; the investigation of test bias via item response theory methods.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Quasi-Experimental Evaluation Design", "prerequisites": "Prerequisite: ST 507", "spring": true, "number": "PSY  762", "descripton": "An introduction to quasi-experimental design as applied to HRD program evaluation: (1) Methods of assessing informational needs, (2) recognition of internal and external validity threats, (3) design of quasi-experiments to minimize threats and (4) use of results by program decision makers.", "fall": false, "units": " 3"}, {"summer": false, "name": "Systems Theory and Applications In Human Resource Development", "prerequisites": "Prerequisite: PSY 750", "spring": false, "number": "PSY  763", "descripton": "An introduction to the systems approach and general systems theory. (1) Concepts and terminology of general systems theory, (2) techniques currently used to access system requirements and (3) methods of analyzing system performance. Emphasis on application of systems techniques to the design and implementation of human resource development programs.", "fall": true, "units": " 3"}, {"summer": false, "name": "Survey of Industrial/Organizational Psychology", "prerequisites": "Prerequisite: PSY 535", "spring": true, "number": "PSY  764", "descripton": "Issues surrounding the person, organization and job.  Employee motivation and work attitudes, work analysis and design, recruitment, selection, training, and performance appraisal of employees, and organizational leadership and group/team processes.Emphasis on scientist-practitioner model throughout the course.", "fall": false, "units": " 3"}, {"summer": false, "name": "Vocational Psychology", "prerequisites": "Prerequisite: ST 507, PSY 761", "spring": false, "number": "PSY  765", "descripton": "The study of the individual's vocational behavior and development through the years of choice and adjustment. An up-to-date review and synthesis of research and theory in the field of vocational psychology. Empirical studies and theoretical statements in the field appraised and evaluated to determine what behavioral laws apply to vocational phenomena.", "fall": true, "units": " 3"}, {"summer": false, "name": "Personnel Selection Research", "prerequisites": "Prerequisite: Six hrs. of grad. ST, PSY 535", "spring": false, "number": "PSY  766", "descripton": "A survey of theoretical, methodological and research literature on personnel selection. Topics include organization, task and person analyses, validation strategies, utility and equal opportunity issues and selection strategies. Emphasis on research.", "fall": true, "units": " 3"}, {"summer": false, "name": "Training Research", "prerequisites": "Prerequisite: Six hrs. of grad. PSY and six hrs. of grad. ST", "spring": false, "number": "PSY  767", "descripton": "A survey of conceptual and research literature on training. Topics include needs assessments, learning, transfer, maintenance, criterial and evaluation issues, as well as a review of research on specific training techniques. Emphasis on research methods and findings, not skill development in specific training techniques.", "fall": true, "units": " 3"}, {"summer": false, "name": "Organizational Psychology", "prerequisites": "Prerequisite: Nine hrs. of PSY", "spring": false, "number": "PSY  768", "descripton": "A study of the application of behavioral science, particularly psychology and social psychology, to organizational and management problems.", "fall": true, "units": " 3"}, {"summer": false, "name": "Work Motivation", "prerequisites": "Prerequisite: PSY 768", "spring": true, "number": "PSY  769", "descripton": "Theory and research in work motivation. An in-depth examination of motivation theory as it pertains to the study of individual behavior in work settings.", "fall": false, "units": " 3"}, {"summer": false, "name": "Organization Development and Change", "prerequisites": "Prerequisite: PSY 768", "spring": true, "number": "PSY  770", "descripton": "A survey of theory and research in organization development. Attention directed to: (1) methods of diagnosing need for organizational change, (2) techniques currently used to implement and evaluate organizational change, (3) professional ethics and other issues dealing with client-consultant relationship. Emphasis on developmental approaches originating from psychology and allied fields.", "fall": false, "units": " 3"}, {"summer": false, "name": "Methodological Issues In Developmental Psychology", "prerequisites": "Prerequisite: PSY 584 and 3 hrs. of grad. statistics", "spring": true, "number": "PSY  785", "descripton": "Methodological issues, research designs and statistical techniques in developmental psychology. Role and meaning of age as a research variable. Interpretation of research reports. Ethical issues.", "fall": false, "units": " 3"}, {"summer": false, "name": "Cognitive Development", "prerequisites": "Prerequisite: PSY 584", "spring": true, "number": "PSY  786", "descripton": "Examination of research and theory in cognitive development. Primary focus on childhood, but implications for the entire life span addressed. Application of cognitive developmental principles in creating interventions and educational programs also discussed.", "fall": false, "units": " 3"}, {"summer": false, "name": "Social Development", "prerequisites": "Prerequisite: PSY 584", "spring": true, "number": "PSY  787", "descripton": "Survey of current theory and research on the development of social behavior systems, including attachment, aggression, gender-role behavior, prosocial behavior. Attention to the role of social class, race and culture, and to contemporary phenomena such as day care, single-parent and dual-career families, child abuse.", "fall": false, "units": " 3"}, {"summer": false, "name": "Adulthood and Aging: Cognitive and Intellectual Change", "prerequisites": "Prerequisite: PSY 584", "spring": false, "number": "PSY  788", "descripton": "Critical examination of theory and research associated with the study of cognitive and intellectual change in adulthood and aging. Memory and learning, information processing, language, intelligence, social cognition and expertise.", "fall": true, "units": " 3"}, {"summer": false, "name": "Socio-Emotional Processes In Adulthood and Aging", "prerequisites": "Prerequisite: PSY 584", "spring": false, "number": "PSY  789", "descripton": "Current theory and research on social, emotional and personality development during adulthood and aging. Generally including self-concept and identity, interpersonal relations (friendship, marriage, parenting, work), control, coping and life satisfaction. Attention to gender, culture and contemporary issues in adult development and aging.", "fall": true, "units": " 3"}, {"summer": false, "name": "Psychology Of Families and Parenting", "prerequisites": "Prerequisite: Nine hrs. grad. PSY or ED", "spring": false, "number": "PSY  792", "descripton": "Special topics in the area, including family influences on cognitive development, effects of parental divorce on children, single-parenting, step-families, child abuse and ethnic/cultural differences in family functioning. A critical examination of traditional and contemporary parenting approaches and an introduction to family therapy.", "fall": true, "units": " 3"}, {"summer": false, "name": "Stress and Coping", "prerequisites": "Prerequisite: Two grad. PSY courses", "spring": false, "number": "PSY  795", "descripton": "Discussion of current research findings and theories in area of psycho-social stress. Topics include: biology of the stress response, methodology, physical, behavioral and psychological reactions to stress, and relationships between personality and social support to the development of stress-related disorders.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction To Graduate Study In Psychology", "prerequisites": "Prerequisite: Graduate standing in PSY", "spring": false, "number": "PSY  800", "descripton": "Orientation to graduate study in psychology. Library and computer systems. Faculty research and teaching interests. Special research facilities and populations. Standards for research with human and infra-human subjects. Ethical principles of American Psychological Association. Generic and specialty guidelines for providers of psychological services. North Carolina Licensing Law and supporting rules. Psychology as science, discipline and profession.", "fall": true, "units": " 1"}, {"summer": "True", "name": "Psychology Colloquium", "spring": "True", "number": "PSY  809", "fall": "True", "units": " 1"}, {"summer": false, "name": "Special Topics In Psychology", "prerequisites": "Prerequisite: 6 hrs. of PSY, Corequisite: 3 hrs. of ST", "spring": true, "number": "PSY  820", "descripton": "Course provides opportunity for exploration in depth of advanced areas and topics of current interest.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "School Psychology Practicum", "prerequisites": "Prerequisite: Twelve hrs. in grad. PSY, which must include clinical skill courses PSY 722 and PSY 723", "spring": true, "number": "PSY  841", "descripton": "Clinical participation in interviewing, counseling, psycho-therapy and administration of psychological tests. Practicum to be concerned with adults and children.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Practicum in Industrial/Organizational Psychology", "prerequisites": "Prerequisite: PSY 764", "spring": true, "number": "PSY  846", "descripton": "Procedures and techniques used by Industrial and Organizational Psychologists in the field.  Students write work proposals, conduct interventions in field, and codument results.  Review one or more I/O procedure step-by-step.", "fall": true, "units": " 3"}, {"summer": false, "name": "Internship In Psychology", "prerequisites": "Prerequisite: Master's degree in PSY and approval of advisory committee", "spring": true, "number": "PSY  851", "descripton": "Supervised work experience in an appropriate setting with professional supervision in the field from a doctoral level psychologist with credentials and/or experience in the appropriate specialty in psychology. Experience consists of full time for one semester or half time for an academic year or equivalent time.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Directed Study In Psychology", "spring": true, "number": "PSY  880", "descripton": "Research project for graduate students supervised by members of the graduate faculty. Research to be elected on basis of interest of student and not to be part of thesis or dissertation research. Credits Arranged", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "PSY  885", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planing for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Doctoral Preliminary Exam", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "PSY  890", "descripton": "For students who are preparing for and taking written and/or oral preliminary exams.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "PSY  893", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "PSY  895", "descripton": "Dissertation Research", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "PSY  896", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "PSY  899", "descripton": "For students who have completed all credit hour requirements, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations.", "fall": true, "units": " 1-3"}]