[{"summer": false, "name": "Stellar and Galactic Astronomy", "spring": true, "number": "PY  123", "descripton": "Introductory, descriptive survey of stars, galaxies and cosmology, designed primarily for non-science majors.  Exotic recent discoveries such as quasars, pulsars, and black holes will be included.  Complements PY 124, Solar System Astronomy.  Companion laboratory course PY 125.", "fall": true, "units": " 3"}, {"summer": false, "name": "Solar System Astronomy", "spring": true, "number": "PY  124", "descripton": "Introductory, descriptive survey of the solar system designed primarily for non-science majors, including current results from space probes, history of astronomy, and the motions of the moon, stars, and planets in the night sky.  Complementary course covering stars, galaxies and cosmology (PY 123).  Companion laboratory course (PY 125).", "fall": true, "units": " 3"}, {"summer": false, "name": "Astronomy Laboratory", "prerequisites": "Corequisite: PY 123 or 124", "spring": true, "number": "PY  125", "descripton": "Introduction to astronomical observing.  Twelve exercises include astronomical instruments; the nature of light;  Kepler's and Newton's laws of motion; the constellations, planets, binary stars, stellar clusters, and galaxies.  Use of small telescopes to observe celestial objects.", "fall": true, "units": " 1"}, {"summer": false, "name": "Computer-based Astronomy Laboratory", "prerequisites": "Corequisite: PY 123 or PY 124", "spring": true, "number": "PY  126", "descripton": "Ten computer-based laboratory exercises in astronomy.  Celestial coordinates, motions of celestial objects, and bright stars and constellations.  Simulated observing of planets, stars, and galaxies, with data reduction and analysis.", "fall": true, "units": " 1"}, {"summer": true, "name": "Conceptual Physics", "spring": true, "number": "PY  131", "descripton": "Fundamentals of physics from a conceptual rather than a mathematical viewpoint.  Applications of physics to everyday phenomena and experiences.  Numerous demonstrations and discovery-based laboratory. Mechanics, properties of matter, heat, sound, electricity and magnetism, light and relativity.", "fall": true, "units": " 4"}, {"summer": false, "name": "Conceptual Physics: Optics", "spring": true, "number": "PY  133", "descripton": "Fundamentals of optics from a conceptual rather than a mathematical viewpoint.  Applications of optics ranging from everyday phenomena to modern optical devices; from rainbows to lasers.  Numerous demonstrations and discovery-based laboratory.  Properties of light, color, optical devices, light in the atmosphere, vision in animals and man, light in modern physics, light in the cosmos.", "fall": true, "units": " 4"}, {"summer": false, "name": "University Physics I", "prerequisites": "Corequisite: MA 141. Credit is not allowed for both PY 201 and PY 205 or PY 211.", "spring": false, "number": "PY  201", "descripton": "First course of three semester sequence for students majoring in physical and mathematical sciences. Calculus used throughout. Principles of classical Newtonian mechanics covered in detail.", "fall": true, "units": " 4"}, {"summer": false, "name": "University Physics II", "prerequisites": "Prerequisite: PY 201, MA 141, Corequisite: MA 241. Credit is not allowed for both PY 202 and PY 208 or PY 211.", "spring": true, "number": "PY  202", "descripton": "Second course of three semester sequence designed primarily for students majoring in physical and mathematical sciences. Calculus used throughout. Principles of electricity and magnetism covered in detail.", "fall": false, "units": " 4"}, {"summer": false, "name": "University Physics III", "prerequisites": "Prerequisite: PY 202, MA 241, Corequisite: MA 242", "spring": false, "number": "PY  203", "descripton": "Third course of three semester sequence designed primarily for students majoring in physical and mathematical sciences. Calculus is used throughout. Principles of wave optics and modern physics are covered in detail.", "fall": true, "units": " 4"}, {"summer": true, "name": "Physics for Engineers and Scientists I", "prerequisites": "Prerequisite: MA 141 with a grade of C- or better or MA 241 Placement. Credit is not allowed for both PY 205 and PY 201 or PY 211.", "spring": true, "number": "PY  205", "descripton": "First semester of a two-semester sequence in introductory physics, with laboratory. A calculus-based study of mechanics, sound and heat.", "fall": true, "units": " 4"}, {"summer": true, "name": "Physics for Engineers and Scientists II", "prerequisites": "Prerequisite: C- or better in PY 205 and C- or better in MA 241. Credit is not allowed for both PY 208 and PY 201 or PY 211.", "spring": true, "number": "PY  208", "descripton": "Second semester of a two-semester sequence in introductory physics, with coordinated laboratory problem-solving experiences. A calculus-based study of electricity, magnetism, optics and modern physics. Credit not allowed for more than one of PY 208,PY 202, and PY 212", "fall": true, "units": " 4"}, {"summer": true, "name": "College Physics I", "prerequisites": "Prerequisite: MA 107 or 111 or 121 or 131 or 108 or 141 with a C- or better, or 480 on the SAT Subject Test in Mathematics Level 2 or the NCSU Math Skills Test, or 2 or better on an AP Calculus exam. Credit is not allowed for both PY 211 and PY 201 or PY", "spring": true, "number": "PY  211", "descripton": "First semester of a two-semester introductory sequence in non-calculus physics, with laboratory. Mechanics, heat, wave motion and sound. Credit not allowed for more than one of PY 211, PY 201 or PY 205", "fall": true, "units": " 4"}, {"summer": true, "name": "College Physics II", "prerequisites": "Prerequisite: PY 211 or PY 205. Credit is not allowed for both PY 212 and PY 202 or PY 208.", "spring": true, "number": "PY  212", "descripton": "Second semester of a two-semester introductory sequence in non-calculus physics, with laboratory. Electricity, and magnetism, light, modern physics. Credit not allowed for more than one of PY 212, PY 202, and PY 208", "fall": true, "units": " 4"}, {"summer": true, "name": "Instrumental and Data Analysis for Physics", "prerequisites": "Prerequisite: PY 202 or PY 208", "spring": true, "number": "PY  252", "descripton": " low-pass filters, feedback circuits), electronic noise (measurement and analysis), and basic circuit construction methods (such as shielding/grounding, soldering).", "fall": true, "units": " 2"}, {"summer": true, "name": "Special Problems in Physics", "spring": true, "number": "PY  299", "descripton": "Study in experimental or analytical topics in classical and modern physics.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Introduction to Quantum Mechanics", "prerequisites": "Prerequisite: PY 203 or 407", "spring": false, "number": "PY  301", "descripton": "An introduction to wave mechanics and quantum phenomena including the Schroedinger equation for simple systems, the Hamiltonian operator, the use of commutator relations, and the application of angular momentum operators.  Emphasis on mathematical tools used in wave mechanics, including complex numbers, function operators, eigenvalues and eigenvectors.", "fall": true, "units": " 3"}, {"summer": false, "name": "Stellar and Galactic Astrophysics", "prerequisites": "Prerequisite: PY 202 or PY 208", "spring": false, "number": "PY  328", "descripton": "Introduction to the study of stars, galaxies, and the universe. Stars and stellar evolution; interstellar medium; galaxies and galaxy clusters; cosmology. Recent developments in the understanding of neutron stars, black holes, active galaxies, quasars and inflationary cosmologies.", "fall": true, "units": " 3"}, {"summer": false, "name": "Spacetime Physics", "prerequisites": "Prerequisite: PY 203 or 407", "spring": true, "number": "PY  341", "descripton": "Introduction to spacetime physics in accordance with Einstein's special theory of relativity; time dilation, twin paradox, Doppler effect, relativistic space travel, four-vectors, relativistic momentum and energy conservation laws in high energy physics. Consequences of Einstein's gravitational theory in cosmology; models of the expanding universe, neutron stars, black holes and the \"big bang\" hypothesis. .", "fall": false, "units": " 3"}, {"summer": false, "name": "Quantum Physics I", "prerequisites": "Prerequisite: Grade of C- or better in PY 411 and grade of C- or better in PY 203.", "spring": true, "number": "PY  401", "descripton": "An introduction to the basic principles of quantum physics with an emphasis on selected applications to atoms, molecules, solids, nuclei and elementary particles.", "fall": false, "units": " 3"}, {"summer": false, "name": "Quantum Physics II", "prerequisites": "Prerequisite: C- or better in PY 401", "spring": false, "number": "PY  402", "descripton": "An introduction to the basic principles of quantum physics with an emphasis on selected applications to atoms, molecules, solids, nuclei and elementary particles.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Modern Physics", "prerequisites": "Prerequisite: MA 242, PY 208", "spring": true, "number": "PY  407", "descripton": "Major developments in modern physics: special relativity, origin of the quantum theory, atomic and molecular structure, radioactivity, properties of nuclei. Credit not allowed for both PY 203 and PY 407", "fall": false, "units": " 3"}, {"summer": false, "name": "Mechanics I", "prerequisites": "Prerequisite: C- or better in PY 202 or C- or better in PY 208, and Corequisite of MA 341.", "spring": true, "number": "PY  411", "descripton": "First semester of a two-semester sequence in particle and continuum mechanics at the intermediate level.  Focuses on single-particle dynamics: Elementary Newtonian mechanics, harmonic oscillator, central force motion, conservation laws, motion in non-inertial frames, Coriolis and centrifugal forces, Lagrangian dynamics, Hamilton's equations.", "fall": false, "units": " 3"}, {"summer": false, "name": "Mechanics II", "prerequisites": "Prerequisite: C- or better in PY 411", "spring": false, "number": "PY  412", "descripton": "Second semester of a two-semester sequence in particle and continuum mechanics at the intermediate level.  Focuses on dynamics of systems of particles and continua: Center of mass, collisions, rigid bodies, inertia tensor, principal axes, stress andstrain tensors, mechanical properties of fluids and solids; Waves in discrete and continuum systems, coupled oscillators, normal modes, elements of special relativity.", "fall": true, "units": " 3"}, {"summer": false, "name": "Thermal Physics", "prerequisites": "Prerequisite: PY 203 or 407, MA 341", "spring": true, "number": "PY  413", "descripton": "An introduction to statistical mechanics and thermodynamics. The statistical study of physical systems emphasizing the connection between the statistical description of macroscopic systems and classical thermodynamics. Concepts of heat, internal energy, temperature and entropy. Classical and quantum statistical distributions.", "fall": false, "units": " 3"}, {"summer": false, "name": "Electromagnetism I", "prerequisites": "Prerequisite: C- or better in PY 203 or C- or better in PY 407, and MA 341", "spring": false, "number": "PY  414", "descripton": "First semester of a two-semester sequence. An intermediate course in electromagnetic theory using the methods of vector calculus. Electrostatic field and potential, dielectrics, solution to Laplace's and Poisson's equations, magnetic fields of steady currents.", "fall": true, "units": " 3"}, {"summer": false, "name": "Electromagnetism II", "prerequisites": "Prerequisite: C- o better in PY 414", "spring": true, "number": "PY  415", "descripton": "A continuation of PY 414. Electromagnetic induction, magnetic fields in matter, Maxwell's equations, wave guides, radiation.", "fall": false, "units": " 3"}, {"summer": false, "name": "Advanced Physics Laboratory", "prerequisites": "Prerequisite: Senior standing, Physics Majors", "spring": true, "number": "PY  452", "descripton": "Introduction to laboratory electronics and instrumentation.  Experiments in mechanics; electromagnetism; electronics; optics; and atomic, nuclear, plasma and solid state physics. Senior Physics students only", "fall": true, "units": " 3"}, {"summer": false, "name": "Fluid Physics", "prerequisites": "Prerequisite: MA 341 and PY 208", "spring": false, "number": ")  463", "descripton": "A derivation of the basic equations governing fluid motion in a rotating coordinate system.  Equations include conservation of mass or the continuity equation, momentum equations, thermodynamic energy equation and the vorticity equation.  Application of equations to simplified oceanic flows which include surface gravity waves, inertial motion, geostrophic motion, Ekman dynamics and vorticity dynamics.", "fall": true, "units": " 3"}, {"summer": true, "name": "Independent Research in Physics", "spring": true, "number": "PY  499", "descripton": "Study and research in physics. Topics for experimental or theoretical investigation.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Quantum Physics I", "prerequisites": "Prerequisite: C- or better in PY 411", "spring": false, "number": "PY  501", "descripton": "Basic principles of quantum physics with emphasis on selected applications to atoms, molecules, solids, nuclei and elementary particles.  PY 501 - first semester in two-semester sequence in quantum mechanics; PY 501 - second semester of sequence. Credit for both PY 401 and PY 501 is not allowed", "fall": true, "units": " 3"}, {"summer": false, "name": "Quantum Physics II", "prerequisites": "Prerequisite: C- or better in PY 401", "spring": true, "number": "PY  502", "descripton": "Basic principles of quantum physics with emphasis on selected applications to atoms, molecules, solids, nuclei and elementary particles.  PY 502 - second semester in two-semester sequence in quantum mechanics; PY 501, first semester of sequence. Credit for both PY 402 and PY 502 is not allowed.", "fall": false, "units": " 3"}, {"summer": false, "name": "Nuclear and Subatomic Physics", "prerequisites": "Prerequisite: PY 203 or 407; PY 412", "spring": false, "number": "PY  506", "descripton": "Introduction to nuclear and subatomic phenomena: properties of nuclear radiations and detectors, accelerators, nuclear forces and nuclear structure, elementary particles, fundamental symmetries and conservation laws.", "fall": true, "units": " 3"}, {"summer": false, "name": "Elementary Particle Physics", "prerequisites": "Prerequisite: PY 401 and PY 506", "spring": true, "number": "PY  507", "descripton": "Introduction to fundamental symmetries and dynamics of quarks and leptons. The Standard Model, Dirac equation, Feynman rules in QED and QCD, the Higgs mechanism and electroweak unification.", "fall": false, "units": " 3"}, {"summer": false, "name": "Mechanics I", "prerequisites": "Prerequisite: C- or better in PY 203 or C- or better in PY 407, and MA 341", "spring": false, "number": "PY  511", "descripton": "First semester of two-semester sequence in particle and continuum mechanics at intermediate level.  Single-particle dynamics: Elementary Newtonian mechanics, harmonic oscillator, central force motion, conservation laws, motion in non-inertial frames, Coriolis and centrifugal forces, Lagrangian dynamics, Hamilton's equations. Credit for both PY 411 and PY 511 is not allowed.", "fall": true, "units": " 3"}, {"summer": false, "name": "Mechanics II", "prerequisites": "Prerequisite: PY 511", "spring": true, "number": "PY  512", "descripton": "Second semester of two-semester sequence in particle and continuum mechanics at intermediate level.  Dynamics of systems of particles and continua:  Center of mass, collisions, rigid bodies, inertia tensor, principla axes, stress and strain tensors,mechanical properties of fluids and solids; waves in discrete and continuum systems, coupled oscillators, normal modes, elements of special relativity. Credit for both PY 412 and PY 512 is not allowed.", "fall": false, "units": " 3"}, {"summer": false, "name": "Electromagnetism I", "prerequisites": "Prerequisite: PY 203 or PY 208, MA 341", "spring": false, "number": "PY  514", "descripton": "First semester of two-semester sequence.  An intermediate course in electromagnetic theory using the methods of vector calculus.  Electrostatis field and potential, dielectrics, solution to Laplace's and Poisson's equations, magnetic fields of steady currents. Credit for both PY 414 and PY 514 is not allowed.", "fall": true, "units": " 3"}, {"summer": false, "name": "Electromagnetism II", "prerequisites": "Prerequisite: PY 514", "spring": true, "number": "PY  515", "descripton": "Continuation of PY 514.  Electromagnetic induction, magnetic fields in matter, Maxwell's equations, wave guides, radiation. Credit for both PY 415 and PY 515 is not allowed.", "fall": false, "units": " 3"}, {"summer": false, "name": "Physical Optics", "prerequisites": "Prerequisite: PY 415", "spring": false, "number": "PY  516", "descripton": "Physical optics with major emphasis on wave properties of light. Boundary conditions, interference and diffraction, optics of thin films, fiber optics and applications to absorption, scattering and laser operation. A background in Maxwell's equations and vector analysis required.", "fall": true, "units": " 3"}, {"summer": false, "name": "Atomic and Molecular Physics", "prerequisites": "Prerequisite: PY 401, 412", "spring": true, "number": "PY  517", "descripton": "The quantum mechanical treatment of structure and spectra for atoms and molecules. The hydrogen atom, helium atom, multielectron atoms, selection rules, diatomic and simple polyatomic molecules and nuclear magnetic resonance spectroscopy.", "fall": false, "units": " 3"}, {"summer": false, "name": "Biological Physics", "prerequisites": "Prerequisite: PY 413 or Graduate Standing", "spring": true, "number": "PY  519", "descripton": "This course presents the application of physics principles and methods to problems in biological systems.  Important biological molecules, their structures and their processes are introduced for physical scientists.  Functional mechanisms are analyzed with concepts from thermodynamics, statistical mechanics, fluid mechanics, and electrostatics.  Modern experimental methods and computational approaches to molecular and cellular level biological phenomena are emphasized.", "fall": false, "units": " 3"}, {"summer": false, "name": "Computational Physics", "prerequisites": "Prerequisite: CSC 112 or equivalent; Corequisite: of PY 401", "spring": false, "number": "PY  525", "descripton": "Computational approach to physics problem solving using standard software relevant for physicists.  Electrostatic potentials, data analysis, Monte Carlo simulations, Fourier optics, particle orbits, Schrodinger's equation.  Examples and assignments for each topic chosen to complement other physics courses.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Plasma Physics and Fusion Energy", "prerequisites": "Prerequisite: MA 401 and PY 208", "spring": false, "number": ")  528", "descripton": "Concepts in plasma physics, basics of thermonuclear reactions; charged particle collisions, single particle motions and drifts, radiation from plasmas and plasma waves, fluid theory of plasmas, formation and heating of plasmas, plasma confinement, fusion devices and other plasma applications.", "fall": true, "units": " 3"}, {"summer": false, "name": "Astrophysics", "prerequisites": "Prerequisite: PY 203 or 407; PY 411", "spring": true, "number": "PY  543", "descripton": "Basic physics necessary to investigate, from observational data, internal conditions and evolution of stars. The formation and structure of spectral lines, methods of energy generation and transport, stellar structure, degeneracy, white dwarfs and neutron stars.", "fall": false, "units": " 3"}, {"summer": false, "name": "Introduction To the Structure Of Solids", "prerequisites": "Prerequisite: C- or better in PY 401", "spring": true, "number": "PY  552", "descripton": "Basic considerations of crystalline solids, metals, conductors and semiconductors.", "fall": false, "units": " 3"}, {"summer": false, "name": "Electronics For Physicists", "prerequisites": "Prerequisite: Graduate standing", "spring": true, "number": "PY  561", "descripton": "Analog and digital electronics laboratory course serving as introduction to use of modern instrumentation required for experimental research in physics. Bipolar and field effect transistors, operational amplifiers, oscillators, power supplies, analog-digital and digital-analog conversion and digital logic circuits.", "fall": false, "units": " 3"}, {"summer": false, "name": "Polymer Physics", "spring": false, "number": ")  570", "descripton": "Polymer microstructures, polymer solutions, polymer physical states (including amorphous polymers, crystalline polymers, polymer melts, melting of polymers, glass-transition, and other transitions), polymer blends, polymer mechanical properties, polymer viscoelasticity and flow, multicomponent polymer systems, and modern polymer topics. The physics of polymer fibers. Graduate standing or permission of instructor.", "fall": true, "units": " 3"}, {"summer": "True", "name": " Interactions for Teachers I", "spring": "True", "number": "PY  581", "descripton": "First semester (mechanics) of a two-semester sequence intended to broaden and deepen in high school physics teachers their knowledge of introductory-level physics from a contemporary point of view.  Includes an introduction to computational physics.Departmental permission required: normally restricted to in-service high school physics teachers.", "fall": "True", "units": " 3"}, {"summer": "True", "name": " Interactions for Teachers II", "spring": "True", "number": "PY  582", "descripton": "Second semester (electricity and magnetism) of a two-semester sequence intended to broaden and deepen in high school physics teachers their knowledge of introductory-level physics from a contemporary point of view.  Includes an introduction to computational physics.  Departmental permission required: normally restricted to in-service high school physics teachers.  PY 581 prerequisite may be waived with strong background in physics and mathematics.", "fall": "True", "units": " 3"}, {"summer": true, "name": "Special Topics In Physics", "spring": true, "number": "PY  590", "descripton": "Investigations in physics under staff guidance. May consist of literature reviews, experimental or theoretical projects or special topics lectures. Credits Arranged", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Special Topics in Physics", "spring": true, "number": "PY  599", "descripton": "Investigations in physics under staff guidance. May consist of literature reviews, experimental or theoretical projects or special topics lectures. Credits arranged", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Seminar", "spring": true, "number": "PY  601", "descripton": "Reports on topics of current interest in physics. Several sections offered so that students with common research interests may be grouped together.", "fall": true, "units": " 1"}, {"summer": false, "name": "Special Topics", "spring": true, "number": "PY  610", "descripton": "Investigations in physics under staff guidance. May consist of literature reviews, experimental or theoretical projects or special topics lectures.  Credits Arranged.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Advanced Special Topics In Physics", "spring": true, "number": "PY  615", "descripton": "Advanced study in astrophysics, atomic and molecular physics, condensed matter physics, nuclear physics or plasma physics. Emphasis on new and rapidly developing research areas.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "PY  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "PY  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "PY  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": true, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "PY  693", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "PY  695", "descripton": "Thesis Research", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "PY  696", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "PY  699", "descripton": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis. Credits Arranged", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Advanced Quantum Mechanics I", "prerequisites": "Prerequisite: MA 512, PY 782", "spring": false, "number": "PY  711", "descripton": "Introduction to relativistic quantum theory of Dirac particles and the positron. Other topics including second quantization technique and its application to many-body problems, radiation theory and quantization of the electromagnetic field.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Quantum Mechanics II", "prerequisites": "Prerequisite: PY 601, PY 711", "spring": true, "number": "PY  712", "descripton": "A general propagator treatment of Dirac particles, photons and scalar and vector mesons. Applications of Feynman graphs and rules illustrating basic techniques employed in treatment of electromagnetic, weak and strong interactions. Renormalization theory, the effects of radiative corrections and aspects of the general Lorentz covariant theory of quantized fields.", "fall": false, "units": " 3"}, {"summer": false, "name": "Statistical Physics I", "prerequisites": "Prerequisite: PY 401, PY 413", "spring": true, "number": "PY  721", "descripton": "Basic elements of kinetic theory and equilibrium statistical mechanics, both classical and quantum; applications of the techniques developed to various ideal models of noninteracting particles.", "fall": false, "units": " 3"}, {"summer": false, "name": "Statistical Physics II", "prerequisites": "Prerequisite: PY 721", "spring": false, "number": "PY  722", "descripton": "A continuation of PY 721, with emphasis on the static and dynamic properties of real (interacting) systems. Topics including equilibrium theory of fluids and linear response theory of time-dependent phenomena.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Semiconductor Thin Film Technology", "prerequisites": "Prerequisite: ECE 404", "spring": "True", "number": ")  727", "descripton": "Techniques and processes encountered in growth and characterization of epitaxial semiconductor thin films. Interactions of gases at solid interfaces and gas phase dynamics related to epitaxial processes. Example of growth techniques are: solution growth, molecular beam epitaxy and chemical vapor deposition. Film characterization includes electrical, structural, optical, and chemical techniques. Issues involved in epitaxial growth such as: lattice match, critical layer thickness, heterostructures, superlattices and quantum wells.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Introduction To the Structure Of Solids II", "prerequisites": "Prerequisite: PY 552", "spring": false, "number": "PY  753", "descripton": "The properties of semiconductors, superconductors, magnets, ferroelectrics and crystalline defects and dislocations.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Properties of Surfaces and Interfaces", "prerequisites": "Prerequisite: PY(ECE) 552", "spring": "True", "number": "PY  754", "descripton": "Properties of surfaces and interfaces of materials.  Relation between electronic properties and atomic structure.  (A) Surfaces: thermodynamics, experimental techniques, structure and reconstruction.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Dielectric Films and their Interfaces", "prerequisites": "Prerequisite: PY 552", "spring": true, "number": "PY  755", "descripton": "This course addresses: i) local atomic structure of non-crystalline/amorphous dielectrics - experimental methods and theory; ii) classification of dielectric materials - by bond ionicity, bond density and bonding contraints/atom to discriminate between ideal covalent random networks, disrupted networks, and nano-crystallinity; iii) thermally-grown silicon dioxide and its interface with Si - the standard for alternative dielectrics; iv) electronic structure and bonding in transition metal/lathanide rare earth dielectrics; and v) intrinsic limitations on the performance and reliability of metal-oxide-semiconductor devices.", "fall": false, "units": " 3"}, {"summer": false, "name": "Quantum Mechanics I", "prerequisites": "Prerequisite: MA 512; PY 411 or 414; Graduate standing", "spring": true, "number": "PY  781", "descripton": "Fundamental concepts and formulations, including interpretation and techniques, and the application of theory to simple physical systems, such as the free particle, the harmonic oscillator, the particle in a potential well and central force problems. Other topics including approximation methods, identical particles and spin, transformation theory, symmetries and invariance, and an introduction to quantum theory of scattering and angular momentum.", "fall": true, "units": " 3"}, {"summer": false, "name": "Quantum Mechanics II", "prerequisites": "Prerequisite: MA 512; PY 411 or 414; Graduate standing", "spring": true, "number": "PY  782", "descripton": "Fundamental concepts and formulations, including interpretation and techniques, and the application of theory to simple physical systems, such as the free particle, the harmonic oscillator, the particle in a potential well and central force problems. Other topics including approximation methods, identical particles and spin, transformation theory, symmetries and invariance, and an introduction to quantum theory of scattering and angular momentum.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Classical Mechanics I", "prerequisites": "Prerequisite: MA 512, PY 412, PY 414; Graduate standing", "spring": false, "number": "PY  783", "descripton": "Introduction to theoretical physics in preparation for advanced study. Emphasis on classical mechanics, special relativity and the motion of charged particles. Topics including variational principles, Hamiltonian dynamics and canonical transformation theory, structure of the Lorentz group and elementary dynamics of unquantized fields.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Electricity and Magnetism I", "prerequisites": "Prerequisite: PY 415; Graduate standing", "spring": true, "number": "PY  785", "descripton": "Topics including techniques for solution of potential problems, development of Maxwell's equations; wave equations, energy, force and momentum relations of an electromagnetic field; covariant formulation of electrodynamics; radiation from accelerated charges.", "fall": true, "units": " 3"}, {"summer": false, "name": "Advanced Electricity and Magnetism II", "prerequisites": "Prerequisite: PY 415; Graduate standing", "spring": true, "number": "PY  786", "descripton": "Topics including techniques for solution of potential problems, development of Maxwell's equations; wave equations, energy, force and momentum relations of an electromagnetic field; covariant formulation of electrodynamics; radiation from accelerated charges.", "fall": true, "units": " 3"}, {"summer": true, "name": "Seminar", "spring": true, "number": "PY  801", "descripton": "Reports on topics of current interest in physics. Several sections offered so that students with common research interests may be grouped together.", "fall": true, "units": " 1"}, {"summer": false, "name": "Special Topics In Physics", "spring": true, "number": "PY  810", "descripton": "Investigations in physics under staff guidance. May consist of literature reviews, experimental or theoretical projects or special topics lectures. Credits Arranged", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Advanced Special Topics In Physics", "spring": true, "number": "PY  815", "descripton": "Advanced study in astrophysics, atomic and molecular physics, condensed matter physics, nuclear physics or plasma physics. Emphasis on new and rapidly developing research areas.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "PY  885", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Doctoral Preliminary Examination", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "PY  890", "descripton": "For students who are preparing for and taking written and/or oral preliminary exams.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "PY  893", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "PY  895", "descripton": "Dissertation Research", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "PY  896", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "PY  899", "descripton": "For students who have completed all credit hour requirements, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations.", "fall": true, "units": " 1-3"}]