[{"summer": true, "name": "Principles of Sociology", "spring": true, "number": "SOC  202", "descripton": "Introduction to sociology. Analyses of key processes and institutions including interaction, inequality, organization, socialization, and social change. Includes core sociological concepts, methods, theories.", "fall": true, "units": " 3"}, {"summer": true, "name": "Current Social Problems", "spring": true, "number": "SOC  203", "descripton": "Examination of social problems linked to structures of economic, political, gender and racial inequality; including poverty, disease, racism, sexism, unemployment, psychological distress, educational failure, environmental destruction and violence. Possible solutions viewed from a variety of perspectives.   Includes core sociological concepts, methods and theories.", "fall": true, "units": " 3"}, {"summer": true, "name": "Sociology of Family", "spring": true, "number": ")  204", "descripton": "Contemporary American family structures and processes and their development. Focus on socialization, mate selection, marital adjustment and dissolution. Includes core sociological concepts, methods, theories.", "fall": true, "units": " 3"}, {"summer": true, "name": "Jobs and Work", "spring": true, "number": "SOC  205", "descripton": "Work experience in terms of intrinsic and extrinsic rewards for worker.  Work experience as intersection of occupation, industry, organization, region, and time period.  Research skills for comparing job options to individual goals.   Includes core sociological theories, concepts and methods.", "fall": true, "units": " 3"}, {"summer": true, "name": "Social Deviance", "spring": true, "number": "SOC  206", "descripton": "Social processes in the creation and maintenance of deviant populations: classification, objectification of social meanings, functions of subcultures and social outcomes of the deviance-ascription process. Includes core sociological concepts, methods, theories.", "fall": true, "units": " 3"}, {"summer": false, "name": "Cultural Geography", "spring": true, "number": ")  220", "descripton": "Investigates the world's past and present cultural diversity by studying spatial patterns of population, language, religion, material and non-material culture, technology and livelihoods, communities and settlements and political organization and interaction.", "fall": true, "units": " 3"}, {"summer": false, "name": "Sociology of Agriculture and Rural Society", "spring": true, "number": "SOC  241", "descripton": "Application of sociological concepts, methods, theories and styles of reasoning to major social problems facing rural America. Changing structure of agriculture; social impact of agricultural technology; rural community growth and decline; rural industrialization, rural poverty, natural resources and environmental issues in rural America. Includes core sociological concepts, methods, theories.", "fall": true, "units": " 3"}, {"summer": false, "name": "Technology in Society and Culture", "spring": true, "number": ")  261", "descripton": "Processes of social and cultural change with a focus on role of technological innovation. Cross-cultural emphasis. Workplace changes and societal risks associated with technological innovations.  Special attention to the role of scientists and engineers in socio-cultural change.  Topical case studies apply course concepts and principles.  Core sociological and anthropological concepts, methods, theories.", "fall": true, "units": " 3"}, {"summer": true, "name": "Special Topics in Sociology", "spring": true, "number": "SOC  295", "descripton": "Offered as needed to present 200-level subject materials not normally available in regular course offerings or for new courses on a trial basis.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Social Research Methods", "prerequisites": "Prerequisite: SOC 202, Corequisite: ST 311", "spring": true, "number": "SOC  300", "descripton": "Basic methods of social research, research design, sampling, data collection, measurement, and analysis; the relationship between theory and research. Laboratory exercises on computer applications.", "fall": true, "units": " 4"}, {"summer": true, "name": "Human Behavior", "prerequisites": "Prerequisite: 3 cr. in SOC, 200 level", "spring": true, "number": "SOC  301", "descripton": "The development of personality as a consequence of social interactions and behavior of individuals in social contexts. Processes of learning, socialization, social perception, organization, stability and change of attitudes, norms, norm-formation and conformity, social roles and role strain, interpersonal attraction, and intergroup and intragroup relations.", "fall": true, "units": " 3"}, {"summer": false, "name": "Women and Men in Society", "prerequisites": "Prerequisite: 3 cr. in SOC, 200 level", "spring": true, "number": ")  304", "descripton": "A sociological analysis of women and men in contemporary American society.  Perpetuation of and change in gender stratification using sociological concepts. theories and research.  How gender expectations developed and transmitted.  Historical data and research on diversity in American society used for analysis of causes and consequences of gender inequality.", "fall": true, "units": " 3"}, {"summer": true, "name": "Racial and Ethnic Relations", "prerequisites": "Prerequisite: 3 cr. in SOC, 200 level", "spring": true, "number": ")  305", "descripton": "Study of the nature of the relationships among racial and ethnic groups in societies around the world but with emphasis on the United States. Explores topics such as inequalities of wealth, power, and status, racism, conflict, and social boundaries among groups. Current trends in intergroup relations are discussed.", "fall": true, "units": " 3"}, {"summer": true, "name": "Criminology", "prerequisites": "Prerequisite: 3 cr. in SOC, 200 level", "spring": true, "number": "SOC  306", "descripton": "Study of processes whereby behavior is defined as crime and persons are identified as criminals. Includes a sociological investigation of agencies of law enforcement, adjudication, corrections and prevention; patterns of criminal behavior; explanations of variations in criminality with emphasis on sociocultural and sociopsychological theories.", "fall": true, "units": " 3"}, {"summer": false, "name": "Religion and Society", "prerequisites": "Prerequisite: 3 cr. in SOC, 200 level", "spring": false, "number": ")  309", "descripton": "Religious beliefs, practices and organizations addressed as social phenomena. Structural functionalism, conflict and subjectivism as theoretical orientations for understanding influences between religion and society. Relationship of religions to family, government, and economy and to social divisions, conflict and change.", "fall": false, "units": " 3"}, {"summer": true, "name": "Managers, Work, and Organizations", "prerequisites": "Prerequisite: Any 200-level SOC, SOC 205 recommended", "spring": true, "number": "SOC  310", "descripton": "Sociological analysis of managers, who they are, and what they do.  How recent changes in the U.S. economy have altered managers' work. How managers influence and adapt to the organizational environment.  Relationship of management and labor in the production process.", "fall": true, "units": " 3"}, {"summer": true, "name": "Community Relationships", "prerequisites": "Prerequisite: 3 cr. in SOC, 200 level", "spring": true, "number": "SOC  311", "descripton": "Institutions, organizations and agencies found in modern communities; social problems and conditions with which they deal; their interrelationships and trends toward comprehensive planning.", "fall": true, "units": " 3"}, {"summer": false, "name": "International Development", "prerequisites": "Prerequisite: 3 cr. in SOC, 200 level", "spring": false, "number": "SOC  342", "descripton": "Sociological explanations of the causes of development and underdevelopment and origins of the present world system with emphasis on lesser developed countries. Recent global changes in the world situation including the increasing internationalization and interdependence of all countries.", "fall": true, "units": " 3"}, {"summer": false, "name": "Population and Planning", "prerequisites": "Prerequisite: 3 credits in SOC at the 200 level", "spring": false, "number": "SOC  351", "descripton": "Effects of births, deaths and migration on population size, composition and distribution. Comparisons across societies.  Socioeconomic and political implications of demographic change. Impact of alternative policies on demographic processes.", "fall": true, "units": " 3"}, {"summer": false, "name": "Sociology of Medicine", "prerequisites": "Prerequisite: 200 level Sociology", "spring": true, "number": "SOC  381", "descripton": "Use of theory and empirical studies to understand the social etiology of disease health practices, practitioners, and institutions, and the special area of mental health. Historical as well as contemporary examples of social influences on, and effects of, health throughout the world, but especially in the United States. Core sociological concepts, methods, theories.", "fall": true, "units": " 3"}, {"summer": true, "name": "Special Topics in Sociology", "prerequisites": "Prerequisite: 3 credits of a 200-level Sociology", "spring": true, "number": "SOC  395", "descripton": "Offered as needed to present 300-level subject materials not normally available in regular course offerings or for new courses on a trial basis.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Theories of Social Structure", "prerequisites": "Prerequisite: 3 cr. in SOC, 200 level", "spring": true, "number": "SOC  400", "descripton": "Contributions of Durkheim, Marx, Weber and others to contemporary macro-level sociological theories. Origins and development of functionalist and conflict approaches. Theories of social solidarity, class structure, the state, bureaucratization, ideology. Uses of original works.", "fall": true, "units": " 3"}, {"summer": true, "name": "Theories of Social Interaction", "prerequisites": "Prerequisite: 3 cr. in SOC, 200 level", "spring": true, "number": "SOC  401", "descripton": "Contributions of Weber, Simmel, Mead, Homans, Goffman and others to contemporary micro-level sociological theories. Origins and development of symbolic interaction, ethnomethodology, exchange theory and dramaturgy. Theories of the self, social construction of reality, emotions, interpersonal relationships.  Interrelationship of theory and research; use of original works.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Urban Sociology", "prerequisites": "Prerequisite: SOC 300", "spring": "True", "number": "SOC  402", "descripton": "Urban social structures emphasizing determinants and consequences of changes in urban places and life styles. Current urban problems and various approaches to urban social planning.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Families and Work", "prerequisites": "Prerequisite: SOC 200 level, SOC 300", "spring": true, "number": "SOC  404", "descripton": "Sociological analysis of the interplay between economy and family.  How men and women make decisions regarding work and family.  Theory and research techniques appropriate to the student of work/family conflicts.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Racism in the U.S.", "prerequisites": "Prerequisite: SOC 300", "spring": "True", "number": "SOC  405", "descripton": "The course will examine the nature of racism in American society and its correlates: prejudice, discrimination, racial conflict, and racial oppression. Emphasis on the history and development of racism in the U.S. as well as its impact on minority groups. Sociological explanations for the emergence and continuation of racism.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Sociology of Sexualities", "prerequisites": "Prerequisite: 3 hours SOC 200 level, 300 level", "spring": true, "number": ")  407", "descripton": "Exploration of sexuality in a social context.  Relationship between sexuality, gender and power in the U.S.  Historical trends in behaviors and identities: social movements and sexual issues; current behavioral trends.  Some issues covered; identity, social construction, sexual meanings.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Sociology of Organizations", "prerequisites": "Prerequisite: 3 cr. in SOC, 200 level, SOC 300", "spring": "True", "number": "SOC  410", "descripton": "Application of sociological theories to study of organizational structures and processes. Special attention to control and coordination, relations with other organizations, and decision making.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Criminal Justice Field Work", "prerequisites": "Prerequisite: SOC 306 and PS 305, Senior standing in Criminal Justice option", "spring": true, "number": ")  413", "descripton": "Supervised observation and experience in a criminal justice agency. Study of relationships between ongoing programs and relevant political and sociological theory and research. Weekly seminars, small groups and individual conferences. Presentation of an integrative report.", "fall": true, "units": " 4"}, {"summer": "True", "name": "Social Class", "prerequisites": "Prerequisite: SOC 300", "spring": "True", "number": "SOC  414", "descripton": "The universality of social inequality, its bases and consequences. Relationship of social inequality to social class, life chances, life styles and social mobility. Theories and research methods pertinent to the study of social class.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Sociology of Education", "prerequisites": "Prerequisite: SOC 300", "spring": false, "number": "SOC  418", "descripton": "Application of sociological theories to education, relating processes of stratification, socialization and organization. Sociological analysis of classrooms and learning. Connections of schooling with family, community and work. Cross-cultural and U.S. research.", "fall": true, "units": " 3"}, {"summer": true, "name": "Juvenile Delinquency", "prerequisites": "Prerequisite: 3 cr. in SOC 200-level; SOC 300", "spring": true, "number": "SOC  425", "descripton": "Nature and extent of juvenile delinquency; measurement problems; and biogenic, psychogenic and sociogenic theories of delinquency causation. Policy implications of delinquency theories for treatment and prevention. Evaluation of treatment and prevention programs.", "fall": true, "units": " 3"}, {"summer": false, "name": "Sociology of Law", "prerequisites": "Prerequisite: 3 cr. in SOC 200-level; SOC 300", "spring": false, "number": "SOC  427", "descripton": "Sociological concepts, theories and research of law as social control. Social forces behind the creation, maintenance and application of law in American Society.", "fall": true, "units": " 3"}, {"summer": false, "name": "Formal Institutions of Social Control", "prerequisites": "Prerequisite: 3 hours SOC 200 level; SOC 300", "spring": true, "number": "SOC  428", "descripton": "Development, structure and behavior of formal institutions of social control in the United States (police, courts, corrections); divergent philosophies of punishment that guide the juvenile and adult criminal justice system, dimensions of inequalitythat influence processing decisions and effectiveness of formal institutions in controlling violations of legal norms.", "fall": false, "units": " 3"}, {"summer": false, "name": "Data Analysis in Criminology", "prerequisites": "Prerequisite: SOC 300, SOC 306, ST311", "spring": true, "number": "SOC  429", "descripton": "Analysis of quantitative data in criminology.  Relationship between theory and research, operationalization and measurement.  Computer coding of social covariaties. Descriptive and inferential analysis.  Writing research reports.", "fall": false, "units": " 3"}, {"summer": false, "name": "Community and Crime", "prerequisites": "Prerequisite: 3 credits in SOC 200 level; SOC 300", "spring": true, "number": "SOC  430", "descripton": "Neighborhood development, structure and processes as related to delinquency, crime and criminality.  Divergent theories of the effect of neighborhood context on crime and crime on neighborhood processes.  The interaction of person and neighborhood context.  Implications of community processes for social control.", "fall": false, "units": " 3"}, {"summer": false, "name": "Violence, Terrorism, and Public Policy", "prerequisites": "Prerequisite: SOC 300 or PS 371", "spring": true, "number": ")  432", "descripton": "The course examines interpersonal and group violence in contemporary societies and the causes for its occurrences. Specific forms of violence that will be examined include domestic violence, gangs, homicide, and terrorism, domestically and internationally. Throughout the course students will use data to critically evaluate policies and practices to prevent and control violence and will examine potential solutions to the problems of violence.", "fall": true, "units": " 3"}, {"summer": false, "name": "Social Change", "prerequisites": "Prerequisite: 3 cr. in SOC, 200 level; SOC 300", "spring": true, "number": "SOC  440", "descripton": "Sources, processes and consequences of social change on macro and micro levels. Applications of classical and contemporary theories to historical and modern examples of social change in international, national, regional, community, and institutionalsettings. Examples of empirical studies and appropriate methodologies for each level of analysis.", "fall": false, "units": " 3"}, {"summer": false, "name": "Inequality, Ideology, and Social Justice", "prerequisites": "Prerequisite: 3 hours of 200-level SOC and SOC 300", "spring": false, "number": "SOC  445", "descripton": "Systematically addresses the question of why people believe what they do about the legitimacy of inequality; explores the role of self-interest, secular and religious values, considers specific types of ideology such as meritocracy, racism, sexism, colonialism; applies various theories to explain patterns of belief; looks at the role of media and propaganda in shaping beliefs.", "fall": true, "units": " 3"}, {"summer": false, "name": "Environmental Sociology", "prerequisites": "Prerequisite: 3 hours SOC 200 level, SOC 300", "spring": false, "number": "SOC  450", "descripton": "Systematic relations between natural environment and human societies. Dependency on the natural world.  Population technology, cultural and economic influences on ecosystems.  Development of environmentalism and alternative models for understanding threats and potentials.  current environmental issues and considerations of their global contexts.", "fall": true, "units": " 3"}, {"summer": false, "name": "Corporate Power in America", "prerequisites": "Prerequisite: (SOC 202 or SOC 203) and SOC 300", "spring": true, "number": "SOC  457", "descripton": "Examines the nature, distribution, and exercise of power in U.S. society. Emphasizes corporate power and its relationship to government. Topics include membership in the upper class and the power elite, media and shaping of public opinion, the culture of politics, formation of political consciousness, and the emergence of oppositional and reactionary social movements.", "fall": false, "units": " 3"}, {"summer": false, "name": "Social Aspects of Mental Health", "prerequisites": "Prerequisite: SOC 300", "spring": true, "number": "SOC  465", "descripton": "A survey of the role of social environment and life experiences in mental health and mental disorder, focusing on the link between social inequality and emotional inequality.  Topics include the social construction of mental illness and the classification process, social distribution of mental health, explanations of mental health differences.  Special emphasis on adolescent and adult traumas that shape the life course.", "fall": false, "units": " 3"}, {"summer": false, "name": "External Learning Experience", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "SOC  492", "descripton": "A learning experience in agriculture and life sciences within an academic framework that utilizes facilities and resources which are external to the campus. Contact and arrangements with prospective employers must be initiated by student and approved by a faculty adviser, the prospective employer, the departmental teaching coordinator and the academic dean prior to the experience.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Special Problems in Sociology", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": "SOC  493", "descripton": "A learning experience in agriculture and life sciences within an academic framework that utilizes campus facilities and resources. Arrangements must be initiated by student and approved by a faculty advisor and departmental teaching coordinator.", "fall": true, "units": " 1-6"}, {"summer": "True", "name": "Special Topics in Sociology", "spring": "True", "number": "SOC  495", "descripton": "Offered as needed to present materials not normally available in regular course offerings or for new courses on a trial basis.", "fall": "True", "units": " 1-3"}, {"summer": "True", "name": "Independent Study in Sociology", "prerequisites": "Prerequisite: Six hours SOC above the 200 level", "spring": "True", "number": "SOC  498", "descripton": "A detailed investigation of a topic in sociology. Topic and mode of study determined by the faculty member(s) in consultation with the department head.", "fall": "True", "units": " 1-6"}, {"summer": "True", "name": "Social Organization", "prerequisites": "Prerequisite: SOC 400 or SOC 701", "spring": "True", "number": "SOC  508", "descripton": "Introduction to study of social structure. Focus on inequality, work, organizations, the economy, the state. Classic writings and their impacts.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Population Problems", "prerequisites": "Prerequisite: SOC 202", "spring": "True", "number": "SOC  509", "descripton": "Examination of population growth, rates of change and distribution. Emphasis on functional roles of population, i.e., age, sex, race, residence, occupation, marital status and education. Stress on population dynamics fertility, mortality and migration. Analysis on population policy in relation to national and international goals stressing a world view.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Community Organization and Development", "prerequisites": "Prerequisite: SOC 202", "spring": "True", "number": "SOC  513", "descripton": "Community organization viewed as a process of bringing about desirable changes in community life. Study of community needs and resources. Stress on democratic processes in community action and principles of organization, along with techniques and procedures. Analysis of roles of lay and professional workers.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Developing Societies", "prerequisites": "Prerequisite: Six hrs. SOC or ANT or Graduate standing or PBS status", "spring": "True", "number": "SOC  514", "descripton": "Definition of major problems posed for development sociology and exploration of social barriers and theoretical solutions for development set forth with regard to newly developing countries. Review of significant past strategies and presentation of main themes in current development schemes. Proposal and discussion of untested strategies for the future. Examination of these problems in their national and international contexts.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "The Community", "prerequisites": "Prerequisite: Six hrs. SOC", "spring": "True", "number": "SOC  533", "descripton": "The community viewed in sociological perspective as a functioning entity. Presentation and application of a method of analysis to eight \"dimensions,\" with emphasis on the unique types of understanding to be derived from measuring each dimension. Finally, analysis of effect of change on community integration and development.", "fall": "True", "units": " 3"}, {"summer": true, "name": "Special Topics In Sociology", "spring": true, "number": "SOC  591", "descripton": "An examination of current problems organized on a lecture-discussion basis. Course content varies as changing conditions require new approaches to emerging problems.", "fall": true, "units": " 1-6"}, {"summer": "True", "name": "Seminar", "spring": "True", "number": "SOC  601", "descripton": "Appraisal of current literature; presentation of research papers by students; progress reports on departmental research; review of developing research methods and plans; reports from scientific meetings and conferences; other professional matters. Credits Arranged", "fall": "True", "units": " 1-3"}, {"summer": false, "name": "Special Topics In Sociology", "spring": true, "number": "SOC  610", "descripton": "An examination of current problems organized on a lecture-discussion basis. Course content varies as changing conditions require new approaches to emerging problems.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Practicum In Sociology", "prerequisites": "Prerequisite: Graduate standing in the Master of Sociology program and nine hrs. of SOC at the 500-600 level", "spring": true, "number": "SOC  642", "descripton": "Opportunity for student under supervision of graduate advisory committee chair and organization/agency supervisor to develop and demonstrate competency in the area of graduate specialization through application of sociological knowledge to practicalproblems facing the organization/agency.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "SOC  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "SOC  690", "descripton": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam. Credits Arranged", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "SOC  693", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "SOC  695", "descripton": "Thesis Research", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "SOC  696", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "SOC  699", "descripton": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis. Credits arranged", "fall": true, "units": " 1-3"}, {"summer": "True", "name": "Classical Sociological Theory", "prerequisites": "Prerequisite: Six hrs. SOC and Graduate standing or PBS status", "spring": "True", "number": "SOC  701", "descripton": "The interdependence of theory and research in sociology; major theoretical classics in the discipline and how they provide foundations for subsequent developments and for analysis in substantive areas.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Contemporary Sociological Theory", "prerequisites": "Prerequisite: SOC 701", "spring": "True", "number": "SOC  702", "descripton": "Works by major figures representing leading schools of sociological theory in the post-World War II period studied as primary sources. Underlying assumptions made explicit, the structure of the theory, including propositions, examined critically anddiscussion of relationships with other theoretical perspectives.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Theory Construction", "prerequisites": "Prerequisite: SOC 701", "spring": "True", "number": "SOC  703", "descripton": "Providing students with a capability to develop theoretical frames of reference within which to devise and implement research activities. Acquainting students with philosophical and disciplinary bases of theory, establishing relationship between theory and research and enabling objective evaluation of theoretical positions encountered in the literature.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Feminist Thought in the Social Sciences", "prerequisites": "Prerequisite: SOC 701 and SOC 702", "spring": false, "number": ")  704", "descripton": "This course is designed to provide an overview of feminist thought in the social sciences.  We evaluate theoretical writings on social structure, social processes, the development of consciousness about gender inequality.  We include both discussionof and distortions within mainstream theory and the recent development of alternative theory using the standpoint of women as a point of departure.  We begin with general theoretical issues and move quickly to the complexity of matrices of dominationwithin U.S. and global contexts.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Quantitative Sociological Analysis", "prerequisites": "Prerequisite: ST 507", "spring": "True", "number": "SOC  707", "descripton": "Introduction to application of common quantitative methodologies in sociology including multiple regression and path analysis. Emphasis on selecting appropriate analytical techniques, model estimation and sociological interpretation of findings.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Advanced Sociological Analysis", "prerequisites": "Prerequisite: SOC 711, ST 507 or ST 711", "spring": "True", "number": "SOC  708", "descripton": "Examination of advanced analysis techniques adaptable to needs of sociological research. Special attention given to causal analysis, analysis of change and aggregate versus individual level data analyses. Consideration of sociological examples. Attention to emerging issues and techniques.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Teaching Sociology", "prerequisites": "Prerequisite: Admission to sociology graduate program", "spring": true, "number": "SOC  710", "descripton": "The objective of this course is for students to further their skills in teaching sociology.  Students will plan an undergraduate course, construct a teaching philosophy, evaluate a variety of teaching techniques, and demonstrate an understanding of teaching as a sociological phenomenon.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Research Methods In Sociology I", "prerequisites": "Prerequisite: SOC 300, ST 311", "spring": "True", "number": "SOC  711", "descripton": "Issues in philosophy of science, causation, relationship of theory and research. Qualitative, experimental and survey design methodologies.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Advanced Survey Research Methods", "prerequisites": "Prerequisite: SOC 711 and SOC 707", "spring": true, "number": "SOC  712", "descripton": "Advanced survey methodology including research design, sampling, questionnaire development and surveys using the World Wide Web.  Designing and executing substantive and methodological studies using surveys to perationalize behavioral and social constructs and to test hypotheses.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Applied Research", "prerequisites": "Prerequisite: SOC 202", "spring": "True", "number": "SOC  713", "descripton": "Studies research process with emphasis upon its application to action problems. Stress upon development of research design to meet action research needs.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Qualitative Sociological Methods and Analysis", "prerequisites": "Prerequisite: Graduate standing", "spring": false, "number": "SOC  715", "descripton": "Survey of qualitative sociological research methods.  Practice in research design and evaluation, multiple forms of data gathering and data analysis.  Theoretical and epistemological issues as related to qualitative sociology, with special attentionto ritical and feminist epistemological debates.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Deviant Behavior", "prerequisites": "Prerequisite: Six hrs. SOC or ANT or Graduate standing or PBS status", "spring": "True", "number": "SOC  721", "descripton": "Topics include: the inevitability of deviance and its social utility; cross-cultural variations in appearance and behavioral cues for labeling the deviant; descriptive and explanatory approaches to kinds and amounts of deviance in contemporary American society; social change, anomie and social disorganization theories; the process of stigmatization; formal and informal societal responses to deviance and the deviant; social action implications.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Social Control", "prerequisites": "Prerequisite: Six hrs. SOC above 200 level or Graduate standing or PBS status", "spring": "True", "number": "SOC  722", "descripton": "Examination of need, functions, utilization and effects of both informal and formal social control mechanisms. Emphasis and critical evaluation of theoretical perspectives on social control and the empirical support for these positions.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Research On Crime and Deviance", "prerequisites": "Prerequisite: SOC 721", "spring": "True", "number": "SOC  723", "descripton": "Major topics including an examination of conceptual problems and research issues and methods in study of crime and deviance; an assessment of current research on crime causation and deviance processes; an examination of research on social control processes and agencies; and an assessment of social action and evaluative research. A variety of substantive topics dealt with in the context of above topical areas including: delinquency, drug usage, mental illness, obesity, stuttering, suicide, prostitution, homicide and rape.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Comparative Societies", "prerequisites": "Prerequisite: Six hrs. SOC", "spring": "True", "number": "SOC  727", "descripton": "Sociological analysis of societies around the world with particular reference to North and South America. Special emphasis given to cultural and physical setting, population composition, levels of living, relationship of the people to the land, structure and function of major institutions and forces making for change.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Survey Of Family Sociology", "prerequisites": "Prerequisite: SOC 202", "spring": "True", "number": "SOC  731", "descripton": "Examination of structural and demographic continuities and changes for American families in general and within major subgroups (e.g., race, ethnicity, social class). Consideration of historical and cross-cultural comparisons. Assessment of the impact of families upon their members and the dynamics of marital and family relationships.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Contemporary Family Theory and Research", "prerequisites": "Prerequisite: SOC 731", "spring": "True", "number": "SOC  732", "descripton": "Emphasis on contemporary research, theory and methodological techniques used by sociologists studying families. Critical examination of where field is now and where it appears to be heading. Primarily for graduate students designing or doing research about families.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Social Stratification", "prerequisites": "Prerequisite: Six hrs. SOC", "spring": "True", "number": "SOC  736", "descripton": "The theoretical background, methodological approaches and analysis of the consequences of systems of stratification. Emphasis on static and dynamic qualities of stratification systems on relations within and between societies. Attention to the integrative and divisive quality of stratification as expressed in life styles, world views, etc.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Sociology Of Gender", "prerequisites": "Prerequisite: Graduate student, SOC 736 or 731", "spring": false, "number": ")  737", "descripton": "Theories about the development and maintenance of gender.  Historical development of gender stratification.  How individuals \"do gender\" in their daily lives.  Contemporary research and substantive readings about gender in public and intimate relationships.", "fall": true, "units": " 3"}, {"summer": false, "name": "Race and Ethnic Inequality", "prerequisites": "Prerequisite: Six hours of Sociology", "spring": true, "number": "SOC  738", "descripton": "Theoretical and methodological approaches and critical debates on race. Impact of racial discrimination on inequality.  Effects of inequality on community institutions.  Formation of attitudes and identities.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Social Psychology Of Inequality", "prerequisites": "Prerequisite: SOC 746 or 508", "spring": "True", "number": ")  739", "descripton": "The effects of race, class and gender inequality on the formation of group consciousness, self-evaluations, emotions, values, attitudes and beliefs. Attention  to interpersonal processes through to reproduction of inequality in everyday life.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Social-Psychological Processes In Health and Illness", "prerequisites": "Prerequisite: SOC 505", "spring": "True", "number": "SOC  742", "descripton": "Contemporary issues in the sociology of health and illness from a social psychological perspective.  The social meaning of illness, social group differences in health, social causes of distress, morbidity and mortality, and measurement of health andillness.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Psychiatric Sociology and Mental Health", "prerequisites": "Prerequisite: SOC 505", "spring": false, "number": "SOC  743", "descripton": "Major issues in mental health.  Epidemiology, causes, course, consequences, correlates, treatment, institutions, and services for mental illness.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Sociological Social Psychology", "prerequisites": "Prerequisite: SOC 401t", "spring": "True", "number": "SOC  746", "descripton": "Central issues in sociological social psychology, including formation of the self, effects of social structure on individual development, emergence of ritualized interaction and tension between individual agency and societal constraint. Emphasis on symbolic interactionist and dramaturgical perspectives.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Social Psychology", "prerequisites": "Prerequisite: Six hrs. SOC", "spring": "True", "number": "SOC  747", "descripton": "The presentation of the major ideas of social psychology in context of the theoretical orientations from which they have emerged. Examination of nature and role of theory in social psychology. The social psychologies of various theorists then examined in terms of their particular approaches including the Gestalt, Field, Role, Psychoanalytic and Reinforcement orientations and combinations of these.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Work and Industry", "prerequisites": "Prerequisite: SOC 400 or SOC 508 or SOC 701", "spring": "True", "number": "SOC  752", "descripton": "Control of economy and workplace. Special attention to economic restructuring, the labor process and recent workplace innovations. Theories include managerialism, bank hegemony and deskilling. Historical studies complement analyses of contemporary settings and issues.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Inequality in Work and the Economy", "prerequisites": "Prerequisite: SOC 701", "spring": true, "number": "SOC  753", "descripton": "Sociological study of structural inequality in labor markets and workplaces with implications for class, race, gender, and spatial disparities in employment-related outcomes.  Special attention is paid to job quality, spatial disparities in employment opportunity, and processes contributing to race and gender disparities in job attainment and rewards.", "fall": false, "units": " 3"}, {"summer": false, "name": "Economic Sociology", "prerequisites": "Prerequisite: SOC 701", "spring": true, "number": "SOC  754", "descripton": "Embeddedness of economic action by individuals, firms, and states within a social context.  Topics include globalization, restructuring, the informal economy, social capital, spatial organization, labor markets and role of the state.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Sociological Analysis Of Agricultural Development", "prerequisites": "Prerequisite: Six hrs. SOC or Graduate standing", "spring": "True", "number": "SOC  756", "descripton": "Systematic sociological analysis of agricultural development and change, emphasizing less-developed countries. Review of classical and contemporary theoretical perspectives. Specific topics: land tenure and agricultural development; peasants and peasant societies; peasant revolt and revolution; women and development.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Rural Sociology", "prerequisites": "Prerequisite: Six hours of Sociology", "spring": true, "number": "SOC  758", "descripton": "Rural conditions and trends including environmental resources; human and social resources; institutions and change; theory, research and rural development policy.", "fall": false, "units": " 3"}, {"summer": true, "name": "Special Topics In Sociology", "spring": true, "number": "SOC  791", "descripton": "An examination of current problems organized on a lecture-discussion basis. Course content varies as changing conditions require new approaches to emerging problems.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Seminar", "spring": true, "number": "SOC  801", "descripton": "Appraisal of current literature; presentation of research papers by students; progress reports on departmental research; review of developing research methods and plans; reports from scientific meetings and conferences; other professional matters. Credits Arranged", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Special Topics In Sociology", "spring": true, "number": "SOC  810", "descripton": "An examination of current problems organized on a lecture-discussion basis. Course content varies as changing conditions require new approaches to emerging problems.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Doctoral Supervised Teaching", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "SOC  885", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Doctoral Preliminary Exam", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "SOC  890", "descripton": "For students who are preparing for and taking written and/or oral preliminary exams.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Supervised Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "SOC  893", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Doctoral Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "SOC  895", "descripton": "Dissertation Research", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Dissertation Research", "prerequisites": "Prerequisite: Doctoral student", "spring": false, "number": "SOC  896", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Doctoral Dissertation Preparation", "prerequisites": "Prerequisite: Doctoral student", "spring": true, "number": "SOC  899", "descripton": "For students who have completed all credit hour requirements, full-time enrollment, preliminary examination, and residency requirements for the doctoral degree, and are writing and defending their dissertations.", "fall": true, "units": " 1-3"}]