[{"summer": false, "name": "Textile Engineering: Materials and Systems", "prerequisites": "Corequisite: CH 101", "spring": true, "number": "TE  105", "descripton": "Introducation to textile engineering, polymers and fibers with emphasis on applications. Discussions of what makes macromolecules unique and pairing of material properties to a given application. Other discussions by various TE faculty giving students a picture of the breadth of the program. This course will also help develop leadership/team work skills and oral/written communications.", "fall": false, "units": " 2"}, {"summer": false, "name": "Computer-Based Modeling for Engineers", "prerequisites": "Prerequisite: E 115, Corequisite: MA 141", "spring": true, "number": ")  110", "descripton": "Introductory course in computer-based modeling and programming using Visual Basic for Applications. Emphasis on algorithm development and engineering problem solving. Methodical development of VBA within applications like Microsoft Excel and Access from specifications; documentation, style; control structures; classes and methods; data types and data abstraction; object-oriented programming and design; graphical user interface design. Projects: design problems from electrical, industrial, textile, and financial systems. Functional relationships will be given and programs will be designed and developed from a list of specifications.", "fall": true, "units": " 3"}, {"summer": false, "name": "Introduction to Polymer Science and Engineering", "prerequisites": "Prerequisite: CH 101", "spring": true, "number": "TE  200", "descripton": "Science and engineering of large molecules. Correlation of molecular structure and properties of polymers in solution and in bulk. Introductory polymer synthesis and kinetics. Analysis of physical methods for characterization of molecular weight, morphology, rheology, and mechanical behavior. The content will be focused on polymer synthesis, structure, and properties. The course will focus on a thorough understanding of polymer concepts and definitions, equations to calculate properties, and equipment used to measure properties.", "fall": true, "units": " 3"}, {"summer": false, "name": "Textile Engineering Science", "prerequisites": "Prerequisite: MA 241, PY 205; and Corequisite: TE/ISE 110", "spring": true, "number": "TE  201", "descripton": "Structure, physical and mechanical properties of fibers; structure of assemblies.  Structure/property relations.  Laboratory exercises in characterization of fiber properties.", "fall": false, "units": " 4"}, {"summer": false, "name": "Analog and Digital Circuits", "prerequisites": "Prerequisite: C- or better in TE 110, PY 208, Corequisite: MA 341", "spring": true, "number": "TE  205", "descripton": "Fundamentals of analog and digital circuit analysis and design. The course will present the systematic analysis and design of AC and DC circuits using Ohms and Kirchhoff's laws, the node voltage method, Thevenin and Norton's theorem, Laplace Transforms, resistance, capacitance, inductance, operational amplifiers, and frequency response. Next, the design of combinatorial and synchronous sequential circuit design will be covered using Karnaugh maps, laws of Boolean algebra, flip-flops, state machines, and latches. Laboratory exercises will supplement the topics presented in class.", "fall": false, "units": " 4"}, {"summer": false, "name": "Engineering Textile Structures I: Linear Assemblies", "prerequisites": "Prerequisite: (MAE 206 or CE 214) and MA 242", "spring": false, "number": "TE  301", "descripton": "Engineering analysis of textile structures, especially yarns. Unit processes of production, handling and packaging. Production sequences, intermachine effects, machine design and their consequences on the textile product.", "fall": true, "units": " 3"}, {"summer": false, "name": "Textile Manufacturing Processes and Systems II", "prerequisites": "Prerequisite: TE 301 and C- or better in TE/ISE 110", "spring": true, "number": "TE  302", "descripton": "Mechanisms used in the production of woven, knitted and nonwoven fabrics. Design and operation of these mechanisms and their impact on the fabric. System dynamics of the different fabric forming processes.", "fall": false, "units": " 4"}, {"summer": false, "name": "Thermodynamics for Textile Engineers", "prerequisites": "Prerequisite: MA 242, PY 208", "spring": false, "number": "TE  303", "descripton": "Introduction to the concept of energy and the laws governing the transfer and transformation of energy with an emphasis on thermodynamic properties and the First and Second Laws of Thermodynamics. The fundamentals of thermodynamics will be emphasized, although more applied examples and problems will be heavily utilized.", "fall": true, "units": " 3"}, {"summer": false, "name": "Textile Engineering Design I", "prerequisites": "Prerequisite: TE 302", "spring": false, "number": "TE  401", "descripton": "The design process including initial specification, design constraints, sources of information and design strategy. Development of fact-finding ability in areas unfamiliar to the student. Analysis of existing designs and the development of improved or new designs.", "fall": true, "units": " 4"}, {"summer": false, "name": "Textile Engineering Design II", "prerequisites": "Prerequisite: TE 401", "spring": true, "number": "TE  402", "descripton": "Application of textile engineering principles using team approach to design, construct and analyze novel engineering solutions to textile industry problems.  Evaluation of design to assess the impact on worker, industry and society.", "fall": false, "units": " 4"}, {"summer": false, "name": "Textile Engineering Quality Improvement", "prerequisites": "Prerequisite: ST 370 and C- or better in TE/ISE 110", "spring": true, "number": "TE  404", "descripton": "Defining and quantifying quality of textile products; quality improvement using statistical process control (SPC) and design of experiment (DOE) techniques.", "fall": false, "units": " 3"}, {"summer": false, "name": "Textile Engineering Quality Improvement Laboratory", "prerequisites": "Corequisite: TE 404", "spring": true, "number": "TE  424", "descripton": "Application of process improvement methods to textile systems using statistical software. Laboratory supplements lecture material presented in TE 404.", "fall": false, "units": " 1"}, {"summer": false, "name": "Process Systems Analysis and Control", "prerequisites": "Prerequisite: (MA 341 and TE 205) or CHE 312", "spring": true, "number": ")  435", "descripton": "Dynamic analysis and continuous control of chemical and material engineering processes. Process modeling; stability analysis, design and selection of control schemes. Solution of differential equations using Laplace transform techniques.", "fall": true, "units": " 3"}, {"summer": false, "name": "Textile Information Systems Design", "prerequisites": "Prerequisite: C- or better in TE/ISE 110 and JR standing", "spring": false, "number": "TE  440", "descripton": "Textile information system design, real-world constraints.  Principles of hardware, software, security and ethics issues.  Emphasis on solving a real world problem. Credit will not be given for both TE 440 and TE 540.", "fall": true, "units": " 4"}, {"summer": false, "name": "Polymer Engineering", "prerequisites": "Prerequisite: MSE 201 or BME 203; and Corequisite: TE 303, MAE 301, or MSE 301", "spring": false, "number": "TE  463", "descripton": "Chemical and physical properties of polymers and fibers; thermodynamics of crystallization, time dependent phenomena, fracture mechanics and rheology.  Advanced topics in extrusion.", "fall": true, "units": " 3"}, {"summer": false, "name": "Polymeric Biomaterials Engineering", "prerequisites": "Prerequisite: PY 208 and (TE 200 or CH 220 or CH 221)and(MAE 206 or CE 214)", "spring": false, "number": ")  466", "descripton": "In-depth study of the engineering design of biomedical polymers and implants.  Polymeric biomaterials, including polymer synthesis and structure, polymer properties as related to designing orthopedic and vascular grafts.  Designing textile products as biomaterials including surface modification and characterization techniques.  Bioresorbable polymers.", "fall": true, "units": " 3"}, {"summer": false, "name": " Implants Requirements", "prerequisites": "Prerequisite: (ZO 160 or BIO 183) and (MAE 314 or CE 313)", "spring": true, "number": ")  467", "descripton": "Application of engineering and biological principles to understand the structure and performance of tendons, ligaments, skin, and bone; bone mechanics; viscoelasticity of soft biological tissues; models of soft biological tissues; mechanics of skeletal muscle; and tissue-derived devices as well as interfaces between native tissues and synthetic devices.", "fall": false, "units": " 3"}, {"summer": false, "name": "Special Topics in Textile Engineering", "spring": true, "number": "TE  492", "descripton": "Presentation of material not normally available in regular course offerings or offering of new courses on a trial basis. Credits and content determined by faculty member in consultation with the Department Head.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Textile Systems and Control", "prerequisites": "Prerequisite: TE 305, CSC 114", "spring": true, "number": "TE  505", "descripton": "Theory and application of instruments and control systems used in modern textile plants.  Description of basic instruments and computer systems along with their use in process control, production control, research and development.", "fall": false, "units": " 3"}, {"summer": false, "name": "Lean Six Sigma Quality", "prerequisites": "Prequisite: ST 361 and ST 371,  or equivalent", "spring": true, "number": ")  533", "descripton": "Systematic approach (Lean Six Sigma philosophy) for improving products and processes. Defining the improvement opportunity, measurement system analysis, data collection, statistical analysis, design of experiment (DOE) methods, and statistical process control (SPC) methods. Application of Lean Six sigma methods to improve product or process.", "fall": true, "units": " 3"}, {"summer": false, "name": "Textile Information Systems Design", "prerequisites": "Prerequisite: Introductory Programming Course", "spring": false, "number": "TE  540", "descripton": "The course will focus on using rapid application development (RAD) tools to design and implement database-based driven applications in a client/server architecture. This includes the SQL database query language, utilizing VB.Net as the RAD environment to build decision support systems and how to integrate these tools together to design and build information systems.  Credit will not be given for both TE 440 and TE 540.", "fall": true, "units": " 3"}, {"summer": false, "name": "Textile Composites", "prerequisites": "Prerequisite: MA 341, MAE 206", "spring": true, "number": ")  565", "descripton": "Fiber architecture of textiles used for composites. Manufacturing processes and geometric quantification. Basic analysis for predicting elastic properties. Interrelationship of elastic properties and geometric quantities. Failure criteria for these materials.", "fall": false, "units": " 3"}, {"summer": false, "name": "Polymeric Biomaterials Engineering", "prerequisites": "Prerequisite: PY 208 and (TE 200 or CH 220 or CH 221)and(MAE 206 or CE 214)", "spring": false, "number": ")  566", "descripton": "In-depth study of the engineering design of biomedical polymers and implants.  Polymeric biomaterials, including polymer synthesis and structure, polymer properties as related to designing orthopedic and vascular grafts.  Designing textile products as biomaterials including surface modification and characterization techniques.  Bioresorbable polymers. Credit for TE 466 and TE 566 is not allowed.", "fall": true, "units": " 3"}, {"summer": false, "name": "Polymer Physics", "spring": false, "number": ")  570", "descripton": "Polymer microstructures, polymer solutions, polymer physical states (including amorphous polymers, crystalline polymers, polymer melts, melting of polymers, glass-transition, and other transitions), polymer blends, polymer mechanical properties, polymer viscoelasticity and flow, multicomponent polymer systems, and modern polymer topics. The physics of polymer fibers. Graduate standing or permission of instructor.", "fall": true, "units": " 3"}, {"summer": true, "name": "Special Studies In Textile Engineering and Science", "prerequisites": "Prerequisite: Senior standing or Graduate standing", "spring": true, "number": ")  589", "descripton": "New or special course on developments in textile engineering and science. Specific topics and prerequisites identified vary. Generally used for first offering of a new course.", "fall": true, "units": " 1-4"}, {"summer": "True", "name": "Seminar", "spring": "True", "number": "TE  601", "fall": "True", "units": " 1"}, {"summer": "True", "name": "Independent Study", "spring": "True", "number": "TE  630", "fall": "True", "units": " 3"}, {"summer": true, "name": "Special Projects", "spring": true, "number": "TE  676", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "TE  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "TE  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "TE  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": true, "name": "Master's Examination", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "TE  690", "descripton": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam.", "fall": true, "units": " 1-6"}, {"summer": true, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "TE  693", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "TE  695", "descripton": "Thesis Research", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "TE  696", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": true, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "TE  699", "descripton": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their thesis. Credits arranged", "fall": true, "units": " 1-3"}]