[{"summer": true, "name": "Introduction to Fiber Science", "prerequisites": "Prerequisite: MT 105 or TT 105 or PCC 101; Corequisite: MA 131 or MA 141", "spring": true, "number": "TMS  211", "descripton": "Properties of fibers related to type and chemical structure. Fiber classification and identification.  Reaction to moisture, stress-strain properties, and methods of measuring physical properties. Relationship between polymer structure, fiber properties and utilization.", "fall": true, "units": " 3"}, {"summer": false, "name": "Yarn and Fabric Formation and Properties", "prerequisites": "Prerequisite: TMS 211", "spring": false, "number": "TMS  212", "descripton": "The development of products from textile and fibrous materials is a critical component of new product development in many industries, including textiles, retail, plastics, composites, transporations, and architecture. This course provides the technical information required for scientists to understand how textile and fiber-based products are manufactures, with a practical view to cmbining the new knowledge with a molucular level understanding of fibers for unique new product development.", "fall": true, "units": " 2"}, {"summer": false, "name": "Yarn and Fabric Formation and Properties Lab", "prerequisites": "Prerequisite: TMS 212", "spring": false, "number": "TMS  214", "descripton": "The development of products from textiles and fibrous materials is a critical component of new product development in many industry. This laboratory course provides hands-on exercises and demonstrations of key textile and fiber-based products are manufactured.", "fall": true, "units": " 1"}, {"summer": false, "name": "Special Topics in Textile Materials Science", "spring": true, "number": "TMS  492", "descripton": "Presentation of material not normally available in regular course offerings or offering of new courses on a trial basis. Credits and content determined by faculty member in consultation with the Department Head.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Fiber and Polymer Microscopy", "prerequisites": "Prerequisite: MA 242, PY 208, TC 203", "spring": false, "number": "TMS  500", "descripton": "Art and science of light and electron microscopy; theoretical and practical aspects of visibility, resolution and contrast. Laboratory practice in assembling, testing and using various microscopes and accessories in analyzing, describing and identifying unoriented and oriented crystalline or amorphous materials. Laboratory emphasis on study of fibers and polymers through transmission microscopy with polarized light.", "fall": true, "units": " 3"}, {"summer": false, "name": "Filament Yarn Production Processing and Properties", "prerequisites": "Prerequisite: Graduate standing or PBS status", "spring": false, "number": ")  521", "descripton": "Structure, properties and processes for manufacturing and treating continuous filament yarns.  Response of fibers to elevated temperatures, twist, false twist and various bulking processes.  Yarn structures and properties required for stretch and molded fabrics.  Independent laboratory and critical literature review in general area of filament yarn processing, properties and test methods. credit not allowed for both TT 521 and TT 425", "fall": true, "units": " 3"}, {"summer": false, "name": "Textile Composites", "prerequisites": "Prerequisite: MA 341, MAE 206", "spring": true, "number": ")  565", "descripton": "Fiber architecture of textiles used for composites. Manufacturing processes and geometric quantification. Basic analysis for predicting elastic properties. Interrelationship of elastic properties and geometric quantities. Failure criteria for these materials.", "fall": false, "units": " 3"}, {"summer": true, "name": "Special Studies In Textile Engineering and Science", "prerequisites": "Prerequisite: Senior standing or Graduate standing", "spring": true, "number": ")  589", "descripton": "New or special course on developments in textile engineering and science. Specific topics and prerequisites identified vary. Generally used for first offering of a new course.", "fall": true, "units": " 1-4"}, {"summer": "True", "name": "Special Projects", "spring": "True", "number": "TMS  676", "fall": "True", "units": " 1-3"}, {"summer": false, "name": "Master's Supervised Teaching", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "TMS  685", "descripton": "Teaching experience under the mentorship of faculty who assist the student in planning for the teaching assignment, observe and provide feedback to the student during the teaching assignment, and evaluate the student upon completion of the assignment.", "fall": true, "units": " 1-3"}, {"summer": true, "name": "Non-Thesis Masters Continuous Registration - Half Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "TMS  688", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain half-time continuous registration to complete incomplete grades, projects, final master's exam, etc.", "fall": true, "units": " 1"}, {"summer": true, "name": "Non-Thesis Master Continuous Registration - Full Time Registration", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "TMS  689", "descripton": "For students in non-thesis master's programs who have completed all credit hour requirements for their degree but need to maintain full-time continuous registration to complete incomplete grades, projects, final master's exam, etc.  Students may register for this course a maximum of one semester.", "fall": true, "units": " 3"}, {"summer": false, "name": "Master's Exam", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "TMS  690", "descripton": "For students in non thesis master's programs who have completed all other requirements of the degree except preparing for and taking the final master's exam.", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Master's Supervised Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "TMS  693", "descripton": "Instruction in research and research under the mentorship of a member of the Graduate Faculty.", "fall": true, "units": " 1-9"}, {"summer": false, "name": "Master's Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "TMS  695", "descripton": "Thesis research", "fall": true, "units": " 1-9"}, {"summer": true, "name": "Summer Thesis Research", "prerequisites": "Prerequisite: Master's student", "spring": false, "number": "TMS  696", "descripton": "For graduate students whose programs of work specify no formal course work during a summer session and who will be devoting full time to thesis research.", "fall": false, "units": " 1"}, {"summer": false, "name": "Master's Thesis Preparation", "prerequisites": "Prerequisite: Master's student", "spring": true, "number": "TMS  699", "descripton": "For students who have completed all credit hour requirements and full-time enrollment for the master's degree and are writing and defending their theses.", "fall": true, "units": " 1-5"}, {"summer": false, "name": "Mechanical and Rheological Properties Of Fibrous Material", "prerequisites": "Prerequisite: MA 301", "spring": true, "number": "TMS  761", "descripton": "In-depth study of the stress-strain, bending, torsional, dynamic and rheological behavior of natural and man-made fibers. Presentation and discussion of theoretical relations and advanced techniques.", "fall": false, "units": " 3"}, {"summer": false, "name": "Physical Properties Of Fiber Forming Polymers, Fibers and Fibrous Structures", "prerequisites": "Prerequisite: MA 301, PY 208", "spring": false, "number": "TMS  762", "descripton": "Experimental results and theoretical considerations of physical properties of fibers and fiber-forming polymers. Electrical, thermal, optical, frictional and moisture properties of these materials. Influence of chemical and molecular fine structure on these properties.", "fall": true, "units": " 3"}, {"summer": false, "name": "Characterization Of Structure Of Fiber Forming Polymers", "prerequisites": "Prerequisite: MA 301, PY 208", "spring": false, "number": ")  763", "descripton": "Theories, experimental evidence and characterization methods of the molecular fine structure of fiber forming polymers in the solid state. Characterization methods include X-ray diffraction, microscopy, infrared, thermal and magnetic resonance.  An introduction to nucleation theory of polymer systems.", "fall": true, "units": " 3"}]