[{"summer": true, "name": "Transition into a Diverse Community", "spring": false, "number": "USC  100", "descripton": "USC 100 is required for all Summer Start students. It is designed to assist freshmen in making an effective transition to the rigors of a large diverse research-focused university. The course is designed to provide students with the support and knowledge needed to address the academic and personal challenges as well as other transitional issues. This course will also help students understand how culture shapes identity. Classroom discussions, small group work, completion of StrengthsQuest, and an introduction to technological and other resources are all vital components of this course. Topics include: diversity, cultural awareness, StrengthsQuest, academic adjustment, college success, social adjustment, campus resources, and health.", "fall": false, "units": " 1"}, {"summer": false, "name": "Introduction to University Education I", "spring": false, "number": "USC  101", "descripton": "Developmental and academic topics to assist students as they make well-informed decisions about majors. Topics include: transition issues between high school and college; community and diversity; major and career decision making; assessment of interests, skills, and values; available university resources; overview of university majors and minors as well as policies and procedures. FYC students only. Student cannot get credit for both USC 101 and 103.", "fall": true, "units": " 1"}, {"summer": false, "name": "Introduction to University Education II", "prerequisites": "Prerequisite: USC 101", "spring": true, "number": "USC  102", "descripton": "Continuation of USC 101; Emphasis on making a decision with respect to an undergraduate major. Credit may not be earned for both USC 102 and 104. FYC Students Only; Credit cannot be received for both USC 102 and 104.", "fall": false, "units": " 1"}, {"summer": false, "name": "Introduction to University Education for Varsity Student Athletes I", "spring": false, "number": "USC  103", "descripton": "Introduction to University Education for Varsity Student Athletes I provides success strategies for first year student athletes at North Carolina State University. The course is designed to assist student-athletes with the skills and knowledge needed to meet the academic and personal challenges of university life and the increased responsibilities of adulthood, with special attention to the unique challenges and opportunities of student-athletes. Topics include: goal setting, time management, study skills, critical thinking, interaction with the faculty, NCAA and NCSU continuing eligibility, academic integrity, nutrition, and diversity.", "fall": true, "units": " 1"}, {"summer": false, "name": "Introduction to University Education for Varsity Student-Athletes II", "prerequisites": "Prerequisite: USC 103", "spring": true, "number": "USC  104", "descripton": "Introduction to University Education for Varsity Student-Athletes II will provide student-athletes with the skills necessary to promote informed decision making in choosing an appropriate major and exploring possible careers. Additional areas of career development, academic success, and personal development will also be addressed as they would relate to the day-to-day responsibilities and challenges that student-athletes face, as well as a review of NCAA and NCSU continuing eligibility.", "fall": false, "units": " 1"}, {"summer": false, "name": "University Orientation I", "spring": false, "number": "USC  105", "descripton": "USC 105 serves as an orientation to academic requirements of the various colleges and departments as N.C. State. A review of study skills, time management, advising procedures, decision making and career exploration through inside and outside of class activities is designed to assist students in developing knowledge of major requirements and requisite comprehension and skills needed to succeed in college. Course is restricted to 31TP students.", "fall": true, "units": " 1"}, {"summer": false, "name": "University Orientation II", "prerequisites": "Prerequisite: USC 105", "spring": true, "number": "USC  106", "descripton": "USC 106 continues to serve as an orientation to academic requirements of the various colleges and departments at the university. A review of study skills, time management, decision making and career exploration through in and outside of class activities is designed to assist students in making well informed choices about majors. Students will also be required to focus on career interviews as well as the development of university academic networks. Course is restricted to second semester 31TP students.", "fall": false, "units": " 1"}, {"summer": false, "name": "Freshman Advancement Seminar", "spring": false, "number": "USC  110", "descripton": "USC 110 provides an opportunity for a diverse student population to explore the question of race and cultural differences in a global society.  This course requires that participants actively explore their biases and cultural prejudices for greater enlightenment.  This course challenges sources of conventional information such as media outlets, empirical data and prevailing folklore.  The course represents an opportunity to have a positive impact on the matriculation and graduation rate of diverse student populations through positive reinforcement, affirmation of cultural heritage and background.  Freshman First Year Entering Students Only.", "fall": false, "units": " 1"}, {"summer": false, "name": "SERV- Seminar Education for Military Veterans/Service Members", "spring": true, "number": "USC  120", "descripton": "The USC 120 class will help military veteran/service members transition into the academic environment and campus community. Topics include academic success skills, academic culture, campus resources and student services. Military Veterans (Active and Veteran)", "fall": true, "units": " 1"}, {"summer": false, "name": "Career Exploration and Development", "spring": true, "number": "USC  202", "descripton": "This course is intended for students who are considering changing their college major and/or are interested in exploring academic major opportunities. Career exploration and development provides students across campus a focused classroom setting to receive career exploration and academic major decision-making assistance.  Students will learn about their personal strengths, values, skills, and personality and understand how these self-assessments will affect their major/career decisions.  Students will explore the concept of career resiliency while developing professional skills that will be transferable into any college/major.", "fall": true, "units": " 2"}, {"summer": true, "name": "Introduction to College Tutoring", "prerequisites": "Prerequisite: Cumulative GPA greater than or equal to 3.25", "spring": true, "number": "USC  210", "descripton": "GPA 3.0 or higher. All enrolled students must be employed as UTC tutors. The purpose of the course is threefold: to introduce tutors to effective tutoring techniques based on educational research, to help tutors implement a variety of tutoring methods depending on the students' specific needs, and to guide tutors in self-evaluating their individual tutoring progress and goals. Departmental Approval Required.", "fall": true, "units": " 1"}, {"summer": "True", "name": "Leadership and the Resident Mentor", "spring": "True", "number": "USC  220", "descripton": "Course will provide the student basic concepts of involvement theory, group development theory and community development relevant to residence hall living as a paraprofessional leader on the campus; the basic principles related to leadership with emphasis on  how one develops and leads with their values, beliefs and attitudes and develop skills involving active listening, communication, conflict management and mediation techniques; basic program development and presentation skills; teaching pedagogy; and diversity issues.  Some out of classroom activities are required.  Departmental approval required.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Orientation Counselor Development", "spring": true, "number": "USC  223", "descripton": "For new student orientation counselors only.  Relevant research, student development theory, and shared professional experiences are presented.  This course will offer learning opportunities that will provide class members with knowledge, attitude, and skills necessary to become effective orientation counselors. Class discussion, small groups activities, simulations, and journal writing employed. Individual projects and out-of-class team building experiences are required, including Saturday activities. Departmental Approval Required.", "fall": false, "units": " 2"}, {"summer": false, "name": "Leadership Development for University Ambassadors", "prerequisites": "Requisite: University Ambassadors Only", "spring": true, "number": "USC  225", "descripton": "Course provides University Ambassadors with the knowledge, mindset, and skills necessary to effectively represent the University in a variety of settings to a variety of constituents. Course prepares students to emerge as leaders within the Ambassador program and throughout their University experience. Restricted to University Ambassadors only.", "fall": true, "units": " 2"}, {"summer": true, "name": "Special Topics in University Studies", "spring": true, "number": "USC  298", "descripton": "Special Topics in University Studies at the Undergraduate level for offering of courses on an experimental basis.", "fall": true, "units": " 1-3"}, {"summer": false, "name": "Transfer Student Success", "spring": true, "number": "USC  301", "descripton": "Students will not received credit for both USC 301 and ALS 303 or T 101.", "fall": true, "units": " 1"}, {"summer": false, "name": "Transitions for the College Graduate", "spring": true, "number": "USC  401", "descripton": "Focus on the unique transitions the student will face upon leaving college.  Through a variety of formats, students will have the opportunity to explore several aspects of their post-baccalaureate lives and ways in coping with emerging careers, money management, extracurricular retirement, transitional issues, civic engagement, and continuing education opportunities.  Explorations of these areas include specific emphasis on developing and refining interviewing skills, professional and personal networks, financial endeavors, and job application and selection.", "fall": true, "units": " 3"}]