[{"summer": "True", "name": "Veterinary Anatomy I", "spring": "True", "number": "VMB  911", "descripton": "Gross anatomy of the dog and cat. Neuroanatomy of the dog and cat. Dissection of embalmed (dog/cat), study of prosections, slides, models, radiographs, and correlations with living animals.", "fall": "True", "units": " 6"}, {"summer": "True", "name": "Veterinary Physiology I", "spring": "True", "number": "VMB  913", "descripton": "A course in comparative physiology with special attention to domestic mammalian and avian species. Emphasis is placed on cellular and metabolic physiology and the physiology of the nervous, endocrine, and reproductive systems.", "fall": "True", "units": " 5"}, {"summer": "True", "name": "Histology and Cytology", "spring": "True", "number": "VMB  914", "descripton": "This course focuses on the study of cells, basic tissues, and selected organs of domestic animals. The primary emphasis is on the molecular and structural basis for cell function, tissue organization, and organ systems.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Comparative and Developmental Anatomy", "prerequisites": "Prerequisite: VMB 911", "spring": true, "number": "VMB  921", "descripton": "Gross anatomy of domestic ungulates (horse, ox, sheep, goat, pig). Involves dissection of embalmed specimens and study of prosections, models, radiographs, and live-animal palpation.", "fall": false, "units": " 6"}, {"summer": "True", "name": "Veterinary Embryology and Teratology", "spring": "True", "number": "VMB  922", "descripton": "This course presents basic facts and concepts of embryology, from fertilization to parturition, focusing on issues relevant to veterinary medicine including: early embryonic development, comparative placentation, and major organ development. Currentresearch and clinical topics, including induction, cloning, in vitro fertilization and surgical intervention are also addressed where appropriate.", "fall": "True", "units": " 2"}, {"summer": "True", "name": "Veterinary Physiology II", "spring": "True", "number": "VMB  923", "descripton": "A continuation course in comparative physiology with special attention to domestic and avian species. Emphasis is placed upon water and electrolyte metabolism and the physiology of gastrointestinal, endocrine, and nervous systems.", "fall": "True", "units": " 5"}, {"summer": "True", "name": "Anesthesiology", "spring": "True", "number": "VMB  930", "descripton": "Anesthetic principles, agents, and techniques of mammalian, avian, and rodent species.", "fall": "True", "units": " 2"}, {"summer": "True", "name": "Introductory Pharmacology", "spring": "True", "number": "VMB  933", "descripton": "The action of drugs in animals and man including basic principles of drug disposition and pharmacokinetics is discussed. Modification of physiological processes by drugs influencing coordination by the nervous, endocrine, and circulatory systems aredescribed.", "fall": "True", "units": " 5"}, {"summer": "True", "name": "Pharmacology and Veterinary Therapeutics", "spring": "True", "number": "VMB  943", "descripton": "special species, prescription writing, and benefit-risk assessment.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Veterinary Toxicology and Poisonous Plants", "spring": "True", "number": "VMB  954", "descripton": "Pharmacological basis and pathological features of diseases of animals and birds caused by common toxic chemicals and plants with emphasis on clinical manifestations, diagnosis, prevention, and treatment.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Veterinary Radiology and Radiobiology", "spring": "True", "number": "VMB  960", "descripton": "Fundamentals of radiographic diagnosis and radiation safety.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Clinician Scientist Research Experience", "prerequisites": "Prerequisite: All freshman-junior DVM courses allowing the student to enroll in senior DVM courses.", "spring": "True", "number": "VMB  962", "descripton": "This course is designed to give students an opportunity to take part in resaerch int he laboratory of their chosen mentor(s), resulting in a greater understanding of the research process.  Students will be specifically required to complete at least three 2-week blocks, and to have at least two of these blocks scheduled consecutively (i.e., a 1-month time period in the laboratory).  This course is restricted to students enrolled in the Clinician Scientist Focus Area of the DVM curriculum and requires approval by the student's CSFA mentor.", "fall": "True", "units": " 1-10"}, {"summer": "True", "name": "Veterinary Nutritional Health", "spring": "True", "number": "VMB  965", "descripton": "The role of nutrition in veterinary medicine. Development, diagnosis and prevention of nutritional problems in a variety of species will be discussed, frequently employing a comparative approach.", "fall": "True", "units": " 2"}, {"summer": "True", "name": "Radiology", "spring": "True", "number": "VMB  975", "fall": "True", "units": " 2"}, {"summer": "True", "name": "Radiology Rotation", "spring": "True", "number": "VMB  976", "descripton": "This rotation will provide practical training in the production of quality radiographic examinations and will help develop interpretation skills in diagnostic radiology. Students are expected to be familiar with material covered in the junior radiology course (VMB 960) as it will be incorporated into this rotation. Review of the auto-tutorial teaching cases, located in the \"Star Wars\" room. The radiology rotation is oriented toward teaching and service. Learning experiences result from a combination of direct contact with the faculty, residents, technicians, and classmates. You will make diagnostic quality radiographs, participate in morning rounds and review didactic material, VMB 960 teaching files and ask questions.", "fall": "True", "units": " 2"}, {"summer": "True", "name": "Clinical Anesthesia Rotation", "spring": "True", "number": "VMB  977", "descripton": "Students engage in the daily clinical service responsibilities of the CVM-VTH Anesthesia Section in the role of anesthetists assigned to the care of client-owned animals. The objective of this clinical course is to enable each student to achieve their maximum potential as neophyte anesthetists having limited experience. Student activities are supervised and conducted by CVM faculty anesthesiologists, and VTH staff anesthesia technicians. Supporting activities related to delivering clinical service include attending clinical rounds and case discussions, and oral presentation of a critical review of a recently published research paper relevant to anesthesia and it's supporting basic sciences.", "fall": "True", "units": " 2"}, {"summer": false, "name": " Nutrition", "prerequisites": "Prerequisite: VMC 927 or equivalent, DVM Curriculum Student Status", "spring": true, "number": "VMB  978", "descripton": "This 4th year clinical rotation will provide interested students with the opportunity to gain experience in both behavior and nutrition. During the week spent at the Animal Behavior Service, students will participate in the diagnosis and treatment of behavior problems in companion animals. During the week spent at the Nutrition Service, students will develop and initiate Nutrition Support plans for hospitalized and health companion animals. Relevant nutrition support skills will be practiced. This course is restricted to students in the DVM curriculum.", "fall": true, "units": " 2"}, {"summer": "True", "name": "SP Top in MBS", "spring": "True", "number": "VMB  991", "descripton": "Sciences.", "fall": "True", "units": " 1-2"}, {"summer": "True", "name": "SP Top in MBS", "spring": "True", "number": "VMB  992", "descripton": "Sciences.", "fall": "True", "units": " 2"}]