[{"summer": false, "name": "Introduction to Women's and Gender Studies", "spring": false, "number": "WGS  200", "descripton": "Introduction to women's and gender studies as an interdisciplinary field spanning the humanities, social sciences and natural sciences.  Study of historical perspectives and contemporary understanding of women and gender.  Theory, systematic analysis and experimental accounts used to explore complexities of gender, and other identity determinants, mechanisms of power and privilege, and avenues for social change.", "fall": true, "units": " 3"}, {"summer": true, "name": "Sociology of Family", "spring": true, "number": ")  204", "descripton": "Contemporary American family structures and processes and their development. Focus on socialization, mate selection, marital adjustment and dissolution. Includes core sociological concepts, methods, theories.", "fall": true, "units": " 3"}, {"summer": false, "name": "Women and Gender in Science and Technology", "spring": false, "number": ")  210", "descripton": "Interdisciplinary introduction to the reciprocal relationships between scientific/technological research and contemporary understanding of gender.  Special emphasis on social factors influencing scientists and engineers in their professions.", "fall": true, "units": " 3"}, {"summer": false, "name": "Special Topics in WGS", "spring": true, "number": "WGS  293", "descripton": "Examination of varying topics on women and/or gender from an interdisciplinary perspective at an introductory level.", "fall": true, "units": " 3"}, {"summer": false, "name": "Women and Men in Society", "prerequisites": "Prerequisite: 3 cr. in SOC, 200 level", "spring": true, "number": ")  304", "descripton": "A sociological analysis of women and men in contemporary American society.  Perpetuation of and change in gender stratification using sociological concepts. theories and research.  How gender expectations developed and transmitted.  Historical data and research on diversity in American society used for analysis of causes and consequences of gender inequality.", "fall": true, "units": " 3"}, {"summer": false, "name": "Women and Literature", "prerequisites": "Prerequisite: Sophomore standing", "spring": true, "number": ")  305", "descripton": "Nineteenth- and twentieth-century womens' literature, as shaped by the intersecting and competing claims of gender, race, sexuality, and culture.  Focus on fiction, accompanied by critical readings from American studies, feminist literary criticism,and postmodern theory.", "fall": false, "units": " 3"}, {"summer": false, "name": "Gender and Politics in the United States", "prerequisites": "Prerequisite: PS 201", "spring": true, "number": ")  306", "descripton": "This course explores the role of gender in contemporary American politics.  The course examines the historical course of gender politics to see how we have arrived at the present state.  It investigates the activities that women and men play in modern politics-voting, running for office, serving in office, etc., and how women and men perform these activities in different ways.  The course also focuses on major areas of public policy that affect women and men in different ways.", "fall": false, "units": " 3"}, {"summer": false, "name": "Women's and Gender Studies Internship", "spring": true, "number": "WGS  310", "descripton": "Internship program.  Introduction to careers that deal specifically with women's issues.  Ten-hours-per-week work at a nonprofit or governmental organization.  Contextualization of that experience through additional academic requirements.", "fall": true, "units": " 3"}, {"summer": false, "name": "Language and Gender", "prerequisites": "Prerequisite: ENG 111, ENG 112", "spring": false, "number": ")  327", "descripton": "Introduction to the use of language by men and women.  Research in Linguistics and Women's Studies addressing issues such as the acquisition of gender-differentiated language, gender and conversational interaction, sexism in language, gender issues in society, and the relationship between language, gender, and other social constructs (e.g., class, culture, and ethnicity).", "fall": true, "units": " 3"}, {"summer": true, "name": "Women and Health", "spring": true, "number": "WGS  330", "descripton": "Women and Health utilizes an interdisciplinary approach to explore historical perspectives on health, access to health technologies, health policy research, and emerging topics in women's health. The humanities, social sciences, and biological sciences inform inquiry into \"hot topics\" in health policy, ethics, and the medical sciences. The health of women is dissected through a lens of gender equity and domestic and international perspectives are employed. Students are encouraged to identify and study topics of their own interest.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Women In Music", "spring": "True", "number": ")  360", "descripton": "The role of women in music as patrons, teachers, composers, and performers, placing them within the social, economic, and political framework to which they belong.  Emphasis on Western Art Music and the role of women in popular music.  No previous formal training in music is required.", "fall": "True", "units": " Performing Arts, U.S. Diversity"}, {"summer": false, "name": "Communication and Gender", "prerequisites": "Prerequisite: Junior standing, COM 112", "spring": true, "number": ")  362", "descripton": "Effects of gender on the interpersonal communication process.  Construction of gendered identities via communication practices.  Examination of theories of gender and the role of gender in organizational, institutional, and media communication practices.", "fall": true, "units": " 3"}, {"summer": true, "name": "Special Topics in Women's and Gender Studies", "spring": true, "number": "WGS  393", "descripton": "Special topics in Women's and Gender Studies at the 300 level for offering courses on an experimental basis.", "fall": true, "units": " 3"}, {"summer": false, "name": "Psychology of Gender", "prerequisites": "Prerequisite: PSY 200, 201 or HSS 200", "spring": true, "number": ")  406", "descripton": "Current theory and research on perceived and actual biological, social, cognitive, personality and emotional similarities and differences of men and women throughout the lifespan.  The construction and consequences of gender in our society and others.Credit cannot be given for both PSY 406 and PSY 506", "fall": true, "units": " 3"}, {"summer": false, "name": "Sociology of Sexualities", "prerequisites": "Prerequisite: 3 hours SOC 200 level, 300 level, or equivalent research methods course", "spring": true, "number": ")  407", "descripton": "Exploration of sexuality in a social context.  Relationship between sexuality, gender and power in the U.S.  Historical trends in behaviors and identities: social movements and sexual issues; current behavioral trends.  Some issues covered; identity, social construction, sexual meanings.", "fall": false, "units": " 3"}, {"summer": false, "name": "Studies in Gender and Genre", "prerequisites": "Prerequisite: Sophomore standing", "spring": false, "number": ")  410", "descripton": "This course examines the ways in which writers have revised the literary genres to include gendered experience.  It will focus on a different generic area, such as poetry, fiction, drama or autobiography, depending on its instructor.", "fall": true, "units": " 3"}, {"summer": false, "name": "Gender Law and Policies", "prerequisites": "Prerequisite: Nine hours of Political Science", "spring": false, "number": ")  418", "descripton": "Law and policy pertaining to contemporary gender issues.  Examination of agenda setting, policy formation, implementation, judicial interpretation and evaluation of selected issues, such as reproductive policies, equal employment and sexual abuse.", "fall": true, "units": " 3"}, {"summer": false, "name": "Cross-Cultural Perspectives on Women", "prerequisites": "Prerequisite: ANT 252 and one of the following: ANT 310,325,330 or 346", "spring": true, "number": ")  444", "descripton": "Comparison of women in a variety of societies: western and non-western; hunting and gathering to industrialized.  Cross-cultural perspective on the similarity and diversity of women's statuses and roles.  Effect of gender on social position", "fall": false, "units": " 3"}, {"summer": false, "name": "History of American Women to 1900", "spring": false, "number": ")  447", "descripton": "The historical experience of women in America from the colonial period to 1890.  Women's work, education, legal and political status, religious experience, and sex roles:  age, class, race, sexual preference, and region as significant variables in women's experience. Credit will not be given for both HI (WGS) 447 and HI (WGS) 547.", "fall": false, "units": " 3"}, {"summer": false, "name": "American Women in the Twentieth Century", "prerequisites": "Prerequisite: 3 hrs. of History", "spring": false, "number": ")  448", "descripton": "Women's historical experience in America, 1890-1990.  Changes in women's work, education, legal and political status, and sex roles, age, class, race, sexual preference and region as significant variables in women's experience.Credit will not be given for both HI (WGS) 448 and HI (WGS) 548.", "fall": false, "units": " 3"}, {"summer": false, "name": "Women and Religion", "prerequisites": "Prerequisite: one course in religious studies or women's and gender studies", "spring": false, "number": ")  472", "descripton": "Historical, literary, and theological sources dealing with portrayals of women and women's religious experience in several religious traditions of the world through different historical periods, from ancient to modern.  Impact of feminist theory on the academic study of religion; methodological issues surrounding the study of women's religious history; role of religion in shaping attitudes toward women and their status in society.", "fall": false, "units": " 3"}, {"summer": "True", "name": "Religion, Gender, and Reproductive Technologies", "spring": "True", "number": ")  473", "descripton": "Examines comparative religious ethics concerning gender marriage, parenthood, children, and the relationship of human beings to the \"natural\".  Relates these views to new and emerging reproductive and genetic technologies.  Compares the internally diverse perspectives of three major religious traditions with regard to their interpretations of these technologies.  Analyzes the impact of particular uses of these technologies on the rights of women and girls.  Students cannot earn credit for both REL 473 and REL 573.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Theoretical Issues in Women's and Gender Studies", "prerequisites": "Prerequisite: WGS 200", "spring": true, "number": "WGS  492", "descripton": "Examination of feminist theory.  Study of formative texts in modern feminism, drawn from various disciplines within the humanities, social sciences, and natural sciences.  In-depth exploration of feminist perspectives on issues of race, class, gender, sexuality, work and mothering, among others.  Analysis of local and global cultural practices using feminist theoretical frameworks.", "fall": false, "units": " 3"}, {"summer": false, "name": "Special Topics in Women's and Gender Studies", "spring": false, "number": "WGS  493", "descripton": "Examination of varying topics on women and/or gender from a multidisciplinary perspective.", "fall": true, "units": " 3"}, {"summer": false, "name": "Psychology of Gender", "spring": true, "number": ")  506", "descripton": "Current theory and research on perceived and actual biological, social, cognitive, personality, and emotional similarities and differences of men and women throughout lifespan.  Construction and consequences of gender in our society and others.Credit for both PSY 406 and PSY 506 is not allowed.", "fall": true, "units": " 3"}, {"summer": true, "name": "Gender Issues In Counseling", "prerequisites": "Prerequisite: Graduate standing or 6 hrs. of ED or PSY", "spring": true, "number": ")  540", "descripton": "Exploration of gender as primary identity and social construct. Emphasis on gender dynamics in counseling, client empowerment and preventive approaches.", "fall": false, "units": " 3"}, {"summer": "True", "name": "History Of American Women To 1900", "prerequisites": "Prerequisite: 6 hrs. of advanced history", "spring": "True", "number": ")  547", "descripton": "Historical experience of women in America from colonial period to 1890. Women's work, education, legal and political status, religious experience and sex roles: age, class, race, sexual preference and region as significant variables in women's experience.Credit for both HI (WGS) 447 and HI  (WGS) 547 is not allowed", "fall": "True", "units": " 3"}, {"summer": "True", "name": "American Women In the Twentieth Century", "spring": "True", "number": ")  548", "descripton": "Women's historical experience in America, 1890-1990.  Changes in women's work, education, legal and political status, and sex roles; age, class, race, sexual preference and region as significant variables in women's experience.  Credit for both HI (WGS) 448 and  HI (WGS) 548 is not allowed.", "fall": "True", "units": " 3"}, {"summer": "True", "name": "Religion, Gender, and Reproductive Technologies", "spring": "True", "number": ")  573", "descripton": "Examines comparative religious ethics concerning gender marriage, parenthood, children, and the relationship of human beings to the \"natural\".  Relates these views to new and emerging reproductive and genetic technologies.  Compares the internally diverse perspectives of three major religious traditions with regard to their interpretations of these technologies.  Analyzes the impact of particular uses of these technologies on the rights of women and girls.  Students cannot earn credit for both REL 473 and REL 573.", "fall": "True", "units": " 3"}, {"summer": false, "name": "Special Topics", "spring": true, "number": "WGS  593", "descripton": "Examination of a core topic on women and/or gender from an interdisciplinary perspective at the graduate level.", "fall": true, "units": " 3"}, {"summer": true, "name": "Independent Study", "spring": true, "number": "WGS  633", "fall": true, "units": " 1-6"}, {"summer": false, "name": "Feminist Thought in the Social Sciences", "prerequisites": "Prerequisite: SOC 701 and SOC 702", "spring": false, "number": ")  704", "descripton": "This course is designed to provide an overview of feminist thought in the social sciences.  We evaluate theoretical writings on social structure, social processes, the development of consciousness about gender inequality.  We include both discussionof and distortions within mainstream theory and the recent development of alternative theory using the standpoint of women as a point of departure.  We begin with general theoretical issues and move quickly to the complexity of matrices of dominationwithin U.S. and global contexts.", "fall": true, "units": " 3"}, {"summer": false, "name": "Sociology Of Gender", "prerequisites": "Prerequisite: SOC 736 or 731, Graduate standing", "spring": false, "number": ")  737", "descripton": "Theories about the development and maintenance of gender.  Historical development of gender stratification.  How individuals \"do gender\" in their daily lives.  Contemporary research and substantive readings about gender in public and intimate relationships.", "fall": true, "units": " 3"}, {"summer": "True", "name": "Social Psychology Of Inequality", "prerequisites": "Prerequisite: SOC 746 or 508", "spring": "True", "number": ")  739", "descripton": "The effects of race, class and gender inequality on the formation of group consciousness, self-evaluations, emotions, values, attitudes and beliefs. Attention  to interpersonal processes through to reproduction of inequality in everyday life.", "fall": "True", "units": " 3"}]